{"title":"Duyung.Dvdrip.Divx.2008","uid":4177855,"size":765161472,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:000af9959565d9044e5fdc058809bf19048d1949&amp;dn=Duyung.Dvdrip.Divx.2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dal4741","files":1,"time":1210235876,"description":"Duyung (translation: Mermaid) is a Malaysian fantasy comedy film that was released on March 6, 2008[2]. The film is directed by A. Razak Mohaideen and produced by KRU Films (now known as KRU Studios) in association with Grand Brilliance Sdn Bhd and Line Clear Motion Pictures. It stars Saiful Apek as a kind-hearted man who encounters a mermaid, portrayed by Maya Karin.\n\nThe story take places at the east coast of Sabah. Duyung tells the tale of a young man named Jimmy who has this habit of taking care of the environment. He also has a weird habit which is not well received by the other villagers. Jimmy befriends Orix an apeman species. Quietly he developes this feeling for Aspalela the daughter of Tok Mudim the leader of the villager.\n\nOne day Jimmy visited Tok Mudim&amp;#039;s house to ask his daughter&amp;#039;s hand in marriage but was denied approval from Tok Mudim. He furthermore challenged Jimmy to have a land of his own if he wishes to marry his daughter. With a struck of a genius idea using recycled items he created his own land but to his surprise, every morning as he wakes up his land seemed to expand bigger and bigger not only just that but the trees grow taller as well. He assumed that Aspalela had something to do with all of these changes to motivate him. After all he has worked for Tok Mudim still refused to give his daughters hand in marriage. Kordi the most successful guy at the village also wishes to marry Aspalela. Kordi also is very much displeased with Jimmy as he forbids him from fishing. Kordi who has had enough of Jimmy&amp;#039;s attitude forced him out of the village and comicly told him to marry a mermaid instead. Kordi destroyed Jimmy&amp;#039;s land and fled off.\n\nAfter all that had happened, Jimmy began to build back his island. While rebuilding the island he had not noticed that a real mermaid had got caught in one of the knots on the island. He managed to give a helping hand to the mermaid and since then they became close friends. Jimmy also became rich after the many gold gifts the mermaid gave him. Kordi was not pleased seeing Jimmy with all of his riches and decided to investigate where his wealth was coming from. It led him to the capture of the mermaid.","torrent":{"xt":"urn:btih:000af9959565d9044e5fdc058809bf19048d1949","amp;dn":"Duyung.Dvdrip.Divx.2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"000af9959565d9044e5fdc058809bf19048d1949","infoHashBuffer":{"type":"Buffer","data":[0,10,249,149,149,101,217,4,78,95,220,5,136,9,191,25,4,141,25,73]},"announce":[],"urlList":[]}}