{"title":"Discovery Before We Ruled The Earth 1of2 Hunt Or Be Hunted XviD","uid":4227189,"size":781541376,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:014d1cfd1da62aaa39b9a9732d3c075716b48e3e&amp;dn=Discovery+Before+We+Ruled+The+Earth+1of2+Hunt+Or+Be+Hunted+XviD+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":1,"time":1212884119,"description":"Discovery Channel - Before We Ruled the Earth (2003)\n\nInformation\n\n&quot;Before We Ruled the Earth&quot; is an odyssey of evolution, from Homo ergaster in Africa at 1.7 million years ago, to Paleo-Indians living in North America at 11,000 years ago. \n\nDetailed recreations of hominid life over seven time periods, stunning wilderness locations, state of the art makeup effects and photo-realistic 3-D animated animals bring the past to life.\n\nHow did we problem solve to protect and provide for our families and ourselves? What are the technological innovations that helped to move us up the food chain? Early human&amp;#039;s ability to adapt is what pushed them to the four corners of the earth and beyond, Before We Ruled The Earth.\n\nPart 1: Hunt Or Be Hunted\n1,700,000 years ago in Africa, Homo ergaster, an ancient predecessor of modern humans, had to scavenge to survive. They lived in the elements among the monsters of the day, like the saber-toothed cat. Over time, early humans evolved and developed simple tools, began to communicate, and learned to control their most important tool: fire. But the monsters were still there. 300,000 years ago, Homo erectus learned to hunt the giant Irish elk, using fire to drive these great beasts through a narrow gorge and over a cliff. While hunting skills improved, proximity remained a necessity to kill a huge beast. 40,000 years ago, Neanderthals were at the top of their form, hunting beasts like the Giant Steppe Bison. The Neanderthals were usurped by an entirely new race of humans, the Cro-Magnons. They adapted and survived when the Neanderthals could not. They would become the undisputed masters of our planet. They would become the humans we are today.\n\nPart 2: Mastering the Beasts\n15,000 years ago, the Cro-Magnons had evolved to become the sole residents of Europe. They had all the abilities of modern humans: the power of speech, reasoning skills, and a belief in the afterlife. But it was still a struggle to survive in a land where large dangerous carnivores competed for living space. As the humans spread out across the world, they made their way over an ancient land bridge connecting Asia and the Americas: Beringia. Life inthe tundra was treacherous, and three stranded women had to use their ingenuity, skill, and sheer guts to survive emong the Woolly Mammoths on which they depended for survival. Moving to North America, the so-called Paleo-Indians developed even more sophisticated weapons and their ability to communicate. They flourished among the waning megafauna like the Giant Ground Sloth. Hunting reached its climax on the Great Plains of North America when two small bands of Paleo-Indians came together for a ritual buffalo hunt, driving hundreds of buffalo off a cliff in a massive slaughter. Early human&amp;#039;s ability to adapt is what pushed them to the four corners of the earth and beyond, Before We Ruled The Earth.\n\nTechnical Specs\nVideo Codec: XVID\nVideo Bitrate: 1773 kbps\nVideo Resolution: 704x400\nVideo Aspect Ratio: 1.760:1\nQuality Factor (bits/pixel)/frame: 0.210\nFrames Per Second: 29.970\nAudio Codec: AC3\nAudio Bitrate: 224kb/s CBR 48000 Hz\nAudio Languages: English/Portuguese\nRunTime Per Part: 47 mins\nNumber Of Parts: 2\nPart Size: 746mb\nSubtitles: English/Portuguese\nRipped by: Dentje\n\nRelease Notes\nEnglish subtitles\nBrazilian Portuguese subtitles\n\nThis is a dual audio release - English and Brazilian Portuguese - see below for how to handle dual audio.\n\n","torrent":{"xt":"urn:btih:014d1cfd1da62aaa39b9a9732d3c075716b48e3e","amp;dn":"Discovery+Before+We+Ruled+The+Earth+1of2+Hunt+Or+Be+Hunted+XviD+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"014d1cfd1da62aaa39b9a9732d3c075716b48e3e","infoHashBuffer":{"type":"Buffer","data":[1,77,28,253,29,166,42,170,57,185,169,115,45,60,7,87,22,180,142,62]},"announce":[],"urlList":[]}}