{"title":"aimer-dvd-studio-pack","uid":4225526,"size":24533173,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:02a69c4c50d817567d58024372444a2dbfe8827a&amp;dn=aimer-dvd-studio-pack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"robo29","files":4,"time":1212799898,"description":"This is my 1st attempt at a torrent so I hope it works \n\nDVD Studio Pack v1.1.55 (c) Aimersoft\n\nAimersoft DVD Studio Pack description\nAll-in-one DVD Ripper, Video Converter, Audio Converter and DVD Creator\n\nAimersoft DVD Studio Pack is an all-in-one multimedia software that includes Aimersoft Video Converter, DVD Creator and Audio Converter and Aimersoft DVD Ripper.\n\nAimersoft DVD Studio Pack supports all common video and audio formats (MP4, AVI, MPG, MPEG, VOB, WMV, ASF, FLV, WMA, M4A, MP3, AC3, WAV, etc.) and all common media players (iPod, Zune, iPhone, Apple TV, PSP, Xbox 360, PS3, Archos, iRiver, Creative Zen \n\n, Pocket PC, PDA, Mobile Phone, etc). \n\nYou can also crop, trim and adjust the effect of movie, and you can burn your favorite movie to DVD video slideshows with fascinating transitions and resources to create a DVD menu of your own.\n\nHere are some key features of &quot;Aimersoft DVD Studio Pack&quot;:\n\nÃ‚Â· Support all common video and audio formats: MP4, AVI, MPG, MPEG, VOB, WMV, DivX, XviD, MOV, DAT, VOB, IFO, 3GP, 3GPP, ASF, FLV, WMA, M4A, MP3, WMA, AC3, WAV, limewire and YouTube, Google video, etc.\nÃ‚Â· Support all common media players: iPod, Zune, iPhone, Apple TV, PSP, Xbox 360, PS3, Archos, iRiver, Creative Zen, PMP, Pocket PC, PDA, etc.\nÃ‚Â· Fully supports Windows XP and Windows Vista.\nÃ‚Â· Super fast converting speed and burning speed. Optimized for 64-bit CPU including Intel EM64T and AMD64 and dual-core processor.\nÃ‚Â· Support all popular mobile phones: Nokia, Motorola, Sony Ericsson, iPhone, Samsung, LG, BlackBerry, etc.\nÃ‚Â· Built-in iPod Copy Manager, help you transfer you videos and music to iPod without iTunes, you can also backup your iPod files to computer.\nÃ‚Â· Built-in PSP Video Manger help you transfer MPEG4 videos and movies to Sony PSP, you can also export PSP MPEG4 videos located in your PSP to your computer, fully support PSP1000 and PSP2000.\nÃ‚Â· Powerful video editing function, allows you to trim, crop and adjust effect of the video, you can also set brightness, contrast, saturation, volume and other parameters.\nÃ‚Â· Support DVD 5 and DVD 9; DVD-R, DVD+R, DVD-RW, DVD+RW, DVD+R DL, DVD-R DL, DVD-RAM supported.\nÃ‚Â· Support burning ISO file.\nÃ‚Â· Very easy to use that you can finish the work with just three clicks.\nÃ‚Â· Support multi-language.\n\n\nRequirements:\n\nÃ‚Â· 1 GHz CPU or above\nÃ‚Â· 128 MB of RAM (256 MB Recommended)\nÃ‚Â· Any VGA card\n\nThis is a release by BEAN which was originally rar&amp;#039;ed. Just Install and Register with the serials in serial.txt.\n","torrent":{"xt":"urn:btih:02a69c4c50d817567d58024372444a2dbfe8827a","amp;dn":"aimer-dvd-studio-pack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02a69c4c50d817567d58024372444a2dbfe8827a","infoHashBuffer":{"type":"Buffer","data":[2,166,156,76,80,216,23,86,125,88,2,67,114,68,74,45,191,232,130,122]},"announce":[],"urlList":[]}}