{"title":"Deadline 25-5  Complete seizoen","uid":12741828,"size":5141172194,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:02fa5f68988e40f2fcee12697cc68f4584ce0bcb&amp;dn=Deadline+25-5++Complete+seizoen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"freerecord","files":8,"time":1447245155,"description":"Deadline 25/5 is een fictiereeks van VTM en Antwerpse regionale zender ATV. De serie vormt het vervolg op Deadline 14/10, uitgezonden in 2012.\r\nDeze reeks werd voor het eerst aangekondigd op 22 april 2013, aan de hand van een teaser die werd uitgezonden op VTM en ATV.[1] In een eerste persbericht werd verklaard dat hoofdrolspelers Charlotte Vandermeersch, Koen De Graeve en Peter Van Den Begin uit Deadline 14/10 opnieuw zullen meedraaien en dat deze serie net als haar voorganger zal worden uitgezonden tijdens de verkiezingsperiode, ditmaal de Vlaamse verkiezingen van 2014.[2] In een latere oplijsting van de terugkerende hoofdcast wordt Koen De Graeve niet vermeld en bleek dat zijn rol is geschrapt.[3]\r\nTen opzichte van voorganger Deadline 14/10 draaide Deadline 25/5 uit op een flop, aangezien per aflevering maar half zoveel kijkers werden bereikt. Een mogelijke verklaring daarvoor is dat de afleveringen van Deadline 25/5 op donderdag in de late avond werden uitgezonden, terwijl Deadline 14/10 op zondag in volle prime-time stond geprogrammeerd.\r\nVerhaal[bewerken]\r\nDe draad wordt opnieuw opgepikt bij Marianne Schmidt (Charlotte Vandermeersch) die op het einde van vorige reeks besliste om te kappen als journaliste bij Gazet Van Antwerpen. Ze werkt nu parttime in een boekhandel, en verder is ze vooral mama.\r\nHaar zoon gaat naar het eerste middelbaar. De staat van het schoolgebouw blijkt niet zo goed, want op een dag overkomt hem een ernstig ongeluk. Er treedt een CO-vergiftiging op in de school van haar zoon. Marianne krijgt vermoedens dat het om meer dan zomaar een ongeval gaat, en meent zelfs dat er een politieke link te leggen valt met het ongeluk","torrent":{"xt":"urn:btih:02fa5f68988e40f2fcee12697cc68f4584ce0bcb","amp;dn":"Deadline+25-5++Complete+seizoen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02fa5f68988e40f2fcee12697cc68f4584ce0bcb","infoHashBuffer":{"type":"Buffer","data":[2,250,95,104,152,142,64,242,252,238,18,105,124,198,143,69,132,206,11,203]},"announce":[],"urlList":[]}}