{"title":"Sustainable Water Use and Management","uid":12744387,"size":12292527,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:02fc1d277120780b428d42c6ff11390fc9b8572d&amp;dn=Sustainable+Water+Use+and+Management&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1447282742,"description":"Sustainable Water Use and Management - Examples of New Approaches and Perspectives (Springer, 2015).pdf\r\n\r\nISBN 9783319123936\r\n\r\nContributing to the growing debate on the need for sustainable water use and management, with concrete examples of new approaches, concepts, arguments, methods and findings which illustrate how this can be achieved, this book will be attractive for large groups of readers familiar with one or more of the themes it tackles, and to the general public. Within this context, the book makes use of many tables and graphics, which bring the many messages together. This approach is intended not only for those working on water matters (e.g. bureaucrats, water managers, policymakers, journalists, etc.) and interested in water management issues and sustainability at large, but also for students of water management, water politics, environmental policy, water economics, water engineering and sustainability studies. Located at the crossroads of two key phenomena: sustainability and water, this book brings forward academic research and discussions on water efficiency, new technologies, and the water-agriculture nexus. It also benefits readers by tackling matters related to trans-boundary cooperation on water (including rainwater) and river-basin management, pricing issues, participatory water management, and the role of women in sustainable water use, amongst others","torrent":{"xt":"urn:btih:02fc1d277120780b428d42c6ff11390fc9b8572d","amp;dn":"Sustainable+Water+Use+and+Management","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"02fc1d277120780b428d42c6ff11390fc9b8572d","infoHashBuffer":{"type":"Buffer","data":[2,252,29,39,113,32,120,11,66,141,66,198,255,17,57,15,201,184,87,45]},"announce":[],"urlList":[]}}