{"title":"Black Francis (Pixies) solo show - 1990 (FLAC)","uid":4238838,"size":368090253,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:035bc11293991f07ea190b4d6d86a09100b453d5&amp;dn=Black+Francis+%28Pixies%29+solo+show+-+1990+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"man-fish","files":24,"time":1213436814,"description":"First off, this is my first torrent, and I did not make it, I just want to put it up here because...it&amp;#039;s not here? Yeah, something like that\n\nAnd I wanted to give back to this place after all the awesome shit I downloaded\n\n\nI downloaded it here: http://www.dimeadozen.org/torrents-details.php?id=115512\n\nSo credit goes to that guy who uploaded it there, and taped it in the first place\n\nI haven&amp;#039;t had the time to listen to it yet, but people there said it sounded great, so I&amp;#039;ll believe them =D\n\nSo enjoy this show, and expect to hear from me again\n\n\n\n\n\nThe following description is from dimeadozen:\n\n\n\nIn the first weeks of 1990, Black Francis took a brief vacation from The Pixies, tossed his Telecaster and a small amp into the back of a vintage yellow Cadillac and drove around the country playing solo gigs. Here is one of them. \nAt that time the Cat&amp;#039;s Cradle was still on Franklin Street in Chapel Hill, a great spot that saw some fantastic gigs by Sonic Youth, Sugar, Throwing Muses, etc etc. Man those were the days. I think Michael Jordan&amp;#039;s restaurant took over that location? Anyhoo... \nThe Black Francis gig kind of popped up without much fanfare and was modestly attended. Lucky for you I took my Sony Walkman and a fresh TDK SA cassette. The recording obviously has its limitations, but it is still very enjoyable and is a small curious piece of American indy rock history I suppose. \nBefore the gig, the house system was playing the White Album, so Francis gave us his own stylized version of The Beatles&amp;#039; &quot;Wild Honey Pie&quot; as a quick encore. Francis also mentions that he had tried to cover a Clash song on the night before, but wasn&amp;#039;t too happy with the results so he was just going to stick to Pixies songs. I asked him afterward what the song was and he said it was &quot;The Card Cheat&quot; (from London Calling). He signed a poster for us and wrote &quot;Free Noriega!&quot; \nAs a bonus you get two Pixies songs recorded at the Cat&amp;#039;s Cradle just a few months before. Sadly that is all that remains of my tape of that gig. By that time The Pixies had really sort of outgrown the club, and the place was jam packed and super rowdy. Next time I got to see them, they were in a big ass stadium, a hundred a fifty yards away. \n\nNo EQ or compression, just loaded in, balanced and normalized. \nSony Stereo Walkman&gt;TDK SA&gt;Nach MR-1&gt;MidiMia Soundcard&gt;SoundForge8&gt;CD ARchitect&gt;Flac6 \n\n1 The Holiday Song\n2 Gouge Away\n3 Dead\n4 Mr. Grieves \n5 Cactus\n6 Nimrod&amp;#039;s Son\n7 Tame\n8 Ed Is Dead\n9 Into The White\n10 Broken Face\n11 No. 13 Baby\n12 River Euphrates\n13 Where Is My Mind?\n14 Blown Away\n15 Tony&amp;#039;s Theme\n16 Weird At My School\n17 Manta Ray\n18 I&amp;#039;m Amazed\n19 Wave of Mutilation\n20 Crackity Jones\n21 Wild Honey Pie (The Beatles cover)\n22 Where Is My Mind?\n23 Into The White\n\n-bonus tracks- \nThe Pixies \nCat&amp;#039;s Cradle Chapel Hill \nOctober 14 1989 \nWhere Is My Mind? \nInto The White","torrent":{"xt":"urn:btih:035bc11293991f07ea190b4d6d86a09100b453d5","amp;dn":"Black+Francis+%28Pixies%29+solo+show+-+1990+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"035bc11293991f07ea190b4d6d86a09100b453d5","infoHashBuffer":{"type":"Buffer","data":[3,91,193,18,147,153,31,7,234,25,11,77,109,134,160,145,0,180,83,213]},"announce":[],"urlList":[]}}