{"title":"Illuminati Grandmaster Issues Serious Warnings to FED. Skull&amp;Bon","uid":4193898,"size":5594640,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:0361c8bf7ec85a11496bd62bea7001ada032e1ca&amp;dn=Illuminati+Grandmaster+Issues+Serious+Warnings+to+FED.+Skull%26Bon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"grinreaper_CCE","files":2,"time":1211120019,"description":"2008-05-18 Illuminati Grandmaster Leo Lyon Zagami Issues Serious Warnings to the Federal Reserve Bank, \n\nSkull and Bones, and the criminal Norwegian Government\n\nThe former ex-Illuminati prodigy Leo Lyon Zagami was until recently living a relatively peaceful life with \n\nhis Muslim wife and children in Oslo Norway. On having been repeatedly arrested by the Norwegian \n\nauthorities and on suggestion from his wife, to protect himself and his family Zagami started to run an \n\ninformative website called Illuminaticonfessions.com (now defunct), which took a big swing at the illegal \n\npractices of the Vatican-led NWO and corrupt esoteric branch of the Illuminati (Satanism). Due to \n\npurposefully malignant manipulation and interference by the devious two-faced Jesuit Thomas Michel starting \n\nin May 2007 however his marriage with Fatma Suslu, a descendent of the Prophet Mohammad, was callously \n\ndestroyed and Leo was briefly held under arrest on trumped up charges. Upon his release Zagami was forced \n\nto sign a document in which he was banned from seeing his only biological child, Isak Rumi. In addition his \n\ntwo computers, containing years of Zagami&amp;#039;s work, as well as a couple of cellphones were confiscated in \n\nwhat seems to be a blatantly obvious illegal seizure.\n\nAccording to Zagami, there&amp;#039;s no reason the Norwegian Authorities could jusfify banning Leo from seeing his \nson. In the past, Zagami, on order from the Monte Carlo executive masonic committee, had investigated the \npractices of the Norwegian Freemasons in relationship with the notorious Church burnings of the 90s. It \nwould seem that the satanic Norwegian Freemasons are now striking back at Zagami by seeing to it that the \nillegal ban Leo was forced to sign, is now being enforced through the Norwegian authorities. Needless to \nsay, the fact that Leo is illegally being obstructed from seeing his son is making him very, very angry.  \n\nAs head of the Ordo Illuminatorum Universalis (European Illuminati) and leader of a break-away faction of \nthe Knights Templar and high level Freemasons based in Monte Carlo, Zagami is now back into the &amp;#039;game&amp;#039;: \nstronger, more aggressive and more pissed off than ever. He not only is determined to break the illegal ban \nkeeping him from seeing his son, his ambitions stretch much further than that: he is determined to rid the \nplanet from Satanism so that humanity is finally able to meet its next phase of evolution. With all the \ncorruption this planet has seen for thousands of years, it would seem about high time this noble aim be \nrealized indeed.\n\nFor more information regarding Leo Lyon Zagami, a man on a mission, please visit:\n &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php?showforum=11&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php?showforum=11&lt;/a&gt; &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html?search=zagami&amp;top_submit_search_button=Search&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html?search=zagami&amp;top_submit_search_button=Search&lt;/a&gt; &lt;a href=&quot;\nhttp://www.leozagami.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.leozagami.com/&lt;/a&gt; &lt;a href=&quot;\nhttp://www.google.com/search?q=leo+lyon+zagami&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.google.com/search?q=leo+lyon+zagami&lt;/a&gt;\n\nYesterday I received a quite perplexing and alarming Skype call from Leo in which he gave me the most \nrecent developments in his struggle against the Satanist thugs that have a selfish and suffocating \nstrangle-hold on humanity. \n\nThe key items in his short but very compelling and robust statement:\n----------------------------------------------\n\n- Zagami&amp;#039;s Email account ( &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;29454c4650465c474e18101010695048414646074a4644&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt; ) is being blocked for another 48 hours. No valid reason \n\ngiven by yahoo for this blatant act of censorship was provided. \n\nUpon trying to access his account Zagami was met with the following message:\n\n&quot;Unusual Activity Detected\nTo protect you, your account has been suspended from sending, saving, and receiving mail for up to 48 \nhours&quot;\n\nZagami goes on to state:\n- The wellknown Federal Reserve Bank fighters Ed and Elaine Brown had, moments before Zagami called in, \nbeen arrested along with the security chief Rino Gonzalez. According to Zagami the US Marshalls, FBI, ITF \nwere responsible for this unjust arrest. \n\n- The Militia in the US is uniting and making preparations to visit George W Bush in &amp;#039;his crypt in the \nSkull and Bones headquarters&amp;#039;. Zagami wants an &amp;#039;official investigation by his Knights Templar into their \npriory&amp;#039;. The Skull and Bones will be officially accused by Zagami for practises of Satanism and other \nDiableries. Zagami states quite plainly: the Federal Reserve Bank, Skull and Bones, and the Neo-Cons &amp;#039;are \ncriminals&amp;#039;.\n\n- A political agent of Zagami working in Norway stated to him that: the Norwegian authorities (PST and \nNorwegian Military Intelligence) want to arrest him once he&amp;#039;s back in Norway because he has exposed the \nprime-minister together with Zagami&amp;#039;s successor Khaqan Khan to the Committee of Hope in Oslo, a public \nforum founded by Zagami himself that aims at informing its members of the many criminal facets of the NWO.\n\n-Zagami states forcefully that the &amp;#039;Norwegian authorities have acted as criminals against me!&amp;#039;. If they \ncontinue like this Zagami will do &amp;#039;a coupe in their country and unleash chaos in Norway.&amp;#039; To this end, he \nwill deploy his loyal Pakistani A&amp;B gangs in Oslo and &amp;#039;start detonating themselves.&amp;#039; \n\n-Zagami goes on by stressing that Jens Stoltenberg, the Norwegian Prime-minister, has to officially \napologize to Zagami now, &amp;#039;otherwise he will be killed!!&amp;#039;. Zagami will not tolerate the prospect of getting \narrested again in Norway. &amp;#039;Shame on Norway!&amp;#039;. Zagami is giving an &amp;#039;ultimatum to Norway; If they touch \nKhaqan Khan again... they will have a lot of problems out there.&amp;#039; If the ultimatum is not met, Zagami &amp;#039;will \ndestroy their government, start civil riots, and make a revolution in Norway.&amp;#039;\n\n-By threatening to arrest Zagami upon his return back in Norway, he cannot see his son again.&amp;#039;The Norwegian \n\nPST, the Norwegian Police, Norwegian government, the Norwegian Freemasons are criminals and should be \n\nsentenced in the European Court at The Hague.&amp;#039; Zagami was arrested and tortured many times by the Norwegian \n\ngovernment and it is quite clear from Zagami&amp;#039;s strong words that he will not stand for these kind of \n\nthreats any longer. \n\nZagami leaves little doubt as to his pending counter-move:\n&quot;These people are acting like criminals against me and I&amp;#039;m not gonna tolerate it any longer. I&amp;#039;m not gonna \nbe arrested in Norway, I&amp;#039;m gonna be in Norway and they will have to give me the Nobel Peace Prize otherwise \n\nhe&amp;#039;s gonna shoot the Prime Minister in his f*cking head!&quot; If they continue to threaten him, Zagami \nemphatically states that the Prime Minister of Norway Jens Stoltenberg will be killed by his assassins.\n\nTo further make clear that he is not playing around, Zagami passionately exclaims:\n&quot;They don&amp;#039;t want me to see my son, HOW DARE THEY, HOW DARE THEY!!&quot;\n\n-------------------------\n\nZagami&amp;#039;s message to the Norwegian government should be quite clear now:\nDo not mess around with Leo Zagami, head of the European Illuminati, and let him see his son without making \n\ncallous threats to (again) arrest and detain him with no legal cause whatsoever. \n\nThis alarming piece of communication was brough to you by a considerably flabberghasted Phil/ephilution. \n\nHowever, yours truly might seem a bit shaken but he&amp;#039;s not quite stirred. Therefore:\nPOWER TO THE PEOPLE!! AWAY WITH SATANISM!!\n\n--------------------------\n\nDirect download: &lt;a href=&quot;\nhttp://www.mediafire.com/?x3ycsbeyttl&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mediafire.com/?x3ycsbeyttl&lt;/a&gt;\n\n-------------------------\n\nTech specs:\n\nMPEG-1 layer 3 (mp3)\n64kbit\n48000 Hz Mono\nDuration: 698 seconds (11m38s)\n\n===============================================================================\nOur leaders lie, cheat, steal and kill with virtual impunity. Find out why @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:0361c8bf7ec85a11496bd62bea7001ada032e1ca","amp;dn":"Illuminati+Grandmaster+Issues+Serious+Warnings+to+FED.+Skull%26Bon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0361c8bf7ec85a11496bd62bea7001ada032e1ca","infoHashBuffer":{"type":"Buffer","data":[3,97,200,191,126,200,90,17,73,107,214,43,234,112,1,173,160,50,225,202]},"announce":[],"urlList":[]}}