{"title":"Better Call Saul - Season 1 - 720p (English Subtitles) - R4R","uid":12735326,"size":4923375905,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:03bafb418cde98aadcd2a00a40460cd62b8125b2&amp;dn=Better+Call+Saul+-+Season+1+-+720p+%28English+Subtitles%29+-+R4R&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vk1989","files":23,"time":1447172324,"description":"He wasn't always Saul Goodman, ace attorney for chemist-turned-meth dealer Walter White. Six years before he begins to represent Albuquerque's most notorious criminal, Goodman is Jimmy McGill, a small-time attorney hustling to make a name for himself. He's a forceful champion for his low-income clients, an underdog whose morals and ambitions often clash. Jimmy works with private eye Mike Ehrmantraut, a former Philadelphia cop and recent transplant to the Southwest. Mike has a specialized skill set -- he's a &quot;fixer&quot; of sticky situations -- that Jimmy soon learns to appreciate.\r\n\r\nSeason 1 Episode Guide:\r\n\r\n1 :01x01 - Uno\r\nFeb/08/2015\r\nJimmy uses an unconventional method for trying to get potential clients. \r\n\r\n2 :01x02 - Mijo\r\nFeb/09/2015\r\nJimmy's troubles escalate, leaving him in dire straits; carelessness puts Chuck at risk.\r\n\r\n3 :01x03 - Nacho\r\nFeb/16/2015\r\nJimmy is eager to prove that his dangerous client is innocent, even though it causes problems with Kim.\r\n\r\n4 :01x04 - Hero\r\nFeb/23/2015\r\nJimmy devises a bold plan to obtain new clients, but must face consequences when his relationships become strained.\r\n\r\n5 :01x05 - Alpine Shepherd Boy\r\nMar/02/2015\r\nWhen his efforts to drum up new business are interrupted by alarming news, Jimmy is pressured to make a difficult choice.\r\n\r\n6 :01x06 - Five-O\r\nMar/09/2015\r\nMike's tragic past comes back to haunt him, and he's forced to seek help from an unusual source. Jimmy's moral compass is put to the test.\r\n\r\n7 :01x07 - Bingo\r\nMar/16/2015\r\nJimmy meets with potential new clients. When given the opportunity to do the right thing, Jimmy cashes in a favor from an unlikely ally.\r\n\r\n8 :01x08 - Rico\r\nMar/23/2015\r\nJimmy demonstrates to Chuck that he's willing to do almost anything to win a case, even if it means getting his hands dirty.\r\n\r\n9 :01x09 - Pimento\r\nMar/30/2015\r\nChuck urges Jimmy to accept a harsh truth. A deal threatens to go off the rails when Mike's ability to complete a job is called into question.\r\n\r\n10 :01x10 - Marco\r\nApr/06/2015\r\nIn the aftermath of recent events, Jimmy seizes an opportunity to reconnect with an old friend. Chuck adjusts to a new way of life","torrent":{"xt":"urn:btih:03bafb418cde98aadcd2a00a40460cd62b8125b2","amp;dn":"Better+Call+Saul+-+Season+1+-+720p+%28English+Subtitles%29+-+R4R","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03bafb418cde98aadcd2a00a40460cd62b8125b2","infoHashBuffer":{"type":"Buffer","data":[3,186,251,65,140,222,152,170,220,210,160,10,64,70,12,214,43,129,37,178]},"announce":[],"urlList":[]}}