{"title":"Early American History 1","uid":12836214,"size":829044191,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:03bef4b76cbae32b7dfd6fb5b6c19b76066e6a7f&amp;dn=Early+American+History+1&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Trae_Beard","files":1441,"time":1448457905,"description":"EAH1 is short for Early American History 1, the first semester of a two-semester course on American History. \r\n\r\nIt consists of 24 written lectures, presented in four configurations (one version with no hyperlinks, one version with hyperlinks to local resources only, one version with hyperlinks to online resources only, and one version with hyperlinks to both local and online resources). Three of the four versions are offered as both combined files (all 24 lectures in one file) and as individual lectures, and in five  file formats - HTML,PDF, EPUB, MOBI and AZW3. This accounts for the large number of files in the torrent. There is a caveat that goes with this, however. Although I have viewed most of the e-book formats on my computer using Calibre, they have not been tested on an actual e-book reader because I don't own one! Sorry. Let the testing begin!!\r\n\r\nThere are also 24 audio recordings of the author giving those lectures, word-for-word, in both mp3 and m4a formats. This accounts for the size of the download. The folder of mp3 recordings is 361 MB while the folder of m4a recordings is 327 MB.\r\n\r\nFinally, included are 19 quizzes and exams. That sounds like a lot, but in reality, there are several versions of quizzes that cover the same material. There are two versions of Quiz 1, five versions of the Midterm Exam, three versions of Quiz 2 and four versions of the Final Exam. The cool thing about the quizzes is that in addition to being offered as PDF files, they are also offered in a self-grading java format.\r\n\r\nThe fulll title of the website on offer here is a mouthful: \r\n\r\nAn Introduction to American History, Part 1: Settlement to Reconstruction\r\n\r\nThe Mini-lecturers of Professor Tom Jacobsen\r\nA Primer for Self-Study for Students of English as a Second Language\r\n\r\nDownload! Share! Enjoy! By the way, it is my belief that this is a completely legal download","torrent":{"xt":"urn:btih:03bef4b76cbae32b7dfd6fb5b6c19b76066e6a7f","amp;dn":"Early+American+History+1","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"03bef4b76cbae32b7dfd6fb5b6c19b76066e6a7f","infoHashBuffer":{"type":"Buffer","data":[3,190,244,183,108,186,227,43,125,253,111,181,182,193,155,118,6,110,106,127]},"announce":[],"urlList":[]}}