{"title":"Dragon Ball Z: El Mas Fuerte Del Mundo","uid":4128832,"size":356567040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:043985209359860f84c1009691e05299f3898dba&amp;dn=Dragon+Ball+Z%3A+El+Mas+Fuerte+Del+Mundo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cazomdb","files":1,"time":1207934690,"description":"Woolong descubre con Son Gohanda que alguien tiene la intenciÃƒÂ³n de reunir las bolas de dragÃƒÂ³n con malos propÃƒÂ³sitos. Averiguan que al Dr. Korchin ha pedido al dragÃƒÂ³n sagrado ShenrÃƒÂ³n que vuelva a la normalidad el laboratorio del Dr.Willow, enterrado ya desde 50 aÃƒÂ±os atrÃƒÂ¡s. Ambos doctores tienen una malvada y cruel intenciÃƒÂ³n:  formar unos guerreros fuertes que eliminen al ser humano de la faz de la Tierra. QuerÃƒÂ­an dominar el mundo.\nPiccolo consigue salvar a Gohan de esta peligrosa situaciÃƒÂ³n, pero lo capturan los secuaces de los doctores: MisoKatsun, Kishime y Ebifrya. El objetivo de Krochin es traer al hombre mÃƒÂ¡s fuerte del mundo para que Willow recupere su cuerpo, pues actualmente es poco mÃƒÂ¡s que un androide. El cientÃƒÂ­fico loco cree que Kame Sennin sigue siendo el mÃƒÂ¡s poderoso y consigue secuestrar a Bulma. Los bioguerreros de Willow pueden derrotar a Kame Sennin sin problemas...\nEn este momento llegan Goku, Son Gohanda y Krilyn. Cuando Goku se ha enfrentado a los bioguerreros, le toca luchar contra Piccolo Junior, controlado por una mÃƒÂ¡quina del cruel doctor. Gohan consigue romper la mÃƒÂ¡quina... En un desesperado ataque de Willow a Goku, su laboratorio acaba destruido con el kaioh ken, kame hame ha y el definitivo genkidama de Goku. Bulma menciona que Mutenroshi realmente es el mejor viejo verde...","torrent":{"xt":"urn:btih:043985209359860f84c1009691e05299f3898dba","amp;dn":"Dragon+Ball+Z%3A+El+Mas+Fuerte+Del+Mundo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"043985209359860f84c1009691e05299f3898dba","infoHashBuffer":{"type":"Buffer","data":[4,57,133,32,147,89,134,15,132,193,0,150,145,224,82,153,243,137,141,186]},"announce":[],"urlList":[]}}