{"title":"Cracker - Season 3.  Four episodes including Lucky White Ghost","uid":4181253,"size":3143254339,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0449ee25f31a53c2d6d8cefd3a4e68bda53706f6&amp;dn=Cracker+-+Season+3.++Four+episodes+including+Lucky+White+Ghost&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"paradan","files":9,"time":1210420576,"description":"This is Cracker Season 3 and there are four episodes here, all as AVI files. Each episode is summarized below and screenshots follow each description:\n\n\nSeason 3, Episode 1:  Brotherly Love\nAired:  October 1995.  IMDB rating: 9.4\n\nAfter having sex with a prostitute, David Harvey kills her when he finds he is unable to pay and she threatens to tell his wife. The case becomes complicated however when a second prostitute is killed and the forensic evidence indicates that it was the same killer. Only problem is that Harvey was in custody at the time of the second killing. Fitz is convinced that Harvey killed the first woman and that an accomplice did the second to cast doubt on his guilt. DS Jimmy Beck returns to work after four months sick leave, still haunted by his role in DI Bilboroughs death and continuing to deny that he raped Jane Penhaligon. Fitzs mother dies and he has to deal with the guilt of being a less than attentive son.\n\n[IMG]http://img166.imageshack.us/img166/9572/brotherly1titlevf3.jpg[/IMG]\n[IMG]http://img521.imageshack.us/img521/8347/brotherly2fo2.jpg[/IMG]\n[IMG]http://img241.imageshack.us/img241/6425/brotherly3vy1.jpg[/IMG]\n[IMG]http://img59.imageshack.us/img59/9668/brotherly4bz2.jpg[/IMG]\n[IMG]http://img137.imageshack.us/img137/8871/brotherly5sl0.jpg[/IMG]\n[IMG]http://img519.imageshack.us/img519/9009/brotherly6mt7.jpg[/IMG]\n\n\n\nSeason 3, Episode 2:  Best Boys\nAired:  November 1995.  IMDB rating: 9.4\n\nBill Preece is a runaway from a childcare facility who finds work in a local factory. He has no place to stay so the foreman, Stuart Grady, offers him his sofa for a night. A dispute with the landlady leads to her being killed and Bill soon drags his new friend into a spiral of crime. He especially wants to exact revenge against those he feels treated him badly as a foster child. Fitz soon realizes that two people are committing the murders, though he believes the perpetrators to be a man and a woman. With the new baby at home, Judith decides that its time to put herself first. The police are still recovering from the death of one of their own and Jane Penhaligon in particular is still having difficulty coping.\n\n[IMG]http://img167.imageshack.us/img167/2972/best2kq3.jpg[/IMG]\n[IMG]http://img241.imageshack.us/img241/1729/best1titlejo9.jpg[/IMG]\n[IMG]http://img167.imageshack.us/img167/8807/best4gj7.jpg[/IMG]\n[IMG]http://img504.imageshack.us/img504/508/best5lo1.jpg[/IMG]\n[IMG]http://img155.imageshack.us/img155/9549/best6da5.jpg[/IMG]\n\n\n\nSeason 3, Episode 3:  True Romance\nAired:  November 1995.  IMDB rating: 9.6\n\nGerry Fitz Fitzgerald is an alcoholic, self-hating psychologist and compulsive gambler who lectures at local community colleges and hosts a radio-call in show, while assisting the Los Angeles police department in various crimes. Fitz is asked to help track down a female serial killer of men who writes him love notes, claiming to be in love with Fitz. With the clock ticking and minimal evidence to move the investigation along, Fitz must find a way to locate the killer before she strikes again. On a personal front, Fitz is also having problems at home: Judith, his wife and a feminist author, is on the verge of throwing in the towel on their marriage despite their newborn baby. Michael, Fitzs 17-year-old son, finds it extremely difficult to relate to his equally troubled father.\n\n[IMG]http://img171.imageshack.us/img171/4752/romance1titleir3.jpg[/IMG]\n[IMG]http://img362.imageshack.us/img362/7272/romance2wy6.jpg[/IMG]\n[IMG]http://img413.imageshack.us/img413/9936/romance3hn2.jpg[/IMG]\n[IMG]http://img413.imageshack.us/img413/166/romance4qt0.jpg[/IMG]\n[IMG]http://img517.imageshack.us/img517/720/romance5gv2.jpg[/IMG]\n[IMG]http://img100.imageshack.us/img100/503/romance6zc0.jpg[/IMG]\n\n\n\nSeason 3, Episode 4 (Special):  Lucky White Ghost\nOctober 1996.  IMDB rating:  8.0\n\nDennis Philby owns his own company in Hong Kong and business has not been going well. Through his own incompetence he is going bankrupt and one of his customers offers to buy him out. At home, Dennis is thrilled that his girlfriend is pregnant but when she hears of Dennis financial troubles, tells him that she will get an abortion and wait until their lives are more stable to start a family. This pushes Dennis over the edge: he kills the potential buyer for his company and his fiances doctor. He also imprisons her, intending to keep her captive until the baby is born. Fitz is in Hong Kong on a lecture tour and works with the local police to find the killer. He arranges for them to request the services of DS Penhaligon, only to have DCI Wise show up to help him.\n\n[IMG]http://img152.imageshack.us/img152/8250/lucky1titledb2.jpg[/IMG]\n[IMG]http://img530.imageshack.us/img530/186/lucky2rf0.jpg[/IMG]\n[IMG]http://img254.imageshack.us/img254/1462/lucky2aas3.jpg[/IMG]\n[IMG]http://img254.imageshack.us/img254/1723/lucky4gc4.jpg[/IMG]\n[IMG]http://img301.imageshack.us/img301/8417/lucky5lp8.jpg[/IMG]\n\n\nIt is best to watch the seasons in the order they were aired.  Along with the main stories in each episode, there are several back stories that span the episodes and make the show more enjoyable. If not available here, try thebox.bz,or a search on    \n\n\nEnjoy!\n\nparadan\n\n\nRip Specs:\n\nVideo:  Codec:  XVID, 640x496, frame rate: 25\nAudio:  Codec: mpga, 2 channels, 48,000 sample rate, 320 kb/s bitrate.\nDuration of each episode is approximately 50 minutes.  \nSubtitles:  None.  Please PM me if you know where I can find English subitles.\n\nI did not rip these episodes myself. I assembled them over a period of about a year. At least one episode is a DVD rip.  The others, I have been told, are TV rips.  But the audio and video quality is high on all of them.\n","torrent":{"xt":"urn:btih:0449ee25f31a53c2d6d8cefd3a4e68bda53706f6","amp;dn":"Cracker+-+Season+3.++Four+episodes+including+Lucky+White+Ghost","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0449ee25f31a53c2d6d8cefd3a4e68bda53706f6","infoHashBuffer":{"type":"Buffer","data":[4,73,238,37,243,26,83,194,214,216,206,253,58,78,104,189,165,55,6,246]},"announce":[],"urlList":[]}}