{"title":"Legendary Pink Dots - Hallway of the Gods[FLAC - LOSSLESS]","uid":4184523,"size":445456918,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:04dd50b52753ca2270e80b37e54044d0e0d69774&amp;dn=Legendary+Pink+Dots+-+Hallway+of+the+Gods%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"99AM","files":12,"time":1210598604,"description":"FLAC files.\nRelease date: September 8, 1997.\n\n\nTrack Listing:\n01. On High - 5:49\n02. Mekkanikk - 3:17\n03. Sterre - 4:08\n04. Spike - 3:28\n05. All Sides - 4:43\n06. Harvest Babies - 5:41\n07. Lucifer Landed - 4:01\n08. The Hanged Man - 2:42\n09. The Saucers Are Coming - 11:14\n10. Destined To Repeat - 5:07\n11. Hallway - 12:41\n\n\nThis 1997 entry from the band&amp;#039;s continuing exploration in dark psychedelia is, like so many of the Legendary Pink Dots&amp;#039; efforts, a winner in both quiet and overwhelming modes. Sliding into things with the steady &quot;On High,&quot; Edward Ka-Spel and his merry men aren&amp;#039;t going to provide longtime listeners with any surprises, but as with most of their late-&amp;#039;90s albums, the combination of rich recording and production quality with subtle twists and variations works very well. The looped rhythm of &quot;Harvest Babies,&quot; leading into a dramatic keyboard/guitar conclusion that conveys a sense of the band&amp;#039;s strong live power, reflects the band&amp;#039;s not-quite-relationship with modern electronic dance, though the roots are generally more in space rock trance than Goa. Mellower songs like &quot;Mekkanikk&quot; and &quot;Destined to Repeat&quot; show how the band&amp;#039;s sense of drama and space can work just as effectively on low volume as well as on overload, as well as giving Ka-Spel a chance to make his cryptic imagery stand out more strongly. Ka-Spel&amp;#039;s vocals in particular bring up some understated differences -- consider the shift on &quot;Spike,&quot; where it almost sounds like he&amp;#039;s biting down on his word once the full chug of the song starts, or the buried delivery on &quot;All Sides&quot; and the a cappella, conversational beginning of &quot;The Saucers Are Coming.&quot; That the latter song turns into the killer freak-out on the album -- at once paranoid and a charge to the heavens -- seems only appropriate. One of the best moments is &quot;Sterre,&quot; with its acoustic guitar start and gentle, mournful air (Niels Van Hoornblower&amp;#039;s clarinet/sax work here, set against some delicate electric guitar wails, makes for an entrancing conclusion). &quot;Lucifer Landed&quot; has a similar start and an even more stripped-down, calm air -- it&amp;#039;s one of the band&amp;#039;s most conventional songs in ways, all without losing Ka-Spel&amp;#039;s obsessive focus or the detailed arrangement that the collective band is known for.\n(Review from AMG)\n\n\nEnjoy!","torrent":{"xt":"urn:btih:04dd50b52753ca2270e80b37e54044d0e0d69774","amp;dn":"Legendary+Pink+Dots+-+Hallway+of+the+Gods%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"04dd50b52753ca2270e80b37e54044d0e0d69774","infoHashBuffer":{"type":"Buffer","data":[4,221,80,181,39,83,202,34,112,232,11,55,229,64,68,208,224,214,151,116]},"announce":[],"urlList":[]}}