{"title":"Trials 2 Second Edition 1.05 Installer","uid":4088337,"size":124337488,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:060769a319ff6aa790e0044ea03bbde18b5c2d6b&amp;dn=Trials+2+Second+Edition+1.05+Installer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"craclr","files":1,"time":1205940535,"description":"Trials 2 Second Edition is a motorcycle game that emphasizes balance, skill and control over speed. You, as the player, try to tackle indoor obstacle tracks with minimum faults, as fast as possible. The tracks consist of logs, truck tires, horizontal ladders, metal ramps, jumps over concrete pipes, scaffoldings reaching staggering heights, etc. To succeed, you need to simultaneously control the bike and the driver?s posture, sometimes advancing inch by inch, sometimes hitting full throttle to jump over flaming barrels.\n\n    *  4 game types (race, flip, wheelie, dynamic)\n    * Race: Race against other players to compete levels as fast as possible.\n    * Flip: Try to make as many backflips or frontflips with your bike to reach a top score.\n    * Wheelie: Drive on your backwheel for longest distance possible.\n    * Dynamic: Navigate through tracks with various dynamic obstacles and puzzles.\n    * 40 tracks to play:\n          o 3 Tutorial tracks\n          o 11 Easy difficulty tracks\n          o 8 Medium difficulty tracks\n          o 8 Hard difficulty tracks\n          o 3 Flip tracks\n          o 3 Wheelie tracks\n          o 4 Dynamic physics tracks \n    * Global highscores\n          o All time and weekly high score lists\n          o Filtering by team and country \n    * Online replays. Watch a replay of any high score on global high score list.\n    * Ghost challenge. Play against the ghost of any other player in high score list.\n    * Online player profiles with team, country and player statistics.\n    * 25 achievements to unlock.\n    * 3D ragdoll. When the player makes a fault he drops off the bike in realistically painful way.\n    * Custom replay recording. Players can record their rides to a file that can be shared.\n    * Ingame chat room\n    * Gamepad support with force feedback (rumble) based on physics response\n    * Several camera modes (multiple side view modes, 1st person, 3rd person, cinematic) \n\n\nEngine features\n\n    * Next-generation graphics engine utilizing deferred rendering\n    * Advanced per pixel lighting and material system\n    * Realistic pixel perfect dynamic shadows from all light sources\n    * High resolution textures designed for Full HD (1920x1080) resolution and beyond\n    * High quality post process filters: Motion blur, depth of field and overexposure light bloom\n    * Dynamic screen space ambient occlusion for ultra high end graphic cards\n    * Volumetric soft particles\n    * 7.1 positional surround sound with doppler and reverb effects ","torrent":{"xt":"urn:btih:060769a319ff6aa790e0044ea03bbde18b5c2d6b","amp;dn":"Trials+2+Second+Edition+1.05+Installer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"060769a319ff6aa790e0044ea03bbde18b5c2d6b","infoHashBuffer":{"type":"Buffer","data":[6,7,105,163,25,255,106,167,144,224,4,78,160,59,189,225,139,92,45,107]},"announce":[],"urlList":[]}}