{"title":"John C. Bogue - The Battle for the Soul of Capitalism","uid":4119264,"size":202795334,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:06ebb963a062fdac604c8f5e21c7e24b1cc632b9&amp;dn=John+C.+Bogue+-+The+Battle+for+the+Soul+of+Capitalism&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Diaperzone","files":138,"time":1207466174,"description":"The Battle for the Soul of Capitalism:  \n\nHow the financial system undermined ideals, damaged trust in the markets, robbed investors of trillions -- and what to do about it.\n\n   Author: John C. Bogue\n   Reader: Stefan Rudnicki\n\n   Audio Length: 9:22:36\n   Abridged non-fiction, CDs 1-8 in 48kps .MP3 format\n\nThere is no one better qualified to tell us about the failures of the American financial system and the grotesque abuses that have taken place in recent years than John C. Bogle, founder and former chief executive of the Vanguard mutual-fund group. This legendary mutual-fund pioneer has witnessed firsthand the innermost workings of the financial industry for more than 50 years and has set the standards for sound investment strategies and stewardship.\n\nBogle&amp;#039;s prudent advocacy of the rights of individual investors began with his 1951 Princeton University thesis on the fund industry, and he continues to champion the restoration of integrity in industry practices today. An astute observer, he knows that a trustworthy business and financial complex is essential to America&amp;#039;s continuing leadership in the world and to economic and social progress at home.\n\nThis audiobook explains much more than what went wrong. More important, it tells us why we lost our way and how we can right our course. The specific reforms Bogle advances are practical and essential, and he includes recommendations for assuring that investors receive their fair share of financial-market returns.\n","torrent":{"xt":"urn:btih:06ebb963a062fdac604c8f5e21c7e24b1cc632b9","amp;dn":"John+C.+Bogue+-+The+Battle+for+the+Soul+of+Capitalism","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06ebb963a062fdac604c8f5e21c7e24b1cc632b9","infoHashBuffer":{"type":"Buffer","data":[6,235,185,99,160,98,253,172,96,76,143,94,33,199,226,75,28,198,50,185]},"announce":[],"urlList":[]}}