{"title":"Law &amp; Order","uid":4073823,"size":366718976,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:06f9a75f9e245b506058ea2f5ce558fc443146fc&amp;dn=Law+%26+Order&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"steinenkova","files":1,"time":1205189279,"description":"In New York City, when a crime is committed, the victims are represented by two distinct yet forever intertwined forces. There&amp;#039;s the police department, represented here by the 27th precinct Homicide Detectives. Theres Senior Homicide Detective Edward Green (Jesse L. Martin) and his partner Detective Cyrus Lupo (Jeremy Sisto) who both report to their boss Lieutenant Anita Van Buren (S. Epatha Merkerson). It is their job to investigate the crime, collect evidence, interview witnesses and then, when the evidence points to a suspect or suspects, place the suspect(s) under arrest. The matter is then taken over by the prosecutors of the Manhatten District Attorney&amp;#039;s office, Executive Assistant District Attorney Michael Cutter (Linus Roache) with support from his assistant prosecutor Connie Rubirosa (Alana De La Garza) who work under the watchful eye of Manhatten District Attorney John James McCoy (Sam Waterston), together they discuss deals, prepare the witnesses and evidence and conduct the people&amp;#039;s case in the trial. Both teams work with the Medical Examiners Office, Crime Lab and Police and District Attorney psychiatrists. Matters are rarely resolved easily, or for the people involved, satisfactorily. Crimes are committed which frequently create public unrest and controversy, race, morals and beliefs are frequently challenged and manipulated, the guilty can go unpunished and the innocent ruined forever. The detectives and prosecutors are weary, cynical, flawed, human and vulnerable. And yet they are somehow still dedicated to their jobs, to make the guilty answer for their crimes and gain some sense of justice for the victim and the victim&amp;#039;s family. These are their stories...","torrent":{"xt":"urn:btih:06f9a75f9e245b506058ea2f5ce558fc443146fc","amp;dn":"Law+%26+Order","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"06f9a75f9e245b506058ea2f5ce558fc443146fc","infoHashBuffer":{"type":"Buffer","data":[6,249,167,95,158,36,91,80,96,88,234,47,92,229,88,252,68,49,70,252]},"announce":[],"urlList":[]}}