{"title":"The Ultimatum : Benjamin Fulford :  Tokyo, Japan 2008 (www.proje","uid":4095904,"size":431396537,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:07316a06e209be75010d715e4a5e63774bcf6336&amp;dn=The+Ultimatum+%3A+Benjamin+Fulford+%3A++Tokyo%2C+Japan+2008+%28www.proje&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gustafrei","files":3,"time":1206314874,"description":"If you need a bodyguard, it&amp;#039;s too late. You have to make them not want to shoot you.\nBenjamin Fulford\n\nThe son of a Canadian diplomat, Benjamin Fulford rebelled against his upbringing and at the age of 17 made his way by boat into the heart of the Amazon to live with a tribe of former cannibals. Continuing to seek answers and better understand Western society, he spent time in a self-sufficient community in Argentina before heading to attend university in Japan.\n\nPrincipled, brave, and still a diehard idealist after all these years, he resigned as Asia-Pacific Bureau Chief of Forbes Magazine after investigating a scandal which the editor refused to report. As he researched global affairs further in his own time, he uncovered for himself the complex web which is global financial control at the hands of the Rockefellers and the Rothschilds - and also the existence of racially targeted bioweapons such as SARS.\n\nIt was these plans for global depopulation that upset some important and powerful factions in Japan, Taiwan and China. After being approached by a real-life, present-day Ninja, matters came to a head in 2007 when Benjamin became the first Westerner for 500 years to be admitted into the ranks of the Eastern Secret Societies, a vast group with six million members. Acting as their spokesman, he stepped up to the plate to deliver a simple message to the Illuminati:\n\nRecognize that your time is over, step down without a fight, and allow the world to thrive as it should - or face the consequences from up to 100,000 professional assassins for whom no love is lost towards the self-styled ruling elite of the planet.\n\nThis was first communicated through Dr Henry Makow and Jeff Rense in July 2007. Project Camelot has now traveled to Japan to meet with Benjamin Fulford personally. Our comprehensive interview presents the far-reaching and literally incredible background story - and will also enable the Illuminati, who we have every confidence watch our videos carefully, to be reminded that the ultimatum is real, serious, and still in force.\n\nArmed also with a contagiously optimistic vision of the future, Benjamin is fully prepared to be the next Finance Minister for Japan. His plans for how he would spend Japan&amp;#039;s $5 trillion of foreign reserves to eliminate global poverty are plausible and inspiring as practical steps, way beyond rhetoric, to repair the generations of damage done by a ruthless ruling elite. This is a man with a deep understanding of both East and West, a global economic historian who thinks way outside of the box, a lover of peace who is unafraid to speak warrior words.\n\nVisit www.projectcamelot.org for more interesting videos and interviews!","torrent":{"xt":"urn:btih:07316a06e209be75010d715e4a5e63774bcf6336","amp;dn":"The+Ultimatum+%3A+Benjamin+Fulford+%3A++Tokyo%2C+Japan+2008+%28www.proje","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07316a06e209be75010d715e4a5e63774bcf6336","infoHashBuffer":{"type":"Buffer","data":[7,49,106,6,226,9,190,117,1,13,113,94,74,94,99,119,75,207,99,54]},"announce":[],"urlList":[]}}