{"title":"Journey into Space - Frozen in Time (BBC Radio 4 2008) 160kbps","uid":4131521,"size":67735074,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:07b9f70e782cbca2e657602c10f87439fbf2f201&amp;dn=Journey+into+Space+-+Frozen+in+Time+%28BBC+Radio+4+2008%29+160kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"drmatt","files":1,"time":1208053635,"description":"Journey into Space - Frozen in Time (BBC Radio 4 2008) 160kbps\n\nWritten by Charles Chiltern\nStarring David Jacobs as Jet Morgan\n\nA brand new adventure for the crew of the spaceship Ares, returning to radio after 50 years!\n\nSampled from BBC listen again.\n\n&quot;Journey into Space&quot;, a trio of adventures written by Charles Chilton and broadcast from 1953 to 1958, was an international as well as personal phenomenon. Translated into 17 languages, it was later noted for its prescience, having landed man on the moon in 1965, which was only four years before it actually happened. It was also the last evening radio series to attract a bigger audience than that watching television at the same time, making it a watershed in postwar Britain. Today it still enjoys a huge fanbase, with active websites and keenly received repeats on BBC7.\n\nThose followers, and others who like their radio drama to be entertaining rather than earnest and literary, will not want to miss this coming Saturday?s afternoon play on Radio 4. It is an update of, and richly evokes, the original. Entitled Journey into Space - Frozen in Time, it was written by Chilton (now 89) in collaboration with the producer, Nick Russell-Pavier.\n\nSet on Mars in 2013, it picks up where the last story, The World in Peril, finished. Most of the crew have been in deep-sleep suspension for 36 years. Captain Jet Morgan is played by David Jacobs, now 81, the sole surviving member of the original cast, and the outstanding music is composed by the author?s son, David Chilton. It has an eerie, epic, filmic quality about it, even if it is all composed on synthesizers rather than the full orchestra used by Van Phil-lips in the 1950s.\n\nDo not listen to Frozen in Time if you can?t abide what are always called ?stereotypes? - the chirpy cockney, straight-talking Aussie, cheerful Canadian, square-jawed Brit and cool Nordic blonde. But do listen for its reflections on time and space, memory and comradeship, benign and malign, and, of course, for the exciting story. The fact that it has been left open-ended, with Jet and his crew wondering whether to help an apparently distressed spacecraft, suggests that Journey into Space might make a further close encounter with the airwaves in due course. This one will be released on CD later in the year.\n\nJourney into Space was a tipping point in broadcasting history in ceding evening dominance thereafter to television. But it reminds us that there is still one time of day when radio is more popular, which is breakfast. At 8am on an average weekday (the time R4?s Charlotte Green had her giggles reading a news bulletin recently), 11m adults are listening to a BBC radio station, twice as many as are watching television. That is just BBC radio, of course: add in commercial radio, still the most popular sort for people up to the age of 44, and the lead is even greater. Despite all the other gadgetry busily competing for our attention, and all the alleged advances of the 21st century, some of which bemuse Jet just as they bemuse us, radio, whether digital or analogue, valve or transistor, Bakelite or wood, mobile or immobile, continues to rule the roost. ","torrent":{"xt":"urn:btih:07b9f70e782cbca2e657602c10f87439fbf2f201","amp;dn":"Journey+into+Space+-+Frozen+in+Time+%28BBC+Radio+4+2008%29+160kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"07b9f70e782cbca2e657602c10f87439fbf2f201","infoHashBuffer":{"type":"Buffer","data":[7,185,247,14,120,44,188,162,230,87,96,44,16,248,116,57,251,242,242,1]},"announce":[],"urlList":[]}}