{"title":"[ANT] - [Wii] - Sports Island - [PAL]","uid":4236527,"size":707205525,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:08ff9479a98ef17c9759e2ee893bf7768dd6cc25&amp;dn=%5BANT%5D+-+%5BWii%5D+-+Sports+Island+-+%5BPAL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"er_guao","files":7,"time":1213324621,"description":"A muchos aficionados a distintos tipos de disciplinas deportivas les ha caÃƒÂ­do en gracia la Nintendo Wii debido a sus particulares mandos y a las acciones que se pueden realizar a travÃƒÂ©s de ellos. Justamente para este tipo de pÃƒÂºblico, la gente de la desarrolladora Hudson Software (creadora del mÃƒÂ­tico Bomberman) ha decidido trabajar en Sports Islands, un juego de deportes con un estilo muy similar al que ya hemos visto en Wii Sports y que estarÃƒÂ¡ llegando a las tiendas en marzo prÃƒÂ³ximo.\n\nPues bien, una vez que le echemos mano, nos encontraremos con diez especialidades diferentes que se destacan sobre el resto, ellos son: el bÃƒÂ¡squet, las competiciones con arco, carreras de karts, carreras de motos, el voley, el patinaje artÃƒÂ­stico, el snowboard, el curling, el bÃƒÂ¡dminton y, por supuesto, el fÃƒÂºtbol. Por suerte todos ellos poseerÃƒÂ¡n modalidad multijugador, lo que servirÃƒÂ¡ para competir con amigos, pero en algunos de ellos esta experiencia no serÃƒÂ¡ muy buena a causa del decaimiento que produce en el ritmo del juego, como por ejemplo en el del arco y flecha.\n\nTeniendo en cuenta que su punto fuerte recae en su jugabilidad, es normal entonces que presente unos grÃƒÂ¡ficos simples y sencillos, aunque no faltos de colorido. Los distintos deportistas tienen un aspecto demasiado similar entre sÃƒÂ­, aunque esto por suerte no ocurre con los escenarios, los cuales estÃƒÂ¡n bien provistos de detalles. ","torrent":{"xt":"urn:btih:08ff9479a98ef17c9759e2ee893bf7768dd6cc25","amp;dn":"%5BANT%5D+-+%5BWii%5D+-+Sports+Island+-+%5BPAL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"08ff9479a98ef17c9759e2ee893bf7768dd6cc25","infoHashBuffer":{"type":"Buffer","data":[8,255,148,121,169,142,241,124,151,89,226,238,137,59,247,118,141,214,204,37]},"announce":[],"urlList":[]}}