{"title":"BitComet version of Magic World Online  V.0430","uid":4176223,"size":2449084370,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:094c69b23c360a7b363bf879f03ccccba013057d&amp;dn=BitComet+version+of+Magic+World+Online++V.0430&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gameyj","files":1,"time":1210141148,"description":"Version: mwobc0430    Updated: 2008-05-05    File Size: 2.28G\n\nGreat News!\n\nBitcomet is proud to partner with Ingle Games Ltd, the publisher of Magic World Online, to launch a brand new game server just for Bitcomet users.\n\nMagic World Online is a fantasy Massive Multiplayer Online Role Playing Game (MMORPG) with exciting features such as Massive Guild/State Wars, In-game Video Chat, AI Robot, Mount Raising, In-game Marriage, House Building, Growing Weapons, Crafting Skills, etc. The game will be free to download, and free to play for life.\nThe new server has been launched at 00:01am of 4/22/2008 (PST). Meanwhile, you can download the client program ahead of time from the links below. The client is a bit large (2.2G in size), and it may take a few hours to download it with your Bitcomet Software. However, we promise that the world of MWO is so exciting that you will not regret the time spent on the download!\n\nThere is no need to register a new account to play MWO, if you have a Bitcomet passport already. Simply activate MWO here and you are ready to log into the game. If you do not have a Bitcomet passport yet, click here to register one.Ãƒ?Ã‚Â£??\n\nMeanwhile, you can visit the Bitcomet Forum of MWO here. You can find many useful resources and communicate with your fellow Bitcomet gamers on the forum.\nJoin us in one of the most exciting MMORPGs of 2008, Magic World Online!","torrent":{"xt":"urn:btih:094c69b23c360a7b363bf879f03ccccba013057d","amp;dn":"BitComet+version+of+Magic+World+Online++V.0430","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"094c69b23c360a7b363bf879f03ccccba013057d","infoHashBuffer":{"type":"Buffer","data":[9,76,105,178,60,54,10,123,54,59,248,121,240,60,204,203,160,19,5,125]},"announce":[],"urlList":[]}}