{"title":"Kevin Welch, Kieran Kane &amp; Fats Kaplin-Kane Welch Kaplin(2007-Co","uid":4083432,"size":51775664,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:09f4d3f7a4f76cabb5a7a82d6600be64ae37bfa3&amp;dn=Kevin+Welch%2C+Kieran+Kane+%26+Fats+Kaplin-Kane+Welch+Kaplin%282007-Co&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Cheng","files":16,"time":1205681434,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/51t3WtCfudL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/51t3WtCfudL._SS500_.jpg&lt;/a&gt; &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/419hf1TjVyL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/419hf1TjVyL._SS500_.jpg&lt;/a&gt;\n\n-=AMG Review=- by Jason MacNeil\n\nPicking up where their last collaboration left off, the trio of Kevin Welch, Kieran Kane, and Fats Kaplin are not simply mailing it in as might be the case with other trios resting on the strength of previous efforts. The slow, barren &quot;Ain&amp;#039;t Gonna Do It&quot; has Kane leading the way with Welch providing distant harmonies for a fine result. Meanwhile, Welch shows his prowess during the stellar &quot;I Wish I Had That Mandolin&quot; that glides along thanks to Fats Kaplin adding accents on an electric sitar. It&amp;#039;s a song that even a great songwriter like Steve Earle would curse with envy. Perhaps the biggest compliment is that all three let the songs work regardless of who is doing what. The simple story Kane relays of checking into a hotel room during &quot;Red Light Blinking&quot; is probably the first early highlight, but there are many more to come. A few bluesy or Delta-tinged rags come into the album such as &quot;Callin&amp;#039; You&quot; and &quot;That&amp;#039;s What I Got&quot; but these pale greatly in comparison to &quot;Last Lost Highway&quot; that Welch nails beautifully. The same can be said of &quot;Highland Mary&quot; which has some subtle Celtic touches guiding it along and the powerful &quot;What Are They Doin&amp;#039; in Heaven Today?&quot; The only miscue is the spoken word delivery of &quot;Dark Boogie #7&quot; which sinks like a stone very quickly. \n\n-=Amazon Review=- by Hal Horowitz\n\nThe third in a series of albums by guitarists, singers, and songwriters Kieran Kane and Kevin Welch along with multi-instrumentalist Fats Kaplin is somewhat deceptively titled, as Kane&amp;#039;s son Lucas is also aboard, making it a quartet. His restrained and meticulously placed drums and percussion shadings help give this warm folk its heartbeat. Kane Sr.&amp;#039;s startling and bizarre folk-art cover painting (his work also adorns the group&amp;#039;s previous albums) is the boldest aspect of this low-key project. Kane and Welch&amp;#039;s stripped-down songs shimmer with Southern heat, lazy, lovely, and measured. They trade vocals and harmonize on a set of 11 originals and a closing cover of the public-domain tune &quot;What Are They Doin&amp;#039; in Heaven Today?&quot; that trod down dusty back roads at a languid yet deliberate pace. Kaplin&amp;#039;s slithery fiddle and Kane&amp;#039;s high, lonesome banjo on &quot;Callin&amp;#039; You&quot; capture the song&amp;#039;s somewhat cautionary lyrics with help from stark yet taut percussion. Nothing is rushed, forced, or molded into commercially accessible pop. This is pure, unfiltered folk, hotwired from the spirit and soul of the participants and sprinkled with religious imagery. These musicians long ago quit compromising, instead creating music that is austere, sincere, and honest. Kane Welch Kaplin isn&amp;#039;t meant for background listening; it&amp;#039;s made to be absorbed while reading the lyrics and concentrating on the passion, subtle talent, and earnest approach of an American collective that just keeps getting better.\n\n-=Amazon Product Description=-\n\nAs songwriters, performers, innovators and founders of the influential Dead Reckoning record label, Kieran Kane and Kevin Welch have made a career of letting the song lead the way. In the process, they midwifed a new genre of American roots music, blazing a trail for other artists to explore and develop. Yet their modus operandi remains the same: to craft and compose with no goal other than to let the song realize itself. In 2003 they joined forces with Fats Kaplin, the renowned multi-instrumentalist and &quot;this generation&amp;#039;s Ry Cooder&quot;, to create an Americana super group that makes music with roots parameters but in the spontaneity and vibe of a jazz recording. Joined this time around by Kieran&amp;#039;s son Lucas, Kane Welch Kaplin picks up where Lost John Dean left off featuring an entire album of roots music gems from the pens of the original Godfathers of Americana. The groove is tighter, the tunes sparser; they&amp;#039;ve gone from being a group of accomplished individuals to a solid soulful unit. Album cover art painted by Kieran Kane. \n\n____________________________________________________________________\n\nARTiST..[ Kevin Welch, Kieran Kane &amp; Fats Kaplin        \nTiTLE...[ Kane Welch Kaplin                             \nGENRE...[ Country                 GRABBER.[ EAC         \nLABEL...[ Dead Reckoning Rec.     ENCODER.[ Lame 3.97   \nYEAR....[ 2007                    QUALiTY.[ avg. 161kbps\nSOURCE..[ CDDA                    MODE....[ Joint-Stereo\nPLAYTIME[ 41:12 min               REL.DATE[ 12.23.2007  \nTRACKS..[ 12                      RiPPER..[ TEAM OMA    \nSiZE....[ 49,3 MB                 SUPPLiER[ TEAM OMA    \n\n____________________________________________________________________\n\nNR. TRACK.                                             TiME.\n____________________________________________________________________\n01  Ain&amp;#039;t Gonna Do It                                  03:49\n02  I Wish I Had That Mandolin                         04:14\n03  Red Light Blinking                                 02:58\n04  That&amp;#039;s What I&amp;#039;ve Got                               02:49\n05  Last Lost Highway                                  04:50\n06  Zagnut                                             01:10\n07  Callin&amp;#039; You                                        03:05\n08  Highland Mary                                      03:21\n09  Dark Boogie #7                                     03:14\n10  No One Told Me                                     04:07\n11  12 Chimes                                          03:11\n12  What Are They Doin&amp;#039; In Heaven Today                04:24\n                                                            \n                                               ????? \n                                              TOTAL: 41:12 \n____________________________________________________________________\n &lt;a href=&quot;\nhttp://www.deadreckoners.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.deadreckoners.com/&lt;/a&gt;       \nEnjoy and support the artists.\n","torrent":{"xt":"urn:btih:09f4d3f7a4f76cabb5a7a82d6600be64ae37bfa3","amp;dn":"Kevin+Welch%2C+Kieran+Kane+%26+Fats+Kaplin-Kane+Welch+Kaplin%282007-Co","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"09f4d3f7a4f76cabb5a7a82d6600be64ae37bfa3","infoHashBuffer":{"type":"Buffer","data":[9,244,211,247,164,247,108,171,181,167,168,45,102,0,190,100,174,55,191,163]},"announce":[],"urlList":[]}}