{"title":"The Kingdom (2007), DVD5, Dutch","uid":4123171,"size":4411512170,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0a1cf17fdce8d58e91498bf6943a4841e0ce8cec&amp;dn=The+Kingdom+%282007%29%2C+DVD5%2C+Dutch&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rolfpoland","files":10,"time":1207664956,"description":"Dutch:\n\nVerenigde Staten / Duitsland\nThriller / Drama\n110 minuten\n\ngeregisseerd door Peter Berg\nmet Jamie Foxx, Jennifer Garner en Chris Cooper\n\nRonald Fleuy (Foxx) leidt een anti-terrorisme eenheid die de verantwoordelijken van een bomaanslag op Amerikaanse burgers in het Midden Oosten moet opsporen. Eenmaal in het weinig toegankelijke woestijnland, proberen de Amerikanen een lokale politie-officier aan hun kant te krijgen om hun onderzoek te vergemakkelijken. Maar het onderzoek wordt gedwarsboomd door bureaucratie en tradities en de levens van Fleury en zijn manschappen staan op het spel.\n\nAudio: 5.1 ENG \nSubs : Nederlands\nMenu: ripped\nExtra: ripped\nSource : Retail\ncover zit erbij\n\n\n\n\nEnglish:\n\nWhen a terrorist bomb detonates inside a Western housing compound in Riyadh, Saudi Arabia, an international incident is ignited. While diplomats slowly debate equations of territorialism, FBI Special Agent Ronald Fleury quickly assembles an elite team and negotiates a secret five-day trip into Saudi Arabia to locate the madman behind the bombing. Upon landing in the desert kingdom, however, Fleury and his team discover Saudi authorities suspicious and unwelcoming of American interlopers into what they consider a local matter. Hamstrung by protocol-and with the clock ticking on their five days-the FBI agents find their expertise worthless without the trust of their Saudi counterparts, who want to locate the terrorist in their homeland on their own terms. Fleury&amp;#039;s crew finds a like-minded partner in Saudi Colonel Al-Ghazi, who helps them navigate royal politics and unlock the secrets of the crime scene and the workings of an extremist cell bent on further destruction. With these unlikely allies sharing a propulsive commitment to crack the case, the team is led to the killer&amp;#039;s front door in a blistering do-or-die confrontation. Now in a fight for their own lives, strangers united by one mission won&amp;#039;t stop until justice is found in The Kingdom\n\nAudio: 5.1 ENG \nSubs : DUTCH ONLY (on/off)\nMenu: ripped\nExtra: ripped\nSource : Retail \ncover included\n\n\nHave fun with this film, and don&amp;#039;t forget to seed after downloading!","torrent":{"xt":"urn:btih:0a1cf17fdce8d58e91498bf6943a4841e0ce8cec","amp;dn":"The+Kingdom+%282007%29%2C+DVD5%2C+Dutch","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0a1cf17fdce8d58e91498bf6943a4841e0ce8cec","infoHashBuffer":{"type":"Buffer","data":[10,28,241,127,220,232,213,142,145,73,139,246,148,58,72,65,224,206,140,236]},"announce":[],"urlList":[]}}