{"title":"Active Caption - Helps you organize your windows.","uid":4088098,"size":838890,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0b266364334ade8409a454a9a73a42a683f2705d&amp;dn=Active+Caption+-+Helps+you+organize+your+windows.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TravisLonghorn","files":1,"time":1205886500,"description":"Active caption is a great application that for some reason no one knows about, and there for i am going to try and release it to the world so that some one will purchase it and post a key or crack it. \n\nWhy is this program so awesome? Well, it is a small, simple application that runs in the background and gives you the following features:\n\n-right click on minimize to minimize to your task bar (or what ever it is called... the place were your clock is :P). This can be use full for organizing your windows.\n\n-right click on the X out button to nail the window in front of all other windows so when you move to another window, you can work on it while the nailed window is still above it. this can be useful for when you are using a keygen. Simply nail the key gen above all the windows, and you will then be able to easily enter in the key. This can also be used for when you are doing video tutorials and want to work in the application while the tut is going on with out the application going in fount of the tut. \n\n\nThere are many other features that this program has, but those 2, even though they are very simple, can be VERY useful. This trial will last you about 45 days i think it is, it works just like the full version and you will never be bothered with any &quot;please register&quot; windows. If you purchase the product, please post the key so the rest of us can enjoy it :). \n\nAlso, another thing i was wanting to ask here was, i am going to be getting back in to video tutorial posting. If any one has any digital tutors requests, please tell me what you are looking for. ","torrent":{"xt":"urn:btih:0b266364334ade8409a454a9a73a42a683f2705d","amp;dn":"Active+Caption+-+Helps+you+organize+your+windows.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b266364334ade8409a454a9a73a42a683f2705d","infoHashBuffer":{"type":"Buffer","data":[11,38,99,100,51,74,222,132,9,164,84,169,167,58,66,166,131,242,112,93]},"announce":[],"urlList":[]}}