{"title":"Meet The Spartans ","uid":4068118,"size":734633432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0b9ba048d82c8b5a0137a4139f75602ff45665d9&amp;dn=Meet+The+Spartans+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxThugxx","files":2,"time":1204906809,"description":"                            *******   *    *  *     *   *****\n                               *      *    *  *     *   *\n                               *      ******  *     *   *\n                               *      *    *  *     *   * ****\n                               *      *    *  *     *   *    *\n                               *      *    *  *******   ****** \n\n        \n                                  \n\n\n\n\nTiTLE : Meet The Spartans\n\nYEAR  : 2008\n\nGENRE : Comedy/Spoof\n\nRUNTIME : 1:05:10\n\nLANGUAGE : English\n\nSUBS : NONE\n\nViDEO FORMAT : AVI\t\t\n                    \n\n\nHollywood has churned out a slew of spoofs within the last year alone, \nincluding Epic Movie, Balls of Fury, The Comebacks, and Walk Hard: The Dewey Cox Story. \nNow, less than a month into 2008, we have Meet the Spartans -- a spoof of a movie, 300, that only opened last March. \nOne wonders if studios aren&amp;#039;t already developing spoofs of their forthcoming summer movies for release the following winter.\n\n\nMeet the Spartans tells the same story as 300, so much so that it dances perilously close to crossing the fine line between parody and plagiarism. \nTrue, 300 recounts a historical event, but as uniquely envisioned by Frank Miller in comic book form and then Zack Snyder on film. \nAs much as Walk Hard owed a lot to Walk the Line, it never lifted scenes and shots directly the way that Spartans does to 300.\n\nLike 300, Meet the Spartans chronicles the youth and training of Spartan king Leonidas (Sean Maguire), \nhis defense of his nation against the invading Persian army of Xerxes (Borat&amp;#039;s Ken Davitian), \nthe efforts by Leonidas&amp;#039; wife (called Queen Margo here, and played by Carmen Electra) to help rally political will for her husband&amp;#039;s cause, and the Spartans&amp;#039; bold last stand. Of course, \nit&amp;#039;s all turned on its head by writers-directors Jason Friedberg and Aaron Seltzer (the duo behind Epic Movie and Scary Movie). \nFor starters, this Leonidas only has 13 warriors rather than 300.\n\nMeet the Spartans is chock full of &quot;cameos&quot; by movie characters and pop culture icons, \nsuch as Shrek, Paris Hilton, Ghost Rider, the judges of American Idol, and Britney Spears. \n(Even Ain&amp;#039;t It Cool News honcho Harry Knowles gets a jab.) Besides 300, there are plenty of scenes satirizing other big Hollywood films, \nsuch as Casino Royale, Stomp the Yard, and Spider-Man 3. Reality shows and game shows are also parodied. \nSeeing as how Spartans is their seventh produced spoof, one wonders what stone is left to be turned by Friedberg and Seltzer.\n            ","torrent":{"xt":"urn:btih:0b9ba048d82c8b5a0137a4139f75602ff45665d9","amp;dn":"Meet+The+Spartans+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0b9ba048d82c8b5a0137a4139f75602ff45665d9","infoHashBuffer":{"type":"Buffer","data":[11,155,160,72,216,44,139,90,1,55,164,19,159,117,96,47,244,86,101,217]},"announce":[],"urlList":[]}}