{"title":"BBC Horizon New Star In Orbit XviD MP3","uid":4241619,"size":735809536,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0ba4b85048f1846c23e586ee97ae7dad7ed18d4d&amp;dn=BBC+Horizon+New+Star+In+Orbit+XviD+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":1,"time":1213571093,"description":"Horizon 1999 New Star In Orbit\n\n\n\nInformation\n\nNew Star in Orbit : The History of the International Space Station \n\nThursday, 11th March 1999 at 9.30pm The International Space Station was born from an age-old dream to send humans to the stars. During its development the reasons for its existence have constantly changed. Whatever the reasons, it is now over a decade behind schedule and billions of dollars over its budget. The questions on many people?s minds are whether the expenditure will ever be justified and whether it is worth sending humans into space at all\n\n\n\nReaching for the stars\n\nA space station would provide a unique platform from which to explore the universe. It could also house a live-in orbital laboratory for scientists to conduct experiments in a weightless environment. There were plenty of ideas for designs, the problem was how to keep humans alive over long periods of time in the unimaginably inhospitable conditions of space.\n\nThe Space Race \n\nIn 1984 the Russians announced their intention to create their own space station. The Americans rose to the challenge and NASA began to plan space station &quot;Freedom&quot;. A budget of $8 billion was agreed with a target of 1994 for the launch. By 1992 the $8 billion was spent on research and designs. There was no confirmed design, no hardware ready to launch and no working life support system. But the Russian space station MIR had already been functioning in orbit for six years.\n\nCollaboration with old enemies \n\nTwo years later Freedom was still on the drawing board. But the Russian space programme was also suffering. It was almost bankrupt. The White House approached the Russians with an alternative; if they combined their assets with they could build the International Space Station (ISS). The Russians could provide early modules including life support systems and construction could begin immediately. It was not that easy. US congressmen want American-built equipment, including the life-support systems needed to recycle air and water. The problem is their systems have never been tested in space.\n\n\n\nThe Weight of the Station\n\nEven when the hardware is ready, building the ISS will take 45 shuttle flights over five years. Almost a thousand hours of space walks will be required to bolt the ISS together. Each one will expose the crew to radiation and the constant risk of accidents. A pinhole tear in a space suit could result in instant death.\n\nDr Larry Delucas, Director of NASA Commercial Space Centre, at the University of Alabama has faith in the space station?s potential, &quot;The space station is just the beginning. It?s the stepping stone to allow us perhaps to take a trip to Mars, to build another space station around Mars.&quot; He also supports the existence of the space station as a platform for research into the structure of protein crystals, used to develop new drugs. &quot;Most drugs are developed using this technology here on earth, but space can help us accelerate the process.&quot;\n\nOther scientists have not found space conditions particularly beneficial for these experiments. Many do not believe there is any justification for the existence of the ISS or indeed for sending humans into space at all. There has long been an argument that robotic space exploration, which is cheaper, is more beneficial. Robert Park, of the American Physical Society, is one advocate. &quot;The space programme has brought enormous benefits to the world in terms of satellites...It has rewritten all of the textbooks on our solar system and now on the universe. All of that has come out of the unmanned space programme. It?s all robotic.&quot;\n\nBy the time the space station reaches completion, now set for 2005, its cost will have grown from $8 billion to almost $100 billion. Its operation will cost an extra $1.5 billion per year. It will be the most expensive object ever built in world history. \n\nTechnical Specs\n\nVideo Codec: XviD\nVideo Bitrate: 1833 kb/s\nVideo Resolution: 640x480 (1.33:1)\nVideo Aspect Ratio: 4:3\nAudio Codec: MP3\nAudio BitRate: 192 kb/s (96/ch) CBR 48000 Hz\nRunTime Per Part: 48m 17s\nPart Size: 701mb\nRipped by jvt40","torrent":{"xt":"urn:btih:0ba4b85048f1846c23e586ee97ae7dad7ed18d4d","amp;dn":"BBC+Horizon+New+Star+In+Orbit+XviD+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ba4b85048f1846c23e586ee97ae7dad7ed18d4d","infoHashBuffer":{"type":"Buffer","data":[11,164,184,80,72,241,132,108,35,229,134,238,151,174,125,173,126,209,141,77]},"announce":[],"urlList":[]}}