{"title":"Distorted Morality - noam chomsky documentary 2003 - .avi","uid":4074534,"size":405519360,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0c5804bff59bb3ad7062d5622873f7ea85a1ccf7&amp;dn=Distorted+Morality+-+noam+chomsky+documentary+2003+-+.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"spacey1","files":1,"time":1205234832,"description":"Documentary concerning the state of the us and it&amp;#039;s involvement in this current war.\n\nlength: 55 minutes\n\nformat: AVI\n\nok, a litte boring at first, but he makes some good points if you can pay attention long enough.  just a video of a speech of his, not a documentary.  no videos really.\n\nIMDB info: \n\nNoam Chomsky is that dry, factual, intellectual that you probably fell asleep listening to in your college classes. However, if you even begin to listen to what he is saying, you&amp;#039;ll suddenly become angry, scared or saddened and be drawn to listen further. Unless you&amp;#039;re thoroughly familiar with US foreign actions for the last 20 years you&amp;#039;ll wonder how he can possibly be telling the truth half the time. However with his constant encouragement to check sources and research exactly what he&amp;#039;s saying he&amp;#039;d have to be absolutely crazy to be lying about what he&amp;#039;s saying. The US hypocrisy toward terrorism becomes obvious and you are simply left wondering why the media isn&amp;#039;t reporting it... Now you&amp;#039;ll have to go watch another Chomsky film called Manufacturing Consent to understand why the media are so complacent in this hypocrisy. The media has only gotten worse since that film was made (1992), so may want to check out Orwell Rolls in His Grave for a more recent treatise of the media&amp;#039;s faults. If only half the people knew half the information Chomsky could impart to them in half an hour, the outrage would force a great positive change in the world.","torrent":{"xt":"urn:btih:0c5804bff59bb3ad7062d5622873f7ea85a1ccf7","amp;dn":"Distorted+Morality+-+noam+chomsky+documentary+2003+-+.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c5804bff59bb3ad7062d5622873f7ea85a1ccf7","infoHashBuffer":{"type":"Buffer","data":[12,88,4,191,245,155,179,173,112,98,213,98,40,115,247,234,133,161,204,247]},"announce":[],"urlList":[]}}