{"title":"Stargate Atlantis - Season 4 (complete)","uid":4074463,"size":7338696990,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0c5f5e410e5a6c9b947476ee9b0f1c1147840897&amp;dn=Stargate+Atlantis+-+Season+4+%28complete%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NeverRAR","files":-1,"time":1205230988,"description":"Ok, so I added the two last episodes that were missing from my previous compilation to make this a FULL SEASON 4 RELEASE. As I mentioned last time, these are all downloaded from various sources at ThePirateBay.\n\nThis time around however, I have personally watched all of episodes 1-19 and can confirm that they work perfectly for me in Windows Media Player. I have also skipped through some of them in Quicktime on my Mac so that shouldn&amp;#039;t be a problem either. However, as usual I recommend you getting VLC player just incase something won&amp;#039;t play.\nI did skip through the last episode a bit myself, but I&amp;#039;m not going to watch that until the release of 5x01 for obvious reasons.\n\nNo annoying episode-by-episode downloading and no frustrating unpacking of rar files! Woohoo!!\n\n\n/NeverRAR\n\n\n\n\n\n\nOriginal Message:\n&gt;Grabbed these from different tpb sources, hope they are all ok. Though as I&amp;#039;m writing this I HAVE NOT YET TESTED them.\n&gt;\n&gt;I put this together since there wasn&amp;#039;t any Atlantis compilation around at the time (well ok, I found one with eps 1-7 with lo seeds), and it really sucks having to download episode by episode and then dscover I have to unrar half of them to watch them! Me not having a rar application on this computer makes that even more of a bitch.\n&gt;\n&gt;Well, anyways, here you are. Thanks to the great me you wont have to go through that insanely boring process yourselves.\n&gt;\n&gt;/NeverRAR","torrent":{"xt":"urn:btih:0c5f5e410e5a6c9b947476ee9b0f1c1147840897","amp;dn":"Stargate+Atlantis+-+Season+4+%28complete%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c5f5e410e5a6c9b947476ee9b0f1c1147840897","infoHashBuffer":{"type":"Buffer","data":[12,95,94,65,14,90,108,155,148,116,118,238,155,15,28,17,71,132,8,151]},"announce":[],"urlList":[]}}