{"title":"ShadowSurfer v2.5","uid":4189493,"size":5264178,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:0c8a038072e584ef933d8bfd4ca55866942db956&amp;dn=ShadowSurfer+v2.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Javelot","files":2,"time":1210870847,"description":"\nShadowSurfer te permite proteger la integridad de tu sistema, brindÃƒÂ¡ndote la posibilidad de deshacer todos los cambios realizados al mismo mientras el programa estÃƒÂ© activo.\n\nEl programa coloca un icono en la bandeja de sistema desde el que puedes activarlo o desactivarlo fÃƒÂ¡cilmente; a partir del momento en que lo ejecutes, todos los cambios que se produzcan se podrÃƒÂ¡n deshacer y devolver el PC a su estado original, el que tenÃƒÂ­a antes de iniciar ShadowSurfer. Mientras estÃƒÂ¡ activado, cambia ademÃƒÂ¡s el fondo de pantalla y pone el del programa, para que recuerdes que al reiniciar se eliminarÃƒÂ¡n todos los cambios.\n\nEsta especie de protecciÃƒÂ³n se puede aplicar a todo el sistema o sÃƒÂ³lo las unidades que tengas seleccionadas, lo que incluye los programas instalados, historial de navegaciÃƒÂ³n, cookies, documentos que hayas guardado en el disco duro, incluso los mensajes de correo electrÃƒÂ³nico que hayas recibido.\n\nMuy ÃƒÂºtil para recuperar tu sistema en caso de problemas de virus o spyware, probar programas que luego se pueden descartar fÃƒÂ¡cilmente o dejarle el PC a un niÃƒÂ±o sin temor a sus posibles trastadas.\n","torrent":{"xt":"urn:btih:0c8a038072e584ef933d8bfd4ca55866942db956","amp;dn":"ShadowSurfer+v2.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0c8a038072e584ef933d8bfd4ca55866942db956","infoHashBuffer":{"type":"Buffer","data":[12,138,3,128,114,229,132,239,147,61,139,253,76,165,88,102,148,45,185,86]},"announce":[],"urlList":[]}}