{"title":"floating_gold_christopher_kemp.epub","uid":12821688,"size":3592353,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0cc7df5ed6eb0932a23e27216a40972766ac173b&amp;dn=floating_gold_christopher_kemp.epub&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zx82zx82","files":1,"time":1448296755,"description":"Floating Gold: The Search for Ambergris, the Most Elusive Natural Substance in the World by Christopher Kemp\r\nEnglish | 2012 | ISBN: 0732291917 , 0226430367 | ISBN-13: 9780732291914 , 9780226430362 | 320 pages | EPUB | 3,4 MB\r\n\r\nJournalist and biologist Christopher Kemp discovers, after reading an odd news report, a hidden world of money, intrigue and amazing wealth. A lump of something turns up on a beach in NZ, the lump so strange it may well have come from out of space. But its not a dead alien, its ambergris.\r\n\r\nAmbergris is a by-product of sperm whales, used for centuries as a perfume, medicine and aphrodisiac. It appears on beaches all over the world and depending on what state its in, can be mistaken for all manner of things. For those in the know, its an amazing source of wealth - ambergris trades for US$20 a gram, which is nearly as much as gold but its harder to find and it cannot be mined. Christopher Kemp travels from the shores of NZ, to the Smithsonian and New Nedford Whaling museum; he meets amateurs, professional hunters, scientists, elusive vendors who traffic ambergris, people who wont confess to have found any, and strangers denying what they are looking for. As he discovers more about ambergris origins, its uses present day and historic, the outrageous lengths people have gone to find it and the intriguing efforts people go to in order to keep what they know about ambergris a secret, the more his infectious obsession grows","torrent":{"xt":"urn:btih:0cc7df5ed6eb0932a23e27216a40972766ac173b","amp;dn":"floating_gold_christopher_kemp.epub","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0cc7df5ed6eb0932a23e27216a40972766ac173b","infoHashBuffer":{"type":"Buffer","data":[12,199,223,94,214,235,9,50,162,62,39,33,106,64,151,39,102,172,23,59]},"announce":[],"urlList":[]}}