{"title":"CTV_W-Five_Right_To_Know_01_03_2008[bn880].avi","uid":4063053,"size":458279150,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0df83023e9b2855d99e8ecab8e8865bbd99a445f&amp;dn=CTV_W-Five_Right_To_Know_01_03_2008%5Bbn880%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bastige","files":1,"time":1204677424,"description":"W-FIVE: Right to Know  43 Minute Documentary on Canada&amp;#039;s healtcare system\n-------------------------------------------------------------------------\n\nFri. Feb. 29 2008 11:13 AM ET\n\nW-FIVE\n\nIn March of 2007, sixty-three year old Mavis Hudson underwent gynecological surgery at one of Canada&amp;#039;s busiest hospitals -- Scarborough General.\n\nLike any patient facing a serious operation, Hudson hoped that her doctor was competent and that the procedure would progress safely and successfully.\n\nHudson&amp;#039;s gynecologist -- Dr. Richard Austin -- had operated on women at Scarborough General for decades. Nothing in the public record regarding his performance indicated a problem.\n\nBut the surgery to repair Hudson&amp;#039;s collapsed bladder did not go well. And Hudson has endured terrible pain ever since.\n\n&quot;At the time I just thought it was my body breaking down. I thought it was just my fault,&quot; Hudson told W-FIVE.\n\nWhat Mavis Hudson didn&amp;#039;t know was that at the time of her surgery, The Scarborough General Hospital and the Ontario College of Physicians and Surgeons were aware of concerns relating to Dr. Austin&amp;#039;s surgical and post-operative complications.\n\nAs early as 2004, Dr. Austin had been warned by the head of gynecology at The Scarborough General about unacceptable complication rates for laparoscopic hysterectomies -- they were 10 times the expected rate. And in 2006, the Scarborough General&amp;#039;s head of gynecology requested an independent review of Dr. Austin&amp;#039;s surgical practice.\n\nAs well, several formal complaints against Dr. Austin had been registered with the Ontario College of Physicians and Surgeons and in at least two cases, the College found that Dr. Austin failed to properly manage critically ill patients. In 2006, the Ontario College of Physicians and Surgeons authorized a full investigation into Dr. Austin.\n\nMavis Hudson had no idea about any of this because in Canada, the public cannot access doctors&amp;#039; performance records or information about complaints substantiated by Provincial Regulatory Colleges. In some provinces, the public can find out about complaints that result in formal disciplinary action - but less than 1% of cases fall within this category.\n\nEven though Dr. Austin&amp;#039;s practice was under scrutiny, he was still permitted to continue operating.\n\nIt wasn&amp;#039;t until Mavis Hudson turned on the television news several weeks after her operation that she discovered there had been problems with Dr. Austin. That&amp;#039;s when a group of Dr. Austin&amp;#039;s former patients began to make allegations about the obstetrician-gynecologist.\n\nAmong those women was Joan Jaikaran. In February, 2006, Jaikaran went to Scarborough General for day surgery to remove an ovarian cyst. She woke up to find her colon attached to a colostomy bag.\n\n&quot;They explained to me that I had a perforated bowel,&quot; Jaikaran said.\n\nAnd though cutting an organ can happen to the best of surgeons, other women have alleged that Dr. Austin perforated their bowels and bladders. But the allegations don&amp;#039;t stop there.\n\nThirty former patients of Dr. Austin appeared on W-FIVE -- most coming forward for the first time - to discuss the problems they say they experienced.\n\nMany of these women are trying to sue Dr. Austin. Their lawyer, Amani Oakley, is angry with a secretive medical system that allowed Dr. Austin to keep operating until July, 2007 - when his medical license was restricted to surgical assisting only.\n\nOakley told W-FIVE, &quot;You&amp;#039;re saying to him okay -- we&amp;#039;re going to give you an opportunity over the next, I don&amp;#039;t know how many years, and they gave him a number of years, to see if you can do better. And meantime, that opportunity is on unconscious women in an operating room.&quot;\n\nOne of Dr. Austin&amp;#039;s former patients added, &quot;I believe the nurses protected the doctor. I believe the anesthesiologist protected the doctor. They saw what went on in those surgical suites. Why were they not our advocates? Why were they for him?&quot;\n\nDr. Austin would not speak to W-FIVE or participate in an on-camera interview. His lawyer responded to a few questions in writing and confirmed that Dr. Austin continues to work at Scarborough General Hospital in accordance with his undertaking to restrict his practice to surgical assisting only.\n\nThe Scarborough General Hospital says that they took what they deemed to be appropriate steps in addressing concerns about Dr. Austin&amp;#039;s practice. But those steps didn&amp;#039;t go far enough or come early enough for Mavis Hudson, Joan Jaikaran or any of the other women who blame Dr. Austin for their physical and emotional injuries.\n\n    * Producer: Marleen Trotter\n    * Associate Producers: Chad Derrick, Patti-Ann Finlay ","torrent":{"xt":"urn:btih:0df83023e9b2855d99e8ecab8e8865bbd99a445f","amp;dn":"CTV_W-Five_Right_To_Know_01_03_2008%5Bbn880%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0df83023e9b2855d99e8ecab8e8865bbd99a445f","infoHashBuffer":{"type":"Buffer","data":[13,248,48,35,233,178,133,93,153,232,236,171,142,136,101,187,217,154,68,95]},"announce":[],"urlList":[]}}