{"title":"Indoctrinate U - ISO DVDr.","uid":4218409,"size":2581070750,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:0e0321d3ef3e937e54922fd7cf5c16e537a33163&amp;dn=Indoctrinate+U+-+ISO+DVDr.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"-k0ck3n-","files":53,"time":1212465531,"description":"                         ---- Indoctrinate U ----\n\nI did buy this copy so that you can watch it, If you like it - Buy it!\n- - - - You can do that at indoctrinate-u.com for only $12.99! - - - -\n\n-----------------------------------------------------------------------------------------------------\n\nJoin Others in your area by requesting a local screening\n\nIndoctrinate U is one of the most important documentaries of the year. But it might also be the most important documentary you aren&amp;#039;t able to see this year. We know there is a vast audience for this film. But commercial distributors -- the executives who decide what films go into theaters -- don&amp;#039;t. So unless we can prove to them that this audience exists -- that you want to see it, Indoctrinate U might not come to a theater near you.\n\nAll you have to do is sign up to see the film if it comes to your area\n\n-----------------------------------------------------------------------------------------------------\n\nEvery American student should watch this documentery!!!\n\n-----------------------------------------------------------------------------------------------------\n\nInside Indoctrinate U\n\nSpeech codes. Censorship. Enforced political conformity. Hostility to diversity of opinion. Sensitivity training. We usually associate such things with the worst excesses of fascism and communism, not with the American universities that nurtured the free speech movement. But American higher education bears a disturbing resemblance to the totalitarian societies that are anathema to our nation&amp;#039;s ideal of liberty. Evan Coyne Maloney&amp;#039;s documentary film, Indoctrinate U, reveals the breathtaking institutional intolerance you won&amp;#039;t read about in the glossy marketing brochures of Harvard, Berkeley, Michigan, Yale, and hundreds of other American colleges and universities.\n\n&quot;When we think of going to college, we think of intellectual freedom. We imagine four years of exploring ideas through energetic, ongoing, critical thinking and debate,&quot; Maloney said. &quot;But the reality is very far from the ideal. What most of us don&amp;#039;t know is that American college students check their First Amendment rights and individual freedom at the door.&quot;\n\nHailed by the New York Sun as one of &quot;America&amp;#039;s most promising&quot; documentary filmmakers, Maloney has assembled a scorching indictment of higher education in America today, one that should make students, parents, trustees, lawmakers, and concerned citizens sit up and take notice. The London Telegraph has called the long-awaited feature-length film &quot;as slick and incisive as anything by Michael Moore.&quot;\n\nMaloney spent two years traveling to campuses across the country, interviewing students, professors, and administrators to find out what life on campus is really like. Instead of the vibrant debate, intellectual diversity, and academic freedom we like to associate with universities, Maloney found violent protests at UC Santa Cruz and San Francisco State, persecution of student members of a conservative club at Cal Poly and the University of Tennessee, divisive racial and ethnic politics at the University of Michigan and Yale, doctrinaire teaching at Duke and Columbia, and much more.\n\nFar from functioning as bastions of serious thought and reasoned debate, Maloney found, campuses today operate as mental processing plants, doing more to tell students what to say and think than to teach them to think for themselves.\n\n&quot;Students are being robbed of their educations--to the tune of tens of thousands of dollars a year,&quot; Maloney said. &quot;As it currently stands, higher education in America is a lie perpetrated on young adults at parents&amp;#039; and taxpayers&amp;#039; expense.&quot;\n\nA production of On the Fence Films with the support of the Moving Picture Institute, Indoctrinate U is an explosive portrait of how colleges and universities across the country routinely compel students to check their First Amendment rights at the door. Hard-hitting and humorous, Indoctrinate U makes the campus culture wars--often treated as an abstract, hopelessly partisan battle of ideas--intensely personal and unforgettably human.\n\nAt once a warning and a wake-up call, Indoctrinate U is bound to stir up controversy and to spark essential debate. As such, it has the potential to force our campuses to make changes they have long denied they need to make.\n\n-----------------------------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:0e0321d3ef3e937e54922fd7cf5c16e537a33163","amp;dn":"Indoctrinate+U+-+ISO+DVDr.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e0321d3ef3e937e54922fd7cf5c16e537a33163","infoHashBuffer":{"type":"Buffer","data":[14,3,33,211,239,62,147,126,84,146,47,215,207,92,22,229,55,163,49,99]},"announce":[],"urlList":[]}}