{"title":"David Johansen- Live it Up 1982 - New York Dolls","uid":4171727,"size":303645949,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:0e56c6d1ea6ad39375e2543b3690121632d8bca2&amp;dn=David+Johansen-+Live+it+Up+1982+-+New+York+Dolls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"doctorbrian","files":11,"time":1209912743,"description":"David Johansen&amp;#039;s 1982 live album. Re-released on CD 4/2008.\nRipped as lossless WMA.\n\nI&amp;#039;ll put up his &amp;#039;79 &amp;#039;In Style&amp;#039; album.\n\nFrom All Music Guide...\nWhen David Johansen&amp;#039;s initial solo albums failed to click with the mainstream record-buying public, he turned to live performing with a vengeance; Johansen once described his career in the early &amp;#039;80s as &quot;traveling around the country in a Dodge RAM van with about six guys...(on) our typical day, we would get up, travel 400 miles, open for a heavy mental act in a hockey rink, get back in the van, travel 400 miles, sleep, get up and do the same thing again.&quot; Recorded in early 1982 as Johansen was touring in support of Here Comes the Night, Live It Up captures the sound of a well-oiled road band who&amp;#039;ve learned to work the crowd and give kids the guitar-fueled bombast they came for while trying to make room for a bit of their own personality in the process. Johansen&amp;#039;s vocal style is more of a fierce bellow than the more exacting studio work he was doing at the time, but he sounds as passionate and committed as one might hope for from a guy plugging his way through a two-night stand in Boston, and while the crowd sometimes sounds more familiar with the covers (such as &quot;Build Me Up Buttercup,&quot; &quot;Reach Out I&amp;#039;ll Be There,&quot; and a medley of Animals hits) than Johansen&amp;#039;s originals, he delivers cult favorites like &quot;Frenchette,&quot; &quot;Donna,&quot; &quot;Funky But Chic,&quot; and &quot;Personality Crisis&quot; like a champ. However, Johansen&amp;#039;s band is another matter; while they never sound less than professional and enthusiastic, the streetwise spunk of the early David Johansen Group has been replaced with faceless arena rock chops, especially David Nelson and Huw Gower&amp;#039;s lead guitars. Significantly, Live It Up earned Johansen the closest thing to a hit his solo career would produce when the Animals medley went into frequent rotation on MTV, but it&amp;#039;s worth noting that he began formulating his second career as Buster Poindexter not long after this.\n\nDFFD","torrent":{"xt":"urn:btih:0e56c6d1ea6ad39375e2543b3690121632d8bca2","amp;dn":"David+Johansen-+Live+it+Up+1982+-+New+York+Dolls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e56c6d1ea6ad39375e2543b3690121632d8bca2","infoHashBuffer":{"type":"Buffer","data":[14,86,198,209,234,106,211,147,117,226,84,59,54,144,18,22,50,216,188,162]},"announce":[],"urlList":[]}}