{"title":"Chronicle (2012) 720p BRRip x264 AAC AVALUNCH","uid":12741734,"size":1018668620,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:0e5cb78ad52c24513df40b44d660314063f3769c&amp;dn=Chronicle+%282012%29+720p+BRRip+x264+AAC+AVALUNCH&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"avalunch","files":5,"time":1447243924,"description":"DISCLAIMER: My seeding is currently slow and cuts off at times (especially this time of the day). Just PM me for any issues.\r\n\r\nChronicle (2012) 720p BRRip x264 AAC AVALUNCH\r\n\r\nimage\r\n\r\nSOURCE: Chronicle Extended 2012 BluR...MA 5 1 x264-beAst [MovietaM]\r\n\r\nSUBTITLES: Subtitles file is separated from MKV file.\r\n\r\nVIDEO:I chose to encode this at 720p since I wanted an alternative to YTS, and there's basically none that I could see. So I tried it myself.\r\n\r\nRELATIVELY GRAINY FILM (just like Dredd): At just 936MB, and considering its aspect ratio being close to 16:9, it's hardly surprising that the quality of the video overall might be considered poor by HQ BluRay standards. Again, forgive me for the parts that are most likely washed out; I also did this film more on for personal viewing, while doing some tinny-tiny improvements over the audio and video itself compared to some standard scene releasers that release within the sizes around or below 1GB for 720p (like YIFY/YTS - who has sadly been shutdown by the MPAA).\r\n\r\nI do not remember my exact settings with hqdn3d denoise, but I do remember that this is the first time I used it in a video (with -tune film in ffmpeg as usual, and preset -slow, etc.) Approximately it's around 0.5:0.5:1.7:1.7, just around the same the denoise in Dredd - I was afraid that raising it high enough would muck up the video too much, and since the video itself is already 'grainy' by default, I had no choice but not to overuse it. I just used it for the sake of making the file size a tad smaller (actually dunno if that truly works in size reduction; I'm just relying on a Handbrake tutorial testimony) - and afaik it seems fine, there's no real perceivable difference over notable total loss between the original and the encoded copy. What I mean is that there's no further quality loss from the video aside from the already lost quality of the encode by default (due to having a high CRF). And since the bitrate reduction is high enough, the grain will get washed away in some manner, so using a bit of denoise wouldn't harm it too much to affect how the film looks as it is supposed to be grainy.\r\n\r\nSTEREO COMPRESSED AUDIO: Far from perfect, but as far as I can hear, the stereo downmix for this film is OK, relying on Audacity's native compressor to do the job of evening up audio between loud and soft parts. At least there seems to be lesser time in raising the volume levels up or down (this is from my opinion; ultimately it's subjective so please PM me if there is a serious notable issue with my audio). DTS track was downmixed simply with ffmpeg's libdca encoder (did NOT discover or fully utilize eac3to with arcsoft at the time since I just didn't know). Sounds good enough to me personally for stereo; dunno for others.\r\n\r\nOLD MKVTOOLNIX VERSION? Well this is my upload of an earlier encode, so that's my main reason for using mkvtoolnix 6.9.1. But I will still use this version since it's the last version that did not implement statistics tags (which became native since 7.0.0). Yes, I can remove statistics tags in the options of mkvtoolnix, but one other thing that concerned me a bit was that ever since 7.0.0, even if statistics tags were removed, the MKV video files outputted always remained slightly bigger somewhat, instead of getting slightly smaller in the older versions (NOTE: I'm pretty sure there's ZERO loss in muxing just by copying the video/audio/subtitle streams, so why the change?). Also, MKV files that had been muxed from 7.0.0 onwards seem to have some more issues with older versions of VLC (in seeking, etc.) But maybe in the future, I'll try to change the mkvtoolnix versions.\r\n\r\nGeneral\r\nUnique ID : 185205718719520352066921427972900114883 (0x8B5552EEBD3096D38D1F2A8F6699D1C3)\r\nFormat : Matroska\r\nFormat version : Version 4 / Version 2\r\nFile size : 937 MiB\r\nDuration : 1h 29mn\r\nOverall bit rate : 1 461 Kbps\r\nMovie name : Chronicle (2012)\r\nEncoded date : UTC 2015-06-09 10:52:35\r\nWriting application : mkvmerge v6.9.1 ('Blue Panther') 64bit built on Apr 18 2014 18:23:38\r\nWriting library : libebml v1.3.0 + libmatroska v1.4.1\r\n\r\nVideo\r\nID : 1\r\nFormat : AVC\r\nFormat/Info : Advanced Video Codec\r\nFormat profile :   \r\nFormat settings, CABAC : Yes\r\nFormat settings, ReFrames : 4 frames\r\nCodec ID : V_MPEG4/ISO/AVC\r\nDuration : 1h 29mn\r\nWidth : 1 280 pixels\r\nHeight : 692 pixels\r\nDisplay aspect ratio : 1.85:1\r\nOriginal display aspect ratio : 1.85:1\r\nFrame rate mode : Constant\r\nFrame rate : 23.976 fps\r\nColor space : YUV\r\nChroma subsampling : 4:2:0\r\nBit depth : 8 bits\r\nScan type : Progressive\r\nWriting library : x264 core 146 r2538 121396c\r\nEncoding settings : cabac=1 / ref=4 / deblock=1:-1:-1 / analyse=0x3:0x133 / me=umh / subme=10 / psy=1 / psy_rd=1.00:0.15 / mixed_ref=1 / me_range=24 / chroma_me=1 / trellis=2 / 8x8dct=1 / cqm=0 / deadzone=21,11 / fast_pskip=1 / chroma_qp_offset=-3 / threads=3 / lookahead_threads=1 / sliced_threads=0 / nr=0 / decimate=1 / interlaced=0 / bluray_compat=0 / constrained_intra=0 / bframes=3 / b_pyramid=2 / b_adapt=2 / b_bias=0 / direct=3 / weightb=1 / open_gop=0 / weightp=2 / keyint=250 / keyint_min=23 / scenecut=40 / intra_refresh=0 / rc_lookahead=60 / rc=crf / mbtree=1 / crf=25.3 / qcomp=0.60 / qpmin=0 / qpmax=69 / qpstep=4 / ip_ratio=1.40 / aq=1:1.00\r\nLanguage : English\r\nDefault : Yes\r\nForced : No\r\n\r\nAudio\r\nID : 2\r\nFormat : AAC\r\nFormat/Info : Advanced Audio Codec\r\nFormat profile : LC\r\nCodec ID : A_AAC\r\nDuration : 1h 29mn\r\nChannel(s) : 2 channels\r\nChannel positions : Front: L R\r\nSampling rate : 48.0 KHz\r\nCompression mode : Lossy\r\nDelay relative to video : -83ms\r\nLanguage : English\r\nDefault : Yes\r\nForced : No\r\n\r\n\r\nHope you like my encode! PM me if you have issues! PM me also if you are going to downvote: at least give a reason why!!! Leaving me a downvote just for the sake of trolling is NOT the way to go!","torrent":{"xt":"urn:btih:0e5cb78ad52c24513df40b44d660314063f3769c","amp;dn":"Chronicle+%282012%29+720p+BRRip+x264+AAC+AVALUNCH","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0e5cb78ad52c24513df40b44d660314063f3769c","infoHashBuffer":{"type":"Buffer","data":[14,92,183,138,213,44,36,81,61,244,11,68,214,96,49,64,99,243,118,156]},"announce":[],"urlList":[]}}