{"title":"Anders de la Motte - Geim (Svensk Retail EPUB)","uid":12757767,"size":613827,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:0ee66aa0b07746dbfb3b82f02bfee328fe009724&amp;dn=Anders+de+la+Motte+-+Geim+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":null,"files":1,"time":1447471393,"description":"Författare: Anders de la Motte\r\n       Titel: Geim (Geimtrilogin #1)\r\nUtgivningsår: 2011\r\n       Språk: Svenska\r\n        ISBN: 9789186615345\r\n\r\nHenrik HP Pettersson är en småhustlare som skiter i det mesta. En dag kommer han över en mobiltelefon som märkligt nog verkar veta det mesta om honom, och via den blir han inbjuden till en fascinerande ny upplevelse. Ett Alternate Reality Game som utspelar sig mitt i den intet ont anande Svennevärlden. Efter att han klarat inträdesprovet erbjuds han en rad olika kittlande uppdrag som alla filmas för att senare visas upp på en rankinglista och bedömas av ett slutet nätcommunity. I takt med att spänningen, belöningarna och inte minst creden från fansen växer tar HP allt större risker och snart är han beredd att göra nästan vad som helst för att få fortsätta spela.\r\n\r\nPolisinspektör Rebecca Normén är HP:s totala motsats. Hon är anställd på Säpos livvaktsrotel och har järnkoll på sitt liv, ändå känner hon sig inte säker. Någon vet obehagligt mycket om hennes förflutna. Om sådant som ingen borde veta. Som till exempel att hon är en mördare... Är det någon som leker med henne?\r\n\r\nEfterhand som Spelet tränger sig allt djupare in i deras liv närmar sig HP:s och Rebeccas världar oundvikligen varandra. Men om verkligheten bara är ett Spel, vad är då egentligen på riktigt? Och är du verkligen säker på att du vill Spela?\r\n\r\nAnders de la Motte arbetar med säkerhetsfrågor och har tidigare varit polis i Stockholm. Geim är hans debut som författare, ytterligare två böcker är planerade","torrent":{"xt":"urn:btih:0ee66aa0b07746dbfb3b82f02bfee328fe009724","amp;dn":"Anders+de+la+Motte+-+Geim+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0ee66aa0b07746dbfb3b82f02bfee328fe009724","infoHashBuffer":{"type":"Buffer","data":[14,230,106,160,176,119,70,219,251,59,130,240,43,254,227,40,254,0,151,36]},"announce":[],"urlList":[]}}