{"title":"Dinosauranet 3of4 Little Das Hunt XviD AC3","uid":4237272,"size":734246912,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0f1b945b984402f745ed009a80a8e5837605ad4b&amp;dn=Dinosauranet+3of4+Little+Das+Hunt+XviD+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"circlensess","files":1,"time":1213362334,"description":"Dinosaur Planet, **Complete Series**\n\nInformation\nTake a dino&amp;#039;s-eye view of life in the prehistoric past as cutting-edge filming techniques and hard science combine to create four, unique narratives that illustrate the struggle to survive in the violent Cretaceous period ? from the dinosaurs&amp;#039; point of view. State-of-the-art computer-generated imagery ? created by infusing vivid realism into scientifically researched digital illustrations ? brings this primordial world to stunning life, offering viewers an unprecedented glimpse through the eyes of each dinosaur as it learns to hunt, dodge natural disasters and simply live to see another day in a world with hungry predators around every turn.\n\nWhite Tip&amp;#039;s Journey\nWhen White Tip, a female velociraptor, loses the rest of her pack, she must struggle to survive on her own. In time, she locates a new pack, as well as a mate, only to find that her hardships are just beginning in the harsh desert environment.\nSETTING: 70 million years ago in the Mongolian deserts of Asia\n\nPod&amp;#039;s Travels\nPod, a male pyroraptor, is alone in the world after his sisters die in a tidal wave that sweeps him out to sea. After landing on an island populated with dwarf-sized dinosaurs, Pod discovers that he&amp;#039;s become the apex predator. But, Pod learns it&amp;#039;s lonely at the top.\nSETTING: 70 million years ago in Europe, near present-day Romania.\n\nLittle Das&amp;#039; Hunt\nAs a young male daspletosaurus, it&amp;#039;s Das&amp;#039; job to herd unsuspecting prey towards the rest of the pack. But he&amp;#039;s easily distracted and ruins several hunts getting him in deep trouble with his mother, the pack leader. When a volcano threatens, the dinosaurs are unprepared.\nSETTING: 72 million years ago, near present-day Montana\n\nAlpha&amp;#039;s Egg\nThe world is a very dangerous place for tiny hatchlings like Alpha, a female saltasaur. Follow Alpha along the road of her growth years, from before her birth through asolescence and on to adulthood, as she learns how to survive and beat the odds.\nSETTING: 80 million years ago in the South American forests of Patagonia\n--------------------------------------------------------------------------------\n\n\n\nTechnical Specs\n\nVideo Codec: Xvid\nVideo Bitrate: 1568 kb/s\nVideo Resolution: 720x416\nVideo Framerate: 23.976\nAudio Codec: AC3\nAudio Bitrate: 448 kb/s \nAudio Channels: 6 ch CBR \nRuntime per Part: 48 minutes\nPart Size: 700 MB\n\n","torrent":{"xt":"urn:btih:0f1b945b984402f745ed009a80a8e5837605ad4b","amp;dn":"Dinosauranet+3of4+Little+Das+Hunt+XviD+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f1b945b984402f745ed009a80a8e5837605ad4b","infoHashBuffer":{"type":"Buffer","data":[15,27,148,91,152,68,2,247,69,237,0,154,128,168,229,131,118,5,173,75]},"announce":[],"urlList":[]}}