{"title":"Never Ashamed (Christian Movie)","uid":4240323,"size":367047563,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f66f8b43bb3bdc9fed173635fb5e7ec44514c9c&amp;dn=Never+Ashamed+%28Christian+Movie%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"IndianChristian","files":3,"time":1213501779,"description":"Never Ashamed (Christian Movie)\n\nAre you ashamed of our Lord Jesus Christ? Are you ashamed of disclosing yourself as a Christian to others? Then this is just the movie you need to watch. Jesus says, Everyone who shall confess Me before men, I will also confess him before My Father who is in heaven. But whoever shall deny Me before men, I will also deny him before My Father who is in heaven.(Matthew 10:32,33). Jesus Christ is the center, the foundation and the substance of our lives. He alone is the only hope of the world. \n\nYet the world really hates Jesus and everything that He stands for. Infact the most hated person in the last 2000 years has been Jesus Christ. During his lifetime itself Jesus Prophesized that the world will hate him and his followers (Christians). Heres the reason why:\nJohn 3:19-21 : This is the verdict: Light has come into the world, but men loved darkness instead of light because their deeds were evil. Everyone who does evil hates the light, and will not come into the light for fear that his deeds will be exposed. But whoever lives by the truth comes into the light, so that it may be seen plainly that what he has done has been done through God.\nJohn 15:19 : The world would love you if you belonged to it, but you dont. I chose you to come out of the world, and so it hates you.\n \nYes, the world hates Jesus Christ because the world loves to sin. And Jesus Christ did not give reasons to justify peoples sins. Rather He called on people to account for their sins and repent. And the world does not want to give up the pleasure of sin and come to repentance. Imagine a good man coming and teling you that you are a sinner in need of repentance. You wont like his message at all. Infact most people will abuse him for telling the truth about them. So is the case with Jesus Christ.\n\nThis film presents a real dilemma for any Christian teen. Tim, a senior in high school, becomes a Christian at a summer youth camp and now must face his old worldly friends, his atheistic parents plus fit in with his new lukewarm Christian friends. A solid movie and a very real situation for Christian witnessing. \n\nThis film is all about giving your all to Christ. This Film, released in 1984 is about a teenager who is arrested along with his best friend Marty after they steal an ice cream truck. Tims Parents(Dad Being a talk show host!)send him to a Christian Camp because they want to Shape up his behavior. With the warning Dont become a born again bible-banger, he is hustled off to camp. Keep in mind that his parents are not Christians.\n\nDespite the warning, He gives his life to Christ. He does the very thing his parents dont want. What do you expect from a kid when you send him to a Christian Camp? Truth is, he does a lot more than just Shape up his behavior. His whole life has changed!\n\nNow he has several new problems he have to deal with. Not the least, is his non Christian parents who want him to be the All American Boy, Isnt that what got him into trouble in the first place? Then, his best friend Marty who is running for class president-Party with Marty is his slogan. Since Tim no longer believed in what Marty Stood for, what to do? What do you now youre a Christian and Marty isnt? Then his lukewarm Christian friends do nothing but talk.\n\nAfter his initial failures to take a stand for his faith(like chickening out when he is asked to read his paper, The most important thing in the world to me out loud in class) He realizes that Jesus wanted a greater commitment from him.\n\nDespite the conflicts with his parents and Marty, Tim decides to Join a Bible study group at school and to show the love of Christ by helping others. It comes to the point when he have to put his life on the line.\n\nThe last 5 minutes is a Gem! I wont give it away, lets just say that it will warm your heart and be an encouragement to you!\n\nLanguage: English\nSubtitles: None\nRuntime: 64 Minutes\nMy Rating: 10/10\nQuality: 8/10\n\nIf financially possible, please buy the CD/DVD to keep Christian films in business ......\n\nPlease seed for as long as possible. Let others also come to know that there is Salvation only in the name of Jesus Christ.\n\nUploaded by Indian Christian\t\t","torrent":{"xt":"urn:btih:0f66f8b43bb3bdc9fed173635fb5e7ec44514c9c","amp;dn":"Never+Ashamed+%28Christian+Movie%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f66f8b43bb3bdc9fed173635fb5e7ec44514c9c","infoHashBuffer":{"type":"Buffer","data":[15,102,248,180,59,179,189,201,254,209,115,99,95,181,231,236,68,81,76,156]},"announce":[],"urlList":[]}}