{"title":"Our Sufferings in this Land","uid":4084380,"size":510771544,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:0f87d7d395fce38a4726178811743055e4fcf714&amp;dn=Our+Sufferings+in+this+Land&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"6079smithw","files":1,"time":1205719717,"description":"A film by Ed Hill.\n\nEye-witness documentary of a two-week visit to Palestine by a group of international peace activists in autumn 2005. As well as visiting Jerusalem and Bethlehem they stayed in rural towns working with the farmers harvesting their olives. The film aims to present a concise understanding of the history, politics and culture of Palestine.\n\nIt dramatically explains the construction of the Separation Wall, the checkpoints, the apartheid system of passes, separate road networks, the continual Israeli military oppression and creeping ethnic cleansing, together with the spirited culture and resistance of a brave people. Through interviews with farmers, teachers, activists, and ordinary people, woven together with the story of the trip, the film presents a view of Palestine as a case study which unlocks an understanding of world politics, the hypocrisy of governments, and the bias of our daily media. The film encourages anyone to visit Palestine and the conclusion is that we can&amp;#039;t rely on anyone else for solutions -- everyone has the power to make a difference.\n\nYou are free:\n\n    * to copy, distribute, display, and perform the work\n\nUnder the following conditions:\n\n    * Attribution. You must give the original author credit.\n    * Non-Commercial. You may not use this work for commercial purposes.\n    * No Derivative Works. You may not alter, transform, or build upon this work.\t","torrent":{"xt":"urn:btih:0f87d7d395fce38a4726178811743055e4fcf714","amp;dn":"Our+Sufferings+in+this+Land","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f87d7d395fce38a4726178811743055e4fcf714","infoHashBuffer":{"type":"Buffer","data":[15,135,215,211,149,252,227,138,71,38,23,136,17,116,48,85,228,252,247,20]},"announce":[],"urlList":[]}}