{"title":"Black PS2 ISO","uid":12753732,"size":1911456663,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:0f8cb2df3e7975ad8a0fc63e15a2609c87dafe4a&amp;dn=Black+PS2+ISO&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DuDoG","files":1,"time":1447419607,"description":"SINOPSE: Black é um jogo de tiro em primeira pessoa pouco focado nos tiroteios intensos ao invés da estratégia e ataques táticos. Apesar de não apresentar batalhas sangrentas e extremamente brutais, o título é apresentado sob uma perspectiva cinemática à la Hollywood. Contando com armas extremamente detalhadas e cenários altamente destrutíveis, o jogo traz uma nova proposta ao gênero. Você incorpora Jack Kellar, um sargento de primeira classe da CIA que apresenta um pequeno problema ao aceitar ordens. Um homem cuja identidade não é revelada leva Kellar, algemado, a uma sala de interrogatório, questionando-o sobre a operação terrorista chamada, Seventh Wave, a qual o sargento havia presenciado em uma missão há quatro anos. Kellar, então, narra sua história, que é sentida na pele pelo jogador.\r\n\r\nO game dispõe de um total de oito missões, sendo a primeira muito curta e que se apresenta praticamente como um mero tutorial sobre os comandos - servindo então, de um breve aquecimento para as sete longas seguintes. Os cenários são variados: florestas, cemitérios, fábricas e outros espaços transparecem uma excelente ambientação ao jogo que, com o apoio de um poderoso som e jogabilidade otimizada, torna Black um ícone dos tiros em primeira pessoa.\r\n\r\nMuito bom trazer um jogo que me fez delirar, tirando, god of war, colossus of shadow e black, não tinha muita coisa pra jogar, fiquei muito triste com o cancelamento de black 2, que pena, se alguém souber de uma noticia mais recente sobre o mesmo, deixe seu comentário, fique semeando, conto com a sua ajuda, torne-se uma semenete e de à mesma alegria que vc teve, ah jogo testado e funcionando, claro! paz galera!","torrent":{"xt":"urn:btih:0f8cb2df3e7975ad8a0fc63e15a2609c87dafe4a","amp;dn":"Black+PS2+ISO","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0f8cb2df3e7975ad8a0fc63e15a2609c87dafe4a","infoHashBuffer":{"type":"Buffer","data":[15,140,178,223,62,121,117,173,138,15,198,62,21,162,96,156,135,218,254,74]},"announce":[],"urlList":[]}}