{"title":"Terminator - The Sarah Connor Chronicles S01E04 - Heavy Metal.av","uid":4199171,"size":367788344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:0fe84c6c30c495e1936d1aa50a11fb5df25daaa9&amp;dn=Terminator+-+The+Sarah+Connor+Chronicles+S01E04+-+Heavy+Metal.av&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Chimera2005","files":1,"time":1211402992,"description":"Sarah, John, and Cameron pursue a mysterious shipment of coltan, a key metal needed to construct Terminators, meanwhile Cromartie obtains plastic surgery to create his new disguise.[1] Although the trio had thought they destroyed Cromartie in the pilot episode, Cameron reviews video footage of their arrival in 2007 and realizes that Cromartie&amp;#039;s severed metal skull followed them through time. She knows it would be able to reconnect with the body, and believes Cromartie had something to do with a shipment of refined coltan rerouted from Oakland to Los Angeles after an arson. Sarah proposes fleeing south across the border, but John insists on a more aggressive approach ? to hunt down Cromartie. To their surprise, the coltan shipment is not being handled by Cromartie but by a different Terminator, named Carter. Carter even manages several human employees (before murdering them), but has no other mission besides securing the coltan in a fallout shelter, where it will be available for Skynet after Judgment Day. The shelter will later become a factory for producing Terminators, including Cameron herself.\n\nThe plot-line of this episode generates tension between Sarah, who prefers a cautious approach, and John, who is willing to take risks to destroy the coltan stockpile. Paradoxically, Sarah&amp;#039;s efforts to protect John could make him too sheltered to lead humanity in the future.[2] Frustrated, John breaks away from her, risking his life in pursuit of the coltan. After John is locked in the fallout shelter with Carter, he discovers an idle Terminator will go into standby mode to save power, and he dares to remove a key from around Carter&amp;#039;s neck so he can open the door. With Cameron&amp;#039;s assistance they ultimately liberate the truckload of coltan from Carter, and Cameron drives it off a cliff into the ocean after locking Carter in the shelter.\n\nIt is later shown that Cameron kept a bar of coltan for herself. Meanwhile, as Cromartie rebuilds his identity he leaves a trail of bodies behind, piquing the interest of Agent Ellison. Ellison discerns that Cromartie has assumed the identity of an unemployed actor, George Lazlo, a client of the plastic surgeon. Cromartie kills Lazlo and takes over his identity.","torrent":{"xt":"urn:btih:0fe84c6c30c495e1936d1aa50a11fb5df25daaa9","amp;dn":"Terminator+-+The+Sarah+Connor+Chronicles+S01E04+-+Heavy+Metal.av","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"0fe84c6c30c495e1936d1aa50a11fb5df25daaa9","infoHashBuffer":{"type":"Buffer","data":[15,232,76,108,48,196,149,225,147,109,26,165,10,17,251,93,242,93,170,169]},"announce":[],"urlList":[]}}