{"title":"American Soldier - General Tommy Franks","uid":4196936,"size":111380012,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:102a41d36cbad543beeaa625271a2cc68550f45d&amp;dn=American+Soldier+-+General+Tommy+Franks&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":34,"time":1211281096,"description":"American Soldier - by Tommy R. Franks. Read by the Author\n\n\n &lt;a href=&quot;\nhttp://www.amazon.com/American-Soldier-LP-Tommy-Franks/dp/B000H2M8RY/ref=pd_bbs_1?ie=UTF8&amp;s=books&amp;qid=1211259836&amp;sr=1-1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/American-Soldier-LP-Tommy-Franks/dp/B000H2M8RY/ref=pd_bbs_1?ie=UTF8&amp;s=books&amp;qid=1211259836&amp;sr=1-1&lt;/a&gt;\n\nEditorial Reviews\nAmazon.com\n\nAs Commander in Chief of the United States Central Command from July 2000 through July 2003, Tommy Franks led the American and Coalition forces to victory in both Afghanistan and Iraq. Unsurprisingly, the portions of American Soldier covering these wars are the most interesting because they combine military maneuvers, political wrangling, and lots of action and commentary. This does not mean, however, that the rest of his autobiography is dull. General Franks&amp;#039;s writing is clear and engaging and his insider&amp;#039;s perspective is informative and interesting, particularly when he explains how the military moved into the 21st century by emphasizing speed, agility, and better cooperation among the various branches--a significant shift from the first Persian Gulf war just a decade earlier.\n \nIn addition to his years as a war general, his memoir also covers his childhood, his early years in the Army, his tours of Vietnam, and how he contemplated retirement before being called up as commander of Central Command, &quot;the most diverse, strategically vital?and unstable?region of the planet.&quot; Ever the diplomat, General Franks offers insights, but little criticism of individuals. Other than expressing admiration for his own staff and for President Bush and Defense Secretary Donald Rumsfeld in particular, he is tight-lipped about any conflict within the administration that may have occurred regarding policy issues. (The one exception is counterterrorism specialist Richard Clarke. &quot;I never received a single operational recommendation, or a single page of actionable intelligence, from Richard Clarke,&quot; he writes). He also writes that he was surprised by the absence of weapons of mass destruction in Iraq and that no WMDs were used against American troops. Still, the invasion of Iraq was justified in his eyes: &quot;While we may not have found actual WMD stockpiles, what the Coalition discovered was the equivalent of a disassembled pistol, lying on a table beside neatly arranged trays of bullets.&quot; American Soldier is a compelling look at the war on terrorism from one who served on the frontlines as both a warrior and a diplomat. --Shawn Carkonen --This text refers to the Hardcover edition. \n\nFrom The Washington Post&amp;#039;s Book World/washingtonpost.com\nThe Romans let victorious generals keep slaves and other spoils of war. The British showered them with noble titles and country estates. In free-market America, we&amp;#039;ve outsourced the job of rewarding our war heroes to the private sector, where they get cushy corporate board seats, lucrative speaking engagements and fat contracts for their memoirs.\n \nGen. Tommy Franks, who as head of U.S. Central Command presided over the wars in Afghanistan and Iraq, has duly produced the expected autobiography. It is a good read, thanks to the work of veteran ghostwriter Malcolm McConnell; the early sections on Franks&amp;#039;s blue-collar upbringing and Vietnam service are particularly affecting. But it has not made as much of a media splash as some other accounts of the administration, because it is not hostile to George W. Bush.\n \nTo the contrary, American Soldier rebuts some criticisms directed against the president. Bush has been accused, for instance, of taking his eye off Afghanistan by ordering the plan for a possible war with Iraq in the fall of 2001. Franks writes that, given the threat posed by Saddam Hussein, this was a sensible request, and that &quot;our mission in Afghanistan never suffered&quot; as a result.\n \nScores of pundits have accused the administration of lying, or at least distorting the evidence, about Iraq&amp;#039;s weapons of mass destruction. But Franks reveals that the leaders of Egypt and Jordan told him that Saddam Hussein had chemical and biological weapons. Though no weapon of mass destruction was ever found, he writes, &quot;I do not regret my role in disarming Iraq and removing its Baathist regime.&quot; \n\nAnother charge made against the administration is that political appointees failed to give the generals enough troops in either Afghanistan or Iraq. In fact, Franks writes, it was his own choice to employ limited forces in order to avoid getting bogged down. Instead of relying on sheer size, he thought surprise and speed were the keys to victory -- a judgment largely vindicated by events.\n \nIn general (so to speak), Franks is complimentary about his bosses. Vice President Dick Cheney is praised for asking questions that &quot;consistently cut to the core of the issue at hand.&quot; Bush comes across as a &quot;confident&quot; and &quot;decisive&quot; leader who refused to let politics intrude into his decision-making. When White House chief of staff Andrew Card brought up the issue of the 2002 elections as a factor in planning for war with Iraq, Bush reportedly snapped, &quot;That is no consideration at all . . . Timing will have nothing to do with congressional elections or polls.&quot; Franks did become exasperated at times with the &quot;genetically impatient&quot; Donald Rumsfeld, but ultimately decided that he and the defense secretary made an effective team.\n \nNot all is sweetness and light in American Soldier. Franks comes off as a bit tetchy. He complains in particular when the Joint Chiefs of Staff get involved in any operational issues that lie outside their jurisdiction. He accuses the chiefs of being focused only on their &quot;parochial&quot; service concerns, of leaking secrets to the press, wasting his time and offering &quot;gratuitous&quot; advice. In one extraordinary episode, he cusses out the Navy and Marine chiefs, Adm. Vern Clark and Gen. James Jones, in language that can&amp;#039;t be reprinted here.\n \nA particular target of his ire is Undersecretary of Defense Douglas Feith, whom he denounces as the &quot;dumbest [expletive] guy on the planet&quot; and &quot;a theorist whose ideas were often impractical,&quot; without offering any examples. He adds, however, that &quot;Rumsfeld never allowed Feith to interfere in my business.&quot; This -- along with the fact that Deputy Secretary of Defense Paul Wolfowitz barely rates a mention in this book -- should help dispel the popular myth that a cabal of neoconservatives led by Wolfowitz and Feith has been running the war on terrorism. Actually Franks was the one in operational control until July 2003, and he offers not a single instance where Rumsfeld, Feith or any other politico forced him to do anything he didn&amp;#039;t want to do.\n \nPerhaps they should have. American Soldier reveals numerous blind spots: Franks never discusses why he didn&amp;#039;t send more U.S. soldiers to cut off al Qaeda fighters escaping Tora Bora in December 2003 or Ba&amp;#039;athists fleeing to the Sunni Triangle in April 2004. Nor does he seriously ponder what more he could have done to foster a secure postwar environment in Iraq and Afghanistan. One of the &quot;impractical&quot; suggestions from Feith that he disregarded, we now know, was to rally Iraqis to assist in their country&amp;#039;s liberation. More than a year later, the United States continues to pay a heavy price for not having mobilized sufficient Iraqi security forces early on. \n\nReviewed by Max Boot \nCopyright 2004, The Washington Post Co. All Rights Reserved.\n\n","torrent":{"xt":"urn:btih:102a41d36cbad543beeaa625271a2cc68550f45d","amp;dn":"American+Soldier+-+General+Tommy+Franks","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"102a41d36cbad543beeaa625271a2cc68550f45d","infoHashBuffer":{"type":"Buffer","data":[16,42,65,211,108,186,213,67,190,234,166,37,39,26,44,198,133,80,244,93]},"announce":[],"urlList":[]}}