{"title":"Holocaust Rescuers - mp3 - Dr. Eva Fogelman - Conscience &amp; Coura","uid":4229655,"size":180735382,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:11d782f3e72410d614eae54bb45734190346fba6&amp;dn=Holocaust+Rescuers+-+mp3+-+Dr.+Eva+Fogelman+-+Conscience+%26+Coura&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RevolutionaryNonviolence","files":32,"time":1212980340,"description":"Conscience and Courage: Rescuers of Jews During the Holocaust (Paperback)\nby Eva Fogelman (Author) &quot;GERMAN INDUSTRIALIST Oskar Schindler was a womanizer, a manipulatory, and a seasoned briber...&quot;\n\nFrom Publishers Weekly\nSome sheltered one Jew for a night; others hid several Jews for years. Some performed a single spontaneous act of heroism, like the baker who saved the author&amp;#039;s father in Poland in 1942; others were part of an anonymous network. These brave people, along with the well-known rescuers Oskar Schindler and Raoul Wallenberg, had this in common: they were gentiles who risked their lives to save Jews from the Nazi regime. In her deeply affecting book, Fogelman recounts the stories of these Europeans --housewives, businessmen, telephone operators, farmers, diplomats, nurses--and tells how the state of Israel has honored them with the title &quot;Righteous Among the Nations.&quot; The author, a New York City social psychologist who directs the Jewish Foundation for Christian Rescuers, ponders deep questions: Why did these particular individuals become rescuers? Can moral integrity be taught and then applied? Is there such a thing as altruism? She explains that one of her reasons for writing the book was &quot;to give altruism back its good name.&quot; Her study of extraordinary instances of moral courage will appeal to a broad audience. Fogelman wrote and co-produced the PBS series Breaking the Silence: The Generations After the Holocaust.\nCopyright 1994 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.\n\nFrom School Library Journal\nYA-This is not just another Holocaust book. Instead of presenting a detailed factual account of what happened during the war, Fogelman explores the altruistic personalities of individuals who risked their lives and those of their families to help people considered to be enemies of the State. The stories of Oskar Schindler and Raoul Wallenberg are told along with those of lesser-known individuals such as Alexander Roslan and Louisa Steenstra, who went to extraordinary means to help Jews. The book is divided into three parts-&quot;The Rescuers,&quot; &quot;The Motivation,&quot; and &quot;Postwar.&quot; Each section, complete with personal accounts, forms a mosaic of courage and conviction on the part of both the rescuers and the rescued.\nRoberta Lisker, W.T. Woodson High School, Fairfax, VA\nCopyright 1994 Reed Business Information, Inc. --This text refers to an out of print or unavailable edition of this title.","torrent":{"xt":"urn:btih:11d782f3e72410d614eae54bb45734190346fba6","amp;dn":"Holocaust+Rescuers+-+mp3+-+Dr.+Eva+Fogelman+-+Conscience+%26+Coura","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"11d782f3e72410d614eae54bb45734190346fba6","infoHashBuffer":{"type":"Buffer","data":[17,215,130,243,231,36,16,214,20,234,229,75,180,87,52,25,3,70,251,166]},"announce":[],"urlList":[]}}