{"title":"Doctor Who - Genesis of the Daleks DVD (PAL) BBCDVD1813","uid":4183999,"size":9375201280,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:120610834ceda8d5be74fb37d4def88f1f07cba6&amp;dn=Doctor+Who+-+Genesis+of+the+Daleks+DVD+%28PAL%29+BBCDVD1813&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"BOB-ARCTOR","files":37,"time":1210562133,"description":"First Transmitted\n\n1 - 08/03/1975 17:30\n\n2 - 15/03/1975 17:30\n\n3 - 22/03/1975 17:30\n\n4 - 29/03/1975 17:30\n\n5 - 05/04/1975 17:30\n\n6 - 12/04/1975 17:30\n\n\nPlot\n\nThe Time Lords intercept the transmat beam taking the Doctor, Sarah and Harry back to Nerva and deposit them instead on the planet Skaro at an early point in its history. There a Time Lord gives the Doctor both a mission to prevent or alter the Daleks&amp;#039; development so that they become less of a threat to the universe and a time ring that will enable him and his companions to return to the TARDIS once this is done. \n\nSkaro is currently in the grip of a long war of attrition between its two humanoid powers, the Kaleds and the Thals. The Kaleds&amp;#039; chief scientist, Davros, has been experimenting to discover the final form into which his race will mutate - the weapons used in the war have already produced genetically scarred &amp;#039;mutos&amp;#039;, who have been consigned to the wastelands - and has devised a protective casing in which they can continue to survive. This is instantly recognised by the Doctor and Sarah as a Dalek. \n\nEscaping from the bunker where Davros and his Elite, led by the sadistic Nyder, are based, the Doctor and Harry persuade the Kaled leaders to put the Dalek experiments on hold. Davros retaliates by conspiring with the Thals to destroy the Kaled city with a rocket. He then activates the Daleks and orders them to wipe out the Thals. \n\nSome members of the Elite revolt, protesting at the genetic alterations that Davros has made to the Daleks, and they too are exterminated. The Daleks then seize control, killing the remainder of the Elite and ultimately Davros himself. Thal survivors detonate explosives at the entrance to the bunker, sealing the Daleks inside. \n\nHaving earlier passed up an opportunity to destroy the Dalek mutants at birth, the Doctor estimates that his intervention will have delayed their development by about a thousand years.","torrent":{"xt":"urn:btih:120610834ceda8d5be74fb37d4def88f1f07cba6","amp;dn":"Doctor+Who+-+Genesis+of+the+Daleks+DVD+%28PAL%29+BBCDVD1813","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"120610834ceda8d5be74fb37d4def88f1f07cba6","infoHashBuffer":{"type":"Buffer","data":[18,6,16,131,76,237,168,213,190,116,251,55,212,222,248,143,31,7,203,166]},"announce":[],"urlList":[]}}