{"title":"PC Tools Firewall Plus 3.0.1.9","uid":4088468,"size":6586528,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:12599e99bfea58863f9a1c376fc73b023aa45157&amp;dn=PC+Tools+Firewall+Plus+3.0.1.9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wonderboy52","files":1,"time":1205946912,"description":"PC Tools Firewall Plus 3.0.1.9 | 6,28 MB\n\nPC Tools Firewall Plus is a powerful free personal firewall for WindowsÃ‚Â® that protects your computer by preventing unauthorized users from gaining access to your computer through the Internet or a network. By monitoring applications that connect to the network Firewall Plus can stop Trojans, backdoors, keyloggers and other malware from damaging your computer and stealing your private information.\n \nPC Tools Firewall Plus is advanced technology designed especially for people, not just experts. Powerful prevention against attacks and known exploits is activated by default while experienced users can optionally create their own advanced packet filtering rules, including IPv6 support, to customize the network defenses. All you need to do is install it for immediate and automatic ongoing protection.\n\nThat&amp;#039;s how PC Tools Firewall Plus provides world-leading protection, backed by regular Smart Updates, real-time protection and comprehensive network shielding to ensure your PC remains safe and hacker free. PC Tools products are trusted and used by millions of people every day to protect their home and business computers against online threats.\n\nWe recommend you use PC Tools Firewall Plus in combination with Spyware Doctor for comprehensive system protection against spyware, adware and other threats.","torrent":{"xt":"urn:btih:12599e99bfea58863f9a1c376fc73b023aa45157","amp;dn":"PC+Tools+Firewall+Plus+3.0.1.9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"12599e99bfea58863f9a1c376fc73b023aa45157","infoHashBuffer":{"type":"Buffer","data":[18,89,158,153,191,234,88,134,63,154,28,55,111,199,59,2,58,164,81,87]},"announce":[],"urlList":[]}}