{"title":"Zone Stad Seizoen 7en8 HDTV NL By Jeffrey","uid":12826185,"size":12857201082,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:148a2f7cc7aed075011cababc700a596e7f9110a&amp;dn=Zone+Stad+Seizoen+7en8+HDTV+NL+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"gljeffrey45","files":26,"time":1448346973,"description":"ZoneStad Seizoen 7 HDTV NL Collected By Jeffrey\r\n\r\nIk neem ontslag'. Met deze schokkende mededeling sloot Tom Segers (Guy van Sande) het zesde seizoen van Zone Stad af. Toen Segers ontdekte dat hij diegene was die als kleine jongen de trekker overhaalde en zo zijn vader vermoordde, leek zijn carrière bij de politie van de zone stad hem niet langer opportuun.\r\n\r\nDe hoofdinspecteur had altijd al een rebels kantje, maar nu haalt zijn zelfdestructieve gedrag wel de bovenhand. Cocaïnestalen bevinden zich niet langer alleen in de bewijsenveloppes van Segers , maar ook in zijn broekzak voor eigen gebruik, terwijl de fles whisky nooit veraf is. En daar zit Inez Vermeulen (Sandrine Andre) voor iets tussen. Tom raakt meer en meer in de ban van deze bloedmooie advocate, die in het verleden de verdediging van Dimitri Alva op zich nam. Langzaam maar zeker dringt het tot Fien Bosvoorde (Lien van de Kelder) door dat Inez Vermeulen wel eens iets op haar kerfstok zou hebben en gaat op onderzoek uit. Inez heeft inderdaad een verborgen agenda. Tom heeft hier echter geen benul van. Tot Fien in grote moeilijkheden komt.\r\n\r\n\r\nAfleveringen:\r\n\r\nBlack Mambas\r\nToffe Pol\r\nMyosotis\r\nOld School\r\nGouden Hanschoen\r\nGame Over\r\nSmeergeld\r\nParkour\r\nBruiloftsklokken\r\nWiedergutmachung\r\nKermis\r\nSupervolle Maan (Deel 1)\r\nSupervolle Maan (Deel 2)\r\n\r\nNL Gesproken\r\nAVI\r\n\r\n\r\nZoneStad Seizoen 8 HDTV NL Collected By Jeffrey\r\n\r\nOp de begrafenis van Fien worden de collega’s van Zone Stad hard aangepakt door haar vader Jean-Yves Bosvoorde. Hij vindt dat ze Fien in de steek hebben gelaten.\r\n\r\nHoofdinspecteur Tom wordt kort na de uitvaartplechtigheid opgeroepen omdat iemand het leven liet bij een ontploffing. Wanneer Tom aankomt op de plaats van het onheil ontmoet hij er zijn nieuwe partner, Esther Mathijs. Tom lijkt op het eerste gezicht niet opgezet met de vervangster van Lien. In zijn ogen kan niemand Lien vervangen. Esther bewijst echter al heel snel dat ze op haar plaats zit bij de politie.\r\n\r\nLucas trekt richting psychiater Inge Daems, maar in haar praktijk treft hij haar vervangster Veerle Goderis aan. Hij kan niet langer leven met zijn leugens en vertelt de zielenknijper wat hij allemaal op zijn kerfstok heeft. Jimmy voelt instinctmatig aan dat er iets niet pluis is, maar dat is niet voldoende om ellende te voorkomen. Het comité P heeft ondertussen de kantoren van Zone Stad ingepalmd. Het hele korps wordt grondig doorgelicht en Wim Jacobs is vastberaden te achterhalen hoe het komt dat de situatie daar zo kon ontsporen. Er zal kost wat kost orde op zaken worden gesteld!\r\n\r\nKortom, Zone stad staat garant voor spanning, actie en intrige!\r\n\r\nAfleveringen:\r\n\r\nInsh'Allah\r\nFucking Clowns\r\nBaby Browning\r\nLove Boat\r\nSuicide Is Easy\r\nOnder Voorwendsel\r\nHartenjagen\r\nFinal Countdown\r\nOude Liefde\r\nBurgerwacht\r\nVerrijzenis\r\nGezichtsbedrog I\r\nGezichtsbedrog II\r\n\r\nNL Gesproken\r\nAVI","torrent":{"xt":"urn:btih:148a2f7cc7aed075011cababc700a596e7f9110a","amp;dn":"Zone+Stad+Seizoen+7en8+HDTV+NL+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"148a2f7cc7aed075011cababc700a596e7f9110a","infoHashBuffer":{"type":"Buffer","data":[20,138,47,124,199,174,208,117,1,28,171,171,199,0,165,150,231,249,17,10]},"announce":[],"urlList":[]}}