{"title":"Death of European Nations","uid":12758207,"size":32243073,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:14d5d5314841e1abc103e0e5f8be9ccc9988e0b0&amp;dn=Death+of+European+Nations&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"murrikaa","files":1,"time":1447484219,"description":"VIRAL: The Most Powerful 19-Minute Video On The Internet Proves We're Approaching 'The End':\r\n\r\nFor those who think that the 'refugee crisis' is anything less than the complete and total overthrow of Europe, I suggest that you watch the video below. It's truly one of the most powerful and eloquently done videos I've ever seen on this ongoing crisis, you can quickly see why it has gone viral, and we quickly see why the continent we once knew as Europe is now dead.\r\n\r\n\r\n\r\n\r\n\r\nWith Open Gates: The forced collective suicide of European nations \r\n\r\nDoing Death of Nations (on youtube) a solid since Youtube blocked his video after 1million+ views (4 days later!). Fuck the elite who do not want us to see what they've done to us. Stop being a bunch of pussies and push the fuck back people. It's us vs them, and they are winning. (The UN, the media, the schools, the political elite, social media owners, social justice warriors and of course, the muslim hoards given the green light to invade and cause havoc in our countries). \r\n\r\nAs per Death of Nations instructions, download and share.\r\n\r\n&quot;Published on Nov 9, 2015\r\n\r\nThis video will not be online long, download and mirror it while you can.\r\nI gain nothing from this. Editing takes a lot of work and time, if you want to support me, you can do it with (link removed. Go to his youtubeto retrieve it. Sorry for the dick move bro. On the upside you could be seeing an influx of people hit your channel on YT and they may choose to donate. Plus, YT might reconsider (HA!) their bullshit 'copyright' stance when they see you reeling in lots of people that make them money. However, you are most likely better off setting up a Liveleak account, you'll do better when it comes to subject matters like this)\r\n\r\n“A nation can survive its fools, and even the ambitious. But it cannot survive treason from within. An enemy at the gates is less formidable, for he is known and carries his banner openly.&quot;\r\n\r\n- Marcus Tullius Cicero, 106-43 BC\r\n\r\nYou are witnessing what will be shown to future generations as the reason for the fall of an Empire.\r\n\r\nAt current immigration levels and disappearing birth rates native Europeans are destined to become a minority in their own countries within decades. This is already the case for many of Europe's largest cities.\r\n\r\nEuropeans have effectively lost their right to exist as cultures and nations in their own homelands and are facing extinction.\r\n\r\nMillions of young Muslim men leave behind their family, pay thousands to criminal traffickers to reach the land they have been promised by European politicians illegally.\r\n\r\nDubbed by the media as &quot;refugees&quot;, they cross through 6-10 safe countries to reach wealthy nations like Germany or Sweden where they hope to receive a better life at the expense of the taxpayer.\r\n\r\nOnly a fraction of them are Syrian, as they enter unfiltered, without any documents and without any legitimate right to claim asylum. Women and children are rarely seen, except in the cherry-picked sob stories of the media.\r\n\r\nAny indigenous resistance of Europeans who refuse to hand over the countries of their ancestors to often radical and criminal Muslim foreigners is labeled &quot;hateful&quot;, &quot;racist&quot;, even &quot;Nazi&quot;.\r\n\r\nThe level of cultural, moral and political subversion with egalitarian and Marxist ideologies has reached levels the KGB would never have dreamed of. Equality and tolerance are lies that serve none but a few.\r\n\r\nThe Left, mainly orchestrated by Zionist interests, is destroying our countries from the inside. Patriotism, the most basic and fundamental trait of any nation that wants to survive, has become something to be ashamed of.\r\n\r\nFeminism has destroyed family values and birth rates. Healthy nationalism has been replaced with a culture of guilt, self-hatred, apathy, degeneracy and pathological altruism. We are told to embrace &quot;diversity&quot;, in reality this simply means instead of just being a global minority, Europeans are supposed to become a minority in their own countries as well. No civilized society can keep up with the birth rate of third world immigrants, especially when the main goal is integration rather than assimilation. Parallel societies breed poverty, crime and radicalism.\r\n\r\nMulticulturalism has never, at any time in human history, worked anywhere. If you believe otherwise, you're delusional. In fact it's the primary reason for every major conflict.\r\n\r\nThe crimes committed by the EU against the European peoples are directly in violation of the 1948 UN genocide convention, Article II: (c) Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part; (d) Imposing measures intended to prevent births within the group; (e) Forcibly transferring children of the group to another group.\r\n\r\nBecause of this injustice, far-right parties everywhere in Europe are gaining astonishing amounts of support, becoming the biggest parties in some countries.\r\n\r\nAny European that does not rise up to defend his country from foreign invasion because he's too scared of words does not deserve it.\r\n\r\nWe are still at a point where you will not get imprisoned for your political opinion in most European countries, but this will change very soon. Do not be apathetic, do not be weak. Be someone that can be proud to call himself European.&quot;\r\n\r\nNever share this kind of shit on Youtube, you are only begging to have it removed since it goes against the narrative they are trying to push. Youtube, Google,are your enemy in this. Stop using those mediums.\r\nRead more at http://www.liveleak.com/view?i=be2_1447429620#iukCHvzZICQbdIdZ.99","torrent":{"xt":"urn:btih:14d5d5314841e1abc103e0e5f8be9ccc9988e0b0","amp;dn":"Death+of+European+Nations","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14d5d5314841e1abc103e0e5f8be9ccc9988e0b0","infoHashBuffer":{"type":"Buffer","data":[20,213,213,49,72,65,225,171,193,3,224,229,248,190,156,204,153,136,224,176]},"announce":[],"urlList":[]}}