{"title":"GroupCalender  WoW Addon","uid":4083857,"size":1003906,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:14e456d2d8bbd46fafaec6b68a60d12f36540b68&amp;dn=GroupCalender++WoW+Addon&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Dexterium","files":1,"time":1205696465,"description":"Group Calendar 4 is now in beta testing and should be done within a few weeks. I&amp;#039;m very pleased so far with this release as it addresses many longstanding bugs and features which GC has been sorely needing for a while now. If you decide to help test then wonderful, but keep in mind a few important points:\n\n    * You must exit WoW completely to upgrade to the 4.0 alpha/beta. Upgrading using only a reloadui will cause you pain and misery.\n    * You WILL experience bugs, maybe even some bad ones. I promise you will. If for some reason you don&amp;#039;t experience bugs, then perhaps I have grossly underestimated my abilities. But you&amp;#039;ll find bugs, don&amp;#039;t worry.\n    * GC4 and GC3 will not talk to each other\n    * Events created under GC4 will show up for GC3 users once you downgrade back to GC3\n    * The databases are compatible and you can freely switch between GC3 and GC4 during the alpha/beta phase\n    * When discussing GC4 features here in the Comments, please make it clear that you are referring to the alpha/beta version to avoid confusing regular users and to avoid confusing me as well\n    * Do not file bug reports or crash logs in the Comments section as they take too much space. I&amp;#039;ve enabled the ticket mechanism for Group Calendar here on Curse, please file tickets to report bugs and crash logs.\n","torrent":{"xt":"urn:btih:14e456d2d8bbd46fafaec6b68a60d12f36540b68","amp;dn":"GroupCalender++WoW+Addon","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14e456d2d8bbd46fafaec6b68a60d12f36540b68","infoHashBuffer":{"type":"Buffer","data":[20,228,86,210,216,187,212,111,175,174,198,182,138,96,209,47,54,84,11,104]},"announce":[],"urlList":[]}}