{"title":"I Am Legend[1964]DvDrip[Eng]-SiRiUs","uid":4123240,"size":733034608,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:14f50655d37fb72520412250f1862ee40850c1f6&amp;dn=I+Am+Legend%5B1964%5DDvDrip%5BEng%5D-SiRiUs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"circlensess","files":3,"time":1207667239,"description":"This is the 1964 version with Vincent Price &quot;The Last Man on Earth (1964)&quot; \n\n\nDr. Robert Morgan (Vincent Price) is the only survivor of a devastating world-wide plague due to a mysterious immunity he acquired to the bacterium while working in Central America years ago. He is all alone now...or so it seems. As night falls, plague victims begin to leave their graves, part of a hellish undead army that&amp;#039;&amp;#039;s thirsting for blood...his!\n\nVincent Price ... Dr. Robert Morgan\nFranca Bettoia ... Ruth Collins\nEmma Danieli ... Virginia Morgan\nGiacomo Rossi-Stuart ... Ben Cortman\nUmberto Raho ... Dr. Mercer\nChristi Courtland ... Kathy Morgan\nAntonio Corevi ... Governor (as Tony Corevi)\nEttore Ribotta ... TV Reporter (as Hector Ribotta)\n\nDirector: Ubaldo Ragona / Sidney Salkow (uncredited in Italian prints)\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0058700/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0058700/&lt;/a&gt;\n\nXvid / MP3 \n\nI never read Richard Matheson&amp;#039;s novel &amp;#039;I am Legend&amp;#039; but I&amp;#039;m particularly intrigued by (science fiction) movies with an apocalyptic theme. And this adaptation simply is one of the most fascinating stories of an already brilliant decade for this type of films. Much more than a grim horror film, this is a gripping drama with an excellent (as always) Vincent Price as the sole and devastated survivor of a deadly plague that exterminated the entire human race, including his own wife and daughter. Price is Dr. Robert Morgan and due to his immunity to the lethal germs, he&amp;#039;s the only one to fight victims who return in the shape of vampire/zombie-like creatures. Even though it has already been 3 years, Morgan desperately continues his search for other survivors?This is one of the most impressive performances Price ever gave away, and a lot more difficult than his usual roles of villains and madmen. Judging by today&amp;#039;s standards, I guess the film looks very dated and you can&amp;#039;t really refer to the tame &amp;#039;vamp-zombies&amp;#039; as threatening anymore. But the empty streets and depressing cities, shot in unsettling black and white, still are the ultimate in eeriness! I love it when a film makes you feel miserable and worried?and the lower the budget is, the more efficient this effect is reached!\n\nLike several of my fellow-reviewers already pointed out, this also was an immensely influential film. You can&amp;#039;t watch &amp;#039;Last man on Earth&amp;#039; without being reminded of George A. Romero&amp;#039;s milestone genre film &amp;#039;Night of the Living Dead&amp;#039;. If you then realize this movie was made 4 years before Romero&amp;#039;s classic, you can&amp;#039;t but reckon the underrated brilliance of this film. The same hopelessness-aspect that made Romero&amp;#039;s film so tense features HERE first, in &amp;#039;Last Man on Earth&amp;#039;! This production offers an ideal proportion of frights and sentiments, luckily without too many tedious scientific speeches or faked drama. &amp;#039;Last Man on Earth&amp;#039; has to be seen by every SF/horror fan on this planet. For some reason this is one of the most underrated genre efforts ever, and that urgently has to change.\n\nThe Last Man on Earth is a great film to watch alone.\n\n# This film was originally going to be produced by Hammer Films of Great Britain. They decided not to make it and passed the script over to their U.S. associate, Robert L. Lippert, who produced the film in Italy.","torrent":{"xt":"urn:btih:14f50655d37fb72520412250f1862ee40850c1f6","amp;dn":"I+Am+Legend%5B1964%5DDvDrip%5BEng%5D-SiRiUs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"14f50655d37fb72520412250f1862ee40850c1f6","infoHashBuffer":{"type":"Buffer","data":[20,245,6,85,211,127,183,37,32,65,34,80,241,134,46,228,8,80,193,246]},"announce":[],"urlList":[]}}