{"title":"Recycled Life - Documentary 2006","uid":4074042,"size":679587562,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:157e0fd82c2ab47852d6970b80fe72c705617640&amp;dn=Recycled+Life+-+Documentary+2006&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"idkidd","files":1,"time":1205199977,"description":"Purchase the dvd (which includes a soundtrack cd and many extras) at www.recycledlifedoc.com\n\n\nFor more than 60 years, the Guatemala City Garbage Dump has been home to the &quot;guajeros&quot; who recycle the city&amp;#039;s trash. Raising their families in the most toxic area in all of Central America, the guajeros were shunned by society and ignored by the government until January 2005 - when a devastating event changed the face of the landfill forever. Narrated by Edward James Olmos, the OscarÂ®-nominated CINEMAX Reel Life documentary RECYCLED LIFE tells their compelling story.\n\n&quot;Though these people are living and working in unspeakable and wretched conditions, their integrity and honor shine brighter than many people in first-world cultures and wealthier nations,&quot; says director Leslie Iwerks. &quot;Their reality raises profound questions about third-world governments and the ongoing cycle of poverty.&quot;\n\nThe guajeros first came to the Guatemala City Garbage Dump when 40 years of civil war caused coffee prices to drop, prompting a mass departure of farmers from the countryside. Many of these unskilled workers were unable to find food or shelter and ended up living and working in the dump, where they searched the city&amp;#039;s trash for items that could be reused or sold for recycling.\n\nToday, the guajeros reduce Guatemala&amp;#039;s waste by one million pounds per day. Despite the conditions, they feel a sense of pride and dignity in their work. Generations have eked out a living at the dump, but few people are even aware of how desolate their existence is.\n\n&quot;Humanity can shine brightly in situations where you least expect it,&quot; says producer Mike Glad. &quot;These people are not poor because they are unintelligent, unmotivated or uncaring. Often family ties, commitment and inner peace can excel in these difficult environments.&quot;\n\nLeslie Iwerks is a third-generation filmmaker from a two-time OscarÂ®-winning family; her other credits include the documentary &quot;The Hand Behind the Mouse: The Ub Iwerks Story.&quot; Mike Glad has spent more than 35 years traveling in third-world countries photographing the lives of indigenous peoples. Iwerks and Glad first partnered in 2000 to produce &quot;The Spirit of the Maya,&quot; about modern Mayan culture.\n\nRECYCLED LIFE is directed by Leslie Iwerks; producer, Mike Glad; narrator, Edward James Olmos; written by Mike Glad &amp; Leslie Iwerks; cinematographer and editor, Leslie Iwerks; still photographer, Mike Glad; music, Mader. For CINEMAX Reel Life: senior producer, Nancy Abraham; executive producer, Sheila Nevins.","torrent":{"xt":"urn:btih:157e0fd82c2ab47852d6970b80fe72c705617640","amp;dn":"Recycled+Life+-+Documentary+2006","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"157e0fd82c2ab47852d6970b80fe72c705617640","infoHashBuffer":{"type":"Buffer","data":[21,126,15,216,44,42,180,120,82,214,151,11,128,254,114,199,5,97,118,64]},"announce":[],"urlList":[]}}