{"title":"Anthrax - Among The Living (1987) [EAC-FLAC]","uid":4187821,"size":360612525,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:16110a06bce695c4ce1a666118dc8c806694e6b1&amp;dn=Anthrax+-+Among+The+Living+%281987%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sworduigi","files":8,"time":1210778110,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD\nArtwork: Front, Back, Inside and CD (Web Found).\n\nGeneral Info:\n\nTracklist:\n\n   1. &quot;Among the Living&quot; (Joey Belladonna, Dan Spitz, Scott Ian, Frank Bello, Charlie Benante) ? 5:16\n   2. &quot;Caught in a Mosh&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 4:59\n   3. &quot;I Am the Law&quot; (Belladonna, Spitz, Ian, Danny Lilker, Bello, Benante) ? 5:57\n   4. &quot;Efilnikufesin (N.F.L.)&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 4:54\n   5. &quot;A Skeleton in the Closet&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 5:32\n   6. &quot;Indians&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 5:40\n   7. &quot;One World&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 5:56\n   8. &quot;A.D.I./Horror of It All&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 7:49\n   9. &quot;Imitation of Life&quot; (Belladonna, Spitz, Ian, Lilker, Bello, Benante) ? 4:22\n\n              LINE UP:\n\n    * Joey Belladonna ? Vocals\n    * Dan Spitz ?Lead Guitar, Acoustic Guitar on A.D.I\n    * Scott Ian ? Rhythm Guitar\n    * Frank Bello ? Bass Guitar\n    * Charlie Benante ? Drums\n\nReview taken from ivingformetal.com:\nAmong the Living was the third full length release by the New York thrash metal band Anthrax. From the first time my friend let me listen to this album, I have listened to it non-stop and have loved it more and more every time. You know how you listen to a CD, and the more and more you listen to it until you reach a point where it just gets boring? Well I have listened through this CD more than 75 times, and it?s just as amazing as when I first heard it.\nThe CD is 50 minutes of amazing music, and as always, Joey Belladonna delivers on the vocals. There are nine tracks on this CD and I will review all 9: Among the Living, Caught in a Mosh, I Am The Law, Efilnikufesin(N.F.L), and Skeletons in the Closet, Indians, One World, A.D.I / Horror Of It All, and Imitation of Life\nAmong The Living: Named after the title of the CD, starts off slow and speeds up to a point where it?s not too fast but fairly fast. Great song, with a memorable chorus ?I am the walking dude / I can see all of the world / Twist your mind with fear / I?m the man with the power / Among the Living / Follow me or die.? Excellent drumming and guitar. If anyone has ever read Stephen King&amp;#039;s The Stand, this song is based on Randall Flagg, the walkin dude, who clearly stands out &quot;Among The Living&quot;. Follow him or die.\nCaught in a Mosh: Starts off with guitar chords, followed by a fairly wicked bass line. After about 10 seconds the drums come in with a nice beat that?s fairly basic yet gets the point across. The bass in this song delivers as it is fairly cool throughout. The song is a metaphor about life and how it is metaphorically caught in the twirls and violence of a mosh pit.\nI Am The Law: Starts off with a guitar riff and gradually adds drums. This song is just outstanding, with how the vocals and the band meld together. Also a heavy chorus that can?t go wrong.\nEfilnikufesin (N.F.L): I named myself after this song because it is my absolute favorite. This song has many memories tied to it, and the fact that this song is a standard in my car, that me and my friends sing. Another heavy chorus that is just amazing. Upon asking what my friend thinks, he agrees that the instrumentation is very clean and together, and that?s its ?tight?\nSkeleton in the Closet: starts out with a grinding riff, then adds a blast beat and like all other songs, it?s very well put together and has am excellent chorus.\nIndians: This Anthrax song delves into the tragedies of racism and how we like to interfere in other fights that are rather useless, but on the important fights we do nothing about. One of the most influential songs, it has excellent drum beats, and half way through it slows down and comes back with a nice head banging beat.\nOne World: Starts out heavy and fast with a constant drum beat, adding bass. An excellent song with pretty much the same riffs throughout the whole song, it changes up about halfway through for the chorus and returns. This song discusses how we are one world and there should be no war.\nA.D.I. / Horror of It All: The longest song on the album at 7:49. Starts off with acoustic guitars. Comes in heavy, almost sound like I Am The Law. Has some really cool drumming near the end, and is pretty much awesome.\nImitation of Life: The final song on the CD, and I believe it is a good choice. Pretty much throughout the song there are basic Anthrax riffs. At the end of the song, the back up vocalist yells ?Imitation of Life!? and then the song goes into a head banging riff for about 20 seconds, getting quieter as it goes.\nJoey Belladonna delivers on this CD, and in my opinion is one of the best singers for any band in this genre. This CD is as I said already one of my favorites and definitely deserves a 10 / 10.\nI believe you can pick up this CD for around 10$ here in Canada, and I picked it up for about that and it is my favorite CD. I highly recommend it to anyone who likes thrash metal.","torrent":{"xt":"urn:btih:16110a06bce695c4ce1a666118dc8c806694e6b1","amp;dn":"Anthrax+-+Among+The+Living+%281987%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"16110a06bce695c4ce1a666118dc8c806694e6b1","infoHashBuffer":{"type":"Buffer","data":[22,17,10,6,188,230,149,196,206,26,102,97,24,220,140,128,102,148,230,177]},"announce":[],"urlList":[]}}