{"title":"King Sisters - Imagination (1958) new link","uid":4192068,"size":58720653,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:162594c9c30616dabc4938311af2a083d732c76e&amp;dn=King+Sisters+-+Imagination+%281958%29+new+link&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mingy2","files":13,"time":1211020359,"description":"One of the big-band era&amp;#039;s most popular and enduring vocal groups, the King Sisters -- Donna, Yvonne, Luise and Alyce -- were born and raised in Salt Lake City, UT. Taking their stage name from their father, vocal trainer Daddy King Driggs, the siblings initially teamed with their mother and a family friend as the Six King Sisters, first attracting attention while appearing with the Horace Heidt Band in 1935 and enjoying a three-year tenure on Heidt&amp;#039;s radio series. The group&amp;#039;s lineup shrank to a quartet as the decade wore on, and in 1939 -- following a stint with Al Pearce -- the King Sisters joined a new band formed by Luise&amp;#039;s husband, the legendary guitarist Alvino Rey. In addition to appearing on Rey&amp;#039;s hits &quot;Nighty Night&quot; and &quot;I Said No,&quot; the sisters also scored a series of smashes issued under their own name, among them &quot;The Hut Sut Song,&quot; &quot;I Understand,&quot; &quot;I&amp;#039;ll Get By&quot; and &quot;In the Mood.&quot; \n\nAt the peak of their success, the King Sisters also appeared in a number of Hollywood features, including 1942&amp;#039;s Sing Your Worries Away, 1944&amp;#039;s Meet the People and 1945&amp;#039;s Cuban Pete. By this time they were no longer working with Rey, who had dissolved his band upon entering the armed forces; throughout 1944 the siblings were regulars on Kay Kyser&amp;#039;s radio series, but during the postwar years their popularity declined, and throughout the 1950s they were well outside the public eye. In 1965, however, the King Sisters -- as well as members of their extended family, including Rey -- were tapped by the ABC television network to host their own weekly variety show; it was an immediate hit, although the death of featured performer Daddy King Driggs just a few weeks into the program&amp;#039;s run made their success bittersweet. The King Family Show continued its run until 1969, with the sisters easing into retirement \n\n\nImagination\n01. Deep Purple \n02. What&amp;#039;s New \n03. That Old Feeling \n04. Early Autumn \n05. Take The &amp;#039;A&amp;#039; Train \n06. You&amp;#039;re My Thrill \n07. Imagination \n08. Four Brothers\n09. Don&amp;#039;t Take Your Love From Me \n10. Sweet And Slow \n11. The Thrill Was New Listen 12. Easy To Love","torrent":{"xt":"urn:btih:162594c9c30616dabc4938311af2a083d732c76e","amp;dn":"King+Sisters+-+Imagination+%281958%29+new+link","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"162594c9c30616dabc4938311af2a083d732c76e","infoHashBuffer":{"type":"Buffer","data":[22,37,148,201,195,6,22,218,188,73,56,49,26,242,160,131,215,50,199,110]},"announce":[],"urlList":[]}}