{"title":"Adele - 25 (2015) (MP3)","uid":12838421,"size":117787119,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:164963e7226745993fa5161c465c2b973c045bdb&amp;dn=Adele+-+25+%282015%29+%28MP3%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nicolaslrobert","files":12,"time":1448480774,"description":"25 is the third studio album recorded by English singer and songwriter Adele. It was released on 20 November 2015, through XL Recordings. Following the release and international success of her second studio album 21 (2011), Adele considered quitting the music industry and going out on a positive note. However, Adele decided to take a hiatus instead and raise her son. During her sabbatical, she suffered from writer's block and rescheduled studio sessions for a new album, fearing she had lost her ability to write songs. In 2013, Adele had a breakthrough and the material that eventually became 25 manifested, with writing and recording continuing through 2015.\r\n\r\nTitled as a reflection of her life and frame of mind at 25 years old, 25 is a &quot;make-up record&quot;. The album's lyrical content features themes of Adele yearning for her old self, her nostalgia, and melancholy about the passage of time as well as themes of motherhood and regret. In contrast to Adele's previous work, the production of 25 incorporated the use of electronic elements and creative rhythmic patterns, with elements of 1980's R&amp;B and organs. Like 21, Adele collaborated with producer and songwriter Paul Epworth and Ryan Tedder, along with new collaborations with Max Martin and Shellback, Greg Kurstin, Danger Mouse, the Smeezingtons, and Tobias Jesso Jr.\r\n\r\nThe lead single, &quot;Hello&quot;, was a critical and commercial success, topping the charts in 28 countries including the United Kingdom and the United States, where &quot;Hello&quot; became the first single ever to sell one million downloads in a release week","torrent":{"xt":"urn:btih:164963e7226745993fa5161c465c2b973c045bdb","amp;dn":"Adele+-+25+%282015%29+%28MP3%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"164963e7226745993fa5161c465c2b973c045bdb","infoHashBuffer":{"type":"Buffer","data":[22,73,99,231,34,103,69,153,63,165,22,28,70,92,43,151,60,4,91,219]},"announce":[],"urlList":[]}}