{"title":"30 Days Of Night","uid":4240695,"size":734062592,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1794a4a710ad819e18cba0146ef0608a8c71e164&amp;dn=30+Days+Of+Night&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"kartman9929","files":1,"time":1213528833,"description":"This is the story of an isolated Alaskan town that is plunged into darkness for a month each year when the sun sinks below the horizon. As the last rays of light fade, the town is attacked by a bloodthirsty gang of vampires bent on an uninterrupted orgy of destruction. Only the small town&amp;#039;s husband-and-wife Sheriff team stand between the survivors and certain destruction.  Written by Risin&amp;#039; Outlaw\n\nIn Barrow, Alaska, seventy percent of the population of five hundred and some dwellers travels on the day of the last sunset, since the town will stay along the next thirty days without sun light. Sheriff Eben Oleson and Deputy Billy Kitka find many cell phones burned on the road. Then they receive a phone call from the local creator telling that his dogs have been slaughtered; later Eben finds the operator of the cell tower decapitated. He arrests a troublemaker drifter and the stranger frightens him telling that &quot;they are coming and the locals will be dead&quot;. Sooner Eben discovers that the town is under siege and attacked by a gang of bloodthirsty vampires, and together with a few survivors, they hide in a empty cellar expecting for the next sunrise. Written by Claudio Carvalho, Rio de Janeiro, Brazil ","torrent":{"xt":"urn:btih:1794a4a710ad819e18cba0146ef0608a8c71e164","amp;dn":"30+Days+Of+Night","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1794a4a710ad819e18cba0146ef0608a8c71e164","infoHashBuffer":{"type":"Buffer","data":[23,148,164,167,16,173,129,158,24,203,160,20,110,240,96,138,140,113,225,100]},"announce":[],"urlList":[]}}