{"title":"BBC The Truth About Killer Dinosaurs 2of2 XviD AC3","uid":4235377,"size":782532608,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:179c6ff2ed1c890674c86b5eb4459fd9702d3d42&amp;dn=BBC+The+Truth+About+Killer+Dinosaurs+2of2+XviD+AC3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":1,"time":1213280823,"description":"BBC - The Truth about Killer Dinosaurs \n\n\n\nIn this innovative series, Bill Oddie takes great joy in comparing dinosaurs with their closest living relatives - crocodiles and birds. He joins forces with a team of experts to scientifically analyse fossilised dinosaur bones and tracks.\nUsing scientific evidence, Bill constructs life-sized, bio-mechanical replicas of the dinosaurs&amp;#039; weaponry. Then he tests them and dramatically demonstrates their awesome potential. The findings from all these investigations are fed into the computer graphics to produce the most accurate portrayal of dinosaurs to date.\n\nProgramme 1\n\n\n\nTyrannosaurus rex versus Triceratops has to be the greatest heavyweight fight in history. In one corner - T. rex - a six-ton powerhouse of muscle and teeth and the most famous killer the world has ever known. Its jaws were packed with over 50 teeth, each up to a foot long, and powerful enough to crush a car.\nIn the opposite corner - Triceratops - an armoured and enormous opponent, equivalent to an elephant-sized rhino wearing a spiked helmet.\nA dramatic face-off such as this has long been imagined by artists and filmmakers, but until now it has been based on pure fantasy. In this programme, Bill Oddie employs some surprising and powerful techniques to unlock the truth, and he reveals extraordinary new fossil proof of a real-life conflict between these two monsters.\nTo illustrate the destructive capabilities of the dinosaurs, Bill constructs life-sized, bio-mechanical replicas of a T. rex head, built from solid steel, and a Triceratops skull, complete with three horns. Then he puts them on trial in the most detailed analysis ever attempted.\n\nProgramme 2\n\n\n\nVelociraptor could be described as the scariest dinosaur in the world. Armed with huge disembowelling claws, as sharp as steak knives, it guts its prey with a single sweep of its powerful legs. At least, that&amp;#039;s what seems to happen in Steven Spielberg&amp;#039;s movies. But what are the facts?\nContinuing his quest to find out the truth, Bill Oddie tracks down the real raptor to find out if it had feathers. Not only did the two-legged flesh-eater look more like a bird than a lizard, but Velociraptor nailed its victims with a far deadlier strike than a slash to the stomach.\nNext Bill introduces a tank-like Ankylosaur, a dinosaur with the ultimate defences. With its armour-plated skin and vicious bone-crushing club, the stupidest dinosaur of all time might have been more than a match for a fleet-footed Velociraptor.\nComparisons with living animals such as alligators and hawks provide Bill with clues as to how these two dinosaurs used their weaponry. Using this information, he constructs accurate working models of a Velociraptor leg, complete with its killer claw, as well as an Ankylosaur&amp;#039;s fearsome tail club. And then he puts them to the test. The results dramatically demonstrate the devastating power of the dinosaurs and lead Bill Oddie to The Truth About Killer Dinosaurs.\n\nRelated Documentaries\nWalking with Dinosaurs\nWalking with Monsters\nWalking with Beasts\nDinosaur Planet\nTechnical Specs\n\nAVI File Details\n\n====\nName.........:\nFilesize.....: 746 MB (or 764,094 KB or 782,432,256 bytes)\nRuntime......: 00:58:56 (88,401 fr)\nVideo Codec..: XviD\nVideo Bitrate: 1574 kb/s\nAudio Codec..: ac3 (0x2000) Dolby Laboratories, Inc\nAudio Bitrate: 192 kb/s (96/ch, stereo) CBR \nFrame Size...: 704x400 (1.76:1) [~7:4]\n\n\n\n &lt;a href=&quot;\nhttp://docuwiki.net/index.php?title=The_Truth_about_Killer_Dinosaurs&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://docuwiki.net/index.php?title=The_Truth_about_Killer_Dinosaurs&lt;/a&gt;","torrent":{"xt":"urn:btih:179c6ff2ed1c890674c86b5eb4459fd9702d3d42","amp;dn":"BBC+The+Truth+About+Killer+Dinosaurs+2of2+XviD+AC3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"179c6ff2ed1c890674c86b5eb4459fd9702d3d42","infoHashBuffer":{"type":"Buffer","data":[23,156,111,242,237,28,137,6,116,200,107,94,180,69,159,217,112,45,61,66]},"announce":[],"urlList":[]}}