{"title":"Future Sound Of London (FSOL) - Dead Cities (1996) (FLAC-EAC-CUE","uid":4206192,"size":423566202,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:187546a7e26b39aa89ff696f7a89c355e9fc8da8&amp;dn=Future+Sound+Of+London+%28FSOL%29+-+Dead+Cities+%281996%29+%28FLAC-EAC-CUE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigsimon","files":23,"time":1211817242,"description":"Music : Electro / Techno : Lossless\n\n\n\n\n\n\n\nFuture Sound Of London (FSOL) - Dead Cities (1996) (FLAC-EAC-CUE)\n\n\n\n\n\n\n\nFuture Sound Of London Biography by allmusic.com.\n\n\n\nBiography by Sean Cooper\n\nFirst recognized as the dance duo behind the club hits &quot;Stakker&quot; (as Humanoid) and &quot;Papua New Guinea,&quot; Future Sound of London later became one of the most acclaimed and respected international experimental ambient groups, incorporating elements of techno, classical, jazz, hip-hop, electro, industrial, and dub into expansive, sample-heavy tracks, often exquisitely produced and usually without easy precursor.\n\nNotoriously enigmatic and often disdainful of the press, the group&amp;#039;s Garry Cobain and Brian Dougans worked their future-is-now aesthetic into a variety of different fields, including film and video, 2- and 3-D computer graphics and animation, the Internet, radio broadcast, and, of course, recorded music. Although they usually disdain their earlier work as play-for-pay club fare not representative of their later musical vision, many of the thematic concerns of their earlier 12&quot;s and their first, heavily dance-oriented LP, Accelerator, followed them into their later work. Usually filed under ambient, that work is often much more than that, drawing from the history of experimental electronic music with a relentlessness that has helped to push the calmer elements of that genre&amp;#039;s reputation into decidedly more difficult directions.\n\nThe pair also grew in repute as remixers, obliterating tracks by Curve, Jon Anderson, David Sylvian and Robert Fripp, and Apollo 440, and rebuilding pieces of almost majestic complexity with the remnants. The duo&amp;#039;s works of the mid- to late &amp;#039;90s -- Lifeforms, ISDN, and Dead Cities -- were important stopping points on the road of rabid hybridization characteristic of post-rave European experimental electronica (ambient, jungle, trip-hop, ambient dub, etc.), and the pair&amp;#039;s somewhat punk rock attitude (despite their success) did much to underscore the scene&amp;#039;s underground roots. After a lengthy hiatus marked by rumors of mental illness and a cottage lifestyle, Cobain and Dougans returned in 2002 with The Isness, a record heavily influenced by &amp;#039;60s and &amp;#039;70s psychedelia.\n\n\n\n\n\n\nCD Pressings Information\n\n\n\nLabel: Virgin\nCatalog#: CDV 2814, 7243 8 42068 2 6\nFormat: CD, Album\nCountry: Europe\nReleased: 1996\nGenre: Electronic\nStyle: Leftfield, IDM, Downtempo, Experimental, Ambient\n\n\n\nCredits\n\n\nEngineer - Yage\nProducer, Written-By - Future Sound Of London\n\n\n\nNotes\n\n\nRecorded at Earthbeat Studios, London &amp;#039;96.\nPublished by Sony Music Publishing.\nIn jewel case.\n\nBarcode: 7 24384 20682 6\nCatalogue number:\n7243 8 42068 2 6\nUK: CDV2814\nF: PM 502\nLC3098 Bel/BIEM\nPrinted in Holland. Made in Holland.\n\n\n\n\n\n\nDead Cities album review from allmusic.com\n\n\n\n\nReview by Ned Raggett\n\n\nDead Cities turned out to be the Future Sound of London&amp;#039;s bow out from the spotlight -- at least, nothing further was released by them for the rest of the decade and well into the next one. Compared to the crisp approach of Accelerator and Lifeforms&amp;#039; disorienting, surprising exploration into ambient sound, Dead Cities finds the group trying out something new yet again. The theme of the album, thoroughly explored in the art (as always, created by the group itself), seems to be one of futuristic urban decay, almost as if reacting against the perceived otherwordliness of Lifeforms, calmer moments like the acoustic guitar shimmer of &quot;Her Face Forms in Summertime&quot; aside. Hints of cyberpunk fetishism and atmospheres are everywhere, combined with a generally darker sound track for track and more upfront beats on a number of songs. &quot;My Kingdom,&quot; a spooky choice for the initial single, blends in low-pitched drones with the echoing shuffle of the main rhythm, suggesting a Japanese city set somewhere in the outback after all the world&amp;#039;s power finally ran out. As a further touch, the overall Blade Runner feeling of Dead Cities is heightened even more via the sampling of Mary Hopkin&amp;#039;s haunting, wordless vocals from that film&amp;#039;s soundtrack. The collage approach that has served the band well over the years recurs time and again -- snippets from unreleased spoken word performances and reworked orchestrations float up and down in the mix, feeling like an unusual sonic tour. That said, two of the strongest moments on Dead Cities -- the amazing single &quot;We Have Explosive&quot; and its semi-remix &quot;Herd Killing,&quot; which starts the album -- come from the same source, namely Run-DMC. The brutal guitar stab and accompanying wah-wah and shout, which define both tracks, come from the Tougher Than Leather album, here reshuffled into a brusque, memorable punch with a killer, buzzing bassline.\n\n\n\n\n\n\n\n\n\nTrack List\n\n\n\n\nFuture Sound Of London (FSOL) - Dead Cities (1996)\n\n01. Herd killing 02:37\n02. Dead Cities 06:37\n03. Her Face Forms In Summertime 05:38\n04. We Have Explosive 06:19\n05. Everyone in the World Is Doing Something Without Me 04:10\n06. My Kingdom * 05:47\n07. Antique Toy 02:48\n08. Quagmire 05:43\n09. In a State of Permanent Abyss 06:57\n10. Glass 05:38\n11. Yage 07:32\n12. Vit Drowning 05:32\n13. Through Your Gills I Breathe - First Death In The Family 04:45\n\n\n\n\n\n\n\nSpecial Note\n\n\n* = &quot;My Kingdom&quot; (Track 6) contains a sample from &quot;Rachel&amp;#039;s Song&quot; which features on the\nVangelis 1994 Blade Runner Soundtrack (Track 4).\n\n\n\n\n\n\n\n\n\n\n\nENJOY ..........................................................................\n\n\n\n","torrent":{"xt":"urn:btih:187546a7e26b39aa89ff696f7a89c355e9fc8da8","amp;dn":"Future+Sound+Of+London+%28FSOL%29+-+Dead+Cities+%281996%29+%28FLAC-EAC-CUE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"187546a7e26b39aa89ff696f7a89c355e9fc8da8","infoHashBuffer":{"type":"Buffer","data":[24,117,70,167,226,107,57,170,137,255,105,111,122,137,195,85,233,252,141,168]},"announce":[],"urlList":[]}}