{"title":"Public Blue (Japanese Squatters)","uid":4198688,"size":731837660,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:1884db7b1ba99bd39dd645440e5a72ba19ab3949&amp;dn=Public+Blue+%28Japanese+Squatters%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"adversesolutions","files":1,"time":1211381545,"description":"(Please go to http://onebigtorrent.org/torrents/3384/Public-Blue--Kansai-Kouen-Japanese-squatters for screenshots etc.)\n\n&quot;Public Blue&quot; is a documentary and ongoing project dedicated to inform and connect concerned people with the struggle of the No-juku-sha (park squatters and/or rough sleepers) for living in human dignity in Osaka and all over Japan. We believe that Public Blue can help people approach this issue as well as provide the chance to connect and show solidarity with the No-juku-sha, their proud and interesting way of life, actions and resistance. We hope that &quot;Public Blue&quot; can serve as an instrument for articulation and reflection on the inside and outside of public space, day labor, precarity and the struggle of the No-juku-sha.\nEverywhere in parks and on the river banks of Osaka rivers, one sees blue tents or barracks covered with blue plastic tarps, at times scattered throughout park areas, sometimes lined up in rows, or united to form small communities. The term homelessness only insufficiently describes the situation of these &quot;nojyukusha&quot;, the campers in the rough. These squatters are the daily inhabitants of public space. But just as Japanese society has traditionally little known nor appreciated public space as a public forum, likewise are squatters and homeless people, who live in these spaces, disrespected.\n\nThe video essay Public Blue was produced in collaboration with Nojyukusha and supporters in Osaka. Public Blue follows their political action and sketches impressions of the Japanese understanding of the public and the political. Used now as a tool during the struggle against evictions of tents in Osaka, the documentary also becomes a vehicle of articulation for those who are living on the outside of Japanese society.\n\nwww.kansaikouen.org\n\n\n\nTechnical Specs\n\nVideo Codec: XviD ISO MPEG-4\nVideo Bitrate: 1256 kbps\nVideo Resolution: 640x480\nVideo Aspect Ratio: 1.333:1\nFrames Per Second: 29.970\nAudio Codec: 0x0055 MPEG-1 Layer 3\nAudio Bitrate: 124kb/s VBR 48000 Hz\nAudio Streams: 2\nAudio Languages: English, Japanese\nRunTime Per Part: 1:10:01\nNumber Of Parts: 1\nPart Size: 731,837,660 Bytes\nSubtitles: English, Japanese\nRipped by: Hex (Osaka)\n\nRelease Notes\n\nPublic Blue is a project devoted to re-thinking the problematics of public space in Japan, and its impact on squatter communities there.\nThis release is distributed free and we encourage those who take an interest in it to organize showings or solidarity protests. Keep in touch at www.kansaikouen.org","torrent":{"xt":"urn:btih:1884db7b1ba99bd39dd645440e5a72ba19ab3949","amp;dn":"Public+Blue+%28Japanese+Squatters%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1884db7b1ba99bd39dd645440e5a72ba19ab3949","infoHashBuffer":{"type":"Buffer","data":[24,132,219,123,27,169,155,211,157,214,69,68,14,90,114,186,25,171,57,73]},"announce":[],"urlList":[]}}