{"title":"avg75free_516a1225 - Mauritius","uid":4217312,"size":33142283,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:188b29a8bb70f51bd3e9c644047963c33842f539&amp;dn=avg75free_516a1225+-+Mauritius&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"manitomanita","files":2,"time":1212415395,"description":"Description\nAntivirus and antispyware protection for Windows from the world&amp;#039;s most trusted security company. Use the\n\nInternet with confidence in your home or small office.\n\n* Easy to download, install and use\n* Protection against viruses, spyware, adware, worms and trojans\n* Real-time security while you surf and chat online\n* Top-quality protection that does not slow your system down\n* Free support and service around the clock and across the globe\n* Compatible with Windows Vista and Windows XP\n\nFEATURES:\n\nIntegrated protection\n* Anti-Virus: protection against viruses, worms and trojans\n* Anti-Spyware: protection against spyware, adware and identity-theft\n* Anti-Rootkit: protection against hidden threats (rootkits)\n* Web Shield &amp; LinkScanner: protection against malicious websites\n\nEasy-to-use, automated protection\nReal-time protection, automatic updates, low-impact background scanning for on-line threats, and instant\nquarantining or removal of infected files ensures maximum protection. Every interaction between your computer\nand the Internet is monitored, so nothing can get onto your system without your knowledge. AVG scans in real time:\n* All files including documents, pictures and applications\n* E-mails (all major email clients supported)\n* Instant messaging and P2P communications\n* File downloads and online transactions such as shopping and banking\n* Search results and any other links you click on\n\nInternet use with peace of mind\nThe new web shield checks every web page at the moment you click on the link to ensure you?re not hit by a\nstealthy drive-by download or any other exploits. All links on search results pages in Google, Yahoo, and MSN\nare analyzed and their current threat level is reported in real time before you click on the link and visit the site.\n\nThe best Windows protection - trusted by millions of users\nAVG&amp;#039;s award-winning antivirus technology protects millions of users and is certified by major antivirus testing organizations (VB100%, ICSA, West Coast Labs Checkmark). \n\nEnjoy............","torrent":{"xt":"urn:btih:188b29a8bb70f51bd3e9c644047963c33842f539","amp;dn":"avg75free_516a1225+-+Mauritius","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"188b29a8bb70f51bd3e9c644047963c33842f539","infoHashBuffer":{"type":"Buffer","data":[24,139,41,168,187,112,245,27,211,233,198,68,4,121,99,195,56,66,245,57]},"announce":[],"urlList":[]}}