{"title":"Spread The Truth 2 (STT)","uid":4218721,"size":2499865611,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:18b4423e174b367bd69c9551c1592e870fde713e&amp;dn=Spread+The+Truth+2+%28STT%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"anonymousstt","files":37,"time":1212486982,"description":"This is the second in a series which will be release over the torrent sites.. Feel free to request or suggest any material you want in the next release..\n\nThe only thing I have done is to assemble this material I take no credit for anything here I am merely a peasant bringing you some educational materials please help me spread it..\n\nDownload now tomorrow might be too late. think of the laws being made to prohibit or to Censure YouTube and in actuality all information spreading tools which is not in their control..\n\nSpread the truth (stt)  &lt;a href=&quot;\nhttp://thepiratebay.se/tor/4210779/Spread_The_Truth_(STT)&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/4210779/Spread_The_Truth_(STT)&lt;/a&gt;\n\nPlease seed I am not able to seed 24h a day but I will seed as often as I can so please seed people.. spread the truth\n\n------------------------------------------------------------------------------------------------------------------------------------------\nHow Human Beings Deny the Truth\n\nHuman beings on Earth like to blow off the truth by claiming that it is simply nonsense, calling it, for example, \\\\\\&quot;funny,\\\\\\&quot; \\\\\\&quot;hilarious,\\\\\\&quot; or \\\\\\&quot;entertaining.\\\\\\&quot; In addition, they automatically disregard the truth messenger as being a \\\\\\&quot;standard-issue schizophrenic who is obviously out of touch with reality.\\\\\\&quot; People desperately try to paint the truth messenger as being non-lucid, mentally unstable, illogical, and so self-absorbed that they can\\\\\\&amp;#039;t see things for what they really are. This is a very convenient way to quickly discard the truth and go on with one\\\\\\&amp;#039;s life. \n\nAnd, when people come upon new information such as this, they erroneously assume that they have some sort of intellectual high ground over it. They start with the assumption that their belief system is correct, and, for whatever reason, vehemently refuse to acknowledge the possibility that they may have actually been deceived all along by their belief system. And thus, when confronted with counter-evidence, they automatically reject it.\n\nAs a matter of fact, human beings are actually pompous enough to think that their status quo worldview is more rational than the truth. They neglect to factor in the concept of intentional deception into their logical thought process, and thus fail to realize that the only reason why their worldview seems \\\\\\&quot;rational\\\\\\&quot; is because it is actually composed of a plethora of lies and distortions. So, in one of the greatest ironies ever, human beings think the lies that they are fed is reality, and that the truth, on the other hand, is crazy, unrealistic, and bizarre.\n\nIt is truly amazing how people are able to adopt one of Earth\\\\\\&amp;#039;s belief systems (whether it be a specific religion or atheism), walk through the proverbial door of enlightenment (or so they think), shut the door behind them, and then never look back. Worse yet, they are actually proud not to look back--proud of their own stubbornness.\n\nOnce human beings are exposed to the truth, their decision to ridicule it manifests so quickly, one could mistakenly think that human beings are actually robots that were programmed to do so. Thus, if people really want to point the finger at someone who does not engage in serious critical thinking, they should go to the nearest mirror and point at themselves (rather than trying to point the finger at the truth messenger).\n\n\\\\\\&quot;There is far more to this world than taught in our schools, shown in the media, or proclaimed by the church and state. Most of mankind lives in a hypnotic trance, taking to be reality what is instead a twisted simulacrum of reality, a collective dream in which values are inverted, lies are taken as truth, and tyranny is accepted as security. They enjoy their ignorance and cling tightly to the misery that gives them identity\\\\\\&quot; (Thomas Cox, montalk.net).\n\n------------------------------------------------------------------------------------------------------------------------------------------\nWhat the Truth is Not\n\nThe truth is the truth, and is not necessarily politically correct or socially acceptable. As a matter of fact, the truth is by no means politically correct or socially acceptable. So, if you came here looking for some conversation material or water-cooler material, then you came to the wrong website. The truth is greater than man, so it will not bow down to your social needs, personal needs, or insecurities. And, your feeble-minded reasoning does not and cannot negate that which actually exists.\n\nThe truth is not a function of human emotions, nor is it catered to the complex dynamics of human culture, interaction, or relationships. So, if the truth makes you feel \\\\\\&quot;embarrassed\\\\\\&quot; or \\\\\\&quot;awkward,\\\\\\&quot; then that is your own problem.\n\nAs all truth messengers already know, human beings always stand in the way of one trying to spread the truth, via such tactics as peer pressure and ridicule. If one ever mentions the truth to a human being, the human being will quickly attempt to suck that person back into the mindless reality that is referred to, here on Earth, as the \\\\\\&quot;real world.\\\\\\&quot; The truth is an enemy of humanity. So, if you are a slave to the human race, then you will forever keep the truth at arm\\\\\\&amp;#039;s length. Therefore, you must pick one: humanity or the truth.\n\nHumanity\\\\\\&amp;#039;s mainstream conception of reality exists merely for the sake of keeping society functioning and orderly. However, human beings incorrectly think that this synthetic conception of reality is reality. Worse yet, fake truth seekers try to get the truth to conform to this synthetic conception of reality.\n\n\\\\\\&quot;Truth is beyond social acceptance. Truth is maladjusted and cannot fit into the massively dumb patterns of ordinary relationships and activities....Greater truth cannot come to those who never bring up the possibility of it to one another. People do not inquire beyond their knowledge because they do not want to have any disturbing shift in their knowledge pattern. The cognitive system is calm and stable through avoiding any disturbing new truth\\\\\\&quot; (Gabriel Chiron, \\\\\\&quot;Truth is Greater Than Man\\\\\\&quot;).\n----------------------------------------------------------\ntext from:http://www.truthism.com/\n----------------------------------------------------------\n\n\nincluded files:\n\nzoom player\n\n4th_July_-_NWO_Revolution._Demise_of_the_New_World_Order\n\nAlex Jones Police State 2000 Martial Law Posse Comitatus\n\nAlien_Skulls_-_Giant_Skeletons_and_Megaliths\n\nALIEN_UFO_GIANT_NEPHILIM_OF_SIZE_170_FEET_FOUND_AND_EXPOSED\n\nanonymous on the system\n\nBRITAIN\\\\\\&amp;#039;S_BRAINWASHED_courtesy_of_The_NEW_WORLD_ORDER\n\nDavid_Icke_2012\n\nDAVID_ICKE_LIVE_AT_BRIXTON_ACADEMY_2006\n\nDavid_Rockefeller_speaks_about_population_control\n\nENDGAME- ALEX JONES - Blueprint for Global Enslavement\n\nEsoteric Agenda\n\nJESUS_wont_save_you._It\\\\\\&amp;#039;s_just_another_masonic_mind_game\n\njordan maxwell\n\nMagic_Weed__History_of_Hemp_&amp;_Marijuana\n\nMatrix_of_Power\n\nNEW_WORLD_ORDER_explained_for_Religious_extremists\n\nPOPULATION_REDUCTION\n\nThe Money Masters - How International Bankers Gained Control of America\n\nThe_Giant_Skeleton_Hoax\n\nU.S_DECLARES_WAR_ON_IRAN_OFFICIAL_.READ_LINKS\n\nmore to come\n\nRemember to seed","torrent":{"xt":"urn:btih:18b4423e174b367bd69c9551c1592e870fde713e","amp;dn":"Spread+The+Truth+2+%28STT%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18b4423e174b367bd69c9551c1592e870fde713e","infoHashBuffer":{"type":"Buffer","data":[24,180,66,62,23,75,54,123,214,156,149,81,193,89,46,135,15,222,113,62]},"announce":[],"urlList":[]}}