{"title":"Trojan.remover v6.6.9+fix","uid":4216349,"size":10051130,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:18c68411a926e7d2fda23a423c63f6b17c208ca5&amp;dn=Trojan.remover+v6.6.9%2Bfix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Slickinator","files":4,"time":1212359805,"description":"  Trojan Remover aids in the removal of Malware - Trojan Horses, Worms, Adware, Spyware - when standard anti-virus software either fails to detect them or fails to effectively eliminate them. Standard antivirus programs are good at detecting this Malware, but not always good at effectively removing it.\n\n \n\nTrojan Remover is designed to work on Windows 98/ME/2000/XP/Vista. The program is not compatible with any 64bit version of Windows.\n\nThe majority of Virus and Trojan Scanners are well able to detect malicious software - Trojan Horses, Internet Worms, Adware/Spyware etc. - but are not always very efficient in removing them once they have been triggered.\n\nTrojan Remover is designed specifically to disable/remove Malware without the user having to manually edit system files or the Registry. The program also removes the additional system modifications some Malware carries out which are ignored by standard antivirus and trojan scanners.\n\n \n\nTrojan Remover scans ALL the files loaded at boot time for Adware, Spyware, Remote Access Trojans, Internet Worms and other malware. Trojan Remover also checks to see if Windows loads Files/Services which are hidden by Rootkit techniques and warns you if it finds any. ","torrent":{"xt":"urn:btih:18c68411a926e7d2fda23a423c63f6b17c208ca5","amp;dn":"Trojan.remover+v6.6.9%2Bfix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"18c68411a926e7d2fda23a423c63f6b17c208ca5","infoHashBuffer":{"type":"Buffer","data":[24,198,132,17,169,38,231,210,253,162,58,66,60,99,246,177,124,32,140,165]},"announce":[],"urlList":[]}}