{"title":"10 little latinas #2","uid":4185762,"size":4457999234,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:1a2a46addea03ce3d47ad73520fd3b240e8acffe&amp;dn=10+little+latinas+%232&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tigerdirect","files":9,"time":1210660312,"description":"Third World Media is very proud to present 10 Little Latinas #2. Find your own &quot;Perfect 10,&quot; with an absolutely &quot;Perfect Tan,&quot; from this fine grouping of 11 Fiery Little Latinas who all seem to agree; &quot;Mucho Gusto en el Culo!&quot; These Latinas are all small and petite girls, with natural breasts and rock hard perfect bodies. They come in a variety of types, from light skinned whities to golden brown luscious Latinas, yet they all share the same perfect tan lines, and a fervent yearning for fat cock crammed in their pint-sized bottoms. If that&amp;#039;s not enough, these teeny-weeny firecrackers all understand the pleasure both they, and their partners derive from sucking their own ass juice straight off his fat dipstick. These girls average barely 19 years of age- 2 are still in braces and 2 more are real twin sisters who share much more than their dolls on our set. A big fat black cock keeps these youngsters quiet, while some of the other girls pass their time with one in the pink and another in the stink at the same time. These girls may be small, but what they lack in size is made up for with pure passion, sizzling heat and a thirst for melting Horchata all over their youthful faces. These aren&amp;#039;t your average East LA Chicas- Our girls are all real Latinas and the finest selection the Third World has to offer. Our research is conclusive- 10 out of 11 Latinas Prefer it in the Culo! \n\nStarring: Featuring Very Sweet and Petite 18 year old Gabriela, our Sexy Cover Girl with Braces; and another 10 of her &quot;Perfect 10&quot; Petite Latina Girlfriends who all share the same motto- &quot;Mucho Gusto en el Culo!&quot; \n\n11 of the Smallest and Fiery Little Latinas give up 13 Total Cum Shots, 100% Natural Girls, 100% Bareback, Shot on Location in Exxxotic South America, Featuring Real 18 Year Old Twin Sisters, Loads of Anal and Ass to Mouth (ATM), Pussy to Mouth (PTM), Ass to other Girl&amp;#039;s Mouth (ATOGM), Interracial, and 2 Double Penetrations (DPs). Bonus Footage includes the Crema de Cum (cum shot recaps)!!\nBonus Footage Included\n\n\nStars: Angel, Claudia, Darlene, Jennifer, Louise, Pietra, Gisele, Gabriela, Milla, Nani, Ariane\nApproximate Running Time: 03:11:29\nReleased: 2007","torrent":{"xt":"urn:btih:1a2a46addea03ce3d47ad73520fd3b240e8acffe","amp;dn":"10+little+latinas+%232","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a2a46addea03ce3d47ad73520fd3b240e8acffe","infoHashBuffer":{"type":"Buffer","data":[26,42,70,173,222,160,60,227,212,122,215,53,32,253,59,36,14,138,207,254]},"announce":[],"urlList":[]}}