{"title":"Nod32 Anti Virus + Marsu - Fix","uid":4203057,"size":19783482,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1a7cab994e40c309438ab643a2d210f151ab521a&amp;dn=Nod32+Anti+Virus+%2B+Marsu+-+Fix&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"monoxide420666","files":2,"time":1211617169,"description":"Antivirus protection is spelled &quot;NOD32.&quot; Built on the award-winning ThreatSenseÂ® engine, ESET NOD32 Antivirus software proactively detects and eliminates more viruses, trojans, worms, adware, spyware, phishing, rootkits and other Internet threats than any program available.\n\nIt&amp;#039;s the ideal antivirus for Windows XP, and also runs smoothly on Windows legacy systems, MS-DOS, file servers, mail servers, and more.\n\nNo matter what your system, there is no better antivirus protection. ESET NOD32 Antivirus was awarded the &quot;BEST Antivirus Solution&quot; in 2006 and 2007 by AV-Comparatives. Compare antivirus solutions here to learn more, or check out the latest virus bulletin.\nESET NOD32 Antivirus provides:\n\n* Proactive Protection: The award winning ThreatSense technology combines multiple layers of detection protecting you from Internet threats before it is too late.\n* Precise Detection: ESET accurately identifies known and unknown threats. It consistently wins top awards from testing labs and is recognized for having zero false positives.1\n* Lightweight Design: Requires less memory and CPU power, allowing your computer to run fast, making more room for games, web browsing, and emailing.\n* Fast Scanning Speeds: Highly efficient program ensuring fast file scanning and product updates. It runs quietly in the background. ","torrent":{"xt":"urn:btih:1a7cab994e40c309438ab643a2d210f151ab521a","amp;dn":"Nod32+Anti+Virus+%2B+Marsu+-+Fix","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1a7cab994e40c309438ab643a2d210f151ab521a","infoHashBuffer":{"type":"Buffer","data":[26,124,171,153,78,64,195,9,67,138,182,67,162,210,16,241,81,171,82,26]},"announce":[],"urlList":[]}}