{"title":"Ruptus Jack","uid":4187178,"size":170763501,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1aa25bcccd1f0a0b0a96ac4d49aad6786d1f7a15&amp;dn=Ruptus+Jack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ruptusjack","files":31,"time":1210736045,"description":"Ruptus Jack - 3 albums \n\nAmnesia (CD single released 2004)\nRoses and French Lessons (released 2005)\nRuptus Jack (Full Album released 2007)\n\nCheck out\n\nHeavy Alternative Rock from New Zealand - Enjoy!\n\nAlbum Reviews:\n4/5 Stars - Groove Guide (Issue 174)\n\n&quot;It&amp;#039;s a dirty world, the rock and roll scene. Dirty is a good word in this case however, when you listen to what many thought Jet would have brought with their latest album. Alas, it&amp;#039;s up to Ruptus Jack to provide us with that sort of nostalgic rock that The Datsuns gave to us, and it&amp;#039;s plentiful on their eponymous debut. With a raucous &amp;#039;Reverend Hutch&amp;#039;s Sermon&amp;#039; leading into &amp;#039;Ulterior Motives&amp;#039; as pivotal to the track as the opening proclamation of Mudhoney&amp;#039;s &amp;#039;In &amp;#039;n&amp;#039; Out of Grace&amp;#039;. It&amp;#039;s nothing intricate musically, but then those complexities one would associate with post-punk and the scene we&amp;#039;re in at the moment can become somewhat tiresome, and it&amp;#039;s always refreshing to hear something with a little bit more bite in the New Zealand music scene. Perfectly acceptable balls out rock!&quot;\n- Benji Jackson (Groove Guide)\n\n4.5/5 Stars - Tearaway Magazine (June 2007)\n\n&quot;If these guys from Auckland have anything going for them, it?s their insane lack of respect for the acceptable standards of not only our society, but everyone else?s.\n\nRude, offensive, uncaring... rock at its core. Headbanging beats that have you feeling like you have elbow-length hair, even as you crush into the guy next to you.\n\nThe next time you?re looking to get back to the roots of Rock N? Roll, these bad boys are just the ticket&quot;\n? DAVID OSTEN GIFFORD\n\nNZ Musician Magazine (June/July 2007)\n\n&quot;I&amp;#039;ve never seen this band live, but i have reviewed an earlier EP and i remember thinking - at the time - that they&amp;#039;d be an interesting live prospect. This new full-length album further confirms the opinion. Auckland-based Ruptus Jack know how to rock out - but the songs have structure, a melody is always discernible and whilst it might all seem like big dumb fun (in the best possible way), at least there is a point to these songs. It might seem unfair to single out any one of the five members here - but kudos has to go to Jared &amp;#039;Fadaladies&amp;#039; Hutcheson. Rock bands, in particular, can live or die by their lead singer and Hutcheson does a fine job of channeling late grunge &amp;#039;Alice in Chains&amp;#039; and the re-invention of &amp;#039;Chris Cornell&amp;#039;; But he has his own sound. Simply put: the guy is more than a decent rock singer, and that&amp;#039;s what you need to be a more than decent rock band. He&amp;#039;s ably backed up by Michael Macfie and Matt Vine&amp;#039;s guitars, by Tim Lomas&amp;#039; dynamic drumming, and by the prod and probe of Richie Tarbitt&amp;#039;s Bass drill.&quot;\nSIMON SWEETMAN\n\nMuzic.net.nz Review (June 2007)\n\nRuptus Jack are an Auckland 5 piece band and who are presenting their first full length self titled CD, which follows on from their 2005 EP ?roses and French lessons? and some pretty extensive touring.\n\nTheir website and biography allude to disparate influences like punk, metal and drum?n?bass, but this CD is a rock pure and simple. The sound is twin guitars, bass, drums and vocals and is obviously honed from a lot of on stage experience. Singer Jared Hutcheson has a definite flavour of the late 60s British blues wailers like Paul Rodgers and Eric Burden, and indeed it is a little bit of a surprise to see promo shots of such young men in this band.\n\nIt would be really easy to stick a retro tag on these guys, but that would be unfair. It?s a sound full of loud guitars and drums, and pumping bluesy vocals, ands songs obviously tested in live performance with real audience feedback. More contemporary reference points would be to the sounds of the datsuns and the D4.\n\nThe songs, then, range from ?bring it up?, which has a very Jet-like riff, to groovier kind of experiences like ?ulterior motives? balanced with the more considered and involved ?lay back down?, and the more epic, last-song-of-the-set ?mr indecisive?.\n\nPlying and singing remain professional and precise throughout, riff heavy rather than lots of guitar widdley, and Hutcheson?s voice a consistent bringer of character to the sound. Good too, to hear consistent use of backing vocals, yet another sign of live experience. Some elements of the live act don?t translate that well, such as ?reverend hutches sermon? and the singers entreaties to the audience to ?get up.. and get down? in ?bring it on up?.\n\nYou could imagine this CD, then, to be an accurate snapshot of a tight, experienced live band with a set of songs that have been road tested and honed.\nReview by trevfset of songs that have been road tested and honed.\nReview by trevf\n\nSounds like: Queens Of The Stone Age, Kyuss, The Datsuns, Jet, Black Sabbath, The Doors, Alice In Chains, Clutch, Faith No More, Tomahawk, Foo Fighters, Incubus, Pearl Jam, Shihad, Stone Temple Pilots, Velvet Revolver","torrent":{"xt":"urn:btih:1aa25bcccd1f0a0b0a96ac4d49aad6786d1f7a15","amp;dn":"Ruptus+Jack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aa25bcccd1f0a0b0a96ac4d49aad6786d1f7a15","infoHashBuffer":{"type":"Buffer","data":[26,162,91,204,205,31,10,11,10,150,172,77,73,170,214,120,109,31,122,21]},"announce":[],"urlList":[]}}