{"title":"Yameen - Never Knows Best (2008)","uid":4236976,"size":58882076,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1aee5087eaa397373e55492bd479ab51c0df252e&amp;dn=Yameen+-+Never+Knows+Best+%282008%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fooltool88","files":15,"time":1213345694,"description":"Philly-bred, San Francisco-located producer Yameen has held several aliases, but one thing that has remained constant is his powerful fascination with all things music-related. Even as a child, he was sneaking tape recorders into school or onto the bus, always on the hunt for new sounds to capture.\n\nThen, as a teenager (and known as Stinke), he was the Webmaster for the Hieroglyphics.com site and essentially wrote the blueprint for indie hip-hop on the Web, garnering praise as one of URB magazine&amp;#039;s Next 100. His music production debut came under the moniker SupremeEx, and his work with Tajai of Souls of Mischief garnered hefty critical praise for its high quality as well as its integration of multimedia to enhance the music&amp;#039;s concept.\n\nNow ? under his given name Yameen ? he has a new album, Never Knows Best (dropping in June on Ropeadope Records), and he has further matured as an artist and producer, moving away from the highly conceptual work of the past and focusing more on creating great music with an impressive roster of guest stars.\n\nDrawing on past experience working with artists like Goapele, Shing02, and a pre-Hollertronix DJ Low Budget, Yameen corralled an impressive list of collaborators, including the legendary Shock G (Digital Underground), Azeem (OM Records), Lady Alma (4Hero, Black Lily), Georgia Anne Muldrow (Stones Throw), Casual (Hieroglyphics), DJ Icewater (Pharcyde, Quannum) and Maylay Sparks (!K7). While they all were artists Yameen had long been hoping to work with, he made sure that each track fit the artist. These aren&amp;#039;t collaborations done for the sake of collaborating.\n\nNor are any of the tracks simply a case of pasting vocals on top of beats.\n\n&quot;When you introduce your collaborator&amp;#039;s work and influence, it just transforms into something you can never ever predict or anticipate,&quot; Yameen explains. &quot;From a production standpoint, you let go of your controlled, linear environment and open the song up to chaos, or events you have no control over. I could have never expected the album to grow in the way it has, and that&amp;#039;s thanks in large part to the power of collaboration.&quot;\n\nThe end result is a more direct, focused album drawn from the give-and-take of creative artists trying to bring the best out of each other.\n &lt;a href=&quot;\nhttp://www.yameenmusic.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.yameenmusic.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:1aee5087eaa397373e55492bd479ab51c0df252e","amp;dn":"Yameen+-+Never+Knows+Best+%282008%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1aee5087eaa397373e55492bd479ab51c0df252e","infoHashBuffer":{"type":"Buffer","data":[26,238,80,135,234,163,151,55,62,85,73,43,212,121,171,81,192,223,37,46]},"announce":[],"urlList":[]}}