{"title":"Explore The Jungle","uid":4200722,"size":179973400,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1b10f5a072ca7630d7899c09a1097dfb01206323&amp;dn=Explore+The+Jungle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Joemighty","files":1,"time":1211482606,"description":"Let\\\\\\&amp;#039;s Explore The jungle: With Buzzy The Knowledge Bug\nImage: http://www.sonic.net/mnitepub/pccafe/reviews/jungle/alljungle.jpg\n\nMinimum System Requirements:\n\nWINDOWS;\n33 MHz 386 with 4 MB RAM SVGA (640x480, 256 color) graphics, Windows 3.1 or higher, sound card, double-speed CD-ROM drive\n\nMacintosh;\nMinimum 25 MHz 68040 or PowerPC with 8 MB of RAM 640x480, 256 colors, System 7.0 or higher, double-speed CD-ROM drive\n\n\n\n\nThis is an incredible interactive tour of a three beautiful jungles, Asia, Africa, and Amazon.  One of the Junior Fieldtrip series by Humongous Entertainment, kids and parents spend hours exploring with Buzzy.\n\nThere are over 30 locations to explore on this virtual safari.  Kids travel with Buzzy the Knowledge Bug and explore and Amazon cave, swim with a hippo, and go underground with the ants. \n\nIf you want to learn more about something just use the question mark.  Buzzy will read to you all about more than 200 plants and animals.  Do you know how a flying snake flies?  Buzzy does.  Have you ever seen a giant anteater.  Buzzy explains everything with the help of detailed pictures.\n\nIn addition to exploring the airport there are five games with multiple levels.  Kids love to play:\n\n    Find It - where they are challenged to find things in the jungles.\n\n    Trivia - a question and answer game\n\n    Jungle Jumble - a spelling game\n\n    Coloring Book - coloring jungle pictures, kids can even mix their own colors\n\nThis game is great for many ages.  Everything on the screen can be read to you for younger kids but the level of detail will interest even older children.  The graphics are among the best you are going to see, they pop off the page.","torrent":{"xt":"urn:btih:1b10f5a072ca7630d7899c09a1097dfb01206323","amp;dn":"Explore+The+Jungle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b10f5a072ca7630d7899c09a1097dfb01206323","infoHashBuffer":{"type":"Buffer","data":[27,16,245,160,114,202,118,48,215,137,156,9,161,9,125,251,1,32,99,35]},"announce":[],"urlList":[]}}