{"title":"American_Dad_S01E01-S03E12 [PROPER EPISODES, NO MIXUPS]","uid":4064006,"size":11238435988,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1b1f8a2da8b3abf943c1ebadaf43e3aa337bbbf7&amp;dn=American_Dad_S01E01-S03E12+%5BPROPER+EPISODES%2C+NO+MIXUPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"DolphWulff","files":-1,"time":1204677145,"description":"Okay, so!\n\nThis is one of those series that are plagued by wrong classifications,\nparticularly the misconception that there were only seven episodes in\nseason one. This resulted in releases online that stated they were,\nfor instance, season two episode three, while it was in reality season\none episode ten.\n\nThis would not be a problem if only this misconception had continued.\nBut, as it were, the release groups picked up on the error and starting\nnaming their releases properly. But really that just added to the\nconfusion. Suddenly you&amp;#039;d have an S02E03 by LOL that was actually S01E10,\nAND an S02E03 by XOR that was indeed S02E03. But how could the regular\ndownloader know which was which, or even know there was a difference?\nWe see lots of tv show episodes by different groups all the time, and\nusually we just pick one of them. In this case, that would prove to be\na bad strategy. As it has for many peers out there.\n\nSo basically, here&amp;#039;s the remedy. I decided to sort this thing once and for\nall, and I&amp;#039;ve scoured the &amp;#039;net on different channels for the original,\nRAR&amp;#039;ed releases, which I&amp;#039;ve succeeded in doing except for three cases, where\nI had to settle for the expanded AVI file. There&amp;#039;s also one episode that\nI really have no clue whether it&amp;#039;s released by LOL, XOR or someone else.\nNot that this matters to regular people, but if you&amp;#039;re the collecting\nkind of dude like me, well, you kinda tend to get a bit anal about it ;)\n\nThe bottom line is that this here is all episodes (as far as I know anyway,\nI haven&amp;#039;t heard about any &quot;specials&quot; or stuff like that) from S01E01 to\nS03E12, in one neat torrent.\n\nDownload, unpack, enjoy, and stop worrying about mixed up episodes! From\nhere on out, you just have to get the latest episodes which are all\nproperly named :)\n\nPlease don&amp;#039;t bitch about the RAR files! It takes five seconds to unpack\nthese things, so no whining!\n\nPS: If anyone has the last proper RAR&amp;#039;ed releases, please up them! :)\n\nPPS: I might not be super stable, as I&amp;#039;m on a wifi, and sometimes it\ndies, and I&amp;#039;m not gonna hang around long after I&amp;#039;ve seeded fully, so\nHELP ME SEED! Thank you.","torrent":{"xt":"urn:btih:1b1f8a2da8b3abf943c1ebadaf43e3aa337bbbf7","amp;dn":"American_Dad_S01E01-S03E12+%5BPROPER+EPISODES%2C+NO+MIXUPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b1f8a2da8b3abf943c1ebadaf43e3aa337bbbf7","infoHashBuffer":{"type":"Buffer","data":[27,31,138,45,168,179,171,249,67,193,235,173,175,67,227,170,51,123,187,247]},"announce":[],"urlList":[]}}