{"title":"ArcSoft MediaImpression v1.2.0.240 (The Joker)","uid":4086096,"size":137410886,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1b44e92570aef3516e227b074ef1d4116a8d2cdb&amp;dn=ArcSoft+MediaImpression+v1.2.0.240+%28The+Joker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jokeri1971","files":9,"time":1205815754,"description":"ArcSoft MediaImpression? manages your media for you, and gives you tons of fun and exciting ways to create and share projects featuring your photo, video, and music files. Edit, enhance and add creative effects to your photos. Create your own movies or photo slide shows, complete with soundtrack. Upload your files easily to YouTube?! Or share them through simple email attachments or popular photo printing.\n\n\nFEATURES:\n\n* Powerful Media Management\no Organize files with ratings, tags, flags and calendar views\no Launch Google Earth, navigate to the location where you took your picture, then ?geotag? your picture for future reference\n\n* XMP Support\no Add title, subject, IPTC, rating and tag information into pictures\no Share information with other applications like Vista Photo Gallery or Adobe Photoshop\no Retain photo information even if you copy, move or share it with other people\n\n* MUI (Multilingual User Interface) Support\no Adjust text size for easier reading\no Choose your language preference\n\n* Simple Creative Projects and Editing Tools\no Combine pictures, video, and music in just a few clicks\no Create your own movies or photo slide shows, complete with sound track\no Edit, enhance, and add fun creative effects to your photos\n\n* Many Ways to Present, Publish, and Share\no View pictures and videos full screen\no Email pictures as attachments or photo pages, or inside colorful templates\no Save photos as screen savers or desktop wallpaper\no Transfer photos to ArcSoft Print Creations? software for making greeting cards, calendars, photo books, and more\n\n* Easy File Import and Export\no Automatically detect plugging and unplugging of memory cards and DSCs\no Automatically fix red-eye, correct picture orientation, and tag files on import\no Capture images from video files\no Capture video from webcams\n\nPRODUCT DETAILS:\n\nPictures\nThe program comes packed with a complete set of image-related features, including:\n\n* Image editing and enhancement, both in a one-click wizard and in a complete set of photo editing tools\n* Creative tools for adding frames, edges, and clip art\n* Photo slide show creation\n* Screen saver and desktop wallpaper creation\n* Photo printing both at-home and online\n* Photo transfer to ArcSoft Print Creations? software for making greeting cards, calendars, photo books, and more\n* Still image capture from video file\n\nVideo\nMediaImpression lets you upload your videos to YouTube?! The built-in media player lets you play video clips without having to launch another application. And, you can create custom movies by combining videos, photos, music, and transition effects. You can also trim your videos, add a soundtrack, and personalize your movies by adding a logo, title and credit screens. You can even capture video or images directly from your webcam, or rotate video when you import files from your camera or camcorder.\n\nMusic\nThe program meets today&amp;#039;s essential music requirements by including its own media player with playlist view mode. You can also add soundtracks to your movies and slide shows.\n\nPowerful Media Management\nBrowse, search, and organize media files with the use of tags, ratings, import dates, and creation dates (through a calendar view). The program honors existing file associations for picture and audio and includes a feature for renaming groups of photo files with a single click.\n\nSimple File Import\nThe program automatically detects the plugging and unplugging of memory cards and digital cameras, then imports the photo, video, and audio files in a flash. During the import process, you can choose to automatically fix red-eye, correct picture orientation, and attach tags to your media files.\n\nEffortless Sharing\nEmail pictures as simple attachments or inside colorful email templates. Uploading media files to online photo sharing websites directly, archiving media files to CD/DVD discs, and creating VCD and DVD discs of movies and slide shows is fun and easy.\n\nContinually Improve your Software\nThe program&amp;#039;s Download/Activation feature lets you download trial versions of new projects and new ways to organize and manage your media files. If you like a plug-in after trying it out, you can activate it right from within the software!\n\nSystem Requirement:\n\nWindows: 2000/XP/Vista:\n\n* Pentium III 1 GHz or equivalent\n* 512 MB RAM\n* 300 MB available hard disk space\n* 800 Ã— 600 pixels, 16-bit color monitor\n* Microsoft Windows Media Player 9.0 or higher\n* Microsoft DirectX 9.0 or higher\n* Apple QuickTimeÂ® 7.0 or higher recommended\n\nhave fun and enjoy The Joker\n\n(I DID NOT HAD ANY TIME TO TEST THE SOFTWARE, SO LET ME NOW IF ITS WORKS)","torrent":{"xt":"urn:btih:1b44e92570aef3516e227b074ef1d4116a8d2cdb","amp;dn":"ArcSoft+MediaImpression+v1.2.0.240+%28The+Joker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1b44e92570aef3516e227b074ef1d4116a8d2cdb","infoHashBuffer":{"type":"Buffer","data":[27,68,233,37,112,174,243,81,110,34,123,7,78,241,212,17,106,141,44,219]},"announce":[],"urlList":[]}}