{"title":"Dime Que Me Quieres 1x06 - Episodio 6 [DVD-DVB DUAL] [by LuTTeR]","uid":4228668,"size":410439680,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1be3e59a5b459c8c40642a3aa237372249fa5197&amp;dn=Dime+Que+Me+Quieres+1x06+-+Episodio+6+%5BDVD-DVB+DUAL%5D+%5Bby+LuTTeR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seriesani","files":1,"time":1212938096,"description":" &lt;a href=&quot;http://seriesani.baywords.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://seriesani.baywords.com&lt;/a&gt; -- EL BLOG DE LAS SERIES - ASAT\n\nDatos de la serie:\n\nTÃƒÂ­tulo: Dime que me quieres\nAÃƒÂ±o de producciÃƒÂ³n: 2007\nTemporadas: 2Ã‚Âª concedida\nCapÃƒÂ­tulos: 10\nGÃƒÂ©nero: Drama.\nProductora: Home Box Office (HBO).\nReparto: Katharine Towne (Mason), Jane Alexander (Dr. May Foster), Michelle Borth (Jaime), Tim DeKay (David), Josh Folan (Josh), Luke Kirby (Hugo), Ginger Kroll (Ginger), Adam Scott (Palek), David Selby (Arthur Foster), Sonya Walger (Carolyn), etc...\nNacionalidad: USA\n\nMediante una provocativa y honesta exploraciÃƒÂ³n de la intimidad, &quot;Dime que me quieres&quot; ofrece una mirada sin filtros a tres parejas en tres estados vitales completamente diferentes, mientras navegan por momentos crÃƒÂ­ticos de sus vidas, lo que les ha llevado a pedir el consejo profesional de una terapeuta matrimonal. Con una candidez que rompe con los lÃƒÂ­mites convencionales, la creadora de la serie, Cynthia Mort, examina tanto los momentos significativos como el dÃƒÂ­a a dÃƒÂ­a que forma la base y el lenguaje de cada relaciÃƒÂ³n sentimental.\n\nLos veinteaÃƒÂ±eros Jamie y Hugo experimentan la vitalidad del sexo, pero se dan cuenta de que sus relacione ÃƒÂ­ntimas sirven como una escapada de sus dispares visiones sobre la fidelidad y el compromiso. Katie y Dave son dos padres felices que han superado los 40 aÃƒÂ±os, y que no se cuestionan por quÃƒÂ© el amor y la devociÃƒÂ³n que sienten el uno por el otro, no se ha traducido en relaciones sexuales desde hace casi un aÃƒÂ±o. Carolyn y Palek llegan a aprender lo mucho que sus esfuerzos por ser padres y su incapacidad de concebir ha forjado unas conexiones intabgibles entre ellos.\n\nLa terapeuta May Foster, (Jane Alexander, Kramer contra Kramer) trabaja para guiar con cuidado a cada una de estas parejas hacia unas relaciones personales mucho mÃƒÂ¡s sanas, y a pesar de contar con una serie de asuntos sin resolver en su propio matrimonio, ella y su jubilado marido Arthur (David Selby, Falcon Crest), se esfuerzan con mantener una sociedad que estÃƒÂ¡ formada por un profundo amor y una apasionada vida sexual. Se esfuerzan por disfrutar su vida juntos, aunque ÃƒÂ©l a menudo se sienta como un segundo plato en la vida de ella, que se muestra muy volcada con su trabajo profesional.\n\nRetratando tanto los momentos incÃƒÂ³modos como las intimidades de cada una de las parejas, la serie abre una ventana hacia las complejidades de las relaciones modernas. Provocadora, cruda y directa, &quot;Dime que me quieres&quot; desvela los sueÃƒÂ±os secretos, los complejos y los medios que se materializan cuando el sexo y las relaciones ÃƒÂ­ntimas conectan... o tambien cuando divergen.\n\nDatos del ripeo:\n\nTemporada: Primera\nCapÃƒÂ­tulos: 10\nTamaÃƒÂ±o capÃƒÂ­tulos: 420MB\nDuraciÃƒÂ³n: Unos 50 minutos por capÃƒÂ­tulo\nRipeo: DVD+DVB Dual\nIdioma: EspaÃƒÂ±ol-InglÃƒÂ©s\n\n","torrent":{"xt":"urn:btih:1be3e59a5b459c8c40642a3aa237372249fa5197","amp;dn":"Dime+Que+Me+Quieres+1x06+-+Episodio+6+%5BDVD-DVB+DUAL%5D+%5Bby+LuTTeR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1be3e59a5b459c8c40642a3aa237372249fa5197","infoHashBuffer":{"type":"Buffer","data":[27,227,229,154,91,69,156,140,64,100,42,58,162,55,55,34,73,250,81,151]},"announce":[],"urlList":[]}}