{"title":"The Big Bang Theory 1x01&amp;1x02 [HDTV-DVB DUAL] [by LuTTeR]","uid":4236414,"size":402601984,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1c3e24ef5dead15525ece8f8fc2728a05ec156c3&amp;dn=The+Big+Bang+Theory+1x01%261x02+%5BHDTV-DVB+DUAL%5D+%5Bby+LuTTeR%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seriesani","files":2,"time":1213320186,"description":"- EL BLOG DE LAS SERIES - ASAT\n\nFICHA TECNICA RIPEO\nTemporada: Primera temporada.\nTotal episodios: 17 \nRipeo:Hdtv+Dvb Dual\nTamaÃƒÂ±o episodios : 200 megas\nDuraciÃƒÂ³n : Unos 20 minutos por episodio.\n\n\nFICHA TECNICA SERIE\nTÃƒÂ­tulo Original :The Big Bang Theory\nCreador: Chuck Lorre y Bill Prady\nProducciÃƒÂ³n Ejecutiva: Chuck Lorre y Bill Prady\nEstudio: Warner\nGÃƒÂ©nero :Comedia\nEpisodios: 17\n\n\nReparto:\nJohnny Galecki: Leonard\nJim Parsons: Sheldon\nSimon Helberg :Wolowitz\nKaley Cuoco :Penny\nKunal Nayyar: Koothrappali\n\nArgumento:Creada por Chuck Lorre (Dos hombres y medio), The Big Bang Theory es una comedia sobre dos jÃƒÂ³venes e inteligentes ciÃƒÂ©ntificos que pueden contarte cualquier cosa que quieras saber sobre fÃƒÂ­sica cuÃƒÂ¡ntica, pero cuando se trata de lidiar con los asuntos cotidianos de la vida diaria en la tierra, es como si estuvieran perdidos en medio del cosmos, ya que principalmente ninguno de esos genios sabe como interactuar con la gente, especialmente con las mujeres. Tampoco entienden del todo que los principios cientÃƒÂ­ficos no siempre se aplican en las cuestiones relativas al corazÃƒÂ³n... hasta que conocen a su nueva y sexy vecina, que terminarÃƒÂ¡ por revolucionar la existencia de ambos amigos.\n\nDos brillantes fÃƒÂ­sicos, Leonard (Johnny Galecki, Roseanne) y Sheldon (Jim Parsons, La Juez Amy), son la clase de &quot;mentes maravillosas&quot; que entienden como funciona el universo. Ambos comparten piso en un edificio de apartamento en el que parece que el ascensor estÃƒÂ¡ siempre fuera de servicio, y como buenos cientÃƒÂ­ficos tienen una pizarra en el salÃƒÂ³n en donde trabajan en sus teoremas. Pero tambiÃƒÂ©n tienen sus diferencias, ya que mientras el genio de Sheldon parece estar centrado principalmente en matemÃƒÂ¡ticas y ciencias, Leonard tiene preferencia por la literatura, la historia y las ciencias, y ÃƒÂ©ste se siente como en casa con sus compaÃƒÂ±eros cientÃƒÂ­ficos, pero quiere integrarse mÃƒÂ¡s socialmente. Sheldon, por el contrario, estÃƒÂ¡ encantado de su situaciÃƒÂ³n y no importa compartir detalles de su vida que otros pueden considerar vergonzosos, lo que le hace tener un ego muy inflado, una cierta ineptitud social y la incapacidad de identificarse emocionalmente con los demÃƒÂ¡s.\n\nSin embargo, todo empieza a cambiar cuando una bella muchacha de espÃƒÂ­ritu libre llamada Penny (Kaley Cuoco, Embrujadas) se muda al piso de al lado. Cuando Leonard y Sheldon la conocen, Leonard inmediatamente se interesa por ella, ya que ve en Penny todo un nuevo universo de posibilidades... incluido el amor, pero Sheldon siente que su amigo estÃƒÂ¡ persiguiendo un sueÃƒÂ±o que nunca alcanzarÃƒÂ¡. Penny es una agradable joven que trabaja de camarera mientras trata de abrirse camino como guionista, y la razÃƒÂ³n por la que se muda al edificio de los muchachos es que acaba de romper con su novio de los ÃƒÂºltimos cuatro aÃƒÂ±os y la han echado de su ÃƒÂºltimo apartamento. Pese a conocer el estatus de &quot;intelectuales&quot; de ambos amigos, decide ayudarlos a comenzar a aprender a relacionarse y a enfrentarse con la realidad que los rodea, aunque a veces no sea muy consciente del efecto que tiene en la vida de ambos.\n\nPor su parte, Sheldon se contenta simplemente con pasar sus noches jugando &quot;on-line&quot;por Internet con sus socialmente disfuncionales compaÃƒÂ±eros de Cal Tech, los cientÃƒÂ­ficos Howard Wolowitz (Simon Helberg, Studio 60), que se retrata a sÃƒÂ­ mismo como el &quot;Casanova&quot; del grupo y suele tratar de intimidar a Penny con su amplio conocimiento de idiomas, y Rajesh Koothrappali (Kunal Nayyar, Navy: InvestigaciÃƒÂ³n Criminal), quien enmudece por completo cuando aparece alguien que no estÃƒÂ© preparado para conversar sobre la teorÃƒÂ­a de la relatividad o sobre cualquier otro principio cientÃƒÂ­fico. ","torrent":{"xt":"urn:btih:1c3e24ef5dead15525ece8f8fc2728a05ec156c3","amp;dn":"The+Big+Bang+Theory+1x01%261x02+%5BHDTV-DVB+DUAL%5D+%5Bby+LuTTeR%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1c3e24ef5dead15525ece8f8fc2728a05ec156c3","infoHashBuffer":{"type":"Buffer","data":[28,62,36,239,93,234,209,85,37,236,232,248,252,39,40,160,94,193,86,195]},"announce":[],"urlList":[]}}