{"title":"YOU CAN'T DO THAT ON TELEVISION DVD Disc 2 of 12 (ISO)","uid":4116609,"size":4681482240,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:1d9977323983aea9a9e5666733b4105c102c4824&amp;dn=YOU+CAN%5C%27T+DO+THAT+ON+TELEVISION+DVD+Disc+2+of+12+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bo Bandy","files":1,"time":1207342456,"description":"YOU CAN&amp;#039;T DO THAT ON TELEVISION\nDISC 2 OF 12\n\nSometime near the end of 2006, while perusing the internet for some way of acquiring episodes of YCDTOTV I came across a website that offered every episode of the show on 12 DVD-Rs for the low, low price of $60.  I&amp;#039;m pretty sure the site that I stumbled upon is gone now, because I searched for it so I could provide a link in this description and could not find it.  The site was upfront about it being on DVD-Rs, and that the source were VHS tapes.  So going into it I wasn&amp;#039;t fooling myself into thinking I was getting digitally remastered copies or something.  I figured it would be like watching old VHS tapes.  I could handle paying $60 for old VHS tapes of every episode, why not digital copies?  Well, I got the set a couple days later and found the quality to be somewhat lower than actual old VHS tapes.  Some episodes are unwatchable, but many are fairly decent.  So why am I uploading this set?  Well, one reason is that I&amp;#039;ve never seen any episodes of YCDTOTV offered on any torrent site.  Another reason is because maybe someone with better quality copies will see some of these and think, &quot;maybe I should upload my higher quality versions.&quot;  Yet another reason is because maybe that site is still around, charging good people $60 a pop for shitty workmanship.  Download it for free here.  Upload it somewhere else.  Spread it around.\n\nId like to mention that the website www.barthsburgery.com offers quality DVDs of the show, just not of every episode.  Check them out if you have the time. \n\nDISC 2\n10  Sexual Equality\n11  Personal Hygiene\n12  Smoking\n13  Crime &amp; Vandalism\n14  Drugs\n15  Nutrition\n16  Peer Pressure\n17  Cosmetics\n18  Addictions\n19  Popularity\n20  Fads &amp; Fashion\n21  Vacations","torrent":{"xt":"urn:btih:1d9977323983aea9a9e5666733b4105c102c4824","amp;dn":"YOU+CAN%5C%27T+DO+THAT+ON+TELEVISION+DVD+Disc+2+of+12+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1d9977323983aea9a9e5666733b4105c102c4824","infoHashBuffer":{"type":"Buffer","data":[29,153,119,50,57,131,174,169,169,229,102,103,51,180,16,92,16,44,72,36]},"announce":[],"urlList":[]}}