{"title":"Cirque Du Soleil ~ Trology","uid":4098154,"size":437520091,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:1eaf827d8a01da358b7ac1e32454eb0443dca08e&amp;dn=Cirque+Du+Soleil+%7E+Trology&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gazzjazz","files":45,"time":1206433312,"description":"I&amp;#039;ve combined three major albums here: Saltimbanco, Alegria &amp; Mystere. The significant driving force &amp; composer on all these recordings is the incredible Rene Dupere.\n\nI&amp;#039;ve included a biography, scanned cover art, plus a bonus track from Rene&amp;#039;s wife Elise Velle performing &quot;Mayalah&quot;, a brilliant and percussive collaboration with Rene.\n\nElise features on Saltimbanco &amp; you can view her on YOUTUBE performing &quot;Horere Ukunde&quot;....she&amp;#039;s the blonde with things sticking out of her hair. True theatre and talent!!!\n\nYou&amp;#039;ll be hard pressed to find such diversity in any genre album...come movie soundtrack or compilation...Rene is brilliant!!!\n\nhere is AMG&amp;#039;s review of Mystere.\n\nReview\tby Lena Katz\n\nThe world-renowned creative team headed up by composers Rene Dupere and Benoit Jutras and creative director ($Guy Laliberte) liken their first permanent Las Vegas show to a desert flower, and its soundtrack is a gorgeous, colorful, unlikely creation indeed. Like preceding albums Saltimbanco and Alegria, Mystere borrows sounds from various corners of the globe, but often it seems to strike out for musical parts unknown, forging a style and sound all its own. Soaring, sweet, intertwining vocals by Elise Gouin and Nathalie Gauvin lend an ethereal air to the sometimes melancholy, sometimes lilting, sometimes driving melodies. Both women sound classically trained, but they do just enough whispering, chanting, and belting to remind listeners that this is no ordinary opera or musical theater piece. The most enjoyable pieces on this album are the slow, dramatic ones such as &quot;Egypte&quot; and &quot;Ulysse.&quot; The faster pieces lose something through the studio recording; the ethnic backing vocals and electric guitars tend to sound a little canned at times. Also, tracks such as &quot;Rondo&quot; and &quot;Kunya Sobe&quot; are intended to back high-energy acrobatic acts, and when you can&amp;#039;t see the acrobats, it&amp;#039;s hard to have a real appreciation for the music. However, overall this album is yet another triumph for Cirque du Soleil. ","torrent":{"xt":"urn:btih:1eaf827d8a01da358b7ac1e32454eb0443dca08e","amp;dn":"Cirque+Du+Soleil+%7E+Trology","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1eaf827d8a01da358b7ac1e32454eb0443dca08e","infoHashBuffer":{"type":"Buffer","data":[30,175,130,125,138,1,218,53,139,122,193,227,36,84,235,4,67,220,160,142]},"announce":[],"urlList":[]}}