{"title":"Smart PC Suite v2.0 Portable (Thinstall)","uid":4190822,"size":9302061,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:1ed8857270db72ab64dda3dfb963e1ecd759cb83&amp;dn=Smart+PC+Suite+v2.0+Portable+%28Thinstall%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoExcuses","files":1,"time":1210947385,"description":"  Smart PC Solutions Smart PC Suite v2.0 Portable (Thinstalled)\n\nNo need to install it.\n\nMore infos at:\n &lt;a href=&quot;\nhttp://www.smartpctools.com/smart_pc_suite/index1.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.smartpctools.com/smart_pc_suite/index1.html&lt;/a&gt;\n\n\n\nFIX YOUR PC PROBLEMS\n\n\nMake your PC run faster and ensure problem-free operation, protect your security and recover lost data with the only software suite you&amp;#039;ll ever need! Fix your computer yourself and make it load and run faster in a few easy steps. Clean up registry errors and take care of viruses and spyware, ensure your personal privacy and recover deleted files. Do all that and more with Smart PC Suite!\n\nFix your computer yourself! Smart PC Suite will detect, diagnose and repair all kinds of problems that may plague your PC. Maintain your system error-free and prevent system failures by using Smart PC Suite on a regular basis.\n\n\nMake your PC load and run faster in just a few minutes! Smart PC Suite optimizes startup programs and removes bloatware, manages memory and cleans up the hard disk.\n\nRegistry errors are the biggest cause of Windows slowdowns and reduced stability after viruses and malware. Clean up and fix your Windows registry in a few easy steps with Smart PC Suite to ensure maximum reliability and performance of your PC!\n\nDelete all personal information, cookies and browsing history from your PC to ensure maximum privacy. Smart PC Suite carefully analyzes your computer&amp;#039;s configuration in order to find and close any security or privacy holes.\n\nDeleted your recent work by an accident? Formatted or repartitioned your hard drive? Smart PC Suite restores your disk and recovers your data in a few easy steps! Recover files and data from computer hard disks, digital cameras, USB memory sticks and a variety of digital media cards\n\nSmart PC Suite automatically protects you from hi-tech threats such as viruses, spyware and malware by preventing the infection before they have a chance to cause harm or by cleaning your computer if it&amp;#039;s already exposed to the threat.\n\nCompatible Platforms: Windows NT/2000/XP/2003/Vista\n\n\n\nEnjoy and remember to seed... :o)\n\n","torrent":{"xt":"urn:btih:1ed8857270db72ab64dda3dfb963e1ecd759cb83","amp;dn":"Smart+PC+Suite+v2.0+Portable+%28Thinstall%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1ed8857270db72ab64dda3dfb963e1ecd759cb83","infoHashBuffer":{"type":"Buffer","data":[30,216,133,114,112,219,114,171,100,221,163,223,185,99,225,236,215,89,203,131]},"announce":[],"urlList":[]}}