{"title":"Railworks TS2016 DTG LMS Coronation","uid":12814297,"size":129388604,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:1f21e2a43d1dc294f8ec4ca73a925c69b467f0ee&amp;dn=Railworks+TS2016+DTG+LMS+Coronation+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TS2015","files":1,"time":1448217588,"description":"Once a record-breaking steam locomotive admired by many on the UK’s rail network, the LMS Coronation Class ‘Duchess of Hamilton’ comes to Train Simulator in its striking streamlined variant. \r\n\r\nThe LMS Coronation Class was a mainline steam locomotive designed by William Stanier and built at Crewe Works between 1937 and 1948. In total, 38 were produced and are the most powerful steam locomotives ever built in the UK, with an impressive 3,333hp - more than the diesel traction that replaced them in later years. \r\n\r\nThe first five locomotives built in the Class were painted in Caledonian Railway blue with sliver stripes to match the coaches for the Coronation Scot service, for which they were designed for. They also featured streamlining, designed by Tom Coleman, the streamlining mainly added as a publicity stunt. However, Stanier believed the added weight, increased difficulty for maintenance and the fact that it just wasn’t effective at lower speeds, didn’t make it worthwhile. \r\n\r\nIn 1937 during speed trials, Coronation Class No. 6220 reached an impressive 114 mph (183km/h) south of Crewe, setting a new record speed at the time. However, shortly after reaching this speed, the locomotive entered a series of crossover points and with insufficient braking distance, entered the crossover too fast. Fortunately, the locomotive remained on the rails but destroyed most of the crockery inside the coaches. As a consequence, record-breaking runs were deemed too dangerous for passengers, crew and trains alike, and they were subsequently banned. \r\n\r\nThe second batch of five Coronations was also streamlined, apart from the more traditional Crimson Lake with gold stripes livery, one such locomotive being No. 6229 ‘Duchess of Hamilton’. The ‘Duchess’ was built in 1938 and was the last in the Coronation Class to be built with streamlining. Nine years later, ‘Duchess of Hamilton’ had its streamlining removed and smoke deflectors added. \r\n\r\nToday, three Coronation Class locomotives have been preserved, No. 6229 ‘Duchess of Hamilton’, No. 6233 ‘Duchess of Sutherland’ and No. 6235 ‘City of Birmingham’. ‘Duchess of Sutherland’ remains in mainline service on railtours around the UK, while ‘City of Birmingham’ and ‘Duchess of Hamilton’ are static displays in museums, the latter alongside LNER A4 Class ‘Mallard’ at the National Railway Museum in York, resplendent in its original streamlining. \r\n\r\n\r\n\r\n\r\nTHIS ADDON WILL NOT WORK ON LEGIT TRAIN SIMUALTOR 2016!!!!","torrent":{"xt":"urn:btih:1f21e2a43d1dc294f8ec4ca73a925c69b467f0ee","amp;dn":"Railworks+TS2016+DTG+LMS+Coronation+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"1f21e2a43d1dc294f8ec4ca73a925c69b467f0ee","infoHashBuffer":{"type":"Buffer","data":[31,33,226,164,61,29,194,148,248,236,76,167,58,146,92,105,180,103,240,238]},"announce":[],"urlList":[]}}