{"title":"The Who - High Numbered (More BBC And TV- Sessions 1965-1970) (B","uid":4202389,"size":400947658,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:203fb93a5e0698032eb29bedd5a969f59ceace65&amp;dn=The+Who+-+High+Numbered+%28More+BBC+And+TV-+Sessions+1965-1970%29+%28B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"SergioPlayboy","files":30,"time":1211574236,"description":"The concept behind this bootleg is a decent one: to gather early Who radio and TV recordings that have not been officially released. For plugging holes in the archives, it has its satisfactions, but as a listening experience, it\\&amp;#039;s mostly for the diehards. The 1965 television shows are interesting in that they provide documentary evidence of how the Who sounded live as they began their recording career, and the performances are good (though one, \\&quot;Anyway, Anyhow, Anywhere\\&quot; on Ready, Steady, Go, seems to be the same track that came out officially on the soundtrack to The Kids Are Alright). But the sound is only fair to lousy, which is too bad, as the live versions of \\&quot;Shout and Shimmy,\\&quot; a substantially different arrangement of \\&quot;My Generation\\&quot; (from August 1965, prior to the single\\&amp;#039;s release), and Marvin Gaye\\&amp;#039;s \\&quot;Baby, Don\\&amp;#039;t You Do It\\&quot; (from December 1965, not the B-side that was officially released from an early-\\&amp;#039;70s concert) are rare and intriguing. On the other hand, the 1966 BBC version of \\&quot;So Sad About Us\\&quot; is good in both performance and fidelity respects, as are the three songs done in London\\&amp;#039;s Marquee club in March 1967 (not March 1969, as the liner notes claim) for the German Beat Club program. The late-1967 BBC versions of songs from the era of The Who Sell Out sound like the studio versions, except for a take of \\&quot;Our Love Was\\&quot; with a different, country-ish guitar solo. The half-dozen BBC songs from April 1970 likewise seem mostly or totally comprised of remixed official studio versions, and the four songs from a live 1964 show have long been available on bootlegs that actually include more material from that same gig. The Pete Townshend TV interview from early 1966, at least, does demonstrate that his opinions of the group and its significance flip-flopped maniacally even at the dawn of his stardom.\n\nRichie Unterberger, All Music Guide\n\n\n\nEAC Log, Cue &amp; Complete Artwork Included.\n\nEnjoy! ","torrent":{"xt":"urn:btih:203fb93a5e0698032eb29bedd5a969f59ceace65","amp;dn":"The+Who+-+High+Numbered+%28More+BBC+And+TV-+Sessions+1965-1970%29+%28B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"203fb93a5e0698032eb29bedd5a969f59ceace65","infoHashBuffer":{"type":"Buffer","data":[32,63,185,58,94,6,152,3,46,178,155,237,213,169,105,245,156,234,206,101]},"announce":[],"urlList":[]}}