{"title":"H.R. Pufnstuf: Live at the Hollywood Bowl    Guest Stars: Brady","uid":4231467,"size":576785920,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:20d5edcd9ffc836bc6967e42e9f9dbbc3adb2943&amp;dn=H.R.+Pufnstuf%3A+Live+at+the+Hollywood+Bowl++++Guest+Stars%3A+Brady+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SlumLord301","files":1,"time":1213072400,"description":"Plot Synopsis\tby Steve Blackburn\n\nThis is a video of a 1973 live musical stage show featuring puppets and humans, based on a half-hour Saturday morning TV series. Produced by Sid and Marty Krofft, H.R. Pufnstuf was popular Saturday fare on NBC from 1969 to 1971. Although only 17 30-minute episodes of H.R. Pufnstuf were produced, it was popular enough to generate a major motion picture, Pufnstuf (1970), and this Hollywood Bowl performance two years after the series&amp;#039; cancellation. Starring Jack Wild, who had played the Artful Dodger in 1968&amp;#039;s Academy Award-winning musical motion picture Oliver!, the children&amp;#039;s TV series was a musical fantasy, featuring original numbers, about a boy named Jimmy (Jack Wild) and his magic flute Freddie, and their adventures on Living Island, a realm populated by lovable life-sized puppets, but where also lurked and plotted the evil Witchiepoo and her minions. The Hollywood Bowl production co-stars Johnny Whitaker, then starring in his own Krofft series, Sigmund and the Sea Monsters, and who earlier played the character Jody on the TV series Family Affair. The Hollywood Bowl production also includes the Krofft puppets from the Lidsville TV series, and a singing appearance by the fictional Brady Bunch Kids.","torrent":{"xt":"urn:btih:20d5edcd9ffc836bc6967e42e9f9dbbc3adb2943","amp;dn":"H.R.+Pufnstuf%3A+Live+at+the+Hollywood+Bowl++++Guest+Stars%3A+Brady+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"20d5edcd9ffc836bc6967e42e9f9dbbc3adb2943","infoHashBuffer":{"type":"Buffer","data":[32,213,237,205,159,252,131,107,198,150,126,66,233,249,219,188,58,219,41,67]},"announce":[],"urlList":[]}}