{"title":"Freeway 5 Pro","uid":4132182,"size":56013107,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:21658f560caf0153dc26c2d7cd853167ae2cff90&amp;dn=Freeway+5+Pro&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eSnCe","files":1,"time":1208093197,"description":"Freeway 5 Pro is...\nThe fastest Web design tool\nDesign exactly what you see in your minds eye. Simply draw the page the way you want it to appear, and publish. Freeway calculates the most efficient layout code possible to reproduce your vision on the widest range of browsers and operating systems.\n\nStay close to your design by making graphic headlines, cropping, rotating, or scaling photographs and illustrations right in your layout.\n\nUse site-wide spell check and find-and-replace even spell-check your graphic headlines all without leaving Freeways legendary WYSIWYG design view.\n\nImport graphics in nearly any raster or vector format, and almost any resolution or size. Freeway 5 automatically compresses and resamples high-resolution artwork without changing the original files.\n\nUse multimedia content like QuickTime, Flash, and Director just as easily as any other graphic format.\n\nSimply drag-and-drop or draw a content frame and import it truly is the same as desktop publishing.\nPrecision layout without pain\nUnlike so-called WYSIWYG HTML editors, Freeway isn&amp;#039;t editing code as it goes. In fact, each time you publish a change, Freeway 5 throws out the old code and re-writes from scratch. There&amp;#039;s never a chance of a compromise or old code messing with your design.\n\nThe same layout in Freeway can be output in XHTML Strict or HTML 3.2, or anything in between, without changing your original layout. Within reason, it will look the same in a browser, too!\n\nAnd because you create an entire site in one Freeway document, its virtually impossible to make a bad link between pages. Freeway 5 Pro can even edit the links inside of Flash movies, so you can make navigation bars that constantly stay up-to-date, without having to open or edit the original Flash document.\nFlexible and extensible\nUse standard or custom Freeway Actions (plug-ins) to automate the production process. Never write the same code twice and avoid the mistakes inherent in hand-coding.\n\nFreeway 5 can also use Photoshop plug-ins to drive a scanner from directly within your design.\n\nUse the PHP Action Suite to automate your Web application projects. Even set up a workflow where a programmer can be making updates to the back-end while a designer changes the layout without stepping on each others work.\n\n","torrent":{"xt":"urn:btih:21658f560caf0153dc26c2d7cd853167ae2cff90","amp;dn":"Freeway+5+Pro","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"21658f560caf0153dc26c2d7cd853167ae2cff90","infoHashBuffer":{"type":"Buffer","data":[33,101,143,86,12,175,1,83,220,38,194,215,205,133,49,103,174,44,255,144]},"announce":[],"urlList":[]}}