{"title":"AeroFighters Assault [PAL - Wii - VC]","uid":4178483,"size":30385404,"categoryP":"games","categoryS":"wii","magnet":"?xt=urn:btih:223607877632278dc58851a8790df0498833698b&amp;dn=AeroFighters+Assault+%5BPAL+-+Wii+-+VC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TMasGames","files":2,"time":1210270973,"description":"AeroFighters Assault \t\n\n\nCategoria: Wii Virtual Console\n\nIdioma: Ingles \n\nTamaÃƒÂ±o: 28.9 MB\n\nFormato: WAD \n\nZona: PAL \n\nDescripciÃƒÂ³n:\n\nAeroFighters Assault is a fighting airplane shooter for the Nintendo 64, released in August 1997. It pits a group of four pilots going after a fictional world-dominating organization Phutta Morgana. It is the latest game in the Aero Fighters series (known as Sonic Wings in Japan). The game is arcade style, meaning that the object is to go through the entire game and score as many points as possible. Points are awarded for having all wingmen survive, how many defensive countermeasures and special weapons are have remaining, and how many hits the plane has remaining when the stage ends. In many cases, earning high point values yields unlocking a bonus mission during gameplay, with a total of 4 bonus missions in all. There are 4 aircraft to choose from at the beginning, each with a different special weapon and missile type. Two more aircraft can be unlocked; one via push-button code, and the other by successfully completing all of the missions in the game including the bonus missions. AeroFighters Assault contains a two-player deathmatch option in which to players face off against each other. Additional planes can also be unlocked for the multiplayer mode based on progress in the single player campaign. The game has been listed on the ESRBÃ‚Â´s website as being a Virtual Console title.","torrent":{"xt":"urn:btih:223607877632278dc58851a8790df0498833698b","amp;dn":"AeroFighters+Assault+%5BPAL+-+Wii+-+VC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"223607877632278dc58851a8790df0498833698b","infoHashBuffer":{"type":"Buffer","data":[34,54,7,135,118,50,39,141,197,136,81,168,121,13,240,73,136,51,105,139]},"announce":[],"urlList":[]}}