{"title":"Animals in Translation - Using the Mysteries of Autism to Decode","uid":4082874,"size":168841001,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:23ee1005f933f31ccf758c94fc917d69efe5faed&amp;dn=Animals+in+Translation+-+Using+the+Mysteries+of+Autism+to+Decode&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"arzendiq","files":239,"time":1205652412,"description":"Animals in Translation - Using the Mysteries of Autism to Decode Animal Behavior\nby Temple Grandin and Catherine Johnson\n\nTemple Grandin&amp;#039;s Animals in Translation speaks in the clear voice of a woman who emerged from the other side of autism, bringing with her an extraordinary message about how animals think and feel.\n\nTemple&amp;#039;s professional training as an animal scientist and her history as a person with autism have given her a perspective like that of no other expert in the field. Standing at the intersection of autism and animals, she offers unparallelled observations and groundbreaking ideas about both.\n\nAutistic people can often think the way animals think - in fact, Grandin and co-author Catherine Johnson see autism as a kind of was station on the road from animals to humans - putting autistic people in the perfect position to translate &quot;animal talk&quot;. Temple is a faithful guide into their world, exploring animal pain, fear, aggression, love, friendship, communication, learning, and yes, even animal genius. Not only are animals much smarter than anyone ever imagined, in some cases animals are out-and-out brilliant.\n\nThe sweep of Animals in Translation is immense, merging an animal scientist&amp;#039;s thirty years of study with her keen perceptions as a person with autism - Temple sees what others cannot. Temple Grandin is like no other author on the subject of animals because of her training and because of her autism: understanding animals is in her blood and in her bones.\n\nUnabridged, 12 hours on 10 Cds.  \nVBR 22KHz mono Ogg Vorbis","torrent":{"xt":"urn:btih:23ee1005f933f31ccf758c94fc917d69efe5faed","amp;dn":"Animals+in+Translation+-+Using+the+Mysteries+of+Autism+to+Decode","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"23ee1005f933f31ccf758c94fc917d69efe5faed","infoHashBuffer":{"type":"Buffer","data":[35,238,16,5,249,51,243,28,207,117,140,148,252,145,125,105,239,229,250,237]},"announce":[],"urlList":[]}}