{"title":"Therapy? - Suicide Pact - You First","uid":4194342,"size":104672201,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:24fe20f4ab31d98a6227dee04c452eec0a4d3ec5&amp;dn=Therapy%3F+-+Suicide+Pact+-+You+First&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"billy_stretcher","files":16,"time":1211137015,"description":"Therapy?\nSuicide Pact - You First\nAlt.Metal/Rock\n2000\n192Kbps\n\n1.He&amp;#039;s Not That Kind Of Girl \n2.Wall Of Mouths \n3.Jam Jar Jail \n4.Hate Kill Destroy \n5.Big Cave In \n6.Six Mile Water \n7.Little Tongues First \n8.Ten Year Plan \n9.God Kicks \n10.Other People&amp;#039;s Misery \n11.Sister\nHidden Track.Whilst I Pursue My Way Unharmed \n\nFront, Back, Inside, CD Covers And Inlay Included.\n\n\nAccording to frontman Andy Cairns, Therapy?&amp;#039;s new album, Suicide Pact - You First, takes its title from a book called Five Days In Hell by English Kafka-esque author Rupert Thompson. One of the main characters wears a t-shirt with Suicide Pact written on the front and You First on the back. I thought it was kinda funny, says Cairns. It would be really easy in this day and age of fucked-up childhood, big-shorts rock to simply call the album Suicide Pact, but we had to be contrary!\n\nIf you&amp;#039;ve come to Therapy? late in their career, seduced by the last two, comparatively melodic, albums, Infernal Love and Semi-Detached, best give Suicide Pact - You First a wide berth. Because following two serious blows their previous record company collapsed last year following the release of Semi-Detached, and drummer Graham Hopkins broke his arm as they started work on the follow up the band have returned with a new deal and they&amp;#039;re madder than hell!\n\nFull of unexpected rhythmic patterns and vocals so unhinged that you fear for Andy Cairns mental health, the bands Big Black/Husker Du influences are well to the fore as they power their way through an album that is unrelentingly dark and intense. Yet, if you return to Semi-Detached, you can see how Suicide Pact is a progression from it, allowing the brutal energy that was only barely reined in on the former free expression on the latter.\n\nThe more compulsive tracks include Jam Jar Jail, the catchy chorus standing out in a song as subtle as a motorway pile-up; Hate Kill Destroy with its monstrous riffs; Sister, full of claustrophobic echoes; and the haunting starkness of Six Mile Water. The guitars sound fantastic throughout, ringing out loud and clear, but it&amp;#039;s a pity that this is sometimes at the expense of Andy Cairns vocals.\n\nAnd speaking of vocals, the instrumental Big Cave In, plonked in the middle of the album could really do with some. As it stands, it sounds like the soundtrack to a chase scene which you know will have a nasty ending rather like this album, the 13-minute hidden track, Whilst I Pursue My Way Unharmed, being the stuff of nightmares.\n\nSuicide Pact takes a few listens to get into, and I suspect the songs will gain even more potency when played live, but fair play to Therapy? for once again spitting in the face of the easy option.\n\nEnjoy! :)\n","torrent":{"xt":"urn:btih:24fe20f4ab31d98a6227dee04c452eec0a4d3ec5","amp;dn":"Therapy%3F+-+Suicide+Pact+-+You+First","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"24fe20f4ab31d98a6227dee04c452eec0a4d3ec5","infoHashBuffer":{"type":"Buffer","data":[36,254,32,244,171,49,217,138,98,39,222,224,76,69,46,236,10,77,62,197]},"announce":[],"urlList":[]}}