{"title":"Numb 2007 DVDSCR XviD-VoMiT","uid":4094271,"size":735070364,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:278769c1c290ad3191883d0048f486f4f143b351&amp;dn=Numb+2007+DVDSCR+XviD-VoMiT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":2,"time":1206223887,"description":"Numb (2007)\n\nVideo Codec: XviD-1.1.2-01112006\nVideo Bitrate: 906 kbps\nAudio Codec: MP3 VBR Stereo\nAudio Bitrate: 130 kbps\nAspect Ratio: 1.81:1\nResolution: 640 x 352\nFrame Rate: 23.976 fps\nGenre: Comedy/Drama\nRuntime: 93 mins\nRAR Count: 50x15\nAudio Language: English\nSubtitles: N/A\nDVD Date: 05.13.2008\nRelease Date: 03.21.2008\nTheater Date: 04.30.2007\nIMDB Rating: 7.6/10 (154 votes) &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0795439&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0795439&lt;/a&gt;\n\nA chronically depressed screenwriter desperately tries to cure his condition when he meets the girl of his dreams.\n &lt;a href=&quot;\nhttp://www.amazon.com/Numb-Matthew-Perry/dp/B0014Z4OM0/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Numb-Matthew-Perry/dp/B0014Z4OM0/&lt;/a&gt;\n\nJeffAbu Blog Numb is, in reality (or unreality) a wake up call There are movies that, in time, garner a cult following, for reasons most people can&amp;#039;t fathom, or don&amp;#039;t care too. This is likely to happen with Harris Goldberg&amp;#039;s &quot;Numb.&quot; The scant reviews emerging from the Tribeca Film Festival thus far have pointed out that the script is pretty much autobiographical, based on Harris Goldberg&amp;#039;s own experience with something called Depersonalization, triggered by pot. Sounds like a pretty extreme and rare reaction to weed, and a pretty weak premise on which to base an entire movie, right? No. Just the opposite. Depersonalization Disorder is something quite real, and a condition that, incredibly, affects more people than either schizophrenia or bi-polar disorders. Yet few people, even relatively few health professionals have ever heard of it. It can be triggered by various forms of stess or trauma, as well as things like LSD and marijuana. The confusion, frustration and inability to deal with &quot;normal&quot; life that often marks DPD is portrayed beautifully by Matthew Perry, whose eyes, at times reveal the void left behind by a soul that has simply disappeared. Lack of affect, &quot;numbness&quot; is just one of many symptoms of depersonalization, but it is likely the one most movie viewers can relate to, and perhaps, the simplest to portray. In this sense, Harris Goldberg has wisely avoided extensive diving into the fearfully negative and hopeless waters of DPD. Instead, he gives us important glimpses into the overall angst of the condition as well as the sufferer&amp;#039;s desperate efforts to resume a &quot;normal&quot; life. And he manages to do this within a comedic context. DPD is NOT depression, you see, nor is it humorless. People with the condition are often highly intelligent, and more often than not, they can exhibit extreme insight and a biting wit, simply because their ego, or lack thereof, never stands in the way. Ultimately, this film marks the very first mention of Depersonalization Disorder on the big screen. It is the first depiction of someone who has it. On top of it, Goldberg has generously shown Perry reading the only authoritative book on the condition &quot;Feeling Unreal&quot; right in the middle of the film. Creating this film, which is funny and highly entertaining by any standard, marks a singlar act of courage on the part of the writer/director. According to Hollywood: Everyone knows that pot is always harmless, right? Wrong. According to the medical profession: Depersonalization is just a symptom of some other condition, right. Wrong again. Goldberg has, if nothing else, boldly stated these truths by tickling the funnybone rather than the temporal lobe. Literally millions of people already know these truths, and therein lies the film&amp;#039;s audience, for a long long time. posted on Sunday, May 13, 2007 11:34 PM by JeffAbu\n\n\n","torrent":{"xt":"urn:btih:278769c1c290ad3191883d0048f486f4f143b351","amp;dn":"Numb+2007+DVDSCR+XviD-VoMiT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"278769c1c290ad3191883d0048f486f4f143b351","infoHashBuffer":{"type":"Buffer","data":[39,135,105,193,194,144,173,49,145,136,61,0,72,244,134,244,241,67,179,81]},"announce":[],"urlList":[]}}