{"title":"(Post-Hardcore) Planes Mistaken for Stars (EP) (Deep Elm)","uid":4122613,"size":25578591,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:27bf5a635c5b399021cf7b4af8b3bf832b2cffdc&amp;dn=%28Post-Hardcore%29+Planes+Mistaken+for+Stars+%28EP%29+%28Deep+Elm%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Falleen_Fan_No_1","files":9,"time":1207629148,"description":"Planes Mistaken for Stars (also known as Planes or PMFS) was a post-hardcore band formed in Peoria, Illinois in 1997. They released music on Deep Elm Records, No Idea Records and Abacus Recordings.\n\nThey began as an aggressive, melodic post-hardcore band, but has since abandoned the genre somewhat to an extent debated by both the band&amp;#039;s fans and critics.\n\nLead singer and guitarist Gared O&amp;#039;Donnell started the band with guitarist Matt Bellinger, bassist Aaron Wise, and drummer Mike Ricketts. Shortly after the band self-released a self-titled EP, Wise was replaced by Jamie Drier. At this time Deep Elm offered to repackage and distribute the EP which was re-released in the spring of &amp;#039;99.\n\n\nIn July 2007, Planes Mistaken for Stars announced that they had broken up. They performed their final concert on February 16, 2008 at the Marquis Theater in Denver. Chuck French and Neil Keener are together in a group called Git Some, while Gared O&amp;#039;Donnell is in a project titled Hawks and Doves.\n\nTrack Listing:\n\n01. Copper &amp; Stars \n02. Division \n03. The Time It Took\n04. The Past Two \n05. Somewhere In September\n06. Standing Still Fast\n07. Knuckle Hungry\n08. Where The Arrow Went Out\n\nPMFS drags you under...and never lets you up for more than a trace of air. A defiant mix of graphic vocals, aggressive screams and churning guitars that burns and smolders of raw post-hardcore emotion. The vocal dueling is incredible. &quot;Melodic but so intense they&amp;#039;ll rip you to shreds.&quot; From Denver, PMFS loudly stomp and quietly crawl, playing each show like it&amp;#039;s their last. You&amp;#039;ll be nothing less than amazed. \n\n&quot;Here we have another incredible release from Deep Elm, my affection for them is increasing rapidly. I guess the best way to describe this band is scrEMO-core at it&amp;#039;s finest. The thing that did it so much for me was how PMFS can play angry, harsh, growling melodic hardcore at 700 miles per hour and then suddenly play the most heartfelt intricate, undistorted section you have ever heard, and then resume back to the insane intense hardcore. We are talking musical ambivalence at it&amp;#039;s best here, and oh is it good.&quot; - Collective\n\nFor lyrics, go here: http://www.deepelm.com/planesmistakenforstars/\nMyspace: \nWikipedia: &lt;a href=&quot; http://en.wikipedia.org/wiki/Planes_Mistaken_for_Stars&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://en.wikipedia.org/wiki/Planes_Mistaken_for_Stars&lt;/a&gt;\n\nif you like this, check out my other torrents.  I only upload quality stuff!\n\n","torrent":{"xt":"urn:btih:27bf5a635c5b399021cf7b4af8b3bf832b2cffdc","amp;dn":"%28Post-Hardcore%29+Planes+Mistaken+for+Stars+%28EP%29+%28Deep+Elm%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27bf5a635c5b399021cf7b4af8b3bf832b2cffdc","infoHashBuffer":{"type":"Buffer","data":[39,191,90,99,92,91,57,144,33,207,123,74,248,179,191,131,43,44,255,220]},"announce":[],"urlList":[]}}