{"title":"Marc Ribot - Live At The Village Vanguard (2014) [EAC-FLAC]","uid":12735150,"size":424074142,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:27f5670af29d5a89b43db9ec2d605db178a0d689&amp;dn=Marc+Ribot+-+Live+At+The+Village+Vanguard+%282014%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"pucholoco","files":13,"time":1447167056,"description":"Marc Ribot - Live At The Village Vanguard (2014) \r\n             EAC rip (secure mode) | FLAC (tracks)+CUE+LOG -&gt; 417 Mb \r\n                     Full Artwork @ 300 dpi (jpg) -&gt; 8 Mb\r\n\r\n\r\nIt might be more concise to list what musical genres Marc Ribot hasn't explored than the ones he has, but his approach to the guitar has often reflected the freedom, reinvention, and elastic boundaries of jazz, no matter what the specific context. On this date, recorded in mid-2012 during a handful of shows at one of New York's most iconic venues, Ribot gives himself the luxury of stretching out with a pair of gifted accompanists, bassist Henry Grimes (who worked with Albert Ayler, one of Ribot's key influences) and drummer Chad Taylor (a veteran of the Chicago Underground Duo and Trio), and the result is one of Ribot's most explicitly jazz-focused dates in some time.\r\n\r\nLive at the Village Vanguard certainly embraces Ribot's particular tastes in jazz, featuring two Ayler compositions (&quot;The Wizard&quot; and &quot;Bells&quot;) as well as two pieces recorded by John Coltrane (&quot;Sun Ship&quot; and &quot;Dearly Beloved&quot;) and a pair of old standards (&quot;Old Man River&quot; and &quot;I'm Confessin' [That I Love You]&quot;). \r\n\r\nIn the grand tradition of the genre, the key here is the interplay between the musicians, not simply the bandleader, though the sharp report of Ribot's tone and the volleys of notes he fires off during the more extreme passages will sound more than familiar to anyone acquainted with his work. On the standards, Ribot, Grimes, and Taylor may seem relaxed, but they dig deep into the melodies and find rich, expressive treasure despite the deceptively accessible surfaces. And as the trio explores the selections from Coltrane and Ayler's songbooks, the communication between the players is total, with each in full flight as individuals and as a group, honoring the masters and finding a voice of their own at the same time. \r\n\r\nThe great free jazz guitarist Sonny Sharrock once quipped that he didn't consider himself a guitarist, but a sax player with a very messed-up horn; Live at the Village Vanguard suggests a bit of the same thinking lurks inside Mark Ribot, but in spite of that, he and his axe seem to be getting along just fine.\r\n\r\n---------------------------------------------------------------------------------\r\nTracklist:\r\n---------------------------------------------------------------------------------\r\n\r\n01. Dearly Beloved\r\n02. The Wizard\r\n03. Old Man River\r\n04. Bells\r\n05. I'm Confessin' (That I Love You)\r\n06. Sun Ship\r\n\r\n*2014 Pi Recordings | PI 53\r\n\r\nPersonnel:\r\nGuitar Marc Ribot\r\nDrums Chad Taylor\r\nBass Henry Grimes\r\n\r\n\r\nEnjoy and Sharing, Thanks!","torrent":{"xt":"urn:btih:27f5670af29d5a89b43db9ec2d605db178a0d689","amp;dn":"Marc+Ribot+-+Live+At+The+Village+Vanguard+%282014%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"27f5670af29d5a89b43db9ec2d605db178a0d689","infoHashBuffer":{"type":"Buffer","data":[39,245,103,10,242,157,90,137,180,61,185,236,45,96,93,177,120,160,214,137]},"announce":[],"urlList":[]}}