{"title":"LimeWire Pro 4.18.1 - Final","uid":4221895,"size":7326792,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:28df83dc17b448c63265c2d73153f9c43b220f6a&amp;dn=LimeWire+Pro+4.18.1+-+Final&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"1988keneth","files":1,"time":1212631193,"description":"LimeWire - The Fastest P2P File Sharing Program\non the Planet, running on the Gnutella Network. It is open standard software running on an open protocol, free for the public to use. LimeWire allows you to share any file such as.mp3s, .avis, jpgs, tiffs, etc., allows you to search for multiple files at the same time, available in several different languages, and is most famous for its ease-of-use and cross-platform compatibility. Limewire is written in Java, and will run on Windows, Macintosh, Linux, Solaris, and other computing platforms. \n\n1. NO BUNDLED SOFTWARE OF ANY KIND! No spyware. No adware. Guaranteed. \n2. Firewall to Firewall Transfers. Since about 60% of users are currently firewalled, this feature greatly increases the amount of content on the network. \n3. Faster network connections. Using new &quot;UDP Host Caches&quot;, LimeWire starts up and connects faster then ever before! \n4. Universal Plug &amp;#039;N Play. UPnP support allows LimeWire to find more search results and have faster downloads. \n5. iTunes Integration. Windows users can now take advantage of LimeWire&amp;#039;s iTunes integration. \n6. Creative Commons Integration. LimeWire now recognizes OGGs and MP3s licensed under a Creative Commons License. \n7. &quot;What&amp;#039;s New?&quot; feature. Users can browse the network for the most recent content additions. \n8. Search drill down results. Searches in LimeWire now immediately display the artists, albums and other information that fully describes files. \n9. Proxy support. Users can now use web proxies to route their to protect their identity. \n10. Support for International searches and International groups. Users can now search in any language, and LimeWire ensures that a user will be connected to other users with their own language to aide international users to receive search results in their native language and to find content from sources that are close to home. \n\nLimeWire still has the following great features: \n- Ease of use - just install, run, and search \n- Ability to search by artist, title, genre, or other metainformation \n- Elegant multiple search tabbed interface \n- &quot;Swarm&quot; downloads from multiple hosts help you get files faster \n- iTunes integration for Mac and Windows users \n- Unique &quot;ultrapeer&quot; technology reduces bandwidth requirements for most users \n- Integrated chat \n- Directly connect to a computer \n- Browse host feature--even works through firewalls \n- Added Bitzi metadata lookup \n- International versions: Now available in many new languages \n- Connects to the network using GWebCache, a distributed connection system \n- Automatic local network searches for lightning-fast downloads \n- Support for MAGNET links that allow you to click on web page links that access Gnutella \n\nLimeWire PRO get turbo-charged  \n\nFastest P2P downloads on the planet \nNo spyware, adware, or bundled software \nBuilt-in media player \nDownloads from multiple hosts \nInternational versions \nWindows, Mac and Linux compatible \n\nWith Pro \nOptimized search results \nTurbo-charged downloads \nConnections to more sources \nMore Reliable Downloads \nSpecial PRO only skin \n &lt;a href=&quot;\nhttp://www.limewire.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.limewire.com&lt;/a&gt; \n","torrent":{"xt":"urn:btih:28df83dc17b448c63265c2d73153f9c43b220f6a","amp;dn":"LimeWire+Pro+4.18.1+-+Final","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"28df83dc17b448c63265c2d73153f9c43b220f6a","infoHashBuffer":{"type":"Buffer","data":[40,223,131,220,23,180,72,198,50,101,194,215,49,83,249,196,59,34,15,106]},"announce":[],"urlList":[]}}