{"title":"Motorola Mobile Phone Tools 4.0 EspaÃƒ?Ã‚Â±ol (spanish)","uid":4064854,"size":751374400,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:2983243ea8225e8b549c0295f3aaa9ca0f618176&amp;dn=Motorola+Mobile+Phone+Tools+4.0+Espa%C3%83%3F%C3%82%C2%B1ol+%28spanish%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xolalpaz","files":1,"time":1204753191,"description":"Motorola Mobile Phone Tools para Windows, perfecto funcionamiento y totalmente en espaÃƒ?Ã‚Â±ol, cualquier error que muestre la aplicacion no es de la misma si no del telefono.\n\nLos celulares motorola son algo remilgosos y probablemente no detectara el celular o se estara desconectando constantemente al querer transferir o extraer archivos del celular, por lo que tendran que actualizar la aplicacion una vez instalada, desde el menu INICIO de Windows y buscar la categoria en el menu segun su version de Windows y seleccionar MOTOROLA UPDATE.\n\nSon 4 actualizaciones y una vez descargadas obviamente tendran que instalarlas, hecho esto.\n\nSi el celular sigue generando el mensaje de error en la aplicacion, entonces volver a abrir desde menu INICIO de Windows y buscar las nuevas aplicaciones que se agregaron Motorola Mobile y seleccionar la aplicacion que segun el nombre (no recuerdo ahora) sea para detectar e instalar los nuevos modelos de celulares.\n\nUna vez hecho esto no tendra por que aparecer ningun error a excepcion de que el celular este daÃƒ?Ã‚Â±ado ya sea de el SW o del puerto USB del celular.\n\nEl archivo es una imagen ISO para guardar en un CD o montar desde Alcohol o PowerIso\n\nComenten","torrent":{"xt":"urn:btih:2983243ea8225e8b549c0295f3aaa9ca0f618176","amp;dn":"Motorola+Mobile+Phone+Tools+4.0+Espa%C3%83%3F%C3%82%C2%B1ol+%28spanish%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2983243ea8225e8b549c0295f3aaa9ca0f618176","infoHashBuffer":{"type":"Buffer","data":[41,131,36,62,168,34,94,139,84,156,2,149,243,170,169,202,15,97,129,118]},"announce":[],"urlList":[]}}