{"title":"After Dark Horrorfest 2007 - 8 Films to Die For DVDRip","uid":4210922,"size":8435838989,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:29a747bc1cf96d5b8d07a5421cf88e45b9a3d318&amp;dn=After+Dark+Horrorfest+2007+-+8+Films+to+Die+For+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"circlensess","files":27,"time":1212066274,"description":"After Dark Horrorfest - 8 Films to Die For\n\nBORDERLAND. File Size: 1.13 GB\nCRAZY_EIGHTS. File Size: 875.59 MB\nDEATHS_OF_IAN_STONE. File Size: 956.10 MB\nLAKE_DEAD. File Size: 991.90 MB\nMULBERRY_STREET. File Size: 922.92 MB\nNIGHTMARE_MAN. File Size: 980.30 MB\nTOOTH_AND_NAIL. File Size: 1.01 GB\nUNEARTHED. File Size: 1.00 GB\n\nCombined File Size: 7.86 GB\nPiece Size: 4.00 MB\n\n-------------------------------------------------------------------\nHomepage : http://www.horrorfestonline.com/ (To buy the DVDs)\nTrailer  : http://www.dejavurl.com/trailers/horrorfest-2007-8-films/\n\nMonsters are on the minds of the eight directors whose films comprise the 2007 After Dark HorrorFest, which arrives on DVD in an eight-disc set as well as single-disc editions. And it&amp;#039;s interesting to note that while there are plenty of traditional monsters on display, from the vengeful spirits of Crazy Eights and Nightmare Man to the rampaging alien in Unearthed, the majority of the creatures causing havoc in the 2007 HorrorFest are all too human, which underscores one of the key functions of the horror genre: to give a face to society&amp;#039;s darkest and most pressing fears. The best showcase for these human beasts is Jim Mickle&amp;#039;s urban creepshow Mulberry Street, which details the outbreak of a rat-borne virus that turns New York City residents into rodent-like mutants. The monsters themselves are actually the least effective part of the film; rather, it&amp;#039;s Mickle&amp;#039;s ability to create both a slow-boiling panic and believable characters on a shoestring budget that gives his picture the advantage over the others in the fest. Less agreeable is Borderland, a well-photographed but mildly xenophobic splatterfest about American college students who run afoul of bloodthirsty Mexican Satanists, while Lake Dead and Tooth and Nail recycle overly familiar horror tropes (mutant hillbillies vs. city folk in , and cannibals vs. apocalypse survivors in Tooth). Of the two, Tooth is the more appealing thanks to its name cast (Michael Madsen, Robert Carradine, Vinnie Jones), while Lake offers little more than unrelieved sadism and sexual violence.\n\nThe Deaths of Ian Stone offers the fest&amp;#039;s most intriguing premise--after a terrible accident, a young man (Mike Vogel of Cloverfield) discovers that he is being reborn as different people, only to suffer an even worse fate with each reincarnation--though the reasons for his condition and the introduction of monsters to the story are ill-conceived and ill-advised. As for the remaining titles, Unearthed is simply Alien in the desert (ground already covered with panache by Feast), while Nightmare Man is a HD-lensed supernatural slasher from the usually reliable Rolfe Kanefsky (The Hazing) that&amp;#039;s enlivened only by the presence of B-movie stalwart Tiffany Shepis. With so much varying quality in the entries, what the 2007 HorrorFest needed was a rock-solid entry by an established talent, like Nacho Cerda&amp;#039;s The Abandoned and Takashi Shimuzi&amp;#039;s Reincarnation, which gave some spark to the 2006 festival. Judging by the tepid box office response to this series, stronger names or more careful selection of titles will be necessary for the HorrorFest to remain an annual event. Unlike the 2006 HorrorFest DVD releases, only a handful of the 2007 festival&amp;#039;s discs offer extras. It seems odd that two of the weakest entries--Borderland and Nightmare Man--are the only discs to feature substantial supplemental features, including director and cast commentary, deleted scenes, and making-of featurettes, as well as a short documentary on Borderland about the true-life crimes that inspired the film. However, Nightmare Man&amp;#039;s extras have a distinct edge thanks to the participation of Shepis, who brings a salty sense of humor to the commentary and also directs an amusing making-of featurette that elicits funny (and honest) responses from the cast and crew. Included on every disc are The Miss HorrorFest Webisodes, a wan collection of reality show-style vignettes that follow a contest to find the festival&amp;#039;s new, scantily clad spokesmodel. -- Paul Gaita ","torrent":{"xt":"urn:btih:29a747bc1cf96d5b8d07a5421cf88e45b9a3d318","amp;dn":"After+Dark+Horrorfest+2007+-+8+Films+to+Die+For+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"29a747bc1cf96d5b8d07a5421cf88e45b9a3d318","infoHashBuffer":{"type":"Buffer","data":[41,167,71,188,28,249,109,91,141,7,165,66,28,248,142,69,185,163,211,24]},"announce":[],"urlList":[]}}