{"title":"Joe Zawinul-WDR BigBand - Brownstreet 2005 TQMP","uid":4132196,"size":598740944,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:2a7662221db32d0f5d9a5bdb2bb3e0783360b360&amp;dn=Joe+Zawinul-WDR+BigBand+-+Brownstreet+2005+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Breezin","files":13,"time":1208094405,"description":"Joe Zawinul's greatest post-Weather Report disc!\n\nquotes from amazon.com review section:\n\n&quot;If you're a Weather Report fan, you'll love this CD. All of the songs were done by Weather Report and written by Joe Zawinul, who is performing them with the WDR Big Band at his Birdland Club. It was a celebration of his 70th birthday. Man, these guys can really cook. The arrangements are well done by Vince Mendoza and the exception is &quot;Procession&quot;, which is arranged by Joe. They don't take away from Joe's or Weather Report's sound at all, in this writer's opinion. You can still hear his keyboard mastery, along with special guests Victor Bailey, Alex Acuna and Nathaniel Townsley. I recently saw an interview in which Joe raved about the first American bands that he heard: Benny Goodman and Glenn Miller. He said that their band's intonations were perfect. &quot;Never made a mistake&quot; he said. I wonder if Joe ever thought that one day his songs would be played by a band that fits that discription. The WDR Band is tight and treats his music beautifully. I recommend this CD highly and I'm glad that I own it as homage to a great musician and person.&quot;\n\n&quot;I am delighted and surprised by the ease and depth of feel exhibited by this large ensemble on what were originally small group compositions. The level of soloing is very high, as one would expect from this crack group of european musicians. There are plenty of Zawinul moments, but a number of players have their moments to shine as well. All acquit themselves quite well under Zawinul's watchful ears. This is a must have for Weather Report fans, but there is something here for lovers of jazz in general. It is a revelation to hear just how steeped in the jazz tradition these pieces are when heard in this more acoustic setting. Big Fun for all.&quot; \n\nBrought to you by TQMP. (The Quality Music Project)\n\nIn this project me and my fellow pirates share only quality items out of our CD collections in lossless FLAC and include covers, especially for those who like to burn and print and put it in a nice and shiny jewelcase. Well, you all know the drill :)\n\nRipped by Exact Audio Copy V0.99 from 01-23-2008, encoded to FLAC with 1024kb/s\nGet Your Free Copy of the EAC and FLAC suite at:   &lt;a href=&quot;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.exactaudiocopy.de/en/index.php/resources/download/&lt;/a&gt;\n\nPlease feel free to join the TQMP project! Since all TQMP torrents are tracked by countless other trackers by now, the lifetime of your uploads will increase by a BIG margin ;)\n\nThe &quot;rules&quot; are simple: Rip your CD (no 1980's cassettetapes or vinylrips please!) in lossless FLAC format AND include artwork.\n\nYou can find all TQMP uploads at: www.thepiratebay.se/tag/tqmp\n\nContact: &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;5f3d2d3a3a2536311f3336293a713133&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\n\nGreetings to ya'all from the Breezin Dutchman! d:)","torrent":{"xt":"urn:btih:2a7662221db32d0f5d9a5bdb2bb3e0783360b360","amp;dn":"Joe+Zawinul-WDR+BigBand+-+Brownstreet+2005+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2a7662221db32d0f5d9a5bdb2bb3e0783360b360","infoHashBuffer":{"type":"Buffer","data":[42,118,98,34,29,179,45,15,93,154,91,219,43,179,224,120,51,96,179,96]},"announce":[],"urlList":[]}}