{"title":"The Nativity Story (2006) English subs [H264]","uid":4190485,"size":628185548,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2b79bfe8dab8d45d21140d58a5c30efa7a6370fe&amp;dn=The+Nativity+Story+%282006%29+English+subs+%5BH264%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pakmenu","files":2,"time":1210926492,"description":"Encoded in H264 Advanced Video Coding for ~20% smaller filesize with same quality\n\nWriting application: MediaCoder 0.6.1.4095\nFile size: 599 MiB  PlayTime: 1h 36mn  Frame rate: 29.970 fps\nVideoCodec: h264 Advanced Video Coding, constant quality (q50)\nVideo Bit rate: 792 Kbps  Dimentions: 640 x 480  Aspect: 4/3\nAudio Bit rate: 55 Kbps VBR 24 KHz MP3 Joint stereo English\nSubtitles: Hard coded with some transparency\n\nReviews:\n\ncopied *some* reviews... (not representing my view) out of many, many: \nsee http://www.imdb.com/title/tt0762121/usercomments\nmy opinion: very enjoyable movie, does not get boring \n((though it neither gets exciting)) -&gt; could be a good thing?\n\n-----------------------------------------------\nAt last a great family movie., 28 November 2006\n8/10 Author: drtwo1 from United States\n\nAs a Catholic/Christian publisher I did not expect the integrity that the movie The Nativity Story presents. The story is produced with good taste and careful thought. At times the Scripture may be bent but it is never broken. The bends are simply to aid in the visual telling of the story and are not offensive.\n\nI found it to be very good family viewing with minimal violence and the scenes were not graphic in nature. The lesson in family love alone is worth the price of a ticket. The bonus is the lesson in faith and trust in God. I would encourage you to take children of all ages.\n\nThe theology should be acceptable to all Christians. However, I did talk to one priest that had a problem with the childbirth scene. He subscribes to the theology that Mary&amp;#039;s childbirth was not painful. I understand his theology but I disagree with it on the grounds of Jesus and Mary&amp;#039;s humanity. Also the arrival of the Wise Men at the time of the birth though not correct does not hurt the story. Still I feel that these small problems would be a poor and unjust reason not to see, or tell others not to see this movie.\n\nOf all the versions of this story that have been done I found it to be the most inspiring and visually the most tastefully done. At last we have a great family movie that puts Christ back into Christmas.\n\nExecutive Director Contemplation Corner Press\n-----------------------------------------------\n\nFar Deeper and far more realistic than previous renditions, 2 December 2006\n9/10 Author: skotoparavich from United States\n\nWhen it comes to biblical movies, I always look for accurate biblical and theological rendering first and foremost. But accuracy is not necessarily enjoyable. You can easily tell if a movie is low-budget or not. You can easily tell if the acting is superficial or not.\n\nThis movie is different. It combines biblical accuracy with excellent acting. Each character was portrayed very correctly. I have studied the biblical characters immensely; and from what we have in the synoptic gospels, the actors brought to live those beloved characters of the bible.\n\nThis is a Christian movie filled with biblical themes and messages. If you are looking for different interpretation than the biblical one, you might not like it. But if you are looking for good acting or accurate biblical rendering, you will not be disappointed.\n\nTreat yourself this Christmas to one of the most beautiful movies.\n-----------------------------------------------\n\nWhy I GIve It A Ten, 24 December 2006\n10/10 Author: Andy Smith from Conyers, GA\n\nAs I write this I am aware that the vote is averaging 6.3. If you could see my voting record you would know that I do not give a high vote easily. So why do I see this so differently than many of you. Is it because I am a devout Christian? I did not give the PAssion of the Christ a very high rating. So i feel that I can be even handed in seeing this as what it is.\n\n1. I think that Ciaran Hinds played Herod as well as I have ever seen. The paranoia, and menace came through so well.\n\n2. I think Elliot Davis&amp;#039; cinematography was beautiful. It made me feel that I was in a renaissance painting.\n\n3. I was moved emotionally - which is not true of the Passion of the Christ movie.\n\n4. The parts of the movie that were based on the Biblw were accurate - although I wished they had shown a choir of the heavenly host.\n\n5. The parts of the movie that were based on conjecture or Catholic traditions were well thought out. I enjoyed the use of the Wise Men as comic relief.\n\nI believe this movie so far is highly underrated.\n\nAdny Smith \n\n","torrent":{"xt":"urn:btih:2b79bfe8dab8d45d21140d58a5c30efa7a6370fe","amp;dn":"The+Nativity+Story+%282006%29+English+subs+%5BH264%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2b79bfe8dab8d45d21140d58a5c30efa7a6370fe","infoHashBuffer":{"type":"Buffer","data":[43,121,191,232,218,184,212,93,33,20,13,88,165,195,14,250,122,99,112,254]},"announce":[],"urlList":[]}}