{"title":"Duke Ellington Live in Concert 1966   The Duke Lives On (LP rip ","uid":4074667,"size":84117513,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2d21ef6e78e697f7d56ca5b34405951b09531095&amp;dn=Duke+Ellington+Live+in+Concert+1966+++The+Duke+Lives+On+%28LP+rip+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"matushka","files":11,"time":1205243626,"description":" @ OGG 8 (LP rip MIDI)\n\nDuke Ellington &quot;The Duke Lives On&quot;  (1966)\n\nSide 1   \n \nDon&amp;#039;t Get Around Much Anymore\n(Ellington-Russell) 2:33\nDo Nothing Till You Hear From Me\n(Vocal By Milt Grayson) (Ellington-Russell) 4:33\nBlack And Tan Fantasy\n(EIlington-Miley) 5:45\nCreole Love Call\n(Ellington) 2:00\nThe Mooche\n(Ellington-Mills) 2:00\n \nSide 2\nThings Ain&amp;#039;t What They Used To Be\n(Mercer Ellington-Ted Persons) 2:53\nPyramid\n(Ellington-Tizol-Gordon-Mills) 3:25\nThe Blues (From &quot;Black, Brown &amp; Beige&quot;)\n(Vocal By Milt Grayson) 3:36\nEchoes Of Harlem\n(Ellington) 3:32\nSatin Doll\n(Ellington-Strayhorn-Mercer) 2:27\n \nDuke Ellington (p), Cootie Williams, Cat Anderson, Roy Burrowes (tp); Ray Nance (tp, vln);\n.awrence Brown, Chuck Connors, Buster Cooper (tb);  Jimmy Hamilton (cl, ts); Russel Procope (cl, as); Johnny Hodges (as); Paul Gonsalves (ts)\nHarry Carney (bars, b-cl, cl); Herbie Shepard (b); Sam Woodyard (dr); Milt Grayson (cl).\nRecorded Live in Concert 1966. Original Reprise recording on\nMidi records distributed by WEA Musik GmbH, a Warner Communications Company. Made in Germany. Originally released\nin January 1967. Linernotes by Mike E. Rodger, (p) 1967 Reprise Records (c) 1974 WEA Musik GmbH.\n \nThe Duke, Edward Kennedy Ellington was a gift to the jazz scene. As one of the most outstanding musical intellects in jazz and one of its most creative artists, he wrote more than 6.000 pieces of music; variety was the spice of his life. The composer, songwriter, arranger, pianist and band-leader developed a unique and inimitable style by building his works on the individualistic sounds of the high-class instrumentalists he gathered in his band, so that each solist added a new tone colour to the orchestrator&amp;#039;s palette. Billy Strayhorn, who worked with the Duke as his co-composer and co-arranger from 1939 until death in 1967 once said: &quot;Ellington plays\n \nthe piano but his real instrument is his band.&quot; This instrument Duke Ellington kept from 1927, when he burst on the jazz scene, right to the time of his death in 1974. In this band&amp;#039;s music the Duke eventually combined his musical talents, his artistic principles, his excellence and his sensitive elegance in a manner that transcended the usual signification of jazz. Although his basic materials were almost invariÃ‚Â¬ably the blues and the voice-like manner in which a jazz musician plays his instrument, classic critics often related his compositions to Debussy, Delius or Ravel. It is wellknown that he also performed with major symphony orchestras.\n \nDuke Ellington, born in Washington, D.C., on April 29, 1899 died in New York on May 24, 1974. In high school his elegance of manner won him his nickname. He was torn between his interests in painting and in music, whereby he showed more aptitude for painting finding piano lessons a chore. During his later life he was awarded virtually every honour that could be received by a musician. Besides the highest American Civil Award he was also presented with the French Legion of Honour. His timeless songs, as on this album, have become standards. Posterity will probably decide that he was one of the few geniuses of the twentieth century.\n","torrent":{"xt":"urn:btih:2d21ef6e78e697f7d56ca5b34405951b09531095","amp;dn":"Duke+Ellington+Live+in+Concert+1966+++The+Duke+Lives+On+%28LP+rip+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d21ef6e78e697f7d56ca5b34405951b09531095","infoHashBuffer":{"type":"Buffer","data":[45,33,239,110,120,230,151,247,213,108,165,179,68,5,149,27,9,83,16,149]},"announce":[],"urlList":[]}}