{"title":"FreemanRadio - Weird but Interesting Point of View","uid":4204409,"size":469761242,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:2d2246e33252351838f61d04fd1ede94b8318fc2&amp;dn=FreemanRadio+-+Weird+but+Interesting+Point+of+View&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"HueMann","files":10,"time":1211713084,"description":"\n\n\nFreemanTV.com &lt;a href=&quot;\nhttp://freemantv.artopium.com/radio/index.shtml&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://freemantv.artopium.com/radio/index.shtml&lt;/a&gt;\n\n\n\n\nFreeman is an internationally known, award-winning TV producer in Austin, Texas. He graduated Interdisciplinary Studies with honors and studied Ancient Architecture at Kansas University. Freeman has made it his life&amp;#039;s work to unveil the mysteries on planet earth. He devotes his life to love, patience, and information. You could say that he is an info-junkie. His research has led him to make films on Corporate Logos and their Magical meanings, Columbia, the Illuminati Goddess, Ancient Astronauts and ETs, HAARP and Chemtrails. He hosts and produces &quot;the Freeman Perspective&quot;, a live local broadcast on Public Access Community Television.\n\nFreeman admits to it all. He is bloodline of the Illuminati, son of a Worshipful Master that built nuclear missiles and chased flying saucers for Project &quot;Blue Book&quot;. Freeman is witness to many of the high strange events currently manifesting on planet earth and wishes to share what he has learned on his synchronistic path.\n\n\n\n\n\n\nFreeman Radio\n\nInterlaced with a great selection of Freeman&amp;#039;s own musical picks, Freeman himself sits down for one hour to talk about his own philosophy on the meaning of life in world spinning out of the control of the many and into the hands of a few.\n\n\n01.What is Reality\n-- A brief introduction to the world of Freeman on his first ever soley hosted and produced radio show.\n\n\n02.I Think, I&amp;#039;m Insane \n-- A journey into the netherworld of Britney Spears, Anna Nicole Smith and their connection to trauma based mind control.\n\n\n03.Secret Destiny \n-- Is there an agenda for America? Is this agenda being written by the rich elite? Find out in this exploration into Manly P. Hall&amp;#039;s book Secret Destiny of America.\n\n\n04.What&amp;#039;s to come \n-- Freeman unites with Alex Jones to talk about our current socially engineered mental paradigm, and what it might be like once we break free from it.\n\n\n06.Do you want to know? \n-- After the 15 minute introduction by Pink Floyd, Freeman explores the topic of your interpersonal relationship with yourself, and transcending the grief that comes with the knowledge of who your oppressors really are.\n\n\n07.Wondrous Stories \n-- Listen to Freeman&amp;#039;s esoteric travels down the Lisa Nowak trail; turning at the phallus and heading through the freemasonic slave trader fortress. From the Georgia Guidestones to the Memphis Pyramid, Freeman devulges a world of mind control and symbols of sorcery in government institutions. The Wondrous Story Slide Show is a helpful visual that synchronizes with this audio show. Just wait for Freeman&amp;#039;s Cue.\n\n\n08.Confessions of a Conspiracy Theorist\n-- Take a listen to Freeman&amp;#039;s personal story, from punk rock to conspiracy theorist. From UFOs to WTO protests,  Freeman&amp;#039;s anecdotes are out of this world.\n\n\n09.What is human?\n-- Humans are not the problem on planet earth. Knowing that you are good, can you conceive of the possibility of  - manifesting a new paradigm based on unconditional love?\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:2d2246e33252351838f61d04fd1ede94b8318fc2","amp;dn":"FreemanRadio+-+Weird+but+Interesting+Point+of+View","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d2246e33252351838f61d04fd1ede94b8318fc2","infoHashBuffer":{"type":"Buffer","data":[45,34,70,227,50,82,53,24,56,246,29,4,253,30,222,148,184,49,143,194]},"announce":[],"urlList":[]}}