{"title":"Invisible, Inc. (Build 156198 Inclu Contingency Plan DLC)","uid":12760563,"size":984589260,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:2d3ae4bdc0f9dd3d3cb1d8a377dbd8c4739dde4b&amp;dn=Invisible%2C+Inc.+%28Build+156198+Inclu+Contingency+Plan+DLC%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dauphong","files":1,"time":1447527115,"description":"\nAbout This Game\r\nTake control of Invisible's agents in the field and infiltrate the world's most dangerous corporations. Stealth, precision, and teamwork are essential in high-stakes, high-profit missions, where every move may cost an agent their life.\r\n\r\nKlei Entertainment, the independent studio behind the hit games Mark of the Ninja and Don't Starve, presents: Invisible, Inc.\r\nKey Features\r\n\r\n    Character selection: Start with any of the 10 unlockable agents in the game, plus 6 agent variants, and 6 starting programs to crack corporate security.\r\n    Deep customization of builds: each play through is different as you create your own strategy using agents, items, augments and programs, and adapt to your surroundings.\r\n    Randomly generated world: locations, threats, and loot are randomly generated so each playthrough is vastly different and you’ll never get complacent.\r\n    Choose your own game mode: with 5 different game modes and extensive custom generation options, each player can play the way they prefer.\r\n    Fully animated cutscenes and voice over: with hundreds of lines of voice over, great animation, and fully animated cutscenes, we didn’t spare any expense to make an immersive experience","torrent":{"xt":"urn:btih:2d3ae4bdc0f9dd3d3cb1d8a377dbd8c4739dde4b","amp;dn":"Invisible%2C+Inc.+%28Build+156198+Inclu+Contingency+Plan+DLC%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2d3ae4bdc0f9dd3d3cb1d8a377dbd8c4739dde4b","infoHashBuffer":{"type":"Buffer","data":[45,58,228,189,192,249,221,61,60,177,216,163,119,219,216,196,115,157,222,75]},"announce":[],"urlList":[]}}