{"title":"DJ Useo Presents Summer Booty 2008","uid":4190679,"size":328022951,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2db1caff9d399bea6939c0491b0a75aab5931025&amp;dn=DJ+Useo+Presents+Summer+Booty+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alpha1999","files":54,"time":1210896304,"description":"Here it is! \nSummer Booty 2008 \nDisc 1 \n01-Sausalito Summernight (Geezy&amp;#039;s Top Down RMX) (Diesel) \n02-Sneaky Exhale (Liam Nicklen) (Liam Nicklen vs Sneaky Sound System) \n03-Faith Be Dub To Me (Alpha1999) (George Michael vs Beats International) \n04-The Sun Goes Down On Your Body (Miss Frenchie) (Tyrese vs Tom Novy) \n05-Misery Loves the Kill (AeKon) (30 Seconds To Mars vs The Red Jumpsuit Apparatus) \n06-Tell Me &amp;#039;Bout The Summer Rain (In The Disco Club) (DJ Fac) (Black Eyed Peas vs Joss Stone vs Die Fantastischen Vier) \n07-Summertime Blown (Pomatic) (Beyonce vs. Snoop Dogg ft. Diddy &amp; Notorious B.I.G.)08-Getting Jiggy &amp;#039;Round a Little Green Bag (DJ Spider) (George Baker Selection vs. Will Smith) \n09-Ahead Mr.Kite (DJ Useo) (Beatles vs Wire) \n10-Lebanese Thieves Don&amp;#039;t Lie (Virtual DJ) (Shakira vs. Thievery Corporation) \n11-Drop It Like A Wiseman (Cheekyboy) (Snoop Dogg vs James Blunt)12-Wherever&amp;#039;s La Isla Bonita (DJ Spider) (Madonna vs. Shakira) \n13-Treat For Sexx (Mad Martigan) (Bert Keampfert vs Beck) \n14-No One Loves Peas (Cheekyboy) (Alicia Keyes vs Black Eyed Peas)15-I Know It&amp;#039;s Ecstacy (Alpha1999) (Hybrid vs Barry White) \n16-This Ain&amp;#039;t The Summer Of Love (DJ Useo) (Blue Oyster Cult vs The Who) \nDisc 2 \n01-Sunshine (DottySmash) (Keane vs Alex Reece vs Marc Et Claude vs Jay-Z vs Milk &amp; Sugar vs Laid Back vs Full Intention vs 5th Dimension vs Twista v Len) \n02-The Summer Ida Mash (Corrupt DJ&amp;#039;s) (Ida Corr vs LL Cool J vs Mr Fingers vs Armand Van Helden vs Groove Armada vs Tom Novy vs Beastie Boys vs Madison Avenue vs Nelly Furtado) \n03-Waiting to Mas Que Nada (DJ Spider) (Jennifer Lopez vs. Sergio Mendez &amp; the BEP&amp;#039;s) \n04-Kaya In Sao Paulo (Simon Iddol) (Morcheeba vs Bob Marley) \n05-Don&amp;#039;t Fear Things We Said (MP3J) (Beatles vs Blue Oyster Cult) \n06-Hollablack Betty Bites The Dust (DJ M.i.F) (Queen vs. Gwen Stefani vs. Tom Jones) \n07-Good, Good Thing (Voicedude) (Fine Young Cannibals vs. James Brown) \n08-Party Hard In The Summertime (Supakon) (Mungo Jerry vs DJ Impact) \n09-Cold Sympathy (Cheekyboy) (Adele vs Massive Attack) \n10-Cruel Summer Lick (DJTopcat) (Bananarama vs Lil Kim) \n11-Marvin Wants to Sex You Up (DJ Magnet) (Marvin Gaye vs. Color Me Badd vs. Doug E. Fresh vs. Beastie Boys \n12-My Girl Has Sin Sin Sin (DJ Morgoth) (Robbie Williams vs The Temptations) \n13-Planet Vibrations (DJTopcat) (Beach Boys vs Planet Rock and the Anchorman) \n14-Sex &amp;#039;N Drugs &amp;#039;N Come Baby Come (Cheekyboy) (K7 vs Ian Dury &amp; The Blockheads) \n15-Summer Nights (Remix) (Alpha1999) (Olivia Newton-John &amp; John Travolta)","torrent":{"xt":"urn:btih:2db1caff9d399bea6939c0491b0a75aab5931025","amp;dn":"DJ+Useo+Presents+Summer+Booty+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2db1caff9d399bea6939c0491b0a75aab5931025","infoHashBuffer":{"type":"Buffer","data":[45,177,202,255,157,57,155,234,105,57,192,73,27,10,117,170,181,147,16,37]},"announce":[],"urlList":[]}}