{"title":"McAfee VirusScan Mac 8.6 (Build 234) aka Virex","uid":4174737,"size":22744956,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:2de5af84734f14607b4a8fc648a49d0a4d4f3afc&amp;dn=McAfee+VirusScan+Mac+8.6+%28Build+234%29+aka+Virex&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"skier354","files":1,"time":1210059989,"description":"Here is McAfee VirusScan for mac (also known as Virex). This is an enterprise version that never expires and requires no serial or activation. Enjoy!\n\n\n\nBenefits:\n\n      * Enforces security policies\n      VirusScan for Mac offers continuous policy enforcement for multiple files,             directories, or volumes, including volumes on remote computers connected through the network\n    * Get broad protection\n      VirusScan for Mac protects your Macintosh systems against all types of viruses and other threats, including emerging malware\n    * Scan when you want to and need to\n      Because VirusScan for Mac uses the Mac OS X interface, you can initiate on-demand scanning using file drag and drop\n    * Scanning is reliable and accurate\n      False positives can be a problem with some anti-virus software, but with VirusScan for Mac, they are few and far between\n    * Stay up-to-date\n      With a single keystroke, you can keep VirusScan for Mac fully up to date for maximum protection\n    * It&amp;#039;s easy to manage\n      Using McAfee ePolicy Orchestrator, you can control, manage, and report using a single-console display\n\nFeatures:\n\n    * On-access scanning\n      VirusScan for Mac scans files as they are accessed to determine if they are infected with malware\n    * Proven anti-virus technology\n      VirusScan for Mac for Macintosh stops every type of virus and malicious code threat, even compressed files; using advanced heuristics and generic detection, VirusScan for Mac protects against new viruses and other threats\n    * Easy Macintosh-like interface\n      VirusScan for Mac uses Apple&amp;#039;s Mac OS X Aqua user interface, so you have an instantly familiar Macintosh screen; and with DropScan, you have easy on-demand scanning\n    * One-click updating\n      Keeping your Macintosh systems up to date is as easy as a mouse click; the rapid update system automatically grabs the latest virus updates to ensure full compliance and protection against viruses, worms, and other malicious code threats\n\n","torrent":{"xt":"urn:btih:2de5af84734f14607b4a8fc648a49d0a4d4f3afc","amp;dn":"McAfee+VirusScan+Mac+8.6+%28Build+234%29+aka+Virex","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2de5af84734f14607b4a8fc648a49d0a4d4f3afc","infoHashBuffer":{"type":"Buffer","data":[45,229,175,132,115,79,20,96,123,74,143,198,72,164,157,10,77,79,58,252]},"announce":[],"urlList":[]}}