{"title":"King Arthur's Court w/Sky SUNLIGHT Saxon of The S","uid":4236804,"size":203531315,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:2df0a8bdfcfe56e76cee339f20b44ede35910647&amp;dn=King+Arthur%5C%27s+Court+w%2FSky+SUNLIGHT+Saxon+of+The+S&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"psychedelicscones","files":11,"time":1213335974,"description":".. picked up the SKY in la.. off to the northern-most of California.. Weed, and Mount Shasta, California.. Do you know Mount Shasta is actually not a mountain?? but is a magnificent volcano composed of overlapping snow capped peaks which at any moment, without warning is capable of exhaling her holy breath: fire, water, air, and earth.. and we only wish  we  could  explain  the character that  pours    out     of      her..      lets      just      say ::   \t\t.. every single twitch of her molecular being..    \t\t.. she won\\&amp;#039;t stand for it.. she might not even record..  \t\t.. a different perception of time she has..  \t\t.. she exists on her own accord..      .. Arrived within her greater sphere of influence on April 8th of the Year 2005.. at 4am.. after a length of time where upon being lost in the forest, we went to find the HOMESTEAD ourselves.. in pitch black.. in the woods.. in the mountains.. in the moment.. And we did.. Opened the door as MYSTERY called to us and entered the guest quarters.. something immediately jumped out at us!!  On the walls, from up above and below, were Hebrew symbols.. &amp; Hindi, Latin, Chinese.. Diagrams &amp; more symbols.. The Periodic Table of Elements, pictographs, a drawn model of the solar system waiting for the sun to rise.. the glorious sun.. Did you see the sun rise today??  We slept as a new day began.. the kind of day that makes you wake up in the morning, put a smile on your face, embrace the human race, and make a vow there is never going to be another war.. the.. altered reality we call our weekend has now begun..   .. Kissed by the sun, we went into town for breakfast.. We grabbed groceries.. talked and talked.. turned on to THE SAINT GERMAINE.. we spoke with the people and heard tales about all the MAGICAL PEOPLE all around us.. we were actually treated with a strange, but familiar flare by all of the locals..  Some embraced us with a conviction never experienced by ourselves, and a few were truly disturbed that we had entered their domain..   .. We were at the tavern for a while.. the people connecting with us.. the Gold Room.. an escape.. and they invite us to what is called THE CHURCH.. A chapel of love.. there I want to be - a place where they celebrate and dance with you and me.. An old church converted into a COMMUNAL gathering place and home.. We orchestrated the flow of our being to the local vibes in their own respective musical realm..   .. We went on a drive into the mountains, top down, and you can see the stars.. ItÃƒÂ¢??s such a clear night tonight.. purple and green smoking, streaking stars rocketing toward mother goddess Earth.. ItÃƒÂ¢??s like the stars come out to talk to you.. Sparkle, sparkel, sparkul.. Folk us, focus.. tried to get lost.. found some springs.. a splendidly scrapped and abandoned car, only stopped by the SNOW LINE when we went too far.. and then back to HOME, and to sleep..   .. Today it seems like a magic day..  Why donÃƒÂ¢??t we go out to the forest and play?? And so we did!! To THE SOURCE, drinking from the cup of life.. We see how the sun plays upon the trees.. See how the trees dancing in the breeze..   .. Five spirits united in HARMONY in a space all together for the first time.. as the light of day has illuminated the commencement of the AQUARIAN AGE.. giving sacred medicine to her majesty as her (and his) omnipresent gaze strikes down upon us.. Wishing for everyone to see how love really should be.. A Spring Honeymoon with God and Family.. Composing a synthesis of sound from the edge of our minds unrehearsed-on-the-spot with no limitations other than the time it takes for the VIBRATION to be converted into electro-chemical energy transmitted to be received and interpreted into meaning by the master processor.. All that molten lava (liquid Earth) and minute tectonic movements really do radiate strange magnetic fields that profoundly affect the thought pattern of human brain.. the result.. a magic shamanic electronic psychedelic collage that sweeps you away into THE TRIP..   .. For all of us, strewn throughout the great spectrum of infinity,   .. King ArthurÃƒÂ¢??s Court  \n\n\n\n\n\n\nKing ArthurÃƒÂ¢??s Court            Sky SUNLIGHT Saxon- vocals, kazoo                  DJIN Aquarian- guitars, vocals                    SCONES Kozyk- bass    Anthony PEGO- keyboards, vocoder                  SAINT GERMAIN Mark Kneass- percussion, vocals, didgeridoo  \t\t\t\t\t\t\t\t\t\t             All songs written spur of the moment, while this 2-track recording was being made live at The YWHW House of Mt. Shasta April 09-10th, 2005 by King ArthurÃƒÂ¢??s Court.     Mastered at The House of Pego in San Diego by Pego &amp; Scones. Scones plays keyboards &amp; Pego plays bass on Track 8, Welcome to the Orchard.  King ArthurÃƒÂ¢??s Court would like to thank:  Our Family &amp; our friends, Rebekah, Toketee, &amp; Abe, Ted Pederson, Amy Nolan, Ashley Woodard, Allan Carroll, Adam Partyka, Pam Schilens, Mt. Shasta and all the others who have supported us. Album Art, Design, &amp; Photography by Scones, Pam Schilens, Ted Pedersen, Ashley Woodard, Allan Carroll, &amp; Pego.     \t\t\t\t\t\t\t\t\t\t\t\tFor more information kindly visit there website:  \t\t\t\t\t\t\t\t\t\t\t\twww.StarPeaceRecords.com  \t\t\t\t\t\t\t\t\t\t\t\t     THE QUEST:  Can you find at least 13 distinct lyrical references from A Spring Honeymoon with God and Family located in the story on the following page?  If you think you are up to embarking upon this quest then listen to the album, find the lyrics, and match them to their corresponding passages in the story.  Write down the passages and in which song they are contained. Email your answers to &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;85d1ede0d4f0e0f6f1c5d6f1e4f7d5e0e4e6e0d7e0e6eaf7e1f6abe6eae8ab&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;  You will receive a ÃƒÂ¢??specialÃƒÂ¢?? present for successfully completing your quest.   A word of wisdom:  From the beginning, never forget your quest\n","torrent":{"xt":"urn:btih:2df0a8bdfcfe56e76cee339f20b44ede35910647","amp;dn":"King+Arthur%5C%27s+Court+w%2FSky+SUNLIGHT+Saxon+of+The+S","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2df0a8bdfcfe56e76cee339f20b44ede35910647","infoHashBuffer":{"type":"Buffer","data":[45,240,168,189,252,254,86,231,108,238,51,159,32,180,78,222,53,145,6,71]},"announce":[],"urlList":[]}}