{"title":"The Water Horse Legend of the Deep DVDRip XviD-Larceny","uid":4094276,"size":1469371188,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2e957f3481d6f93da0389b1c04af63ea0e086af8&amp;dn=The+Water+Horse+Legend+of+the+Deep+DVDRip+XviD-Larceny&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":5,"time":1206224033,"description":"Title The Water Horse: Legend of the Deep (2007)\nYear 2007\nURL http://imdb.com/title/tt0760329/\nLength 111 min\nAudio AC3 CBR 448kbps\nVideo XViD 1200 kbps\nSubs EN,FR\nScreens $14,070,469 (USA) (30 December 2007) (2,772 Screens)\n\n\nA lonely boy discovers a mysterious egg that hatches a sea creature of Scottish legend.\n\n\n\n\n\n\nWhen my wife dragged me to this movie I thought I&amp;#039;d be bored. The trailers show nothing except the little monster growing quickly and swimming around happily. What I did not expect is the wonderful, and entertaining background story set in Scotland during WWII. \n\nNow the film has a modern frame as well as the WWII story. An old man tells two young visitors to Loch Ness what they assume is a tall tale. Frames usually don&amp;#039;t add much to movies but in this frame is an exception.\n\nIn WWII a young boy, who doesn&amp;#039;t know his father was lost at sea, finds a strange egg. While the egg grows into a likable, gigantic plesiosaur, a strange man, who might be a German spy, starts as caretaker of the boy&amp;#039;s father&amp;#039;s estate, and a gunnery unit takes over the estates grounds. The captain of the gunnery unit takes a shine to the boy&amp;#039;s Mom, and tries to instill discipline to the boy by treating him like a drill sergeant would a recruit. Meanwhile, the new caretaker decides to keep the boy&amp;#039;s new pet a secret. and wins the respect of the boy&amp;#039;s mother. \n\nAlthough there is no real violence in this movie there is a killer (hunter) cook and some shooting. In fact there is a scene with cannon fire that might scare young children. And of course the cook has a tough bull-dog who likes to chase things. \n\nThe characters here are well developed and the acting and cinematography is superb. This movie will not disappoint.\n\n","torrent":{"xt":"urn:btih:2e957f3481d6f93da0389b1c04af63ea0e086af8","amp;dn":"The+Water+Horse+Legend+of+the+Deep+DVDRip+XviD-Larceny","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2e957f3481d6f93da0389b1c04af63ea0e086af8","infoHashBuffer":{"type":"Buffer","data":[46,149,127,52,129,214,249,61,160,56,155,28,4,175,99,234,14,8,106,248]},"announce":[],"urlList":[]}}