{"title":"Click","uid":4185568,"size":1321186953,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:2ea899d8a37bb575c512f3e34816444145d804cb&amp;dn=Click&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JohnRGillespie","files":89,"time":1210651609,"description":"On the surface, Michael Newman, Adam Sandler,  seems to have it all, yet with all the demands forced upon him by his ungrateful boss Ammer, Michael finds that setting aside time to spend with his loving wife, Donna, and two picture-perfect children, Ben and Samantha, has grown increasingly difficult. When a frustrating bout with the television remote leads the overworked husband and father to a nearby Bed, Bath &amp; Beyond in search of a universal remote with the power to control all of his electronic devices, a curious peek into the back room leads Michael into the company of eccentric employee and talented inventor Morty. It seems that Morty has created a device that will not only allow Michael complete control over his television and stereo, but his entire life as well. As Michael discovers that the remarkable device has the power to muffle the barks of the family dog, zoom himself past an irritating quarrel with his wife, and even allow him to travel back and forth through time to different points in his life, the rush of being able to skip straight to the good parts in life soon leaves him feeling as if he\\&amp;#039;s missing out on the total experience. Only when Michael begins to realize that the he has lost control of his life and the remote is now programming him does he finally learn that life is as much about the moments he\\&amp;#039;d rather forget as it is the moments he will always remember.\n\nTitle: Click\nGenre: Comedy, Drama, Fantasy\nRelease Date: 2006  (USA)\nRuntime: 107 min\nLanguage: English\nRatings: PG-13\nQuality: DVDRip\nSize: 696 mb\n","torrent":{"xt":"urn:btih:2ea899d8a37bb575c512f3e34816444145d804cb","amp;dn":"Click","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ea899d8a37bb575c512f3e34816444145d804cb","infoHashBuffer":{"type":"Buffer","data":[46,168,153,216,163,123,181,117,197,18,243,227,72,22,68,65,69,216,4,203]},"announce":[],"urlList":[]}}