{"title":"Autumnwatch.2015-4Ep-BBC","uid":12738724,"size":3832312676,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:2ff6858ab23d8921e0c1096307764e3c831fd944&amp;dn=Autumnwatch.2015-4Ep-BBC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"uggauga","files":8,"time":1447214391,"description":"Autumnwatch 2015 -- BBC\r\n4 Episodes\r\n \nhttp://www.bbc.co.uk/programmes/b0079t1p\r\n\r\n1280x720 resolution for the 1st 3 episodes,\r\n832x468 only for the last episode (don't know why I couldn't access the 720p version...)\r\n\r\nWith subtitles - enjoy !!\r\n_________________________________________________\r\n\r\nAutumnwatch Day One\r\nAutumnwatch is back, live from a brand new location - the Wildfowl &amp; Wetland Trust Caerlaverock Reserve in the beautiful south west of Scotland. Chris Packham, Michaela Strachan and Martin Hughes-Games watch the action unfold as resident badgers and otters prepare for winter. Elsewhere, the red deer rut goes into nocturnal overdrive, and the country is invaded by hundreds of thousands of swans and geese.\r\n\r\nAutumnwatch Day Two\r\nChris Packham, Martin Hughes-Games and Michaela Strachan are live from Caerlaverock on the stunning south west corner of Scotland, surrounded by the entire world population of Svalbard barnacle geese. In a special report, Martin is on a stakeout to unravel the extraordinary night-time shenanigans of red deer. And the team are treated to possibly the closest views of badgers yet.\r\n\r\nAutumnwatch Day Three\r\nThe best of the season's wildlife with Chris Packham, Martin Hughes-Games and Michaela Strachan, live from their base in the south west of Scotland. The wild goose chase continues, along with action from badgers, otters and the UK's most powerful birds of prey.\r\n\r\nAutumnwatch Day Four\r\nAt the end of an action-packed week, Chris Packham, Michaela Strachan and Martin Hughes-Games report live on all the wildlife stories from their base on the Scottish coast. It's Bonfire Night and the series finale promises to be spectacular. Wildlife up and down the country has been putting on incredible displays, and the team are using the very latest technology to take us closer than ever to nocturnal animal action","torrent":{"xt":"urn:btih:2ff6858ab23d8921e0c1096307764e3c831fd944","amp;dn":"Autumnwatch.2015-4Ep-BBC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"2ff6858ab23d8921e0c1096307764e3c831fd944","infoHashBuffer":{"type":"Buffer","data":[47,246,133,138,178,61,137,33,224,193,9,99,7,118,78,60,131,31,217,68]},"announce":[],"urlList":[]}}