{"title":"Transformers.WS.2007.XviD.HHI","uid":4088450,"size":733744283,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3077ff2213fe9fac611df5de53a24ca07f40379c&amp;dn=Transformers.WS.2007.XviD.HHI&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"raidy","files":3,"time":1205946348,"description":"Happy Hacker Industries:presents:TRANSFORMERS.ENGLISH.DVDRIP.XVID \n                                                                              \nReLeaSe         Transformers                                                  \n     TyPe            SciFi                                                    \n     LaNGuaGe        English                                                  \nWideScreen                                                                    \n     auDio           MP3 128Kbps                                              \n     CoDeC           XviD                                                     \n     FRaMe RaTe      23.976                                                   \n     ReSoLuTioN      640 x 272                                                \n\n                    DreamWorks SKG(2007). Length : 144min                     \n                                    PG-13                                     \n\n\n A long time ago, far away on the planet of cybertron, a war was being waged  \n between the noble Autobots (led by the wise Optimus Prime) and the devious   \n Decepticons (commanded by the dreaded Megatron) for control over the         \n Allspark, a mystical talisman that would grant unlimited power to whoever    \n possessed it. The Autobots managed to smuggle the Allspark off the planet,   \n but Megatron blasted off in search of it. He eventually tracked it to the    \n planet of Earth (circa 1850), but his reckless desire for power sent him     \n right into the Arctic Ocean, and the sheer cold forced him into a paralyzed  \n state. His body was later found by Captain Archibald Witwicky, and before    \n going into a comatose state Megatron used the last of his energy to engrave  \n a map, showing the location of the Allspark, into the Captain&amp;#039;s glasses,     \n and send a transmission to Cybertron. He is then carted away by the          \n Captain&amp;#039;s ship. A century later, Sam Witwicky, nicknamed Spike by his        \n friends, buys his first car. To his shock, he discovers it to be Bumblebee,  \n an Autobot in disguise who is to protect Spike, as he bears the Captain&amp;#039;s    \n glasses and the map carved on them. But Bumblebee is not the only            \n Transformer to have arrived on Earth - in the desert of Qatar, the           \n Decepticons Blackout and Scorponok attack a U.S. military base, causing the  \n Pentagon to send their special Sector Seven agents to capture all            \n &quot;specimens of this alien race,&quot; and Spike and his girlfriend Mikaela find    \n themselves in the middle of a grand battle between the Autobots and the      \n Decepticons, stretching from Hoover Dam all the way to Los Angeles.          \n Meanwhile, within the depths of Hoover Dam, the cryogenically stored form    \n of Megatron awakens...                                   \n","torrent":{"xt":"urn:btih:3077ff2213fe9fac611df5de53a24ca07f40379c","amp;dn":"Transformers.WS.2007.XviD.HHI","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3077ff2213fe9fac611df5de53a24ca07f40379c","infoHashBuffer":{"type":"Buffer","data":[48,119,255,34,19,254,159,172,97,29,245,222,83,162,76,160,127,64,55,156]},"announce":[],"urlList":[]}}