{"title":"Malayians artists for Unity Video","uid":4190379,"size":205171865,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:31583e577e304b9063189e317733f7d74b949571&amp;dn=Malayians+artists+for+Unity+Video&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tinohou","files":2,"time":1210918309,"description":"                             MALAYSIAN ARTISTES FOR UNITY\nOver 120 Malaysians from all walks of life have contributed their talent and time on a pro-bono basis for the creation of a song and music video in an effort to promote racial unity in the country.\n\nEntitled Ãƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½Here In My HomeÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½, the song is written by Pete Teo and showcases16 local artistes, namely Afdlin Shauki, Awie, Ning Baizura, Atilia, Jaclyn Victor, Reshmonu, Pete Teo, Jason Lo, Klg Sqwad,Altimet, Suki, Daniel Lee, Nikki Palikat and Melina William. Although predominantly an English composition, the song has a multi-lingual section sung in Malay, Mandarin and Tamil. A Malay language version of the song is in the works by Afdlin Shauki and other language versions of the song are expected to be unveiled in associated projects before long.\nThe music video for the song is directed by award-winning film directors Yasmin Ahmad and Ho Yuhang.\n\nAs well as the 16 singers, it also features cameo appearances by notable Malaysian personalities ranging from celebrities to arts activists and sportsmen. The star-studded cast of over 50 personalities includes football pundit Shebby Singh, AirAsia CEO Tony Fernandes, model Amber Chia, comedian Harith Iskander, dancer January Low as well as actors Nell Ng, Ida Nerina, Maya Karin and Sharifah Amani.\n\nÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½Here In My HomeÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½ is released and distributed to the public for free. Both the song and videos can be downloaded from the projectÃƒ?Ã‚Â¢ÃƒÂ¯Ã‚Â¿Ã‚Â½ÃƒÂ¯Ã‚Â¿Ã‚Â½s official website. It is also available from other channels on the Internet such as music portals, video sharing sites, current affairs news sites and blogs.\n\nProduced by Pete Teo, Malaysian Artistes for Unity is an independent, non-partisan, non-profit national unity project that seeks to celebrate cultural diversity and the ideal of Bangsa Malaysia. The project is agift from the participants to the nation.\n\nOfficial Project Website:\nwww.malaysianartistesforunity.info\n","torrent":{"xt":"urn:btih:31583e577e304b9063189e317733f7d74b949571","amp;dn":"Malayians+artists+for+Unity+Video","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31583e577e304b9063189e317733f7d74b949571","infoHashBuffer":{"type":"Buffer","data":[49,88,62,87,126,48,75,144,99,24,158,49,119,51,247,215,75,148,149,113]},"announce":[],"urlList":[]}}