{"title":"Discovery Channel Miracle Planet 1080i Ep.01-03 MPEG-2","uid":4077422,"size":17603118754,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:315d93457f5ac611115200a1e023d648f6aafb58&amp;dn=Discovery+Channel+Miracle+Planet+1080i+Ep.01-03+MPEG-2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"weiguo_x","files":9,"time":1205389331,"description":"Discovery Channel Miracle Planet 1080i Ep.01-03 MPEG-2\n\n\n\nGeneral Info\n\nIMDB Link: http://imdb.com/title/tt0488317/\n\nLength: 44min 28s 338ms + 44min 20s 754ms + 46min 45s 460ms\n\nDescription: The beautiful high-definition filmed Miracle Planet narrated by Christopher Plummer traces the Earth&amp;#039;s evolution over 4.5 billion years, from its birth as a planet to the emergence of Homo sapiens roughly 200,00 years ago...the four hour plus series combines on-location footage shot around the globe,eye-popping computer animation and field interviews with scientists and scholars. What&amp;#039;s most impressive here, however, are not the individual speculations, but the series&amp;#039; success in integrating such a wide range of disparate ideas into an absolutely compelling prehistoric narrative, one that sheds considerable light on the extraordinary inner workings of our amazingly resilient miracle planet.\n\nViolent Planet: Secrets of our Past\n\nEarth was born as a result of repeated asteroid collisions, the moon created by a single giant impact event. Then, Earth&amp;#039;s size attracted huge meteorites, which slammed into it, causing super-high-temperature rock vapor to cover the entire surface and evaporate all ocean water. The earliest life-forms survived such infernal events by escaping deep into the ground, miraculously emerging again and again.\n\nThe Earth has gone through innumerable catastrophic events, and life has survived by acquiring new abilities to live through each crisis. Humans are part of the grand history of life&amp;#039;s evolution, which has been closely intertwined with repeated cataclysmic events. Why was Earth able to evolve into a livable planet, but not Mars, which failed to hold its atmosphere and oceans? Find out in the opening episode of the series.\n\nSnowball Earth: First Complex Life\n\nThe hypothesis &quot;Snowball Earth&quot; explains that ice ages, caused by the earliest life-forms, resulted in an evolutional leap ? larger-sized life. Atmospheric methane created by microbes initially kept the Earth warm. As microbes that produce oxygen (photosynthesizers) emerged, atmospheric methane was lowered. As a result Earth cooled and the primeval ocean froze to 1,000 meters deep.\n\nMost life may have become extinct during a long period of intense glaciation believed to have lasted several million years. However, some life survived, perhaps in puddles created near volcanic craters. Carbon dioxide accumulated in the air because thick ice sheets prevented ocean water from absorbing it. A green-house effect, created by carbon dioxide, finally melted the ice and fed photosynthesizers.\n\nHyper hurricanes raged after the great meltdown and stirred up the ocean water, creating an ideal condition for life to prosper and develop collagen. Using collagen, life-forms were able to build larger bodies, and a variety of creatures, called Ediacara biota, emerged for the first time.\n\nLife Indestructible\n\nEarth provides a rich environment, and many factors continually shape the planet&amp;#039;s condition. \n\nTechnical Specs\n\n\nVideo Codec.......: MPEG-2\nResolution........: 1920x1080i\nFramerate.........: 29,97fps\nVideo Bitrate.....: ~17.00 Mbps avg\nAudio Codec.......: 48 kHz, AC3 Dolby Digital, 2/0 Channels (L, R) | 3/2 (L,C,R,l,r) + LFE ch, ~384.00 kpbs\nSubtitles.........: None","torrent":{"xt":"urn:btih:315d93457f5ac611115200a1e023d648f6aafb58","amp;dn":"Discovery+Channel+Miracle+Planet+1080i+Ep.01-03+MPEG-2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"315d93457f5ac611115200a1e023d648f6aafb58","infoHashBuffer":{"type":"Buffer","data":[49,93,147,69,127,90,198,17,17,82,0,161,224,35,214,72,246,170,251,88]},"announce":[],"urlList":[]}}