{"title":"Story_Of_The_Year-The_Black_Swan-2008-pLAN9","uid":4117277,"size":82951473,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:318ad4dc1418f6bc2bd5477f6fa7e680bc615c50&amp;dn=Story_Of_The_Year-The_Black_Swan-2008-pLAN9&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uploadpirate","files":16,"time":1207371709,"description":"\n+----------------+------------------------------------------+----------------+\n|                                                                            |\n|   Artist  : story of the year                                              |\n|   Album   : the black swan                                     |\n|   Bitrate : 220 kbps avg                                                   |\n|                                                                            |\n+-------------------------------[Release Info]-------------------------------+\n|                                                                            |\n|   Source     : CD                                                          |\n|   Label      : epitaph                                                     |\n|   Year       : 2008                                                        |\n|   Genre      : Punk Rock                                                   |\n|                                                                            |\n|   Rip date   : 2008-04-04                                                  |\n|   Store date : 2008-04-19                                                  |\n|                                                                            |\n|   Encoder    : LAME                                                        |\n|   Size       : 82.93 megs                                                  |\n|                                                                            |\n+--------------------------------[Track List]--------------------------------+\n|                                                                            |\n|  1.  choose your fate                                               3:33   |\n|  2.  wake up                                                        3:31   |\n|  3.  the antidote                                                   3:59   |\n|  4.  tell me (pac)                                                  3:58   |\n|  5.  angel in the swamp                                             4:28   |\n|  6.  the black swan                                                 3:44   |\n|  7.  message to the world                                           4:04   |\n|  8.  apathy is deathwish                                            3:30   |\n|  9.  we are not gonna make it                                       4:03   |\n|  10. cannonball                                                     3:49   |\n|  11. terrified                                                      4:00   |\n|  12. pale blue dot (interlude)                                      1:06   |\n|  13. welcome to our new war                                         5:11   |\n|  -----------------------------------------------------------------------   |\n|                                                                    48:56   |\n|                                                                            |\n+-------------------------------[Release Notes]------------------------------+\n|                                                                            |\n|  : TRACK BY TRACK : STORY OF THE YEAR                                      |\n|  Posted byBomber on Sunday, March 30 @ 15:14:51 CDT                        |\n|  Contributed by Bomber                                                     |\n|                                                                            |\n|  They&amp;#039;ve just announced their much anticipated tour, so next thing for     |\n|  Story Of The Year to do is unleash their new album &amp;#039;The Black Swan&amp;#039;.      |\n|  They will do just that on April 19th on Epitaph / Shock, and we&amp;#039;re here   |\n|  to tell you all about it, track by track. Read More to check out what     |\n|  you can expect when it hits!                                              |\n|                                                                            |\n|                                                                            |\n|  TRACKLISTING                                                              |\n|  1. Choose Your Fate                                                       |\n|  2. Wake Up                                                                |\n|  3. The Antidote                                                           |\n|  4. Tell Me (P.A.C)                                                        |\n|  5. Angel In The Swamp                                                     |\n|  6. The Black Swan                                                         |\n|  7. Message To The World                                                   |\n|  8. Apathy Is A Dead Wish                                                  |\n|  9. We&amp;#039;re Not Gonna Make It                                                |\n|  10. Cannonball                                                            |\n|  11. Terrified                                                             |\n|  12. Pale Blue Dot (Interlude)                                             |\n|  13. Welcome To Our New War                                                |\n|                                                                            |\n|  INSTORES APRIL 19TH                                                       |\n|  EPITAPH | SHOCK                                                           |\n|                                                                            |\n|                                                                            |\n|  &quot;Choose Your Fate&quot; hits you like a slap in the face, an aggressive        |\n|  track, part sing, part scream (the good variety of scream, none of this   |\n|  dying cat shit). a good powerful way to start the album showing they can  |\n|  mix the heavy stuff with the catchy melodic parts too.                    |\n|                                                                            |\n|  &quot;Wake Up&quot; is the first single made available from the album, it is a      |\n|  very good indication of where the band is at right now, energetic,        |\n|  melodic and rockin&amp;#039;. Strong in backup vocals and solid delivery, this     |\n|  one is bound to be huge in the live setting, sing-a-longs will be         |\n|  aplenty.                                                                  |\n|                                                                            |\n|  &quot;The Antidote&quot; is catchier than the flu, the chorus will inject itself    |\n|  in your mind instantly, &quot;all we need is a reason, all we need is right    |\n|  here inside us all&quot;. A huge melodic rock song with definite potential to  |\n|  become a future single, sweet little guitar solo going on too.            |\n|                                                                            |\n|  &quot;Tell Me (P.A.C)&quot; is introduced with marching band style drums before     |\n|  the wall of guitar inflicts itself. Another rockin&amp;#039; song packed with      |\n|  melody and a well constructed chorus, the production stands out on this   |\n|  one, the sounds are huge and used really well, this is the kinda song     |\n|  Linkin Park are probably wishing they&amp;#039;d came up with rather than writing  |\n|  the same songs over and over again.                                       |\n|                                                                            |\n|  &quot;Angel In The Swamp&quot; starts off slowly, giving the impression we might    |\n|  be in for a bit of a ballad, but nope, drums kick in and we&amp;#039;ve got a      |\n|  punk beat going on before slipping back into the slower mode for a        |\n|  little bit more, before a big ending. A solid track that jumps around a   |\n|  lot. A bit like the band on stage, you can just visualize them, and the   |\n|  crowd going off for this one.                                             |\n|                                                                            |\n|  &quot;The Black Swan&quot; has a familiar vibe to it, go back a couple of albums    |\n|  and this track could&amp;#039;ve slotted in with any of the bands tracks back      |\n|  then, again a great balance of power and melody, the song builds up well  |\n|  to a nice big ending.                                                     |\n|                                                                            |\n|  &quot;Message To The World&quot; is the song you knew was about to come, things     |\n|  are slowed down, there&amp;#039;s a lot less jumping around sound wise, the pace   |\n|  is consistent and their ability to construct and instantly appealing      |\n|  chorus really stands out &quot;when you kill me, please do it slowly, send a   |\n|  message to the world&quot; sticks like glue. This one will be a favourite for  |\n|  many, chances are this one will be a single.                              |\n|                                                                            |\n|  &quot;Apathy Is A Dead Wish&quot; rides along at a nice pace on the back of a       |\n|  sweet guitar riff, the kind you heard a lot when nu-metal was thriving,   |\n|  another track without much chopping and changing, pace wise, just         |\n|  building up slightly for the chorus. A cool track, nothing too amazing,   |\n|  but a few notches up from being classed as filler.                        |\n|                                                                            |\n|  &quot;We&amp;#039;re Not Gonna Make It&quot; is a no-frills rock song, catchy all the way    |\n|  through, one you can bop along to and they stick to a simple formula      |\n|  throughout, very solid, as with most songs on here, the chorus is solid   |\n|  and memorable. Sometimes the simpler things are the best, while this      |\n|  isn&amp;#039;t the best song on offer, it&amp;#039;s better than most would come up with.   |\n|                                                                            |\n|  &quot;Cannonball&quot; well the name tells you a lot about this song, when it&amp;#039;s     |\n|  called Cannonball, you know not to expect some kind of ballad, you are    |\n|  going to get something that will impact hard. And the song lives up to    |\n|  it&amp;#039;s title. Once again, the main foundation is a big slab of rock, with   |\n|  some nice guitar work and infectious vocals. Another track that just      |\n|  oozes potential single.                                                   |\n|                                                                            |\n|  &quot;Terrified&quot; is the first sign of the album wrapping up, vocals take       |\n|  centre stage in a slow intro, backed by another marching style drum       |\n|  build up, no explosive wall of guitars to come though, this one is rock   |\n|  ballad through and through. It has third single written all over it, you  |\n|  can picture the video clip already, filmed at a live show, main lights    |\n|  will take a rest while the the cigarette lighters will be out swaying     |\n|  through the air, there will close up cuts to those in the front rows      |\n|  singing along to every word, maybe a few &quot;will you marry me Dan&quot; signs    |\n|  being waved by girls on their boyfriends shoulders and before you know    |\n|  it, that drum beat is back as it all fades away. Great track.             |\n|                                                                            |\n|  &quot;Pale Blue Dot (Interlude)&quot; isn&amp;#039;t a song, but a short reading by Carl     |\n|  Sagan, who was an American astronomer and astrochemist, the &amp;#039;Pale Blue    |\n|  Dot&amp;#039; referring to the earth, in particular a photograph taken by Voyager  |\n|  1 from 6.4 billion km&amp;#039;s away, where the earth simply was a pale blue      |\n|  dot.                                                                      |\n|                                                                            |\n|  &quot;Welcome To Our New War&quot; closes things up, in the same way the disc       |\n|  opened, a frenzy. A fast paced, heavy track that jumps around between     |\n|  different speeds, has a kick arse chorus, nice guitar lines and overall   |\n|  is well delivered and closes things up quite nicely.                      |\n|                                                                            |\n|                                                                            |\n|                                                                            |\n|  THE VERDICT                                                               |\n|  &quot;A new lease of life&quot; is what the band describes it as, and they are not  |\n|  far off the mark. This album is set to send Story Of The Year to a whole  |\n|  new level. The album is full of potential singles that will no doubt      |\n|  impact on the mainstream. The good thing is they&amp;#039;ve found the perfect     |\n|  balance between heavy and catchy. Fans will lap it up, while many more    |\n|  will jump on board.                                                       |\n|                                                                            |\n+----------------------------------------------------------------------------+\n\n","torrent":{"xt":"urn:btih:318ad4dc1418f6bc2bd5477f6fa7e680bc615c50","amp;dn":"Story_Of_The_Year-The_Black_Swan-2008-pLAN9","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"318ad4dc1418f6bc2bd5477f6fa7e680bc615c50","infoHashBuffer":{"type":"Buffer","data":[49,138,212,220,20,24,246,188,43,213,71,127,111,167,230,128,188,97,92,80]},"announce":[],"urlList":[]}}