{"title":"WinRAR 5.30 Final x86 &amp; x64 +Key","uid":12829629,"size":3765011,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:319b09a55b5df9fc5c0d2035d31744c2810bdd43&amp;dn=WinRAR+5.30+Final+x86+%26amp%3B+x64+%2BKey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1448382844,"description":"WinRAR is a powerful archive manager. It can backup your data and reduce the size of email attachments, decompress RAR, ZIP and other files downloaded from Internet and create new archives in RAR and ZIP file format. \r\n\r\n\r\n\r\nWinRAR and RAR 5.30 release - Last updated: 24 November 2015\r\n\r\nChangelog:\r\n\r\nInformation about the critical vulnerability in WinRAR self-extracting archives published in news in September and October 2015 is incorrect. Unfortunately mass media failed to recognize that what was described as WinRAR vulnerability is Windows OLE vulnerability patched in November 2014: \r\n \nhttps://technet.microsoft.com/en-us/library/security/ms14-064.aspx Even if unpatched, this Windows OLE vulnerability does not introduce new risk factors for WinRAR SFX archives. \r\n\r\nPlease read http://rarlab.com/vuln_sfx_html2.htm for more details. No patches for WinRAR are needed. \r\n\r\n\r\nAdded extraction of multipart ZIP archives created by 7-Zip. Such archives have .zip.001, .zip.002, ... file extensions. You need to open .zip.001 file in WinRAR shell to browse or unpack such archive. All parts must be stored in the same folder before starting extraction. \r\n\r\nAdded extraction of files split to multiple parts with .001, .002, ..., extensions. You can open .001 file as a usual archive and then unpack its contents. WinRAR will combine all parts and save them to extracted file. All parts must be stored in the same folder before starting extraction. \r\n\r\n&quot;001&quot; item is included to &quot;Associate WinRAR with&quot; list in &quot;Settings/Integration&quot; dialog. \r\n\r\nWinRAR file list allows to use mouse Back and Forward buttons or Alt+Left and Alt+Right keyboard shortcuts to navigate in recently visited folders. \r\n\r\nFolder wildcards are allowed in RAR command line in file names to archive. For example: \r\n\r\nrar a backup c:backup2015** \r\n\r\nwill archive all '2015*' folders in c:backup. Use -r switch to search for '2015*' also in c:backup subfolders. \r\n\r\n&quot;Extract&quot; button in SFX archive is changed to &quot;Pause&quot; when extraction is started, so it is possible to pause SFX extraction and resume it later. \r\n\r\n&quot;Skip encrypted&quot; option in &quot;Find files&quot; dialog to silently skip encrypted archives while performing search command. \r\n\r\nArchive test command works for tar.gz, tar.bz2 and tar.xz archives. Since TAR format does not provide file data checksums, WinRAR checks only validity of GZIP, BZIP2 or XZ container. \r\n\r\nAdding a new string to WinRAR diagnostic messages window could be slow and affect the operation performance in case of thousands of errors. Now it works fast regardless of errors number. \r\n\r\nNew 'R' object for -sc switch defines encoding of console RAR messages sent to redirected files and pipes. For example: rar lb -scur data &gt; list.txt will produce Unicode list.txt with archived file names. \r\n\r\nSleep time parameter in -ri&lt;priority&gt;[:&lt;sleep_time&gt;] switch is adjusted to lower its impact to RAR performance and especially to recovery record related operations. Higher sleep time values are needed to reduce the system load to same level as in previous versions. \r\n\r\nConsole RAR &quot;l&quot; and &quot;v&quot; commands display file time in YYYY-MM-DD format. \r\n\r\nWhen extracting RAR and ZIP archives created in Unix, WinRAR maps decomposed Unicode characters to precomposed. Such conversion is required for some Unix and OS X archives to correctly unpack non-English archived names in Windows. It works for Windows versions starting from Windows Vista. \r\n\r\nModification time is set for all folders created when unpacking .7z archives. Previous versions set it only for non-empty folders. \r\n\r\nWinRAR prevents a computer to go to sleep by inactivity timeout until current operation, such as archiving, extraction or another archive processing, is done. \r\n\r\nTotal progress bar is displayed when extracting .arj, .lzh and .cab archives (except multivolume archives). \r\n\r\nProgress bar is displayed when deleting files after archiving and when clearing &quot;Archive&quot; attribute of archived files. \r\n\r\n&quot;Test&quot; command also verifies contents of NTFS alternate data streams in RAR 3.x - 5.x archives. Previously their contents was checked only during extraction command. \r\n\r\nSFX module sets sfxstime environment variable, which contains the module start time in &quot;YYYY-MM-DD-HH-MM-SS-ms&quot; format. You can specify it in Path command if you need to generate a time based unique installation path, such as &quot;Path=myapp-%sfxstime%&quot;. \r\n\r\n\r\n\r\nBugs fixed: \r\n\r\nconsole RAR crashed instead of displaying an overwrite prompt when attempting to add files to already existing volumes; \r\n\r\nconsole RAR &quot;lt&quot; command did not display seconds in file timestamp; \r\n\r\nWinRAR failed to decompress .xxe files if they did not include &quot;section N of xxencode&quot; string in the body; \r\n\r\nWinRAR could not restore contents of NTFS alternate data stream saved with -os switch if it was split between different volumes. \r\n\r\n\r\n \nhttp://imgbay.mobi/di/WinRARTrail-3h41w.jpg \nhttp://imgbay.mobi/di/WinRARKEY-ygb5y.jpg","torrent":{"xt":"urn:btih:319b09a55b5df9fc5c0d2035d31744c2810bdd43","amp;dn":"WinRAR+5.30+Final+x86+%26amp%3B+x64+%2BKey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"319b09a55b5df9fc5c0d2035d31744c2810bdd43","infoHashBuffer":{"type":"Buffer","data":[49,155,9,165,91,93,249,252,92,13,32,53,211,23,68,194,129,11,221,67]},"announce":[],"urlList":[]}}