{"title":"MWS Wow TCG (2.01)","uid":4063159,"size":113891203,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:31ae2d316ebb76c4c0a6e36654b0f9243cee6406&amp;dn=MWS+Wow+TCG+%282.01%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"DrMuffin","files":1,"time":1204681749,"description":"BrokenTech&amp;#039;s Guide to Installing Magic Workstation w/ WoW on Windows Vista\n\n\n1. Installation\n\n2. Cracking Magic Workstation and Installing WoW Patches the First Time\n\n3. Setting Up MWS to function with WoW\n\n4. How to Install future WoW Patches\n\n5. FAQs\n\n\n--Installation\nRun the setup file named &quot;mws094f.exe&quot;\n\n -Click Next\n -Accept the Agreement\n -Click Next(This will install to the default directory -Recommended)\n -Click Next\n -Finish Installation\n\n\n--Cracking Magic Workstation and Installing WoW Patches the First Time\nClose Magic Workstation if it is open.\n\n-Copy and Paste the entire contents of the Magic Workstation included in the zip over the Magic Workstation installed on your computer. Make sure you are replacing the files with the new ones. (&quot;Yes to All&quot; is your friend)\n\nDefault should be -&gt; C:/Program Files/\n\n--Setting Up MWS to Function with WoW\nOpen MWS after patching it with the folder that installed the WoW patches.\n\n-As you open MWS for the first time after cracking it, you will notice it will say registered now.\n-Once MWS is open, click -&gt; File -&gt; Assign Default Master Base. Select WoW.mwbase in the default folder you installed this file to earlier. Doing so will close MWS.\n-Reopen MWS, click -&gt; File -&gt; Open Libraries... Select WoW.mwbase.\n-Close MWS &lt;- Doing so saves all changes you have made so that if MWS crashes you will not have to redo this again.\n-Reopen MWS, click -&gt; Tools -&gt; Preferences -&gt; Interface -&gt; Graphic Theme -&gt; TTGWOW -&gt; Ok. If this crashes MWS see my FAQ, you can still play WoW but the images will not be in their best quality.\n -Close MWS &lt;- Doing so saves the interface change as it can sometimes be difficult to do so and if for some reason it crahes later you may regret not doing so as it can be a pain to get it to work again later.\n\n\n--How to Install Future WoW Patches\nUnzip the patch and put it into the following folder. It is important to do so, or you will have grey/blank images instead of pictures of the cards from the set. (The file that you need to put into the folder should look something like this, &quot;WoWSET.mwSet&quot;)\n\n&quot;C:/Program Files/Magic Workstation/Custom Sets&quot;\n\n-Open MWS if it is not already open. You should be looking at the screen with a list of all previously installed sets. If not get there by clicking View -&gt; Library Mode(Classic). Now in the bottom half of the screen click the Folder Icon and find the patch you are installing in the custom Sets folder. Click on it to open. (If it is not there, put it in this folder or the WoW.mwbase will have no idea where to find the pictures of the cards.)\n-Now the bottom half of the screen should have the patch to be installed cards and at the top of the screen select the icon that looks like a notepad.(When hovering over it, it should say view/edit base mode).\n-Click into the bottom screen panel and press, &quot;CTRL + A&quot; this is the shortcut to select all.\n-Click the Green Up arrow in the bottom screen area. This should move the new cards up into the rest of the cards.\n-Now click the save option in the top area(Blue Disk) and you should now have saved the new patch into the rest of the Master Base.\n\n\n--FAQs\nQ. How come MWS keeps crashing everytime I try to change the interface?\nA. Close it, reopen it. Do it again. Repeat a couple of times rebooting the CPU as needed. If that does not work click here. http://www.magi-soft.com/forum/viewtopic.php?t=5684\n\n\nQ. How come there are no WoW players online? It seems like it is mostly Magic Players.\nA. The reason why I made this easier for players to use online.\n\nQ. Why do my games keep crashing?\nA. The servers suck. Also ownership changes of cards from one side of the screen in rapid or quick movements can cause crashes. I recommend even if an ability is attached to an opposing hero or ally to press Shift + Enter to set a note of the name of its target and leave it on your side.\n\nQ. How come the filters don&amp;#039;t work?\nA. The filters were set to work with the Magic TCG and has difficulty translating across to the WoW TCG.\n\nQ. Why are you playing WoW TCG on &quot;Magic&quot; Workstation?\nA. This program, although named Magic Workstation, doesn&amp;#039;t have anything to do with the actual Magic TCG for legal purposes. It is just a Magical Workstation in which you can use Custom Sets to play card games.\n\nQ. Where can I go to ask a question for help not listed here?\nA. http://entertainment.upperdeck.com/wow/community/forums/1/946324/ShowThread.aspx\n\nQ. Where can I find the guide for Helpful Hints to Playing WoW online?\nA. http://entertainment.upperdeck.com/wow/community/forums/1/946324/ShowThread.aspx\n\n\n--BrokenTech\n\n\n\n\n\n(I just uploaded it. No credit taken.)","torrent":{"xt":"urn:btih:31ae2d316ebb76c4c0a6e36654b0f9243cee6406","amp;dn":"MWS+Wow+TCG+%282.01%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31ae2d316ebb76c4c0a6e36654b0f9243cee6406","infoHashBuffer":{"type":"Buffer","data":[49,174,45,49,110,187,118,196,192,166,227,102,84,176,249,36,60,238,100,6]},"announce":[],"urlList":[]}}