{"title":"Multiplayer Online Mafia Game With prizes","uid":4132733,"size":48399,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:31e5d5ad6c3efcc6790cf22f9e2c3aa4c83a1766&amp;dn=+Multiplayer+Online+Mafia+Game+With+prizes&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mafiajoey","files":1,"time":1208114931,"description":"MafiaThugs.com is a free MMORPG (Massive Multiplayer Online Role Playing Game) game based on a mob gangster type lifestyle. The game is fully browser based therefore no spyware filled software to install like some other games. Here at MafiaThugs.com, you can be a Cartel boss or simply join another cartel to rule the streets in your neighborhood. No laws to worry about because real mobsters don&amp;#039;t abide. Get ready to fight other bosses and cartels who will try to take over your city. Collect money using your hookers or other operatives or just kill the neighborhoods until you receive the amount of respect you demand. You can supply your guys with cars and a variety of guns so they can do drive by attacks for you. You&amp;#039;ll be able to purchase and produce narcotics to keep your guys and gals happily working for you. Since real mobsters don&amp;#039;t abide by the law, there isn&amp;#039;t much you can&amp;#039;t do in this action packed world! Whats more? MafiaThugs.com awards Real Cash each round along with subscriptions and other amazing prizes. To make the game fair for everyone, we require that you only register one account per person and/or I.P. address. This insures no cheating is taking place. Duplicate or multiple accounts will be removed. Enjoy ","torrent":{"xt":"urn:btih:31e5d5ad6c3efcc6790cf22f9e2c3aa4c83a1766","amp;dn":"+Multiplayer+Online+Mafia+Game+With+prizes","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31e5d5ad6c3efcc6790cf22f9e2c3aa4c83a1766","infoHashBuffer":{"type":"Buffer","data":[49,229,213,173,108,62,252,198,121,12,242,47,158,44,58,164,200,58,23,102]},"announce":[],"urlList":[]}}