{"title":"Men in Trees S01E13 - Flohmarkt (German)","uid":4064675,"size":402456576,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:31f81d81d824e01676f8f06092d2f7eab28d40c6&amp;dn=Men+in+Trees+S01E13+-+Flohmarkt+%28German%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gwodus","files":1,"time":1204747781,"description":"Rip: TV Rip\nFormat: AVI XviD\nResolution: 624 x 352\nLanguage: German &amp; English Track\n\nKurzbeschreibung:\nPatrick befindet sich auf Freiersfuessen: Seit er wieder gluecklich mit Annie vereint ist, traegt er sich mit dem Gedanken, ihr einen Heiratsantrag zu machen. Er moechte unbedingt, dass der Antrag in einer aussergewoehnlichen Form und in perfekter Atmosphaere stattfindet und hat sich darum etwas ganz Besonderes ausgedacht: Er laedt Annie zum Chinesen ein. Dort soll es zum Nachtisch einen Glueckskeks geben, in dem sie einen Zettel finden soll, auf dem statt der ueblichen Lebensweisheit der Heiratsantrag geschrieben steht. Patrick ist voller Aufregung, als es endlich soweit ist. Doch sein Plan geht nicht auf. Der Kellner verwechselt die Kekse und statt Annie erhaelt eine andere Frau den Heiratsantrag - ein dummer Zufall mit ungeahnten Konsequenzen...\n\nBen und Theresa erleben einen zweiten Fruehling. Als die beiden verliebt in der Kueche des Restaurants herumknutschen, taucht unerwartet Sara auf. Theresa, die wenig erfreut ueber Saras Anblick ist, verlaesst verwirrt den Raum, so dass Sara die Moeglichkeit hat, Ben zu erklaeren, warum sie Elmo vor einiger Zeit so fluchtartig verlassen hat. Ben hingegen beichtet ihr, dass er wieder mit Theresa zusammen ist. Doch Sara ist nicht bereit, kampflos aufzugeben. Waehrend des Flohmarkts, den Elmo alljaehrlich veranstaltet, kommt es schliesslich zu einer offenen Konfrontation zwischen beiden Frauen, die auch an Ben nicht spurlos voruebergeht...\n\nMarin erhaelt hohen Besuch aus New York: Ihr Verleger Stuart Maxson, der zufaellig geschaeftlich in der Gegend zu tun hat, steht unvermittelt vor ihr. Er wartet bereits seit Wochen vergeblich auf das naechste Kapitel von Marins neuem Buch. Nun schlaegt er ihr einen Deal vor: ein Abendessen gegen ein neues Kapitel von Marin. Als beide in der freien Natur des romantisch verschneiten Elmo ein Glas Wein miteinander trinken, macht Stuart ihr aber dann ein eher unangenehmes Gestaendnis. Er ist enttaeuscht von Marins neuem Text. Im Gegensatz zum ersten Kapitel ihres Buches enthalte er wenig echte Gefuehle, sondern mehr oberflaechliche Beschreibungen. Marin ist dankbar fuer die Kritik ihres Verlegers. Ihr wird klar, dass sie in letzter Zeit Angst hatte, einen ehrlichen Blick auf ihre wahren Gefuehle zu werfen...\n","torrent":{"xt":"urn:btih:31f81d81d824e01676f8f06092d2f7eab28d40c6","amp;dn":"Men+in+Trees+S01E13+-+Flohmarkt+%28German%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"31f81d81d824e01676f8f06092d2f7eab28d40c6","infoHashBuffer":{"type":"Buffer","data":[49,248,29,129,216,36,224,22,118,248,240,96,146,210,247,234,178,141,64,198]},"announce":[],"urlList":[]}}