{"title":"The Cell - Scary As Hell Edition","uid":4213905,"size":732887040,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:336dd332248c354522b237515c500a38c9672859&amp;dn=The+Cell+-+Scary+As+Hell+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"3Raz0r","files":1,"time":1212229154,"description":"This is a fanedited version of THE CELL.\n\nYou certainly do remember this movie about a serial killer, who falls into a coma, so he cannot tell the FBI, where he has hidden his last victim...\nBesides the cool idea of mind entering machinery and truly stunning visual effects, this also is a very cruel thriller with a lot of gore. Anyone remember the killer hanging himself up with chains over the dead body of his victim?\nWhile there were certainly a lot of cool and unforgettable scenes in this movie, and it was the predecessor for a lot of great movies to follow using the same techniques or effects (The Ring, The Grudge), yet it still left the audience unsatisfied, because of a plot that just would not be thrilling or carrying along. J-Lo&amp;#039;s crisis, Vince Vaughn and J-Lo as lovers, and most of all the very long, wonderfully filmed, but so boring and unnecessary death of Carl...\n\nAnyway, I considered it worthy to give this movie another chance and a new take, via a scary as hell fanedit. And I think it worked out really well.\n\nMy version comes with several deleted scenes, most importantly a drastically extended necrophilia scene, and a lot of scenes were cut to support the plot, avoid inconsistencies, improve the thrill. I cut the over the top &quot;dream&quot; sequences as well as the interactions that did not interact. But most importantly I totally deleted the killing of Carl (which is available as bonus scene on the DVD version, which is on Rapidshare), as this particular scene totally killed the atmosphere.\n\nSee for yourself and be ready to be scared.\n\nI am very proud of the result and hope you can enjoy it. Please leave a comment on http://www.fanedit.org, where you can also find my other fanedits and the DVD version of this one.\n\nyours,\n3Raz0r\n\nA fanedit is a fan-created version of a movie. It is not intended to replace the original, nor can it be sold or bought. If you like the original and mind someone messing with it, don&amp;#039;t watch it. You need to own the original DVD to legally watch a fanedit.","torrent":{"xt":"urn:btih:336dd332248c354522b237515c500a38c9672859","amp;dn":"The+Cell+-+Scary+As+Hell+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"336dd332248c354522b237515c500a38c9672859","infoHashBuffer":{"type":"Buffer","data":[51,109,211,50,36,140,53,69,34,178,55,81,92,80,10,56,201,103,40,89]},"announce":[],"urlList":[]}}