{"title":"CMOS Time-Mode Circuits and Systems: Fundamentals and Applicatio","uid":12845170,"size":16276300,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:33eca7431dd02753a87265edf1bf695ee3b2e34e&amp;dn=CMOS+Time-Mode+Circuits+and+Systems%3A+Fundamentals+and+Applicatio&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoctDeath","files":2,"time":1448547168,"description":"Title: CMOS Time-Mode Circuits and Systems: Fundamentals and Applications \r\nSeries: Devices, Circuits, and Systems (Book 53) \r\nAuthor: Fei Yuan \r\nFormat: PDF \r\nHardcover: 427 pages \r\nPublisher: CRC Press (December 2, 2015) \r\nLanguage: English \r\nISBN: 9781482298734 \r\n\r\n\r\nTime-mode circuits, where information is represented by time difference between digital events, offer a viable and technology-friendly means to realize mixed-mode circuits and systems in nanometer complementary metal-oxide semiconductor (CMOS) technologies. Various architectures of time-based signal processing and design techniques of CMOS time-mode circuits have emerged; however, an in-depth examination of the principles of time-based signal processing and design techniques of time-mode circuits has not been available―until now.\r\n\r\nCMOS Time-Mode Circuits and Systems: Fundamentals and Applications is the first book to deliver a comprehensive treatment of CMOS time-mode circuits and systems. Featuring contributions from leading experts, this authoritative text contains a rich collection of literature on time-mode circuits and systems.\r\n\r\nThe book begins by presenting a critical comparison of voltage-mode, current-mode, and time-mode signaling for mixed-mode signal processing and then:\r\n\r\n- Covers the fundamentals of time-mode signal processing, such as voltage-to-time converters, all-digital phase-locked loops, and frequency synthesizers\r\n- Investigates the performance characteristics, architecture, design techniques, and implementation of time-to-digital converters\r\n- Discusses time-mode delta-sigma-based analog-to-digital converters, placing a great emphasis on time-mode quantizers\r\n- Includes a detailed study of ultra-low-power integrated time-mode temperature measurement systems\r\n\r\nCMOS Time-Mode Circuits and Systems: Fundamentals and Applications provides a valuable reference for circuit design engineers, hardware system engineers, graduate students, and others seeking to master this fast-evolving field","torrent":{"xt":"urn:btih:33eca7431dd02753a87265edf1bf695ee3b2e34e","amp;dn":"CMOS+Time-Mode+Circuits+and+Systems%3A+Fundamentals+and+Applicatio","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"33eca7431dd02753a87265edf1bf695ee3b2e34e","infoHashBuffer":{"type":"Buffer","data":[51,236,167,67,29,208,39,83,168,114,101,237,241,191,105,94,227,178,227,78]},"announce":[],"urlList":[]}}