{"title":"Barbra Streisand - A Love Like Ours - (1999)[FLAC-EAC-CUE]","uid":4197180,"size":305800427,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:340bf731c465e34a9847014e16fbde6ce21cb32e&amp;dn=Barbra+Streisand+-+A+Love+Like+Ours+-+%281999%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seanprince","files":22,"time":1211296996,"description":"Barbra Streisand - A Love Like Ours - (1999)[FLAC-EAC-CUE]\n\nTrack list\n\nBarbra Streisand - A Love Like Ours\n\n01.\tI&amp;#039;ve dreamed of you\t\t\t\t04:46\n02.\tIsn&amp;#039;t it a pity?\t\t\t\t05:22\n03.\tThe island\t\t\t\t\t04:37\n04.\tLove like ours\t\t\t\t\t03:59\n05.\tIf you ever leave me (duet with Vince Gill)\t04:38\n06.\tWe must be loving right\t\t\t\t03:37\n07.\tIf I never met you\t\t\t\t03:38\n08.\tIt must be you\t\t\t\t\t03:29\n09.\tJust one lifetime\t\t\t\t04:18\n10.\tIf I didn&amp;#039;t love you\t\t\t\t04:18\n11.\tWait\t\t\t\t\t\t04:10\n12.\tThe music that makes me dance\t\t\t04:30\n\nBiography\tby William Ruhlmann\n\nBarbra Streisand&amp;#039;s status as one of the most successful singers of her generation is all the more remarkable not only because her popularity has been achieved in the face of a dominant musical trend -- rock &amp; roll -- which she did not follow, but also because, despite an amazing singing voice that has enthralled practically anyone who has heard it, she has always used singing as a mere stepping stone to other careers, as a stage and film actress and as a film director.\nStreisand struggled briefly as an actress and nightclub singer in New York in the early &amp;#039;60s before landing her first part in a Broadway show, I Can Get It for You Wholesale, in 1962. The cast album for that show and a subsequent appearance on a studio revival of Pins and Needles were her first recordings. Signed to Columbia Records, she released her first album, The Barbra Streisand Album, in 1963. It became a Top Ten, gold-selling record, turning Streisand into one of the best-selling recording artists of the early &amp;#039;60s.\nBut despite three successful albums by early 1964, Streisand turned her back on potentially lucrative concert bookings in favor of a starring role in the Broadway show Funny Girl, in which she appeared for more than two years. &quot;People&quot; from that show became her first Top Ten single, and the People album her first chart-topping LP. She turned to television in 1965 with My Name Is Barbra, the first of five network specials. In 1967, Streisand went to Hollywood to film Funny Girl, for which she would win an Academy Award. But by 1970, with her second and third films flops and her recording career flagging in the face of rock, she seemed consigned to Las Vegas before turning 30. Instead, she returned to hit-making with a Top Ten cover of Laura Nyro&amp;#039;s &quot;Stoney End&quot; and a successful non-singing performance in the comedy The Owl and the Pussycat.\nIn the 1970s, Streisand successfully married her musical and film acting interests, first in The Way We Were, a hit film with a theme song that became her first number one single, and then with A Star Is Born, which featured her second number one single, &quot;Evergreen,&quot; a song she co-wrote. From that point on, every album she released sold at least a million copies. In the late &amp;#039;70s, she found recording success in collaboration: her duet with Neil Diamond, &quot;You Don&amp;#039;t Bring Me Flowers,&quot; hit number one, as did &quot;No More Tears (Enough Is Enough),&quot; a dance record sung with Donna Summer. She had her biggest-selling album in 1980 with Guilty, which was written and produced by Barry Gibb of the Bee Gees and contained the number one hit &quot;Woman in Love.&quot; In 1983, Streisand&amp;#039;s first directorial effort, Yentl, became a successful film with a Top Ten soundtrack album. In 1985, The Broadway Album returned her to the top of the charts. 1991 saw the release of Just for the Record..., a boxed set retrospective, and her second film as a director, The Prince of Tides. Streisand returned to the concert stage in 1994, resulting in the Top Ten, million-selling album The Concert. In 1996, she directed her third film, The Mirror Has Two Faces, and in 1999 she released A Love Like Ours.\nThe 2000 album Timeless: Live in Concert was recorded at her Las Vegas show on New Year&amp;#039;s Eve 1999 and released on both CD and DVD. A year later, the new holiday album Christmas Memories arrived, then a sequel to The Broadway Album, The Movie Album, appeared in 2003. In 2005, a deluxe CD/DVD reissue of the original Guilty was followed a month later by Guilty Pleasures, a new album that reunited Streisand with Gibb. In 2006 she returned to the concert stage, documented in the 2007 Sony release Live in Concert. \n\nReview\tby Stephen Thomas Erlewine\n\nBarbra Streisand makes sure there&amp;#039;s no doubt to what love she&amp;#039;s referring to in the title of A Love Like Ours. On both the front and back covers, and throughout the liner notes, she&amp;#039;s seen with her new husband, James Brolin. As a matter of fact, the album is no less than a celebration of her love of Brolin and their storybook wedding. To some, this may be a little too sentimental, but the emotions are genuine, as she makes abundantly clear in her gushing, track-by-track liner notes. Streisand tackles both standards and newly written tunes, including the Richard Marx-penned &quot;If You Ever Leave Me,&quot; which she sings with Vince Gill. She claims in the liner notes that &quot;If You Ever Leave Me&quot; was intended to be a country song -- that&amp;#039;s why Gill sings on the track -- but, like the Gershwin tune &quot;Isn&amp;#039;t It a Pity,&quot; the show tunes, and &quot;We Must Be Loving Right,&quot; the other country song on the album, everything is given a measured, polished adult contemporary production. That&amp;#039;s a little ironic, since Streisand claims nearly everything was recorded live with an orchestra. Nevertheless, it sounds as if it was assembled in a studio piece by piece, which isn&amp;#039;t necessarily a bad thing. However, the absence of longtime collaborator Marvin Hamlisch is notable, since the arrangers on A Love Like Ours don&amp;#039;t have much flair. Consequently, the album is a little subdued, which is appropriate for a romantic album. And, judged as a romance album, it works pretty well. Essentially, A Love Like Ours is a simple love album, a soundtrack to Streisand and Brolin&amp;#039;s wedding that will work for other weddings. It&amp;#039;s mood music that doesn&amp;#039;t set the mood, but will compliment the mood quite nicely. \n\nEnjoy.","torrent":{"xt":"urn:btih:340bf731c465e34a9847014e16fbde6ce21cb32e","amp;dn":"Barbra+Streisand+-+A+Love+Like+Ours+-+%281999%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"340bf731c465e34a9847014e16fbde6ce21cb32e","infoHashBuffer":{"type":"Buffer","data":[52,11,247,49,196,101,227,74,152,71,1,78,22,251,222,108,226,28,179,46]},"announce":[],"urlList":[]}}