{"title":"Google Earth Pro Final 4.2.0205.5730","uid":4229742,"size":25330552,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:34d8dc67ef78ccfa3cac28fc7d4f3dfd0bce667a&amp;dn=Google+Earth+Pro+Final+4.2.0205.5730&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ikoqiso","files":2,"time":1212985186,"description":"With Google Earth Pro, it?s easy to research locations and present your discoveries. In just a few clicks, you can import site plans, property lists or client sites and share the view with your client or colleague. You can even export high-quality images to documents or the web. Annotate and visualize Represent your location-based data using 3D drawing tools, or transfer up to 2,500 locations by address or geospatial coordinates from a spreadsheet. The GIS Data Importing Module lets you incorporate GIS data in file formats such as .shp and .tab. Examples include parcel, demographic, and 3D building data. Share and analyze Share your Google Earth views and data representations with your clients as a KML, Google Earth?s original file format. With your upgraded Pro subscription, you get additional measurement tools (square feet, mile, acreage, radius and so on), so simply select the points on the screen using your mouse and let Google Earth calculate the rest. Create visually powerful presentations Export high-resolution images up to 11&quot; x 17&quot; (4800 pixels, sample print - 890k), and use them in documents, presentations, web or printed materials. Your audience can come along for the ride as you create your own compressed movies (.wmv, sample movie - 13MB) of the zooms and virtual tours you take in Google Earth. Useful for many industries Whether you?re in commercial real estate, insurance or media, Google Earth Pro lets you represent geo-specific information to full dramatic effect.","torrent":{"xt":"urn:btih:34d8dc67ef78ccfa3cac28fc7d4f3dfd0bce667a","amp;dn":"Google+Earth+Pro+Final+4.2.0205.5730","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"34d8dc67ef78ccfa3cac28fc7d4f3dfd0bce667a","infoHashBuffer":{"type":"Buffer","data":[52,216,220,103,239,120,204,250,60,172,40,252,125,79,61,253,11,206,102,122]},"announce":[],"urlList":[]}}