{"title":"Hawking, A BRIEFER HISTORY OF TIME chaptered","uid":4081405,"size":131898335,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:35b487db96d7c7e193de01585410a93b9b9402eb&amp;dn=Hawking%2C+A+BRIEFER+HISTORY+OF+TIME+chaptered&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Donleavy","files":24,"time":1205587826,"description":"First I would like to give credit to autoslump for the original upload of this great audiobook.\nSo why am I uploading the same source?\nWell I make a habit of breaking down CD Audio books into their chapters if possible and this one was quite easy to break into subjects. I took a small bit of integral music to append as an end marker for each subject.\n\nHaving done that it struck me that other folk might like a copy so I have decided to upload it.\n\nI have also included a couple of pdf files that might be of interest\n1. The associated text written by Stephen Hawking\n\n2. A parody by Erik Schuman version that I found somewhere.\n\\&amp;#039;An irreverent overview of important cosmic milestones covers topics ranging from the formation of the galaxy to the expansion of the Internet\\&amp;#039;\n\n\nPersonally I enjoyed the Schuman text but even so the subjects are not exactly easy for an average chap like myself. Anyway if either are useful to anyone out there my purpose will have been met.\n\n\nNotes From Original Uploader autoslump\n---------------------------------------------------------- &lt;a href=&quot;\nhttp://thepiratebay.se/tor/3925899/A_Briefer_History_of_Time_(Stephen_Hawking)_%5BNF%5D&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/tor/3925899/A_Briefer_History_of_Time_(Stephen_Hawking)_%5BNF%5D&lt;/a&gt;\n\nA Briefer History of Time\n\nBy: Stephen Hawking &amp; Leonard Mlodinow\n\nNarrator: Erik Davies\n\nLength: 4 hours and 21 min\n\nType: Unabridged Audio\n\nMP3, 64Kbps, 22KHz, Stereo, CBR\n\nPublisher\\&amp;#039;s Summary:\n\nStephen Hawking\\&amp;#039;s worldwide best seller, A Brief History of Time, has been a landmark volume in scientific writing. Its author\\&amp;#039;s engaging voice is one reason, and the compelling subjects he addresses is another: the nature of space and time, the role of God in creation, the history and future of the universe. But it is also true that in the years since its publication, readers have repeatedly told Professor Hawking of their great difficulty in understanding some of the book\\&amp;#039;s most important concepts.\n\nThis is the origin of and the reason for A Briefer History of Time: its author\\&amp;#039;s wish to make its content more accessible to readers, as well as to bring it up-to-date with the latest scientific observations and findings.\n\nAlthough this book is literally somewhat \\&quot;briefer\\&quot;, it actually expands on the great subjects of the original. Purely technical concepts, such as the mathematics of chaotic boundary conditions, are gone. Conversely, subjects of wide interest that were difficult to follow because they were interspersed throughout the book have now been given entire chapters of their own, including relativity, curved space, and quantum theory.\n\nThis reorganization has allowed the authors to expand areas of special interest and recent progress, from the latest developments in string theory to exciting developments in the search for a complete unified theory of all the forces of physics. Like prior editions of the book, but even more so, A Briefer History of Time will guide nonscientists everywhere in the ongoing search for the tantalizing secrets at the heart of time and space.\n\nSummary:\n\nHawking\\&amp;#039;s A Brief History of Time, published in 1988 (whereas this \\&quot;Briefer\\&quot; edition is published in 2005), was a surprise best-seller but a tough read for most people who tackled it. Hawking received many requests for a version that would make his discussion of deep questions about the universe more accessible. This book does that. Hawking and Mlodinow, a physicist turned science writer, proceed by small and careful steps from the early history of astronomy to today\\&amp;#039;s efforts to construct a grand unified theory of the universe.\n\nSummary:\n\nIn the 17 years since the publication of A Brief History of Time, Dr. Hawking\\&amp;#039;s bestselling exposition of physics, new data from particle physics and observational astronomy have shed light on efforts to find a Grand Unified Theory of Everything that Hawking and Mlodinow use to enhance and update their answers to basic questions about the universe: where it\\&amp;#039;s going and how it began. Discussed at length are the mysterious dark matter and dark energy-both of which can only be observed by their gravitational effects and are believed to make up 90 percent of the universe. Another area of research that has exploded in the past 20 years is string theory. Hawking and Mlodinow provide one of the most lucid discussions of this complex topic ever written for a general audience. Readers will come away with an excellent understanding of the apparent contradictions and conundrums at the forefront of contemporary physics. Recognizing that much of their audience will also be science fiction buffs, they include a chapter on the possibility of time travel. \\&quot;Don\\&amp;#039;t bet on it,\\&quot; the authors advise. Throughout these discussions, the authors maintain the same wry, lively tone that made the original Brief History such a delight. They close with a discussion of where physics ends and philosophy begins, \\&quot;Why does the universe exist at all?\\&quot; They cannot provide the answer, but they do provide an immense amount of food for thought. Highly recommended.\t\t\n\n","torrent":{"xt":"urn:btih:35b487db96d7c7e193de01585410a93b9b9402eb","amp;dn":"Hawking%2C+A+BRIEFER+HISTORY+OF+TIME+chaptered","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35b487db96d7c7e193de01585410a93b9b9402eb","infoHashBuffer":{"type":"Buffer","data":[53,180,135,219,150,215,199,225,147,222,1,88,84,16,169,59,155,148,2,235]},"announce":[],"urlList":[]}}