{"title":"Black Sabbath - Master Of Reality (1971) (W.B.Rhino Rem. 2004) [","uid":4219120,"size":252774800,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:35d527c6f4236c3ad2666915e061681129d025ec&amp;dn=Black+Sabbath+-+Master+Of+Reality+%281971%29+%28W.B.Rhino+Rem.+2004%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sworduigi","files":9,"time":1212507248,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Found (Ripped by Necromandus)\nArtwork: Full scans.\n\n\n\nGeneral Info\n\n\nAlbum: Master of Reality\n\n\n\nTracklist:\n\n   1. &quot;Sweet Leaf&quot; ? 5:05\n   2. &quot;After Forever&quot; ? 5:27\n   3. &quot;Embryo&quot; ? 0:28\n   4. &quot;Children of the Grave&quot; ? 5:17\n   5. &quot;Orchid&quot; ? 1:30\n   6. &quot;Lord of This World&quot; ? 5:26\n   7. &quot;Solitude&quot; ? 5:02\n   8. &quot;Into the Void&quot; ? 6:13\n\n\n              LINE UP:\n\n    * Ozzy Osbourne ? lead vocals\n    * Tony Iommi ? guitar, flute, piano\n    * Geezer Butler ? bass guitar\n    * Bill Ward ? drums, backing vocals\n\n    * Keef ? photography, poster design\n    * Mike Stanfod ? art direction\n    *Dan Hersch, Bill Inglot ? remastering (2004)\n\n\nReview taken from revelationz.net:\nListening to Master Of Reality brings forth an image of a dark and mystic veil that slowly but firmly covers your mind with mystic ease, leaving your senses blurred, it kind of just takes you in.\nTo me this is one of Sabbaths most dark and heavy releases and that we find ourselves in the year 1971 only makes this piece of music even more unique and special, they were truly ahead of their time.\nFrom the opening sequences of Sweet Leaf the ultra tight and groovy feeling is firmly established as a standard for the rest of the album to build upon.\nI have always been very fascinated by Geezers technical and participating bass approach, After Forever is a mind-blowing example of his amazing style, he simply kills in this one.\nOne of Sabbath&amp;#039;s biggest strengths is their choice and ability to make both simple and complex creations. This is of the more or less progressive kind, having lots of changes and clever interludes, take Iommi&amp;#039;s ingenious solo that sounds down right phenomenal.\nThe Sabbath hymn Children Of The Grave goes down a more simple but nevertheless hard hitting road, Bill Ward&amp;#039;s diverse drum delivery gives the song a very special dynamic.\nOrchid is one of Iommi&amp;#039;s best instrumentals, a soft and harmonious acoustic journey leading the way for Lord Of This World to unfold it&amp;#039;s mystic magic. A high grooving cut with a fantastic guitar/bass interplay, not the most exciting rhythm path but it keeps things together.\nSolitude ranks as one of my favourite Sabbath songs. The spellbinding and sensitive atmosphere is totally unique and embraces you right away. Ozzy&amp;#039;s profound and very emotional vocals fit the mood perfectly and the mesmerizing flute parts give it even more depth. The acoustic guitar and deep bass in some strange way manages to be both the fundament of the creation and yet it also politely stays in the background. This is a true masterpiece.\nThe jamming opening of Into The Void that suddenly explodes with one of Iommi&amp;#039;s fiercest riffs ever is bound to amaze. The shift between fast paced intensity and ultra slow grooves gives this ending creation a highly interesting structure. There are so many cool details to discover on the entire album and this song is filled with them.\nWhen the last second of music has faded (man it&amp;#039;s only 34 minutes) I&amp;#039;m left with a feeling of wanting more and honestly I have a hard time finding anything not working well on this disc, every riff, every chorus and every change in direction is there for a reason and it seems that all decisions made only enhances the quality. Every member put their unique and high quality stamp on this release and there is something magical about the way they collaborate.\nThe lyrics deal with questions about belief and existence, love gone bad and a hope for a better and peaceful world. It&amp;#039;s not the most detailed writings but the meanings and messages are striking.\nThe sound on this remastered version is good when taking the original year of production into consideration, the cymbals and some vocals parts sounds a bit trebled but everything is quite clear and powerful.\nMaster Of Reality paints a world of doom and enchantment, a fascinating place with a compelling and hypnotic effect on your mind.","torrent":{"xt":"urn:btih:35d527c6f4236c3ad2666915e061681129d025ec","amp;dn":"Black+Sabbath+-+Master+Of+Reality+%281971%29+%28W.B.Rhino+Rem.+2004%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"35d527c6f4236c3ad2666915e061681129d025ec","infoHashBuffer":{"type":"Buffer","data":[53,213,39,198,244,35,108,58,210,102,105,21,224,97,104,17,41,208,37,236]},"announce":[],"urlList":[]}}