{"title":"YOU CAN'T DO THAT ON TELEVISION DVD Disc 3 of 12 (ISO)","uid":4116627,"size":4681480192,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3686e4cbe466e2f4ed8273c0277fb4d858021cad&amp;dn=YOU+CAN%5C%27T+DO+THAT+ON+TELEVISION+DVD+Disc+3+of+12+%28ISO%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bo Bandy","files":1,"time":1207343373,"description":"YOU CAN&amp;#039;T DO THAT ON TELEVISION\nDISC 3 OF 12\n\nSometime near the end of 2006, while perusing the internet for some way of acquiring episodes of YCDTOTV I came across a website that offered every episode of the show on 12 DVD-Rs for the low, low price of $60.  I&amp;#039;m pretty sure the site that I stumbled upon is gone now, because I searched for it so I could provide a link in this description and could not find it.  The site was upfront about it being on DVD-Rs, and that the source were VHS tapes.  So going into it I wasn&amp;#039;t fooling myself into thinking I was getting digitally remastered copies or something.  I figured it would be like watching old VHS tapes.  I could handle paying $60 for old VHS tapes of every episode, why not digital copies?  Well, I got the set a couple days later and found the quality to be somewhat lower than actual old VHS tapes.  Some episodes are unwatchable, but many are fairly decent.  So why am I uploading this set?  Well, one reason is that I&amp;#039;ve never seen any episodes of YCDTOTV offered on any torrent site.  Another reason is because maybe someone with better quality copies will see some of these and think, &quot;maybe I should upload my higher quality versions.&quot;  Yet another reason is because maybe that site is still around, charging good people $60 a pop for shitty workmanship.  Download it for free here.  Upload it somewhere else.  Spread it around.\n\nI&amp;#039;d like to mention that the website www.barthsburgery.com offers quality DVDs of the show, just not of every episode.  Check them out if you have the time.  \n\nDisc 3\n22  Rip-Offs\n23  Bullying\n24  Culture Junk\n25  Telelvision\n26  Sports\n27  Heroes\n28  The Not-So-Fair Show\n29  Growing Up\n30  Pets\n31  Rules &amp; Regulations\n32  Manners\n33  Medicine","torrent":{"xt":"urn:btih:3686e4cbe466e2f4ed8273c0277fb4d858021cad","amp;dn":"YOU+CAN%5C%27T+DO+THAT+ON+TELEVISION+DVD+Disc+3+of+12+%28ISO%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3686e4cbe466e2f4ed8273c0277fb4d858021cad","infoHashBuffer":{"type":"Buffer","data":[54,134,228,203,228,102,226,244,237,130,115,192,39,127,180,216,88,2,28,173]},"announce":[],"urlList":[]}}