{"title":"WinRar 5.30 Corporate Edition PT-BR","uid":12858158,"size":6868069,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:36920e7b9b33a66875b58a431ddc9e67bfc14094&amp;dn=WinRar+5.30+Corporate+Edition+PT-BR&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":2,"time":1448708191,"description":"\nWinRAR é um compactador RAR para Windows, inclusive com suporte para outros formatos. Ele promete compactar de 8% a 15% a mais que o seu principal concorrente, o WinZIP. Portanto, se você não quer perder tempo para compactar e descompactar arquivos transmitidos pela internet, faça um &quot;test drive&quot; deste programa, que tem como diferencial um menu sempre interativo e navegável.\r\n\r\nWinRAR é um dos únicos softwares que trabalha com arquivos dos mais diferentes formatos de compressão, tais como: ACE, ARJ, BZ2, CAB, GZ, ISO, JAR, LZH, RAR, TAR, UUEncode, ZIP, 7Z e Z. Também suporta arquivos de até 8.589 bilhões de Gigabytes!\r\n\r\n\r\nCaracterísticas Gerais:\r\n\r\nA lista de todos os arquivos compatíveis.Ao usar o WinRAR você terá uma grande gama de ferramentas para compactar arquivos e salvar espaço no computador!\r\nTrabalha com diferentes formatos de arquivos.\r\nOferece uma interface gráfica intuitiva e fácil de usar, permitindo usar o mouse e menus de forma ágil, assim como o uso de uma interface através de linhas de comando.\r\nPossui um guia passo a passo especial que fornece acesso instantâneo às funções mais básicas para você realizar suas tarefas.\r\nÉ capaz de codificar seus arquivos com uma das tecnologias mais avançadas de criptografia com até 128 Bits: AES (Padrão de criptografia avançada).\r\nPermite criar extração rápida e trabalhar com arquivos de vários volumes.\r\nEstá sempre em constante desenvolvimento, possuindo atualizações frequentes","torrent":{"xt":"urn:btih:36920e7b9b33a66875b58a431ddc9e67bfc14094","amp;dn":"WinRar+5.30+Corporate+Edition+PT-BR","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36920e7b9b33a66875b58a431ddc9e67bfc14094","infoHashBuffer":{"type":"Buffer","data":[54,146,14,123,155,51,166,104,117,181,138,67,29,220,158,103,191,193,64,148]},"announce":[],"urlList":[]}}