{"title":"Liberty Realm Series - K.D. Faerydae","uid":12762658,"size":3073682,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:36d521c87b90725d1900f0b2729cd9b7f9987f80&amp;dn=Liberty+Realm+Series+-+K.D.+Faerydae&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":6,"time":1447551090,"description":"01. Hidden Magic [Liberty Realm, #01] - K.D. Faerydae\r\n\r\n\r\n\r\nThe humans were not allowed to know the true magic of this world. They were sometimes unkind, selfish and ignorant. If the humans were to experience the world’s true magic, they may damage or even destroy it. They had already fought with their own kind, destroyed the land and selfishly killed many of God’s creatures. It was therefore decided: the magic must remain hidden from the humans... forever.\r\n\r\nEight-year-old Grace Darling lives in the small village of Witern Wood. She and her best friend Christian have had many adventures within the woods but have never once come across the ancient gate that lies concealed behind a large holly bush– the entrance into Liberty, a magical land, where everything is currently not as it should be. An evil force is lurking, depleting Liberty of all that is good. The malevolent Nomeds feed frequently and with each meal they become more formidable. The noble Zavier, leader – or ‘Berthold’ – of Maytime Meadow is tasked with the collection of the rest of the realm’s Berthold. These leaders must gather in front of the Great Prophet, who has foreseen a way in which the Nomeds may be defeated.\r\n\r\nZavier selects some of his herd and the small and chirpy Chester to accompany him on a magical and treacherous journey across Liberty. The group face many challenges, a race against time and an increasing threat from the evil Nomeds. Will they make it in time… and what exactly has been prophesied?\r\n\r\n\r\n\r\n02. An Army of Good [Liberty Realm, #02] - K.D. Faerydae\r\n\r\n\r\n\r\nGrace and her best friend Christian are whisked through the magical land of Liberty upon the back of the noble Zavier. The powerful Shire horse takes them to the relative safety of Serenity Sunrise Beach, where they frolic upon the golden sands and splash playfully within the turquoise waters. They form many close bonds with the creatures of the realm and much fun is had. But this enjoyment does not last long, for as the sun shines brightly on Serenity, the darkness within the swamp is growing, the evil is spreading and the Nomeds are getting bolder.\r\n\r\nGrace and Christian embark on a magical roller coaster ride of emotions. They help select an army of good, an extraordinary legion of creatures that are to fight in the battle against the Nomeds.\r\n\r\nAnd so the children commence with their training and prepare for war… a war between good and evil","torrent":{"xt":"urn:btih:36d521c87b90725d1900f0b2729cd9b7f9987f80","amp;dn":"Liberty+Realm+Series+-+K.D.+Faerydae","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"36d521c87b90725d1900f0b2729cd9b7f9987f80","infoHashBuffer":{"type":"Buffer","data":[54,213,33,200,123,144,114,93,25,0,240,178,114,156,217,183,249,152,127,128]},"announce":[],"urlList":[]}}