{"title":"David Johansen- Self Titled 1978- New York Dolls","uid":4171127,"size":235717501,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3753e8d857b72821bdc5cf261cbbde0dbfc7cff4&amp;dn=David+Johansen-+Self+Titled+1978-+New+York+Dolls&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"doctorbrian","files":9,"time":1209869820,"description":"David Johansen&amp;#039;s 1978 self titled solo debut. Re-released on CD 4/2008.\nRipped as lossless WMA.\n\nI&amp;#039;ll put his &amp;#039;82 &amp;#039;Live It Up&amp;#039; album if people respond to this one.\n\n\nFrom All Music Guide...\nDavid Johansen&amp;#039;s self-titled solo debut bears a closer resemblance to his work with the New York Dolls than any of his subsequent recordings, but the former Dolls singer cleverly crafted an album that played to his former band&amp;#039;s strengths while establishing an identity of his own and delivering a set of tight but powerful hard rock. Where the Dolls were frequently sloppy and poorly focused (if often gloriously so), David Johansen rocks with a cleaner but equally emphatic guitar attack (courtesy Johnny Rao and Thomas Trask), while Johansen&amp;#039;s vocals are noticeably more powerful and sharper than his earlier music. Johansen&amp;#039;s songs are more straightforward and less campy than his Dolls tunes; while &quot;Funky But Chic&quot; would have done his old glam buddies proud (&quot;Mama says I look fruity, but in jeans I feel rotten&quot;), the celebration of the fair sex in &quot;Girls&quot; and &quot;I&amp;#039;m a Lover&quot; cuts his former sexual ambiguity to the quick, and the tough rock &amp; roll good times of &quot;Cool Metro&quot; and the girl-trouble commiseration of &quot;Pain In My Heart&quot; show Johansen could move into more conventional lyrical territory without losing his swagger or street smarts along the way. And while the Dolls didn&amp;#039;t leave Johansen much room for slow songs where he could wear his heart on his sleeve, &quot;Donna&quot; and &quot;Frenchette&quot; allow him to do just that, and remarkably well. David Johansen in some respects seems like a deliberate attempt to sidestep much of the baggage that weighed down the New York Dolls in their bid for rock stardom, but at the same time its celebration of women and good times isn&amp;#039;t simple or without its own appreciation of good danger, and it rocks out with a New York street vibe that has a life of its own; it&amp;#039;s still Johansen&amp;#039;s best solo work to date. \n\n\nDFFD\n","torrent":{"xt":"urn:btih:3753e8d857b72821bdc5cf261cbbde0dbfc7cff4","amp;dn":"David+Johansen-+Self+Titled+1978-+New+York+Dolls","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3753e8d857b72821bdc5cf261cbbde0dbfc7cff4","infoHashBuffer":{"type":"Buffer","data":[55,83,232,216,87,183,40,33,189,197,207,38,28,187,222,13,191,199,207,244]},"announce":[],"urlList":[]}}