{"title":"Rent.a.Cop.s01e03.EN.SUB.HEVC.x265.WEBRIP.[MPup]","uid":12752494,"size":138917645,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:37aa57939463329d73e785edda03478abb0ddf6f&amp;dn=Rent.a.Cop.s01e03.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"makinapufterpup","files":2,"time":1447399932,"description":"Rent.a.Cop.s01e03.EN.SUB.HEVC.x265.WEBRIP.[MPup]\r\n\r\n\r\nFormat: [b]This is a [i]HEVC x265 MKV[/i] file. You may need to update your video codecs to play this file.[/b]\r\nSize: 1280x720\r\nDisplayAspectRatio: 16:9\r\nFrameRate: 25.000 fps\r\nAudioCodec: AAC\r\nChannels: 2 channels\r\nSamplingRate: 48.0 KHz\r\n\r\n[b]3 of 8[/b]\r\n\r\nSeries following a Darlington-based private security firm. Francis embarks on a marketing drive to offer his services to the gay community, and escorts a drag queens' coach trip.\r\n\r\n[img]http://extraimago.com/images/2015/11/13/69ba5358ceead0952eb43728a398e8b7.jpg[/img]\r\n\r\nObservational documentary series following Sparta Security, a Darlington-based private security firm. Sparta is run by well-known local character Francis Jones, who has given behind-the-scenes access to himself, his staff and their operations.\r\nFrancis is a born-again Christian and former professional boxer. He is a man with a big personality and he's on a mission to clean up the streets of Darlington. No job is too small for Sparta Security, and Francis often goes the extra mile to help his clients, with often outrageous but also hilarious consequences.\r\nFrancis relies on his office team, Rachel and Claire, who use their unusual sales techniques to help him find and secure new business. The work they bring in varies from mediating in neighbourhood disputes to guarding against grand larceny at big businesses in the area. Francis employs a number of security staff to work with him, including balaclava-clad ex-forces officers, part-time bouncers and a personal trainer, and together they use a range of unorthodox methods to make Darlington a better place to live.\r\nFrancis embarks on a marketing drive to offer his services to Darlington's gay community and gets a job escorting a coach trip for drag queens on a bank holiday pub crawl in Leeds. Sparta's campaign to catch Darlo's nuisance bikers goes undercover as Francis hires an ex-forces specialist for a stakeout. Pembow takes his girlfriend for dinner to celebrate the successful start of his apprenticeship, but his professional discipline is tested when things get lively on the drag queens' coach trip.\r\n\r\n[img]http://extraimago.com/images/2015/11/13/69a9348527542dfc06af8f7b07f032e2.jpg[/img]","torrent":{"xt":"urn:btih:37aa57939463329d73e785edda03478abb0ddf6f","amp;dn":"Rent.a.Cop.s01e03.EN.SUB.HEVC.x265.WEBRIP.%5BMPup%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37aa57939463329d73e785edda03478abb0ddf6f","infoHashBuffer":{"type":"Buffer","data":[55,170,87,147,148,99,50,157,115,231,133,237,218,3,71,138,187,13,223,111]},"announce":[],"urlList":[]}}