{"title":"Movie clips in H.264 to demo superior quality ripping","uid":4173142,"size":63158599,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:37e039b545ee0ba22732acaf71ef9ca8a27955b0&amp;dn=Movie+clips+in+H.264+to+demo+superior+quality+ripping&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"nitrogun","files":6,"time":1209982651,"description":"Contents are 2 movie clips, a 5 minute clip from 5 movies, received on a satellite TV receiver at 4:3 aspect ration, and a 3 minute clip made up of 6 x 30s clips from movies, of a widescreen transmission. Both movies have been trimmed to a 16:10 aspect ration to completely fill a standard widescreen TV or Monitor. They are best played with Quicktime player or VLC. \n\nThis is a 5 minute demonstration of how much better H.264 can be compared to the usual formats seen in torrents. It consists of 5 random 1 minute pieces taken from TV transmissions made in 4:3 Format, copied with a PVR, ripped to MP4/H.264/AAC with MPEG Streamclip on a Mac (Software available free for both Mac and PC)\nTrimmed the black from the sides (132 pixels of just black cut from left and right sides, and 40 pixels from top and bottom (so that 16:10 aspect ratio results)\nThe MPEG Streamclip settings for 4:3 broadcast TV caught on a PVR are:\n\n45% quality, \n1024x576 (16:9)\nAudio MPEG-4 AAC 128 kbps\nDe-interlace Video (needed from PVR format)\nMultipass\nB-Frames\nBetter Downscaling\nBrightness +10%\nContrast 118%\nSaturation 100%\nVolume +6dB\n\nThe result is a file that is usually same or smaller size than a DIVX or XVID file, but much larger image (760x496 with these settings) compared with average Divx being only 288-352 pixels High. \nThese 5 clips from different movies (a Disney Movie, Simpsons, Scrubs, American Dad, Seinfeld) are joined together and average 1036kbps\nI suggest you view these Fullscreen mode in a large widescreen monitor, eg, 1680x1024 to really see how they beat Divx hands-down. \nListen also the the sound, been amplified to a decent but clear level so that even a laptop speaker can allow you to listen to it without straining your ears. \n\nFor Widescreen TV broadcast caught on PVR, I use a Top/Bottom Crop of 26 each, and a Left/Right crop of 92 each.   This gives a result of 840 x 524 pixels, The Second sample is made up of 6  clips of 30 seconds each from a variety of movies/shows, starting with Paycheck. The other settings are the same \n\nAs I use a PERCENTAGE QUALITY rather than setting a kbps rate, the final size of movies can vary a bit, but the quality is excellent always. The 6 clips will represent an average bitrate obtained, and to see that size an average complexity 90 minute movie would be, multiply the 5 minute sample by 18, and the 3 minute sample by 30\nDarker movies use less kbps and are smaller, and bright action movies are larger. \nPaycheck off TX was 1519kbps, duration 109 min for 1.16Gb  I believe the extra size well worth it for the extra quality, and disk space is so cheap, and blank DVD\\&amp;#039;s are only 25c a disk, so why be bound by an outdated 700Mb CD size limit. DVD players that read Divx can read it off a DVD just as well as off a CD. And a lot of us are using small lounge PC\\&amp;#039;s as DVD players, with a large LCD monitor as a TV screen. \n\nEven so, at the samples attached show, even at these higher resolutions, H.264 delivers superior quality, (especially when viewed on a large widescreen monitor, where the poorer quality torrents really look poorly) BUT could still produce most 90 minute videos at less than 700Mb\nTough luck about not being playable on a Divx player, if you cannot watch it on your PC, then just make a quick divx conversion to copy to CD/DVD to do that, the high quality of the \\&quot;original\\&quot; will ensure you could make a better than OK Divx from the samples attached. Try it. \n\nI put these up as an example of what other formats than the standard .avi  or  .divx can look like, and hope that more and more uploaders will make movies of this quality available. ","torrent":{"xt":"urn:btih:37e039b545ee0ba22732acaf71ef9ca8a27955b0","amp;dn":"Movie+clips+in+H.264+to+demo+superior+quality+ripping","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"37e039b545ee0ba22732acaf71ef9ca8a27955b0","infoHashBuffer":{"type":"Buffer","data":[55,224,57,181,69,238,11,162,39,50,172,175,113,239,156,168,162,121,85,176]},"announce":[],"urlList":[]}}