{"title":"Doctor Who - AV022 - Cuddlesome (1989) - iPod Audiobook","uid":4070068,"size":95808990,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:3873871601324fb8f9a5d33fa290a8891b6db81b&amp;dn=Doctor+Who+-+AV022+-+Cuddlesome+%281989%29+-+iPod+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheDoctor05","files":4,"time":1205004965,"description":"Doctor Who - AV022 - Cuddlesome (1989) - iPod Audiobook\n\n\nThis is the original (1989) Audio adventure, Cuddlesome, written by Nigel Fairs and produced by Gary Russell.  The Doctor\nis played by Nick Briggs of today&amp;#039;s Big Finish.  This story was finally licensed, remade staring fifth Doctor Peter Davison\nand released on CD free with Doctor Who Magazine 393 in March 2008.\n\nThis original incarnation of this quite disturbing story is sourced from a 19 year old audio cassette.  Included is the \noriginal 1989 cover art as well, from this unauthorized release by &quot;Audio Visuals&quot;.\n\n\nThe Audio Visuals were an unlicensed series of Doctor Who audio dramas made by British fans in the 1980s. Featuring Nicholas Briggs as the Doctor, twenty-six audio plays were recorded and distributed on audio cassette between 1985 and 1991 (a pilot, in which the Doctor was voiced by Stephen Payne, was recorded in 1984). The first three seasons (released 1985-1988) were produced by Bill Baggs, and the fourth and final season (1989-1991) by Gary Russell.\n\nAlthough the Audio Visuals audios were a violation of copyright, the BBC chose to look the other way. Gary Russell later told an interviewer,\n\n&quot;We were fans doing some stuff for a handful of people. We never advertised in professional magazines, we kept ourselves to ourselves. In doing so, we broke every copyright rule in the book (hell, Terry Nation would have crucified us - although I think our Dalek stories knocked spots off Saward&amp;#039;s!) JNT was certainly aware of us, but he didn&amp;#039;t care. Why should he? We were no more than any other fan product and at least we weren&amp;#039;t printing articles about him or the show. I doubt Saward knew or cared. He wouldn&amp;#039;t know drama if it bit him.&quot;[1] \nMany of those involved in the Audio Visuals went on to work in more professional, licensed science fiction audio drama, either through BBV (founded by Bill Baggs) or through Big Finish Productions (which in 1999 began producing licensed Doctor Who audio drama under the guidance of Gary Russell). Nicholas Briggs has worked for both BBV and Big Finish as an actor and as a writer; he also worked on additional Doctor Who-related/inspired productions for Reeltime Pictures and, beginning in 2005, provided vocal work for the new Doctor Who series.\n\nSeveral other Audio Visuals scripts have been remade professionally, either by BBV (with the Doctor Who elements removed, as part of the video series The Stranger) or Big Finish (as licensed Doctor Who audios). The Big Finish audios which were adapted from Audio Visuals plays are The Mutant Phase, Sword of Orion, Minuet in Hell and the Doctor Who Magazine special release Last of the Titans.\n\nElements from various Audio Visuals plays also appear in Gary Russell&amp;#039;s contributions to the licensed Doctor Who novel ranges published by Virgin and the BBC, most notably in Deadfall.\n\n\n","torrent":{"xt":"urn:btih:3873871601324fb8f9a5d33fa290a8891b6db81b","amp;dn":"Doctor+Who+-+AV022+-+Cuddlesome+%281989%29+-+iPod+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3873871601324fb8f9a5d33fa290a8891b6db81b","infoHashBuffer":{"type":"Buffer","data":[56,115,135,22,1,50,79,184,249,165,211,63,162,144,168,137,27,109,184,27]},"announce":[],"urlList":[]}}