{"title":"WarDay &amp; The Journey Onward by Whitley Strieber and James Kunetk","uid":4207363,"size":770422312,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:393d2e28ad86246fd3c3cc68a38ce6b6077696a1&amp;dn=WarDay+%26+The+Journey+Onward+by+Whitley+Strieber+and+James+Kunetk&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Coventry","files":1,"time":1211872010,"description":"Without a doubt one of the most chillingly realistic novels of the &quot;World War III&quot; genera. Whitley Strieber and James Kunetka create a story so rich in accurately researched detail, that the fact that this was written in the mid 80&amp;#039;s seems almost too prescient. The USSR initiates a &quot;limited&quot; nuclear war against the United States in response to the pending deployment of a totally effective missile defense system. The social, political and economic consequences are remarkable in their detail. The character development is rich in detail and unforgettable in its intensity. And, best of all, the ending is as well crafted as the beginning. Making for a totally satisfying literary experience.\n\nOK, now for the bad news. This audio book is a digital dub of 22 year old tapes. Yes, they are completely audible. However, those of you who are used to the quality of a full DVD rip will easily be able to tell the divergence. Still, for a book of this quality, now some 20 years out-of-print, this is a REAL TREAT. I will seed this for a long long time.\n","torrent":{"xt":"urn:btih:393d2e28ad86246fd3c3cc68a38ce6b6077696a1","amp;dn":"WarDay+%26+The+Journey+Onward+by+Whitley+Strieber+and+James+Kunetk","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"393d2e28ad86246fd3c3cc68a38ce6b6077696a1","infoHashBuffer":{"type":"Buffer","data":[57,61,46,40,173,134,36,111,211,195,204,104,163,140,230,182,7,118,150,161]},"announce":[],"urlList":[]}}