{"title":"Car Washer: Summer of the Ninja","uid":12760555,"size":199963456,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:39bc62cbf517a624196c4f6d587f9e1be1b60143&amp;dn=Car+Washer%3A+Summer+of+the+Ninja&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dauphong","files":1,"time":1447526725,"description":"About This Game\r\nSummer break, a time to relax and have fun. But what's the difference between a good summer and a great summer? Spending money, of course! And what better way to earn some extra cash than a car wash? Unfortunately, the local branch of Ninja Car Washing Corp. is right across the street and they don’t appreciate the competition...\r\n\r\nWash cars quickly to keep your customers happy and keep the money coming in. But beware! Those pesky ninja will do everything they can to run you out of business. You’ll need to use your wits, reflexes, and collection of basic car washing tools to defend against their attacks while keeping your customers happy.\r\n\r\nLearn to wield powerful items like the Garden Hose, Giant Sponge, and Reptile Wax both to clean cars and fend off the attacking ninja! You’ll start by defending against simple threats like muddy water balloons and exploding shuriken, but prove yourself superior to such petty tricks and your reputation will grow, earning you more customers and more attention from your enemies. Use the money earned to upgrade your stand and buy new gear such as the Polishing Cloth, Textured Sponge, and Fire Hose then put that equipment to work, taking on bigger jobs and fighting off mud firing bazookas, ninja assassins, and the dreaded trained pigeon attack squad!\r\n\r\nFeatures:\r\nAction/Casual Gameplay\r\nA hilarious story with hours of fun!\r\nThree fast and furious arcade modes for endless replay value!\r\nOver 25 different tools and upgrades for your car wash!\r\nOver 20 different ninja to fight!","torrent":{"xt":"urn:btih:39bc62cbf517a624196c4f6d587f9e1be1b60143","amp;dn":"Car+Washer%3A+Summer+of+the+Ninja","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"39bc62cbf517a624196c4f6d587f9e1be1b60143","infoHashBuffer":{"type":"Buffer","data":[57,188,98,203,245,23,166,36,25,108,79,109,88,127,158,27,225,182,1,67]},"announce":[],"urlList":[]}}