{"title":"Overclocked-JFKPC","uid":4129924,"size":6015840317,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:3b345c07344dc60a423162f3c3acc7998ea63477&amp;dn=Overclocked-JFKPC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wsxsun","files":4,"time":1207985936,"description":"Game summary:   \n\nSet against the backdrop of a catastrophic thunderstorm raging over New York City, Overclocked explores an archetypical, yet actual condition of mankind: violence. This psychological thriller mixes frightening fictional thriller elements using innovative narrative structures. Overclocked charts the diffuse areas where memories and illusions; dreams and reality; perpetrators and victims; collide. \n\nArmy psychiatrist, David McNamara, is called to the Staten Island Forensic Hospital in New York City to consult on a case that requires his expertise in forensic psychiatry. Tasked with exploring the minds of five young men and women who were found scared, screaming, and without memory, he makes alarming discoveries as he begins to cautiously explore the psyches of his young patients. Throughout the game, players will switch between six different characters in this chilling interactive psycho thriller. \n\nFeatures: \n\nSeveral Player controlled characters allow the player to experience the story from different viewpoints Innovative storytelling techniques create a unique gameplay experience Fluid character movements and an advanced facial animation system bring the characters to life Achieves cinematic presentation by use of camera techniques pioneered by feature films Icon based dialogue system Complex yet intuitive interface Dynamic realtime shadows Atmospheric real-time particle effects (rain, snow, lightning) ","torrent":{"xt":"urn:btih:3b345c07344dc60a423162f3c3acc7998ea63477","amp;dn":"Overclocked-JFKPC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3b345c07344dc60a423162f3c3acc7998ea63477","infoHashBuffer":{"type":"Buffer","data":[59,52,92,7,52,77,198,10,66,49,98,243,195,172,199,153,142,166,52,119]},"announce":[],"urlList":[]}}