{"title":"Pink Floyd - The Endless River (Deluxe Edition) 2015 320ak","uid":12853734,"size":192716750,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3bc38007de451b1eb2d609328043b7009503c636&amp;dn=Pink+Floyd+-+The+Endless+River+%28Deluxe+Edition%29+2015+320ak&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"analogkid6103","files":25,"time":1448644175,"description":"\nPink Floyd - The Endless River (Deluxe Edition) 2015 320ak\r\nWith Extra Bonus Tracks \r\n\r\nFrom 1969 to 1972 Pink Floyd made several film soundtracks ,the most dramatic being Zabriskie Point, in which Michelangelo Antonioni's closing sequence of explosions was complemented by Floyd's &quot;Careful With That Axe, Eugene&quot;  They began using the &quot;azimuth coordinated sound system&quot; in concert, a sophisticated 360-degree P.A. With Atom Heart Mother, they topped the British chart in 1970; stateside success, however, still eluded them.\r\n\r\n\r\n\r\nSubsequent albums explored similarly dark territory, although the relatively warm Wish You Were Here (Number 1, 1975) was dedicated to Barrett, eulogizing him with &quot;Shine On You Crazy Diamond.\r\n\r\nThe Wall, a brooding concept album about a troubled, isolated rock star named Pink, topped the U.S. chart for 15 weeks, and its nihilistic hit, &quot;Another Brick in the Wall,&quot; was banned by the BBC and in 1980 became the band's only Number One American single.\r\n\r\nMeanwhile, Pink Floyd's stage shows had become increasingly elaborate. For the Dark Side and Wish tours, there were slide/light shows and animated films, plus a giant inflated jet that crashed into the stage; for Animals, huge inflated pigs hovered over the stadiums; for The Wall (due to enormous expense, performed 29 times only in New York, L.A., and London) an actual wall was built, brick by brick, across the stage, eventually obscuring the band from audience view. Shortly after touring for The Wall Wright left the band, due to conflict with Waters.\r\n\r\nWith The Final Cut (Number Six, 1983), subtitled A Requiem for the Postwar Dream, Waters penned his darkest work yet. It also marked the effective end of the original Pink Floyd, with Waters bitterly departing, and Gilmour and Mason cementing their alliance. (Two films related to the original band (minus Barrett) have been made: the documentary Pink Floyd Live at Pompeii [1971] and The Wall [1982]. The latter featured stunning animation by Gerald Scarfe; Bob Geldof starred in the live-action sequences. The first remains a cult movie; the second was a massive commercial success.)\r\n\r\n\r\nIn the interim, Dark Side of the Moon had taken on yet new life, when certain Pink Floyd fans began playing the album while watching The Wizard of Oz and noting how the 1973 album seemed to provide an uncannily appropriate soundtrack to the 1939 film. The band itself denied that it had intended any sort of parallel between its music and the movie, but rumors persisted of an eerie connection between the two. Pink Floyd also entered the new millennium by releasing a live version, from 1980, of The Wall, in double-CD format, with a lavishly illustrated history.\r\n\r\nAlthough the appearance remained a one-time only affair, the classic line-up embraced at the end of their set. One year later, on July 7, 2006, Syd Barrett died at his home in Cambridge from complications related to diabetes.\r\n\r\nThat same year the Rogers Water led line-up of Floyd hit the road ? albeit in two different camps. David Gilmour hit theaters in America with Richard Wright on keyboards, while Roger Waters revived Dark Side Of The Moon in arenas with Nick Mason playing drums at select gigs. While promoters salivated over the prospects of a reunion tour, Gilmour remained steadfast in his refusal to even consider the possibility. \r\n\r\nThe Endless River Deluxe \r\n\r\n1. Pink Floyd - Things Left Unsaid [04:26]\r\n2. Pink Floyd - It's What We Do [06:16]\r\n3. Pink Floyd - Ebb And Flow [01:54]\r\n4. Pink Floyd - Sum [04:47]\r\n5. Pink Floyd - Skins [02:36]\r\n6. Pink Floyd - Unsung [01:06]\r\n7. Pink Floyd - Anisina [03:16]\r\n8. Pink Floyd - The Lost Art Of Conversation [01:42]\r\n9. Pink Floyd - On Noodle Street [01:41]\r\n10. Pink Floyd - Night Light [01:41]\r\n11. Pink Floyd - Allons-Y (1) [01:56]\r\n12. Pink Floyd - Autumn '68 [01:34]\r\n13. Pink Floyd - Allons-Y (2) [01:31]\r\n14. Pink Floyd - Talkin' Hawkin' [03:28]\r\n15. Pink Floyd - Calling [03:37]\r\n16. Pink Floyd - Eyes To Pearls [01:50]\r\n17. Pink Floyd - Surfacing [02:45]\r\n18. Pink Floyd - Louder Than Words [06:36]\r\n19. Pink Floyd - TBS9               2:27\r\n20. Pink Floyd - TBS14              4:11\r\n21. Pink Floyd - Nervana            5:32\r\n22. Pink Floyd - What Do You Want from Me  9.96 MB\r\n23. Pink Floyd - Not Now John              11.53 MB\r\n24. Roger Waters-Wish You Were Here(Bonus Live)   5:11\r\n\r\n\r\n\r\nPink Floyd\r\n\r\n   \r\nDavid Gilmour – guitars ,EBow guitar ,lead vocals ,backing vocals  bass guitar,voice samples \r\n    \r\nNick Mason – drums  percussion , rototoms , gong , voice samples \r\n   \r\nRichard Wright – Hammond organ","torrent":{"xt":"urn:btih:3bc38007de451b1eb2d609328043b7009503c636","amp;dn":"Pink+Floyd+-+The+Endless+River+%28Deluxe+Edition%29+2015+320ak","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bc38007de451b1eb2d609328043b7009503c636","infoHashBuffer":{"type":"Buffer","data":[59,195,128,7,222,69,27,30,178,214,9,50,128,67,183,0,149,3,198,54]},"announce":[],"urlList":[]}}