{"title":"Hero Wanted (2008) DVDScr","uid":4074760,"size":732932096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3bd7ddb9724071ea176d52daf01d16a7abb7eb1f&amp;dn=Hero+Wanted+%282008%29+DVDScr&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"circlensess","files":1,"time":1205248454,"description":"After he awakens in a hospital, a man tracks down and murders the man that left him and a bank teller for dead during a robbery, only to end up having the slain thief&amp;#039;s associates come after him in retaliation.\n\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0977214/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0977214/&lt;/a&gt;\n\n\nTHIS COMMENT MAY CONTAIN SPOILERS !!! I liked this movie a lot. The plot looks like it is a resume of a few others - &quot;Before the devil knows You&amp;#039;re dead&quot; and &quot;Death sentence&quot; come to mind. The non-linear structure of the movie makes the story looks more clever than it actually is. I found it OK though, nothing to complain about. The acting is solid for the genre. There are some unrealistic moments - at a particular moment some major injuries have much lesser effect on the guy who sustained them, but what the hell... On the other hand I liked very much the gunplay because in real life not many people are good shots, especially when in combat situation i.e. when the target is in fact shooting back. The characters were reloading often enough, the slides were remaining in rear position after the last shell has been ejected and shooting both guns simultaneously resulted in hitting nothing. Cool. There is even a moment where a guy is teaching the main character how to shoot and tells him &quot;forget about the movies.... now support the bottom of your gun with your left hand and don&amp;#039;t pull the trigger.. squeeze it!&quot; I actually thought that the movie was gonna pretty bad and I was pleasantly surprised. Definitely worth watching.","torrent":{"xt":"urn:btih:3bd7ddb9724071ea176d52daf01d16a7abb7eb1f","amp;dn":"Hero+Wanted+%282008%29+DVDScr","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bd7ddb9724071ea176d52daf01d16a7abb7eb1f","infoHashBuffer":{"type":"Buffer","data":[59,215,221,185,114,64,113,234,23,109,82,218,240,29,22,167,171,183,235,31]},"announce":[],"urlList":[]}}