{"title":"Legacy.Native.American.Photogravures.and.Music.DVDRip-neocon80","uid":4213815,"size":733298688,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3bf6cbc34b21a3e9d3616055e8b7d716d74980dc&amp;dn=Legacy.Native.American.Photogravures.and.Music.DVDRip-neocon80&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"neocon80","files":1,"time":1212227624,"description":"Legacy: Native American Photogravures &amp; Music is simply 58 minutes of early 20th century photos taken by Edward S. Curtis accompanied by Native American music. THERE IS NO DIALOGUE OR NARRATION.\n\nThe photographer Edward S. Curtis had a lot to do with setting the legend of Native American Indians in stone or, to be more accurate, in photogravure print. Curtis&amp;#039;s photos - shot between 1890 and 1930 and presented in his controversial book The North American Indian - made Native Americans legendary peoples that were at once mythic and authentic, historical and modern, realistic and romantic.\n\nThis video is basically 58 minutes of photogravure prints by Curtis taken from his famous book accompanied by splendid Native American music written and performed by Mary Youngblood, Joanne Shenandoah and Lawrence Laughing.\n\nPhotogravure is basically a photographic image produced from an engraved copper plate that when finished looks like a golden glowing sepia-toned lithograph. The process in done in three steps: First you take the picture then you produce a transparent glass printing plate of the image and then you printing the image on paper. The process takes a while, is expensive and must be done with care. Nobody did it better or with more purpose than Edward Curtis as is apparent from this video.\n\nThe entire presentation of the video is not unlike something you would see in a museum. Each of the images fade in, are held for a few seconds and then fade out. In most of the shots we simply see the striking photogravures, in others the camera graces an image showing us various aspects of it. And all along the way the music sets a graceful, lively, thoughtful or mysterious ambience.\n\nDuring his career Curtis photographed more than 80 Native American peoples. The images shown on the presentation include images of the Apache, Navajo, Mandan, Sioux, Maricopa, Mojave, Walapai, Ogala and dozens of more native peoples. Most of the images are of people in traditional dress rather than modern dress, which is the primary reasons for their controversy. But even if you know that Curtis was manipulating the images and the ethnography a bit the photogravures are still beautiful to behold. \n\n\nReleased in 2003\n\n\nAUDiO.........[ MP3 48000Hz 179 kb/s ABR (2 channels)\nLANGUAGE......[ NONE \nViDEO.........[ 1476 kbps XviD 29.9 FPS\nRESOLUTiON....[ 688 x 512\nDAR...........[ 1.344\nQUALiTY FRAME.[ 0.140\nSiZE..........[ 700 MB\nSOURCE........[ NTSC DVD\nDURATiON......[ 58mins 34secs\n\nBROUGHT TO YOU BY NEOCON80 OF THE KINYAA&amp;#039;AANII CLAN","torrent":{"xt":"urn:btih:3bf6cbc34b21a3e9d3616055e8b7d716d74980dc","amp;dn":"Legacy.Native.American.Photogravures.and.Music.DVDRip-neocon80","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3bf6cbc34b21a3e9d3616055e8b7d716d74980dc","infoHashBuffer":{"type":"Buffer","data":[59,246,203,195,75,33,163,233,211,97,96,85,232,183,215,22,215,73,128,220]},"announce":[],"urlList":[]}}