{"title":"Therapy? - Infernal Love","uid":4182330,"size":70070510,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3c28af7436d4a4f0529dcd7dce736a30fe6387f3&amp;dn=Therapy%3F+-+Infernal+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"billy_stretcher","files":11,"time":1210469385,"description":"Therapy?\nInfernal Love\nMetal/Rock\n1995\n192Kbps\n\n1.Epilepsy\n2.Stories\n3.A Moment Of Clarity\n4.Jude The Obscure\n5.Bowels Of Love\n6.Misery\n7.Bad Mother\n8.Me vs You\n9.Loose\n10.Diane\n11.30 Seconds\n\n\nThere&amp;#039;s one thing that I should remember,&quot; sings Andy Cairns on 30 Seconds, the final song on Therapy?&amp;#039;s third full-length album, Infernal Love. Oh yes, what&amp;#039;s that? &quot;There is a light at the end of the tunnel,&quot; he yells. Well, now he tells us. After 37 minutes of unadulterated angst, pain and despair, Therapy? stick a vaguely optimistic little Post-It note on the door of the medicine cabinet. The previous album, Troublegum (1993), was a similarly unhappy affair, but then the neuroses were tempered by catchy, upbeat tunes and the Belfast band&amp;#039;s famed sense of irony. No one will describe Infernal Love as bubblegrunge. It&amp;#039;s as heavy and dark as Metallica, as morose and melodramatic as Pink Floyd&amp;#039;s The Wall; and it&amp;#039;s great. Though still a trio, Therapy? seem to have extended their sound in all directions. Fyfe Ewing&amp;#039;s drumming, maniacal but machine-like on previous records, now pounds and crescendos all over the place, and Cairns&amp;#039;s guitar is dominant and varied in a way it never was before. His voice, still essentially a hoarse little thing, is multi-tracked and distorted into the larynx of Satan on Me Vs You and Bowels Of Love, the tension heightened by a string section. The latter, in fact, sounds like Tindersticks, up to the point when you realise Cairns is singing &quot;You poured . . . maggots down my throat/Until I choked&quot;. The narrowness which was always the group&amp;#039;s downfall has been jettisoned at last. This album ranges from the pop accessibility of Loose (which could have been lifted from Sugar&amp;#039;s Copper Blue) through heaving epics like A Moment Of Clarity to an actual Bob Mould cover, Diane, which is a work of pure dark genius. Their transformation is complete.\n\nEnjoy! :)","torrent":{"xt":"urn:btih:3c28af7436d4a4f0529dcd7dce736a30fe6387f3","amp;dn":"Therapy%3F+-+Infernal+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3c28af7436d4a4f0529dcd7dce736a30fe6387f3","infoHashBuffer":{"type":"Buffer","data":[60,40,175,116,54,212,164,240,82,157,205,125,206,115,106,48,254,99,135,243]},"announce":[],"urlList":[]}}