{"title":"Shoot.Em.Up.DVDRip (2007) gg","uid":4172757,"size":734256254,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:3cbb419dd4599e16bdc1259246b61e6dd097431e&amp;dn=Shoot.Em.Up.DVDRip+%282007%29+gg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nowgulli","files":2,"time":1209957513,"description":"I rated this movie a 10 in the context of other action movies; it&amp;#039;s nowhere near a 10 when compared to classics like Casablanca, but in it&amp;#039;s genre, it accomplishes exactly what it sets out to do.\n\nClive Owen stars as &quot;Smith&quot; a guy with a past (that&amp;#039;s slowly revealed during the crazy gun fights) who shows up as a knight in shining armor to a lady who is about to pop a baby and is being chased by baddies, headed up by Paul Giamatti. After he rescues the kid, he links back up with an old flame, DQ, played by Monica Bellucci. The movie starts out with a bang, quite literally and doesn&amp;#039;t settle down the entire time. There&amp;#039;s a plot somewhere in the movie, but if you think too hard, it&amp;#039;ll disappear in a puff of logic.\n\nThat being said, the gunfights and car chases are stellar. They are lots of fun, with ridiculous things going on the entire time. Just suspend your reason &amp; logic, strap into your theater seat and enjoy the ride.\n\nMichael Davis spoke before the preview and said he was an action movie buff since the beginning and made the movie he wanted to make. As an action movie fan, I thank him! \n\n","torrent":{"xt":"urn:btih:3cbb419dd4599e16bdc1259246b61e6dd097431e","amp;dn":"Shoot.Em.Up.DVDRip+%282007%29+gg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3cbb419dd4599e16bdc1259246b61e6dd097431e","infoHashBuffer":{"type":"Buffer","data":[60,187,65,157,212,89,158,22,189,193,37,146,70,182,30,109,208,151,67,30]},"announce":[],"urlList":[]}}