{"title":"Big Brother USA 9 Live Feeds - 03-07-08","uid":4069633,"size":558402344,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3d51bd4718b5275d185bb15352fb5362c29271b2&amp;dn=Big+Brother+USA+9+Live+Feeds+-+03-07-08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xx2000xx","files":8,"time":1204984155,"description":"Big Brother USA Live Feeds - 03/07/08 - xx2000xx\n\nFor youtube vids + exclusive content go to - http://bbcouchpotatoes.blogspot.com/\n\nFrom a game perspective this was by far the craziest day. Ryan flipped 3 different times and is all over the place.\n\nPart 1 - 6 min\nRight after POV. Chelsia won. Ryan confirms their plan and he&amp;#039;s going to backdoor Matt.\n\nPart 2 - 7 min\nChelsia comes up to the HOH room. He tells Chelsia that the plan is still in effect and Matt will leave Wed.\n\nPart 3 - 8 min\nMatt knows something might go down and freaks out. He goes to the HOH room and Ryan really doesn&amp;#039;t say anything. After this he went outside and sat alone in the hammock an hour.\n\nPart 4 - 33 min\nSheila has a true heart to heart with Adam. She breaks down and tells him that they&amp;#039;re basically screwed if they put up Matt because they&amp;#039;re next. - Adam talks to Ryan about putting up Matt, Ryan doesn&amp;#039;t deny it - Sheila has the game figured out and tells Nat everything.\n\nPart 5 - 42 min\nSheila pulls the move of the season. She flips Ryan in a span of 12 min. Excellent stuff here - A new alliance is formed. Matt/Nat/Sheila/Adam/Ryan. Shades of bb6 here. They want to take out the ring leader in Josh. - Josh reads his letter that he won at POV from his Mom - The other side of the house talks smack about the new alliance and how Matt is going this week while making fun of him.\n\nPart 6 - 33 min\nRyan comes up with a plan out of nowhere to take out James. We have our first big pow wow of the season and Matt/Ryan/Adam want to take out James this week. I think Ryan is dead set on this one too.\n\nPart 7 - 39 min\nNew alliance members Nat/Adam talk about the game - Adam tells a story about almost dying - More of the new alliance talk - Sheila/Nat talk about the crazy day - Nat talks to Ryan alone in the HOH room.","torrent":{"xt":"urn:btih:3d51bd4718b5275d185bb15352fb5362c29271b2","amp;dn":"Big+Brother+USA+9+Live+Feeds+-+03-07-08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3d51bd4718b5275d185bb15352fb5362c29271b2","infoHashBuffer":{"type":"Buffer","data":[61,81,189,71,24,181,39,93,24,91,177,83,82,251,83,98,194,146,113,178]},"announce":[],"urlList":[]}}