{"title":"IGI 2 MAC","uid":12756054,"size":1008544876,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:3dedd8c1083e5bbc0964f906ff4d71c3ebcef846&amp;dn=IGI+2+MAC&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MTechZonex","files":1,"time":1447451418,"description":"grading your torrent client!)\r\n                   PROJECT IGI 2 Convert Strike Mac : I'm going in\r\n===================================================================================\r\n----&gt; It features a blend of stealth, covert surveillance, and high-powered firefights at secret military bases.\r\n\r\n----&gt; The awkwardly named Project IGI: I'm Going 2 In follows in the trend of the Rainbow Six series, the Delta Force series, and SWAT 3. It eschews the outlandish futuristic weapons and imaginary settings of many traditional shooters and focuses instead on contemporary realism. In the game, you play as David Llewelyn Jones, a former Special Air Service member who now works as a freelance operative for both the British and American governments. The game features a blend of stealth, covert surveillance, and high-powered firefights at secret military bases, and it has much of the thrill and daring of the James Bond films of the late Cold War era.\r\n\r\n\r\n----&gt; Project IGI 2 Mac is a strictly single-player and multiplayer game with 14 missions+ that are often large and complex, but they're divided into smaller, more manageable objectives. Unfortunately, there's no way to save your game during a mission, and even on the lowest difficulty setting, some missions can be quite hard, and they will inevitably require you to restart from scratch a number of times before you achieve success. Since you'll typically be infiltrating military installations, you'll run into swarms of guards, many of whom stand waiting in towers with their sniper rifles. Death awaits at every corner. The abundance of guards is necessary because the game's enemy artificial intelligence is spotty if not downright poor, as enemies sometimes stand obliviously when you kill one of their comrades, who is only a few feet in front of them. Also, the game sometimes cheats by making guards appear out of thin air or from buildings that you've already cleared.\r\n\r\n----&gt; The vast outdoor environments really steal the show in Project IGI. Some design concepts for the proprietary 3D engine came from Innerloop's flight simulator, Joint Strike Fighter - and it shows. Early in the game, you'll infiltrate a military airbase with a seemingly endless runway, a geodesic radar dome, huge hangars with parked fighter jets, troop barracks, and so on, all of which are surrounded by realistically scaled and subtly textured hills and mountains. This huge visual scope is really immersive and memorable, especially since the outdoor terrain is so well textured. By contrast, the indoor environments in the game tend to be repetitive and forgettable. Also, because of the huge areas, you'll have to do lots of laborious running.\r\n\r\n===================================================================================\r\n\r\n----&gt; Instructions for Install:-\r\n1)Install IGI 2 MAC DMG.\r\n2)Copy IGI 2 to Application Folder\r\n3)Start playing the game by double-clicking the IGI 2 MAC GAME.\r\n4)Make sure go to setting in IGI 2 and select the screen resolution for you mac\r\n5)Make you screen bright to enjoy full 4k gaming experience.\r\n===================================================================================\r\n\r\n----&gt; So enjoy!!!\r\n\r\n----&gt; Uploaded by MTechZone.\r\nFeedbacks/Requests/Complaints/Dontaions:-   /icloud.com\r\n===================================================================================","torrent":{"xt":"urn:btih:3dedd8c1083e5bbc0964f906ff4d71c3ebcef846","amp;dn":"IGI+2+MAC","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3dedd8c1083e5bbc0964f906ff4d71c3ebcef846","infoHashBuffer":{"type":"Buffer","data":[61,237,216,193,8,62,91,188,9,100,249,6,255,77,113,195,235,206,248,70]},"announce":[],"urlList":[]}}