{"title":"Saw: Rebirth","uid":4097033,"size":16196288,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:3f0fe5adbca6a590d3bd8f10aa5b55adb4504953&amp;dn=Saw%3A+Rebirth&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TwiggsRevenge","files":1,"time":1206376799,"description":"Publisher \tIDW Publishing\nFormat \t        One-shot\nWriter(s) \tR. Eric Lieb\n                Kris Oprisko\nArtist(s) \tRenato Guedes\n\n\n\nSaw: Rebirth is a comic book one-shot published by IDW Publishing. It was written by R. Eric Lieb and Kris Oprisko with art by Renato Guedes.\n\nThe comic book is a prequel to Saw, as well as the entire series. It delves into the origins of the tortured John Kramer and his sinister alter-ego, Jigsaw. Also, it fleshes out Jigsaw&amp;#039;s past and motivations, and answers some unexplained questions from the first film such as how he knew all his victims and how a dying old man could concoct such elaborate traps.\n\nThe comic fit neatly into the first three films&amp;#039; storyline and explained many unanswered questions. It was discovered that John worked in a toy division, from where he may have acquired his sinister puppet, Billy. It was also discovered how he was familiar with all of his subjects from the first film. It was revealed that John&amp;#039;s loss of hair from the first film is not due to chemotherapy but rather him shaving his hair. John was also viewed doing all the research and experiments for his subjects, something that many had found hard to believe prior. Rebirth also marked the first appearance of Jill Tuck, John&amp;#039;s former wife, who later appeared in Saw III and Saw IV. (Betsy Russell, who was cast as Jill after the comic came out, bears little resemblance to her character in the comic.)\n\nWriter Leigh Whannell said on the commentary track for Saw II that the scene of John shaving off his hair in Rebirth was originally in the script, and that it was supposed to symbolize his transformation into Jigsaw, but the producers cut it out.","torrent":{"xt":"urn:btih:3f0fe5adbca6a590d3bd8f10aa5b55adb4504953","amp;dn":"Saw%3A+Rebirth","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f0fe5adbca6a590d3bd8f10aa5b55adb4504953","infoHashBuffer":{"type":"Buffer","data":[63,15,229,173,188,166,165,144,211,189,143,16,170,91,85,173,180,80,73,83]},"announce":[],"urlList":[]}}