{"title":"Jimi Hendrix and Traffic - 1990 - A Session","uid":4204931,"size":76009591,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:3f14aa3b6b3784dc5c77f0bf49a898b03bfc231c&amp;dn=Jimi+Hendrix+and+Traffic+-+1990+-+A+Session&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"koshin123","files":10,"time":1211745688,"description":"A purely instrumental affair, alternately dated as 1968 or 1970, this studio material is among the most intriguing unreleased pieces of either performer. The lineup is listed as Jimi Hendrix (guitar), Steve Winwood (piano), Chris Wood (flute), Rick Grech (bass), and Jim Capaldi (drums), but the actual lineup of these recordings is uncertain. Only Hendrix is identifiable with certainty. The overall sound resembles Traffic, and the piano and flute parts seem particularly recognizable as Steve and Chris, respectively.\n\nThe music on this cd consists of jams that, in contrast to Traffic&amp;#039;s usual melodic sensibilities, range from minor key to almost atonal structure. Some of the magic of the &quot;Voodoo Chile&quot; session is also evident on this recording. The jams sound basically spontaneous, organized around particular keys with shifting tempos, and lack a distinct song structure. None of them sound like they were even intended to have vocal parts. For the most part, the piano and drums drive the rhythms while the guitar and flute solo. The extraordinary aspect of the recording is the complementary interplay between Jimi and Chris. While Jimi builds upon driving vamps that eventually erupt into molten solos, Chris counterbalances with his usual delicate, mellowing flute. The result of this collaboration is at least interesting, and sometimes magical. Unlike other Hendrix jam sessions, Jimi seems to have a lot of respect for Traffic and doesn&amp;#039;t fully dominate the proceedings, which makes the session perhaps unique to both entities.\n\nThis bootleg CD consists of three jams of excellent quality studio recordings. The insert states that the session &quot;was recorded at an unknown place in the late 60&amp;#039;s&quot;. Credits are Jimi Hendrix (guitar), Chris Wood (flute and saxophone), Jim Capaldi (drums), and Steve Winwood (organ). In the book Jimi Hendrix: Electric Gypsy (1995), by Harry Shapiro and Caesar Glebbeek, the well researched discography section lists the CD as released in late 1990, and recorded in 1968 or 1969.\n\n1. Jam Thing 18:38\n2. Guitar Thing 5:15\n3. Session Thing 35:27","torrent":{"xt":"urn:btih:3f14aa3b6b3784dc5c77f0bf49a898b03bfc231c","amp;dn":"Jimi+Hendrix+and+Traffic+-+1990+-+A+Session","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f14aa3b6b3784dc5c77f0bf49a898b03bfc231c","infoHashBuffer":{"type":"Buffer","data":[63,20,170,59,107,55,132,220,92,119,240,191,73,168,152,176,59,252,35,28]},"announce":[],"urlList":[]}}