{"title":"PerfectStartFinish","uid":4235872,"size":4380409400,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:3f2172d8ae2e1038c63872fcd7979be48f2f2fc1&amp;dn=PerfectStartFinish&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"12pup12","files":3,"time":1213297538,"description":"~*~ Let me start off by stating this is ripped from VHS tapes, so quality is not that great. While it&amp;#039;s &quot;watchable&quot; it&amp;#039;s not dvd quality! ~*~\n\n\nThe Perfect Start / Perfect Finish Set DVD\n\n\n\n    * Understand how your dog learns\n    * Teaching here, heel and whoa\n    * Evaluation of your dog&amp;#039;s natural abilities\n    * Why your dog does the things he does and how this effects training\n    * Introduction to Birds, backing and guns\n    * Enhance the natural pointing instincts in your dog\n    * Enhancing and encouraging the natural retrieving abilities in your dog\n    * Proper use of the electronic collar\n    * Perfecting the Whoa Command\n    * Achieve the level of steadiness desired\n    * Steady to Wing - Steady to Wing &amp; Shot\n    * Honor Backing\n    * Implementing the E-collar \n\n&quot;Tired of whoa posts and barrels? Tired of videos showing already trained dogs in &quot;mock&quot; training situations? Tired of videos that only show the select best dogs? In this video, We don&amp;#039;t pick &amp;#039;em, We just train &amp;#039;em!&quot; - Jon Hann\n\n&quot;The Perfect Start&quot; video teaches with in-depth explanation and live training examples of all key points of starting your bird dog. Understand how your dog learns, teach here, heel and whoa, and evaluate your dog&amp;#039;s natural abilities. Understand why your dog does the things he does and how this affects training. Use the introduction to birds, backing and guns. Enhance the natural pointing instincts in your dog. Enhance and encourage the natural retrieving abilities in your dog. This video also shows the proper use of the electronic collar.\n\n&quot;The Perfect Start&quot; - 2 disk 158 Minutes\n\n\n\nOpening to the Perfect Start Equipment Head Tucking Birds First time out First Retrieves Introduction to Birds Using Bird Releasers Electronic Collar Introduction The Here Command The Here Command and the Electronic Collar Retrieving Gun Introduction Teaching Heel Teaching Whoa Whoa and the Electronic Collar Introducing Backing\n\n&quot;The Perfect Finish&quot; expands the basics you learned in &quot;The Perfect Start&quot; in an easy to understand and implement video. It is a common sense approach which works with soft dogs, tough dogs and all those in between.\n\n&quot;The Perfect Finish&quot; teaches you to teach your dog! We show you how to implement the e-collar, and we show you, in detail, our humane training and finishing methods. We do not recommend using the &quot;The Perfect Finish&quot; without first completing The Perfect Start.&quot;\n\nThe Perfect Finish - 3 disk 377 minutes\n\nIntro\nWhoa in the Field\nWhoa with Birds\nWhoa and the Bird Release\nSteady to Wing? or Wing and Shot?\nAdding the blank gun\nSteady to Shot and the Falling Bird\nShooting the First Bird\nStop to Flush\nBacking with another Dog\nClosing Segments\n\nThese videos features Jon and Cindy Hann, owners and operators of one of the most successful pointing dog training facilities in the United States.\n\nJon and Cindy are trainers of numerous Champions &amp; National Champions competing in all breeds and disciplines of the field trial world; Amateur, Open, Walking and Horseback. Jon and Cindy are also trainers of countless hunting companions from all over America.\n\n","torrent":{"xt":"urn:btih:3f2172d8ae2e1038c63872fcd7979be48f2f2fc1","amp;dn":"PerfectStartFinish","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f2172d8ae2e1038c63872fcd7979be48f2f2fc1","infoHashBuffer":{"type":"Buffer","data":[63,33,114,216,174,46,16,56,198,56,114,252,215,151,155,228,143,47,47,193]},"announce":[],"urlList":[]}}