{"title":"Great Scottish comedy Still Game Series 1 (2002)","uid":4064913,"size":4415325748,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:3f868aa02194c9886ad296bea5e96105b7f2cb88&amp;dn=Great+Scottish+comedy+Still+Game+Series+1+%282002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"o0oliambeeo0o","files":1,"time":1204756091,"description":"Series 1 (2002) -  TV rips\n\n\n\n\n\nFlittin&amp;#039; - Jack escapes his neighbours from hell to relocate to a flat near Victor. Meanwhile, Winston trains his grandson for a boxing match.\n\nFaimly - Victor is awaiting a visit from his son John, who now lives in Johannesburg. But When he leaves a message on Victor&amp;#039;s answering machine part of it is blocked out by the sound of a horn, Jack and Victor set out to discover what it says and when he is due to arrive. Meanwhile Winston gets injured in a fight with Peggy over who gets the Gigot Chops.\n\nCauld - shows the residents of Craiglang experiencing one of the coldest winters in years but are helped, in the end, by Winston who gives them a sly solution to their problem. Victor, however, wants nothing to do with this solution.\n\nCourtin&amp;#039; - Jack develops a crush on Barbara, the woman from the charity shop, leaving Victor feeling left out due to his friend&amp;#039;s new romance. Meanwhile Winston gets barred from the Clansman and tries to find new places to drink.\n\nWaddin&amp;#039; - It&amp;#039;s the wedding of the year and both Jack and Victor still haven&amp;#039;t received an invite; they decide to do something about it. Meanwhile Wullie MacIntosh appears to have passed away and Winston plans to rake through his house to find something that will get him an invite.\n\nScones - Jack and Victor are tired of their friend Tam Mullen being lucky all the time and attempt to win a competition involving scones. This leads to them creating jingles of their own, complete with their own humour. Meanwhile Winston is having problems with the DHSS and has his money stopped. Isa&amp;#039;s estranged husband, Harry also returns.\n","torrent":{"xt":"urn:btih:3f868aa02194c9886ad296bea5e96105b7f2cb88","amp;dn":"Great+Scottish+comedy+Still+Game+Series+1+%282002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"3f868aa02194c9886ad296bea5e96105b7f2cb88","infoHashBuffer":{"type":"Buffer","data":[63,134,138,160,33,148,201,136,106,210,150,190,165,233,97,5,183,242,203,136]},"announce":[],"urlList":[]}}