{"title":"Black Sabbath - Technical Ecstacy (1976) (W.B.Rhino Rem. 2004) [","uid":4226097,"size":305454958,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:40a1f39a2f7a4f2a41cb6c5f33c54c3cec859a49&amp;dn=Black+Sabbath+-+Technical+Ecstacy+%281976%29+%28W.B.Rhino+Rem.+2004%29+%5B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sworduigi","files":10,"time":1212835977,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure \nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nCodec: Flac 1.2.1;  Level 8  \n\nSource: Found (Ripped by Necromandus)\nArtwork: Full scans.\n\n\nGeneral Info:\n\n\nAlbum: Technical Ecstasy\n\nLabel Warner Bros/Rhino (2004) \n\n\nTracklist:\n   1. &quot;Back Street Kids&quot; ? 3:47\n   2. &quot;You Won&amp;#039;t Change Me&quot; ? 6:42\n   3. &quot;It&amp;#039;s Alright&quot; ? 4:04\n   4. &quot;Gypsy&quot; ? 5:14\n   5. &quot;All Moving Parts (Stand Still)&quot; ? 5:07\n   6. &quot;Rock &amp;#039;n&amp;#039; Roll Doctor&quot; ? 3:30\n   7. &quot;She&amp;#039;s Gone&quot; ? 4:58\n   8. &quot;Dirty Women&quot; ? 7:13\n\n\n\n                   LINE UP:\n\n    * Ozzy Osbourne ? vocals\n    * Tony Iommi ? guitar\n    * Geezer Butler ? bass guitar\n    * Bill Ward ? drums, lead vocals on &quot;It&amp;#039;s Alright&quot;\n\n    * Gerald Woodruffe ? keyboards\n    *Dan Hersch, Bill Inglot ? remastering (2004)\n\n\n\n\nReview taken from metal-observer.com:\nBy 1976, Ozzy Osbourne, Tony Iommi, Geezer Butler, and Bill Ward had not only struggled with stardom and fame, dealt with heavy drug addictions, and faced writer?s block and creative struggles, but they had also released six classic albums. Despite the impressive resume, the band was in a fragile position, with this seventh album potentially making or breaking their future. Talk about pressure, eh?\nEven the most devout BLACK SABBATH fans often disregard ?Technical Ecstasy,? and many flat out despise it. It?s not hard to see why ? this album is drastically different from classics such as ?Paranoid? and ?Master Of Reality.? The dark, spooky cover art of the band?s past has been replaced with a strange and abstract modern piece, which most definitely caught some fans off-guard. The music found on this album is quite different, as well, focusing less on Iommi?s massive riffs and more on Hard Rock aesthetics and experimental dynamics. The opener ?Back Street Kids? is a fast-paced, rip-roaring track which is soured by Ozzy?s frail vocal delivery, which actually mars a good bit of the album due to its bad production and general lack of intensity. I found this to be a real disappointment after his great performance on ?Sabotage.? The experimental side really kicks in with ?It?s Alright,? a soft and poppy piano and acoustic guitar ballad sung by drummer Bill Ward. Until this point, ?It?s Alright? was definitely the most un-SABBATH-like track BLACK SABBATH had recorded, and it feels strangely out of place on the record. ?Rock ?N? Roll Doctor? is pure party rock spoiled by poor lyrics, and ?Gypsy? comes off as uninspired ?Rock ?N? Roll? filler.\nDespite the rough waters, there are some real gems on here. Sounding the most like classic BLACK SABBATH out of all of the record, ?You Won?t Change Me? is a crawling, riff-driven number with excellent use of keyboards. ?She?s Gone? is a soft ballad, closer to ?Solitude? from ?Master Of Reality? than it is to ?It?s All Right,? led by Ozzy on vocals and featuring strings and softly plucked acoustic guitars. It never reaches the level of melancholy found on ?Solitude,? but it stands on it?s own as a really good track. ?Dirty Women,? a song about prostitution featuring a nice chunky main riff, reminds a lot of the material found on ?Sabbath Bloody Sabbath,? and is one of the few songs from this period that still finds its way into the band?s live set. Even these tracks, however, are still damaged by the album?s weak production and Ozzy?s sub-par vocals.\nThree good songs out of eight poorly produced tracks do not make a good album, especially by BLACK SABBATH standards. The album isn?t terrible, in fact, it?s quite listenable despite being somewhat unimpressive, but it?s definitely a massive weak spot in the Ozzy-era SABBATH catalogue","torrent":{"xt":"urn:btih:40a1f39a2f7a4f2a41cb6c5f33c54c3cec859a49","amp;dn":"Black+Sabbath+-+Technical+Ecstacy+%281976%29+%28W.B.Rhino+Rem.+2004%29+%5B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"40a1f39a2f7a4f2a41cb6c5f33c54c3cec859a49","infoHashBuffer":{"type":"Buffer","data":[64,161,243,154,47,122,79,42,65,203,108,95,51,197,76,60,236,133,154,73]},"announce":[],"urlList":[]}}