{"title":"Doctor Who - The Invasion of Time - DVD CGI Preview [RTF]","uid":4190569,"size":3045412,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:418e9b276359edc2d210417575e8a28826f623d5&amp;dn=Doctor+Who+-+The+Invasion+of+Time+-+DVD+CGI+Preview+%5BRTF%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Homie.Beast","files":4,"time":1210932836,"description":"Doctor Who - The Invasion of Time - DVD CGI Preview [RTF]\n\nVideo Source; &lt;a href=&quot;\nhttp://www.purpleville.pwp.blueyonder.co.uk/rtwebsite/InvasionOfTime.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.purpleville.pwp.blueyonder.co.uk/rtwebsite/InvasionOfTime.htm&lt;/a&gt;\n\nHere we have a rare look at a small movie made by the Doctor Who \nRestoration Team;\n &lt;a href=&quot;\nhttp://www.restoration-team.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.restoration-team.co.uk/&lt;/a&gt;\n\nIn this little 45 second movie, the insiders whom have access to the \narchives of BBC&amp;#039;s Doctor Who holdings, give a little sneak peak at what \nthey say are over 25 MINUTES of extra CGI footage regarding the classic \nTom Baker episode &quot;The Invasion of Time&quot;.   \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/The_Invasion_of_Time&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/The_Invasion_of_Time&lt;/a&gt; \n\nAnd here is their blurb;\n\n-----------------------------------------------------------------\n\n\nThe Invasion of Time - DVD \n\n\nTying directly into the welcome return  of the Sontarans in the new series, &amp;#039;The Invasion of Time&amp;#039; is the last of the four classic series Sontaran stories to see DVD release. As well as a standalone two-disc release for this six-part Tom Baker story, 2entertain will also at the same time be releasing &amp;#039;Bred for War&amp;#039;, a four story boxset comprising &amp;#039;The Time Warrior&amp;#039;, &amp;#039;The Sontaran Experiment&amp;#039;, &amp;#039;The Invasion of Time&amp;#039; and &amp;#039;The Two Doctors&amp;#039;.\n\n\n--------------------------------------------------------------------------------\n\n&amp;#039;The Invasion of Time&amp;#039; features a reasonable amount of 16mm location filming and although the original camera negatives no longer exist, the transmission print has been retained by the BBC library thanks to the ever-diligent Andrew Martin. As usual, we planned to re-transfer the film on the Spirit telecine to improve the resolution and maximise the available image area. However, when the print was put onto the telecine it was found to be quite faded and red - a common occurrence with colour films of this age as the unstable dyes change over time. A lot of detail seemed to be missing from the white end of the picture too, making it look somewhat white-crushed and bleached out - again a familiar problem with faded prints. Nonetheless, colourist Jonathan Wood was able to use the custom gamma curves on the Pixi colour corrector to pull a surprising amount of detail out of the whites, certainly as much as was visible on the original transfer from 1978, and was able to achieve a very good colour balance from the film despite the fading. The film sequences also provided an unexpected bonus, in that there were several minutes of unused scenes from the last two episodes incorporated within them.\n\nOriginally planned as a single disc release, the decision was made late in the day to go over to two discs to ensure better quality overall. Part of the reason for this was the sheer amount of alternative video effects that John Kelly had managed to put together for the release. The story has achieved a certain amount of notoriety due to the somewhat underwhelming nature of the original video effects (notably the Vardans) and John has done an excellent job in creating an alternative effects option which creates much greater believability whilst at the same time retaining a look and feel sympathetic to the source material. \n\nThe full line-up of extra features consists of:\n\nA commentary with actors Louise Jameson and John Leeson, script editor Anthony Read and visual effects designer Mat Irvine. \n\nProducer Andrew Beech takes us Out of Time (dur. approx 16&amp;#039; 52&quot;), as artistes and production crew recall the making of this story. With actors Louise Jameson, John Leeson, Chris Tranchell and Milton Johns, script editor Anthony Read and visual effects designer Colin Mapson.\n\nA Deleted Scenes package (dur. 5&amp;#039; 54&quot;) was put together from additional material found in the film sequences for episodes five and six. \n\nPhoenix Media supplied two new featurettes for this release:\n\nThe Rise and Fall of Gallifrey (dur. 9&amp;#039; 57&quot;)  looks at how the portrayal of the Time Lords and their home planet of Gallifrey changed over the years. With script editors Terrance Dicks, Anthony Read and Gary Russell and former Doctor Who Magazine editor Alan Barnes.\n\nIn The Elusive David Agnew (dur. 5&amp;#039; 15&quot;) they delve into the murky past of David Agnew, the writer of this story and other BBC dramas.  Who was he? Why can nobody find him? Script editors Terrance Dicks and Anthony Read try to get to the bottom of the mystery? \n\nThe new alternative CGI Effects provide nearly 25 minutes of new effects, including replacement gunfire, enhanced model effects and a completely new look for the Vardans. \n\nBBC1 continuity announcements (dur. 3&amp;#039; 25&quot;) from the story&amp;#039;s transmission provide a nostalgic glimpse of the 1978 Saturday night BBC TV line-up. \n\nAs usual there is a Photo Gallery (dur. 7&amp;#039; 04&quot;) featuring production, design and publicity photos from the story. However, for the first time this gallery also has an optional subtitle stream giving information about the photographs.\n\nAnd as usual there&amp;#039;s the Coming Soon trailer,  Radio Times Billings PDF, Programme subtitles and Subtitle Production Notes. \n\nOrder your original DVD now in the UK at : &lt;a href=&quot;\nhttp://www.amazon.co.uk/Doctor-Who-Invasion-Tom-Baker/dp/B0015083PI&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.co.uk/Doctor-Who-Invasion-Tom-Baker/dp/B0015083PI&lt;/a&gt;\n\nOrder your original DVD now in the US at :  &lt;a href=&quot;\nhttp://www.bbcshop.com/invt/bbcdvd2586&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbcshop.com/invt/bbcdvd2586&lt;/a&gt;\n\n--------------------------------------------------\n\nYou can also, always visit the most central and elite website on \nEarth, dedicated to, and run by a chum team of Who fans (and BBC\nemployees) the preservation of Doctor Who on DVD.   In fact, every \nDoctor Who DVD you have ever enjoyed was produced by these guys;\n &lt;a href=&quot;\nhttp://www.restoration-team.co.uk/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.restoration-team.co.uk/&lt;/a&gt;\n\nSee you there!   \n","torrent":{"xt":"urn:btih:418e9b276359edc2d210417575e8a28826f623d5","amp;dn":"Doctor+Who+-+The+Invasion+of+Time+-+DVD+CGI+Preview+%5BRTF%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"418e9b276359edc2d210417575e8a28826f623d5","infoHashBuffer":{"type":"Buffer","data":[65,142,155,39,99,89,237,194,210,16,65,117,117,232,162,136,38,246,35,213]},"announce":[],"urlList":[]}}