{"title":"MAE WEST.iso","uid":4238523,"size":1028333568,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:41a140fe4ef1662a66850a2ffdb9c16fb07d250e&amp;dn=MAE+WEST.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"choempi","files":1,"time":1213413798,"description":"THE ORIGINAL BLONDE BOMBSHELL. SHE DONE HIM WRONG 1933 and MY LITTLE CHICKADEE with W. C. FIELDS 1940. CUSTOM AVI FILES.\n\n\n  Mae West was born in Brooklyn, New York, to &quot;Battling Jack&quot; West and Matilda \nDoelger. She began her career as a child star in vaudeville, and later went on \nto write her own plays, including &quot;SEX&quot;, for which she was arrested. Though her \nfirst movie role was a small part in Night After Night (1932), her scene has \nbecome famous. A coat check girl exclaims, &quot;Goodness! What lovely diamonds!&quot;, \nafter seeing Mae&amp;#039;s jewelry. Mae replies, &quot;Goodness had nothing to do with it&quot;. \nHer next film, in which she starred, came the following year. She Done Him Wrong \n(1933) was based on her earlier and very popular play, &quot;Diamond Lil&quot;. She went \non to write and star in seven more films, including My Little Chickadee (1940) \nwith W.C. Fields. Her last movie was Sextette (1978), which also came from a \nplay. She died two years later.\nIMDb Mini Biography By: Carla Donnell \n\n\nMini Biography\nMary Jane West was born in Brooklyn, New York, on August 17, 1893, to parents \ninvolved in prizefighting and vaudeville. Mae herself worked on the stage and in \nvaudeville from the time she was five years old. She never was academically \ninclined because she was too busy performing. She studied dance as a child, and \nby the time she was 14 she was billed as &quot;The Baby Vamp&quot; for her performances on \nstage. Later Mae began writing her own plays. One of those plays, &quot;Sex&quot;, landed \nher in jail for ten days on obscenity charges in 1926. Two years later her play \n&quot;Diamond Lil&quot; became a huge Broadway success. Mae caught the attention of the \nHollywood studios and was given her first movie role with George Raft in Night \nAfter Night (1932). Although it was a small role, she was able to display a wit \nthat was to make her world-famous. Raft himself said of Mae, &quot;She stole \neverything but the cameras.&quot; The moviegoing public fell in love with the first \nwoman to make racy comments on film. She became a box-office smash hit, breaking \nall sorts of attendance records. Her second film, She Done Him Wrong (1933), was \nbased on her earlier and popular play that she had written herself. The film was \nnominated for an Academy Award as Best Picture. It also made Cary Grant a star. \nHer third film later that year was I&amp;#039;m No Angel (1933). The controversy aroused \nby these two films resulted in the studios establishing the Motion Picture \nProduction Code, which regulated what content could be shown or said in \npictures. As a result of these codes, Mae began to double-talk so that a person \ncould take a word or phrase any way they wished. This was so she could get her \nmaterial past the censors, and it worked. She really felt she had a vested \ninterest because it was her written work being scrutinized. She had already \nwritten and performed these for the stage with the very material now being \nfilmed. Her next film, Belle of the Nineties (1934), was an equal hit. By 1936, \nwith Klondike Annie (1936) and Go West Young Man (1936) she became the highest \npaid woman in the US. After 1937&amp;#039;s Every Day&amp;#039;s a Holiday (1937), she didn&amp;#039;t make \nanother film until 1940, when she co-starred with W.C. Fields in another film \nshe wrote herself, My Little Chickadee (1940). It was well known she had little \nuse for Fields and his ways, which were crude ven for her. After The Heat&amp;#039;s On \n(1943), Mae took a respite from the film world, mainly because the censors were \ngetting stricter. She decided she would be able to have greater expression in \nher work if she went back to the stage. Mae continued to be a success there. \nWhen censorship began to end in the 1960s, she returned to film work in 1970&amp;#039;s \nMyra Breckinridge (1970). MYRA Her last film was 1978&amp;#039;s Sextette (1978). Mae \nsuffered a series of strokes which finally resulted in her death at age 87 on \nNovember 22, 1980, in Hollywood, California. She was buried in New York. The \nactress, who only appeared in 12 films in 46 years, had a powerful impact on us. \nThere was no doubt she was way ahead of her time with her sexual innuendos and \nhow she made fun of a puritanical society. She did a lot to bring it out of the \ncloset and perhaps we should be grateful for that.\nIMDb Mini Biography By: Denny Jackson \n\n\nSpouse\n      Frank Wallace(11 April 1911 - 23 July 1942) (divorced)\n\n\nTrivia\nHollywood&amp;#039;s outrageous, self-proclaimed psychic Criswell predicted in 1955 that \nshe would win the 1960 Presidential election, and would fly to the moon in 1965 \nwith him and friend Liberace!.\nAfter two years of denying that she had ever been married, West admitted in a \nreply to a legal interrogatory in 1937 that she and Frank Wallace had married in \n1911. During her divorce trial in 1942, she testified that they had lived \ntogether only &quot;several weeks&quot;.\nAccording to actor Tony Curtis, her famous walk originated while beginning her \ncareer as a stage actress. Special six-inch platforms were attached to her shoes \nto increase the height of her stage presence. Her walk literally was &quot;one foot \nat a time.&quot;\nDuring World War II, US Navy and Army pilots and crewmen in the Pacific named \ntheir inflatable life vests after her, supposedly because of her well-endowed \nattributes. The term &quot;Mae West&quot; for a life jacket continues to this day.\nShe was with George Raft in both her first (Night After Night (1932)) and last \n(Sextette (1978)) film.\nMeasurements: 36-26-36 (in 1933), 38-24-38 (fitting by designer Edith Head), \n39-27-39 (self-described in 1956), (Source: Celebrity Sleuth magazine)\nAppears on sleeve of The Beatles &quot;Sgt Pepper&amp;#039;s Lonely Hearts Club Band&quot;. West at \nfirst declined to be pictured on the cover (&quot;What would I be doing in a lonely \nhearts club?!&quot;), but reconsidered when the Beatles sent her a handwritten \npersonal request.\nFormer Beatle Ringo Starr appeared with West in Sextette (1978). He was \nunpleasantly surprised at first, at all the attention given her on the set \n(usually reserved for pop stars like The Beatles), but came to admire West \nduring the shoot, and praised her afterwards.\nIs sometimes credited with originating the Shimmy (a once-popular dance).\nWas banned from NBC Radio after a guest appearance in 1937 with Edgar Bergen and \nCharlie McCarthy that was loaded with flirtatious dialogue and double-entendres. \nShe returned to the network as a guest on the &quot;Perry Como Show&quot; in 1949.\nShe was famous for her morning enemas, which she claimed made her skin like silk \nand left her &quot;smelling sweet at both ends&quot;. On the set of her last film Sextette \n(1978), co-star Tony Curtis claimed that she was given an enema after being made \nup, at approximately 11:00 in the morning, as the last step of her preparations \nbefore going before the camera.\nAccording to psychic Kenny Kingston, she wrote all her plays while in a trance.\nHer films are credited with single-handedly saving failing and debt-ridden \nParamount Pictures from bankruptcy in the early 1930s.\nWas named #15 Actress on The American Film Institutes 50 Greatest Screen Legends\nAt one point, her chauffeur was Jerry Orbach (who is best known for playing \nDetective Lennie Briscoe on all four &quot;Law &amp; Order&quot; series and &quot;Homicide: Life on \nthe Street&quot; (1993)).\nDied two days before her Night After Night (1932) and Sextette (1978) co-star \nGeorge Raft.\nIs portrayed by Ann Jillian in Mae West (1982) (TV) and by Gloria Gray in \nMarlene (2000)\nOne of the first women to consistently write the movies she starred in.\nPlaying opposite Ed Wynn in Arthur Hammerstein&amp;#039;s &quot;Sometime,&quot; with music by \nRudolf Friml, she introduced the shimmy to the Broadway stage in 1918. The dance \nrequires hardly any movement of the feet but continuous movement of the \nshoulders, torso and pelvis. She had seen the dance at black cafÃƒÂ©s in Chicago.\nOnce when she was scheduled to play a theater in New Haven, CT, the theater&amp;#039;s \nmanagement refused to let her go on because her act was too &quot;risquÃƒÂ©&quot; and \ncanceled the show. Disappointed Yale University students rioted and wrecked the \ntheater.\nEldest of three children of John Patrick West, an occasional prizefighter and \nlivery-stable owner, and Matilda Delker Doelger, a one-time corset and fashion \nmodel.\nDuring World War II, Miss West&amp;#039;s name was applied to various pieces of military \nequipment and was thus listed in Webster&amp;#039;s New International Dictionary, Second \nEdition. The Royal Air Force named its inflatable life jackets &quot;Mae Wests,&quot; and \nUnited States Army soldiers referred to twin-turreted combat tanks also as &quot;Mae \nWests.&quot;\nWas not a smoker or a drinker.\nDied apparently of natural causes in the wake of a mild stroke she suffered \nthree months prior that left her speech impaired. Also suffered from diabetes \nthe last 15 years of her life.\nHer parents converted to Protestantism, although her mother was, by heritage, a \nJewish Bavarian-German and her father was born Irish-Catholic.\nTurned down a role in Elvis Presley&amp;#039;s film Roustabout (1964), which eventually \nwent to Barbara Stanwyck.\nBorn Mary Jane West in the Bushwick section of Brooklyn, she always considered \nherself half Jewish. Her mother, Matilda Decker Doelger, an immigrant from \nMunich, was Jewish. Her father, Jack West, a featherweight prizefighter called \n&quot;Battling Jack&quot; West and later a stable master, was Anglo-Irish.\nWas at one point Hollywood&amp;#039;s highest paid star.\n\n\nPersonal Quotes\nIt&amp;#039;s better to be looked over than overlooked.\nA hard man is good to find.\nMen are my life, diamonds are my career!\nWhen women go wrong, men go right after them!\nWhen caught between two evils I generally pick the one I&amp;#039;ve never tried before.\nWhen I&amp;#039;m good, I&amp;#039;m very good. But when I&amp;#039;m bad, I&amp;#039;m better.\nMarriage is a great institution. I&amp;#039;m not ready for an institution.\nIt&amp;#039;s not the man in your life that counts. It&amp;#039;s the life in your man.\nIs that a gun in your pocket or are you just glad to see me?\nI believe in censorship. After all, I made a fortune out of it.\nI only like two kinds of men: domestic and foreign.\nToo much of a good thing is wonderful.\nI&amp;#039;m no model lady. A model&amp;#039;s just an imitation of the real thing.\nDon&amp;#039;t marry a man to reform him. That&amp;#039;s what reform schools are for.\nIt&amp;#039;s hard to be funny when you have to be clean.\nI wrote the story myself. It&amp;#039;s all about a girl who lost her reputation but \nnever missed it.\nIt ain&amp;#039;t sin if you crack a few laws now and then, just so long as you don&amp;#039;t \nbreak any.\nPersonality is the glitter that sends your little gleam across the footlights \nand the orchestra pit into that big black space where the audience is.\nGood girls go to heaven. Bad girls go everywhere else.\nI used to be Snow White, but I drifted.\nTen men waiting for me at the door? Send one of them home, I&amp;#039;m tired.\nSex is an emotion in motion.\nI do all my writing in bed; everybody knows I do my best work there.\nTo err is human, but it feels divine.\nFew men know how to kiss well. Fortunately, I&amp;#039;ve always had time to teach them.\nI always save one boyfriend for a rainy day . . . and another in case it doesn&amp;#039;t \nrain.\nWhy don&amp;#039;t you come sometime and see me? I&amp;#039;m home every evening . . . Come up, \nand I&amp;#039;ll tell your fortune.\nI freely chose the kind of life I led because I was convinced that a woman has \nas much right as a man to live the way she does if she does no actual harm to \nsociety.\nThe man I don&amp;#039;t like doesn&amp;#039;t exist.\nI generally avoid temptation unless I can&amp;#039;t resist it.\nIt isn&amp;#039;t what I do, but how I do it. It isn&amp;#039;t what I say, but how I say it, and \nhow I look when I do it and say it.\nI&amp;#039;m not good and tired, just tired.\nMen are easy to get but hard to keep.\n\n\nSalary\n      Myra Breckinridge (1970)$350,000\n      Belle of the Nineties (1934)$400,000\n      She Done Him Wrong (1933)$130,000\n      Night After Night (1932)$50,000","torrent":{"xt":"urn:btih:41a140fe4ef1662a66850a2ffdb9c16fb07d250e","amp;dn":"MAE+WEST.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"41a140fe4ef1662a66850a2ffdb9c16fb07d250e","infoHashBuffer":{"type":"Buffer","data":[65,161,64,254,78,241,102,42,102,133,10,47,253,185,193,111,176,125,37,14]},"announce":[],"urlList":[]}}