{"title":"Vispa 0.1.2 &amp; xpy 0.9.12 (The Joker)","uid":4087435,"size":309722,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:42b6ef31081726daa37d7301c7259895249172ab&amp;dn=Vispa+0.1.2+%26+xpy+0.9.12+%28The+Joker%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jokeri1971","files":6,"time":1205891388,"description":"xpy 0.9.12:\n\nxpy is a small program which disables the default threats of your Windows XP installation. Besides the classic antispy features, disabling Windows and some of its components to communicate with Microsoft servers, xpy improves privacy settings and your system&amp;#039;s security, closes recent security holes like the remote procure call (rpc) service and the distributed component object model (dcom). Though xpy is smaller than 100 kilobytes, it can close serious threats on long distance, where large service-packs can only protect you until a new security hole has been found. \n\nxpy is currently available in two versions, Redistributable and Monolingual. The Redistributable build includes all available languages and is intended for distribution on offline-media (i.e. CD-ROM) or Intranet, while the Monolingual builds try to save bandwidth for fastest possible download speed.\n\nFeatures: \n? disable windows &quot;calling home&quot;\n? disable questionable services \n? disarm internet explorer\n? disarm windows media player \n? remove windows messenger \n? improve security\n? improve performance\n\nVispa 0.1.2:\n\nvispa is a small software, securing your Windows Vista installation and protecting your privacy. In addition to so-called Antispy features, it disables common security threats and increases your Windows performance.\n\nThere are many reasons why you wouldn&amp;#039;t want your operating system connect to Microsoft&amp;#039;s server, be it for practical reasons or pure idealism. Based on the source-code of the award-winning xpy (version 0.9.8), Vispa allows you to easily tweak your Windows Vista for better privacy and security, even system performance. Do a few clicks rather than finding the write registry keys or program settings.\n\nThe only recommendation I can give is not applying settings without vague knowledge of what you&amp;#039;re doing. Not every setting is desired in every environment. Vispa is no tool for beginners, just a more convenient way of tweaking your operating system.\n\nImportant: Some antivirus software might report Vispa as Spyware or a Trojan. Vispa is an executable written and compiled using NSIS, false-positives are unfortunately quite common among NSIS compiled programs. The NSIS development team is aware of this situation and constantly works with software companies to solve such issues.\n\nChanges in v0.1.2 (2007-09-19):\n* added option to delete prefetch folder\n\nhave fun and enjoy The Joker","torrent":{"xt":"urn:btih:42b6ef31081726daa37d7301c7259895249172ab","amp;dn":"Vispa+0.1.2+%26+xpy+0.9.12+%28The+Joker%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42b6ef31081726daa37d7301c7259895249172ab","infoHashBuffer":{"type":"Buffer","data":[66,182,239,49,8,23,38,218,163,125,115,1,199,37,152,149,36,145,114,171]},"announce":[],"urlList":[]}}