{"title":"DE KEURINGSDIENST VAN WAARDE [KVW BOX 5/7]","uid":4187626,"size":1676155574,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:42fb0d82978a2a750ccccbcf3f04ece15dbf05f9&amp;dn=DE+KEURINGSDIENST+VAN+WAARDE+%5BKVW+BOX+5%2F7%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rud-gr","files":6,"time":1210770521,"description":"DE KEURINGSDIENST VAN WAARDE [KVW BOX 5/7]\n\n42 afleveringen, verzameld op 7 dvds, in een verzamelbox. Bijna 17 uur kijkplezier! Van Kip en Kalkoen tot Dons, Bruine boon en natuurlijk Ot &amp; Sien; de varkens van de KvW.Per dvd staan er 6 afleveringen op.\n\nOmdat 30Gig een beetje onhandig is, hier in Divx formaat van ca. 280Mb per aflevering van 25 minuten.\n\nDVD 5 \n\nBROOD\nBrood, daar zit wat in, maar niet altijd.\nDe Keuringsdienst van Waarde bakt een Oerbrood, dat zo niet heten mag want Oerbrood is een gedeponeerde merknaam. \n\nWATER\nVan regen word je zuur, van tranen krijg je dorst. Water valt uit de lucht, het komt over de dijk, sijpelt over je wangen en het spoelt de wc. Maar wat is drinkwater? \n\nHET BESTE EI\nDe Keuringsdienst van Waarde fietst langs Nederlands hoogste kippenflat, raapt eieren op de achtste verdieping en filmt in een volgestouwde Ekoschuur, pal naast de schuur waar duizenden biologische kippen elkaar proberen uit te moorden. \n\nAARDAPPEL\nAardappelpuree wordt gemaakt van aardappelen. Maar waar worden aardappel- producten van gemaakt? Van aardappelpuree. \n\nDE BRUINE BOON\nBruine bonen in pot en blik zijn spotgoedkoop. De akkerbouwer krijgt er bijna niets voor en het blik waar gekookte bruine bonen in zitten kost meer dan de bonen zelf. Bruine bonen zijn zo gewoon dat ze nooit op tv komen. Maar de boon gaat bekende Nederlander worden. De Keuringsdienst van Waarde - een half uur lang spanning en sensatie - over de boon die zo gewoon is. \n\nPANEERMEEL\nPaneermeel maak je van oud brood. Had je gedacht. Paneermeel wordt gemaakt van nieuw brood. En voor het eerst op tv: een gepaneerde schnitzel in de afwas. Wat verbergt het krokante korstje?\n","torrent":{"xt":"urn:btih:42fb0d82978a2a750ccccbcf3f04ece15dbf05f9","amp;dn":"DE+KEURINGSDIENST+VAN+WAARDE+%5BKVW+BOX+5%2F7%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"42fb0d82978a2a750ccccbcf3f04ece15dbf05f9","infoHashBuffer":{"type":"Buffer","data":[66,251,13,130,151,138,42,117,12,204,203,207,63,4,236,225,93,191,5,249]},"announce":[],"urlList":[]}}