{"title":"West India Company","uid":4203439,"size":113910372,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:43b866862a31771dd6445b7ee13e6243d8ac9080&amp;dn=West+India+Company&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"voyageur2","files":15,"time":1211639259,"description":"Former Blancmange member, Stephen Luscombe\\\\\\\\\\\\\\&amp;#039;s project.\n\nAll Music Guide:\n\nHaving already incorporated Indian music with Blancmange\\\\\\\\\\\\\\&amp;#039;s new wave grooves, keyboardist Stephen Luscombe delved into it further with the\n\nWest India Company. Along with Vince Clarke (synthesizers) of Depeche Mode and Yaz, Mute Records founder and producer Daniel Miller, vocalist Asha Bhosle, and percussionist Pandit Dinesh (who had previously worked with Luscombe in Blancmange), the West India Company released the single \\\\\\\\\\\\\\&quot;Ava Maria\\\\\\\\\\\\\\&quot; in 1984. As with Blancmange, the West India Company combined keyboard-heavy club rhythms with Indian instrumentation. The biggest difference were the vocals of Indian superstar Bhosle, which transcended the West India Company from its Western origins. The West India Company introduced Bhosle to European and American audiences who weren\\\\\\\\\\\\\\&amp;#039;t familiar with her, receiving exposure on British and German television. In 1989, the West India Company released their debut LP Music From New Demons. Blancmange had already broken up by then and Luscombe took the West India Company on a U.S. tour. The group performed at 13 cities in 20 days, a cross-country road trip that left the band exhausted. Nevertheless, the group flew to a gig in Stockholm, Sweden, after leaving America. However, Bhosle became stricken with colitis before the concert. Instead of canceling it, Bhosle found the strength to sing and then spent an entire month in bed recovering from her illness. ~ Michael Sutton, All Music Guide\n\nFull Album.","torrent":{"xt":"urn:btih:43b866862a31771dd6445b7ee13e6243d8ac9080","amp;dn":"West+India+Company","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43b866862a31771dd6445b7ee13e6243d8ac9080","infoHashBuffer":{"type":"Buffer","data":[67,184,102,134,42,49,119,29,214,68,91,126,225,62,98,67,216,172,144,128]},"announce":[],"urlList":[]}}