{"title":"Directory Opus 9.1.0.3 with crack","uid":4204962,"size":19198667,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:43e3f0e1f6e12b5d36826bf830a3de8810c6c8d2&amp;dn=Directory+Opus+9.1.0.3+with+crack&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"aoloffline","files":1,"time":1211746675,"description":"Directory Opus description\nA complete file manager and Explorer replacement solution\nGPSoftware is proud to announce the release of a major upgrade to its flagship product, Directory Opus. Already well established in the market place as the leading File Manager and Explorer Replacement for Windows, this new version is achieving wide acclaim from both new and existing users. With over two years&amp;#039; development, this is not just a superficial upgrade with new colours! Directory Opus 9 raises the bar for Windows File Managers providing enhanced usability for the novice user while at the same time giving the experienced user more power, functionality and better tools to handle all file management needs.\n\nA file manager is, at its simplest, a utility program which presents lists of files and allows the user to perform actions of some kind on those files. File managers are useful for moving files between folders, making backup copies of files, viewing pictures and playing sounds, running other utility programs on lists of files, deleting unwanted files and many other &quot;housekeeping&quot; tasks.\n\nDirectory Opus goes beyond the simple file manager metaphor, and offers you a complete replacement for Windows Explorer and many other utility programs for handling FTP, ZIP, viewing files and images, running slideshows and more. It provides you with all this within a user-friendly and fully-configurable environment within which you can access and manage your important data with a minimum of effort. Harness the power of your computer like never before!\n\nDirectory Opus is a useful, reliable and complete file manager and also an Explorer replacement solution.\n\nHere are some key features of &quot;Directory Opus&quot;:\n\nDesigned for Windows: Directory Opus 9 has been designed and written from the ground up especially for Windows. Full support for the latest Windows Operating\nSystems from 2000, XP and 2003 and Windows Vista.\nFamiliar Interface: Unlike many other file managers, Directory Opus defaults to an Explorer-compatible user interface. You can immediately begin using Directory Opus, with no learning curve, because it will feel extremely familiar and comfortable to you. But, you will find that you can easily configure the interface to fully personalize your system including the use of dual file displays or multiple displays for special folders.\nÂ· Fully Configurable Menus, Toolbars and Hotkeys: Directory Opus supports unlimited menus and toolbars. Toolbars can be attached to any side of a Lister display or can be independent free-floating windows. Directory Opus supports user-configurable hotkeys, both for use within Opus, and globally throughout the system. The Windows key is also fully supported!\nBuilt-in ZIP and FTP Support: Throw away your external ZIP and FTP programs - Directory Opus lets you access ZIP files and FTP sites as easily as local folders! You can copy files from anywhere and to anywhere - even from an FTP site straight into a ZIP file!\nTrue Multitasking: The object-orientated multi-threaded design gives you unheralded power to perform multiple operations at the same time. Why should you have to wait for your computer to finish? Now you can begin one task and immediately move on the the next. Zip one folder whilst unzipping into another, at the same time as you are downloading files from a remote FTP site and copying yet more files between your local folders, independently and reliably.\nSupport for Common Image and Sound Files: Directory Opus supports most common image and sound file formats. It provides a quick yet powerful image viewer which lets you view your pictures without having to load a large paint program! It also provides a Thumbnails-style view of your folders, allowing you preview a large number of images to quickly locate the one you are looking for.\nBuilt-in Viewer Pane: Quickly view pictures, text files and other types of files in the Opus Viewer pane directly in the Lister window. Opus supports a viewer plug-in system so you can add new drivers for the specific file formats you wish to view as they become available. Directory Opus comes with plug-ins for many popular image and document file formats. Third party libraries can extend the viewing capabilities to include Word and Excel documents, Acrobat files and many other types of files. A free SDK is available for developers to write their own viewer plug-ins.\nEnhanced Support for Digital Images: More than any other file manager, Directory Opus give you full access to the hidden details of the EXIF format for images from digital cameras. You can now sort images by any field and view all the information about your photos from shooting time, shutter speed, aperture, subject distance, metering type and more...\nEnhanced Finding and Searching: Directory Opus lets you quickly locate the files you need, with an extremely powerful search system. Does Explorer let you search for Led Zeppelin MP3 files recorded at a bit rate of 160 sometime between last Thursday and today? Opus does!\nPowerful Internal Command Set: With Directory Opus you are not just limited to functions given to you by the programmer. Directory Opus&amp;#039;s functions are built upon the most powerful file management command language available in any file manager. You can harness this easily to create your own functions commands to perform the actions that YOU want to do.\n\nThe latest version is 9.1.0.7 .I did not find a certificate only for this one and a few inferior builds.Read very carefully the how to install for applying the crack it&amp;#039;s easy .This version i got it from demonoid and since 9.1.0.0 is the latest on TPB i uploaded this one.","torrent":{"xt":"urn:btih:43e3f0e1f6e12b5d36826bf830a3de8810c6c8d2","amp;dn":"Directory+Opus+9.1.0.3+with+crack","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43e3f0e1f6e12b5d36826bf830a3de8810c6c8d2","infoHashBuffer":{"type":"Buffer","data":[67,227,240,225,246,225,43,93,54,130,107,248,48,163,222,136,16,198,200,210]},"announce":[],"urlList":[]}}