{"title":"G.Simenon - Maigret i trup młodej kobiety [PL]","uid":12754999,"size":308774038,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:43f75480134c4b67779a70b04a744e71c1f3d49d&amp;dn=G.Simenon+-+Maigret+i+trup+m%C5%82odej+kobiety+%5BPL%5D+MP3%40128&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"everdarksoul","files":44,"time":1447435905,"description":"Audiobook PL - 42 części /   \r\nrozmiar: 294 MB / czas: 05:19:09\r\nczyta: Mirosław Konarowski\r\n\r\nNad zwłokami stało trzech umundurowanych policjantów i jakaś para. Byli to, jak się komisarz później dowiedział, pierwsi, którzy zobaczyli trupa i zaalarmowali policję. Kobieta leżała na prawym boku, policzek dotykał mokrego chodnika.\r\nW zimną noc, na placu Vincimille, komisarz Maiget zastanawiał się skąd wzięły się tu zwłoki młodej, ubranej w wieczorową suknię, kobiety przy której nie znaleziono żadnych dokumentów. Sekcja zwłok wykazała, że przyczyną zgonu było złamanie podstawy czaszki po uderzeniu tępym narzędziem oraz, że denatka była dziewicą.\r\nMaigret polecił wysłać fotografię zamordowanej do gazet, a po dokładnym obejrzeniu jej sukni, odnalazł metkę z adresem krawcowej...\r\n\r\nGeorges Joseph Christian Simenon (1903-1989) był bardzo płodnym autorem: pisał nawet 60-80 stron dziennie i w czasie swojego życia stworzył ponad 450 powieści i opowiadań. Największym sukcesem Simenona było stworzenie postaci Commissaire Julesa Maigreta - który na przestrzeni dziesięcioleci dostarczał świetnej rozrywki wielu pokoleniom miłośników kryminału i powieści detektywistycznych. Od czasu wydania pierwszej powieści z jego udziałem (w roku 1929), komisarz Maigret tropi zbrodnie popełniane w barach, na dworcach, w kabaretach no i oczywiście na ulicach Paryża. Ten sympatyczny policjant z nieodłączną fajką, stał się wśród czytelników równie rozpoznawalny i popularny jak Sherlock Holmes czy Hercules Poirot. Cykl o dokonaniach komisarza liczy sobie aż 75 powieści oraz 28 opowiadań, a jego wielka popularność wśród czytelników sprawiła, że wiele z tych powieści i opowiadań zostało również zekranizowanych, zaś w postać komisarza Maigret często wcielali się tacy wybitni aktorzy francuscy, jak choćby Jean Gabin czy Philippe Noiret","torrent":{"xt":"urn:btih:43f75480134c4b67779a70b04a744e71c1f3d49d","amp;dn":"G.Simenon+-+Maigret+i+trup+m%C5%82odej+kobiety+%5BPL%5D+MP3%40128","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"43f75480134c4b67779a70b04a744e71c1f3d49d","infoHashBuffer":{"type":"Buffer","data":[67,247,84,128,19,76,75,103,119,154,112,176,74,116,78,113,193,243,212,157]},"announce":[],"urlList":[]}}