{"title":"Advanced PDF Password Recovery Professional 3.10","uid":4179013,"size":2115457,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:45cc70d4e61b1f63ae04c5cd9cad4d23c0b984c9&amp;dn=Advanced+PDF+Password+Recovery+Professional+3.10&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"p0lanc054","files":3,"time":1210296783,"description":"This program (Advanced PDF Password Recovery, or APDFPR) is intended to decrypt password-protected and restricted Adobe Acrobat PDF files, which have &quot;user&quot; password set (required to open/view the file), and/or &quot;owner&quot; password (when the file is only protected from editing, printing etc), i.e. remove the protection and/or break the PDF password. Restricted files are being unprotected instantly, while decryption of files with &quot;open&quot; password may be time-consuming. The program is also able to convert Kinko&amp;#039;s Document Format (KDF) files to PDF files (without any protection).\n\nThree versions (editions) are available: Standard, Professional and Enterprise.\n\nStandard: basic edition of the program, that is only able to remove restrictions (from printing, selecting text and graphics and copying them into the Clipboard, adding/changing annotations and form fields). Does not handle PDF files with &quot;open&quot; password set, if that password is not known.\n\nProfessional: this edition has all functionality of the Standard one, but also allows to search for &quot;owner&quot; and &quot;user&quot; passwords with brute-force and dictionary attacks, effectively optimized for speed. In addition, it has the &quot;Key search attack&quot;, which guarantees the decryption (regardless the password length and complexity) of PDF files that use 40-bit encryption. This attack takes from a few days (on modern dual-core systems) up to two weeks (on slow computers).\n\nEnteprise: based on Professional edition, this one has an improved &quot;Key search attack&quot; using state-of-the-art &quot;time-memory trade-off&quot; technology, allowing to break &quot;user&quot; password (for 40-bit encryption) in just a few minutes (instead of days, as in Professional edition), using special pre-computed tables on DVD, shipped with express mail.\n\n","torrent":{"xt":"urn:btih:45cc70d4e61b1f63ae04c5cd9cad4d23c0b984c9","amp;dn":"Advanced+PDF+Password+Recovery+Professional+3.10","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"45cc70d4e61b1f63ae04c5cd9cad4d23c0b984c9","infoHashBuffer":{"type":"Buffer","data":[69,204,112,212,230,27,31,99,174,4,197,205,156,173,77,35,192,185,132,201]},"announce":[],"urlList":[]}}