{"title":"Hellsing.Utimate.IV[OVA 4][ENG SUB] - INFINITY","uid":4064067,"size":686915840,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:46183d36df475e385c6cf66284c2b44126fee6db&amp;dn=Hellsing.Utimate.IV%5BOVA+4%5D%5BENG+SUB%5D+-+INFINITY&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Infinity_90","files":2,"time":1204723019,"description":"II II  II IIIII II II  II II IIIIII II  II\n             II III II II    II III II II   II    IIII\n             II IIIIII III   II IIIIII II   II     II\n             II II III II    II II III II   II     II\n             II II  II II    II II  II II   II     II\n__________________________________________________________________________________\n__________________________________________________________________________________\n\nHELLSING OVA 4 - HELLSING OVA 4 - HELLSING OVA 4 - HELLSING OVA 4 - HELLSING OVA 4\n__________________________________________________________________________________\n__________________________________________________________________________________\n\nTitle: Hellsing Ultimate OVA Series\nRelease Date: 22 February 2007\nGenre: Horror/Anime\nIMDB Rating: 8.7\nIMDB Link: http://www.imdb.com/title/tt0495212/\nAudio: Japanese 5.1\nSubtitels: English [Fan Sub]\n__________________________________________________________________________________\n__________________________________________________________________________________\n\nHellsing Ultimate is a Japanese OVA series that is more closely based on the Hellsing manga series. It is being produced by animation studio Satelight and Geneon and currently runs 3 episodes, with the 4th episode in production. Episodes I, II, and III of the OVA are based on Volumes 1, 2, and 3 of the manga, respectively. Episode IV is based on Volumes 4 and 5.\n\nHellsing follows Alucard and police girl-turned-vampire Seras Victoria as they \nexterminate the vampires and other creatures of the night for England's Hellsing Organization. \nThe Hellsing OVA is a closer adaptation of the manga than the Hellsing TV series.\nEpisode One of the OVA follows the manga's first Volume. \nIt covers Seras being turned into a vampire, the introduction of the characters, \nand the first fight with father Alexander Anderson . \nThere are some minor departures from the manga, such as inclusion of \nSeras' dream sequence with subtle super deformed aspects, and inclusion of \nSeras being welcomed by Integra, Walter, and Alucard \n(after the dream sequence she woke up to see Alucard by her side). \nThese departures are not as drastic as the departures in the TV series. \nIt should be noted that the OVA series features humor similar to that of the manga, \nwhich was not included in the TV series.\n\nEpisode Two of the OVA follows the manga's second volume. \nDealing with the Valentine Brothers' assault on Hellsing's \nheadquarters [6]. It is slightly different, as \nAlucard's battle with Luke Valentine is extended, a\nnd there are a few scenes of the brothers individually killing \nHellsing soldiers that were not in the manga. \nThe last two chapters of the manga are also left out, \nprobably since the entire episode is heavily action based, \nalthough they are seen as images during the credits. \nOmissions include the introduction of Pip, and Enrico Maxwell with Anderson. \nThe Omake which premieres in volume 2 of the manga is also left out, \nwhich likely means it will not be seen in animated form.\n\nEpisode Three of the OVA follows the events shortly after where the credits of \nHellsing Ultimate II ended. the introduction of the Wild Geese mercenaries, \nIntegra's meeting with Enrico Maxwell, Alucard and Walter's discussion about Millennium, \nthe mission to Rio de Janeiro, the massacre at Hotel Rio, \nand the duel between Alucard and Alhambra. In addition the scene with Enrico \ninterrogating the priest from Volume Four was omitted and instead a scene with \nthe Major from Volume Four was added.\n__________________________________________________________________________________\n__________________________________________________________________________________\n\nINFINITY torrents is just repacks to make it easy for you to download complete \nseries and stuff instead of episode by episode. \nI cant take credit for anything but UL here and the repacking.","torrent":{"xt":"urn:btih:46183d36df475e385c6cf66284c2b44126fee6db","amp;dn":"Hellsing.Utimate.IV%5BOVA+4%5D%5BENG+SUB%5D+-+INFINITY","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46183d36df475e385c6cf66284c2b44126fee6db","infoHashBuffer":{"type":"Buffer","data":[70,24,61,54,223,71,94,56,92,108,246,98,132,194,180,65,38,254,230,219]},"announce":[],"urlList":[]}}