{"title":"(Indie Rock) This is Indie Rock!  Volume 1 and 2 (Deep Elm)","uid":4122606,"size":88537025,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:46436956e5948ccb45fc973d7af8ea3b099787a2&amp;dn=%28Indie+Rock%29+This+is+Indie+Rock%21++Volume+1+and+2+%28Deep+Elm%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Falleen_Fan_No_1","files":24,"time":1207628163,"description":"Created to document the music, spirit and resolve of the independent artist, each volume of This Is Indie Rock: The Best Bands You&amp;#039;ve Never Heard features twelve UNRELEASED and EXCLUSIVE songs from the hottest new indie rock bands / artists throughout the world. You&amp;#039;ll find a diverse mixture of hardcore, punk, rock, emo, metal, pop and more. By uniting all genres of indie rock, these compilations are destined to surpass the popularity of Deep Elm&amp;#039;s other highly acclaimed compilation series. Bands were selected to participate based on open submissions of their music. Only the music mattered. Extremely high recording quality characterizes each compilation. This Is Indie Rock has already been proven to be a springboard for several talented young bands. From Volume One, Clair De Lune (now on Deep Elm), Lakota (now on Pop Up) and The Kidcrash (now on Lujo) all signed to established labels. Volume Two band The Forecast recently joined the ranks of Victory Records. \n\nVolume 1\n\n01. The Pit That Became A Tower - &quot;I Must Save...&quot;  \n02. Clair De Lune - &quot;Marionettes&quot;  \n03. The Blind King - &quot;Indie Pop Song&quot;  \n04. Dino Velvet - &quot;The Weekend Warriors&quot;  \n05. Secondhand Stories - &quot;Frontiers&quot;  \n06. Throat - &quot;Saturday&quot;  \n07. Winter In Alaska - &quot;Puzzle: Part One&quot;  \n08. Joanna Erdos - &quot;Silver And Gold&quot;  \n09. Siva - &quot;G&quot;  \n10. Lakota - &quot;So Simple&quot;  \n11. Leaving Rouge - &quot;Rooms&quot;  \n12. The Kidcrash - &quot;Bells And Hammers&quot;  \n\nFeaturing UNRELEASED songs by The Pit That Became A Tower (Jerusalem, Israel), Clair De Lune (Minneapolis, MN), The Blind King (Boston, MA), Dino Velvet (Hackettstown, NJ), Second Hand Stories (Charlotte, NC), Throat (Larne, Ireland), Winter In Alaska (Normal, IL), Joanna Erdos (Brooklyn, NY), Siva (El Paso, TX), Lakota (New York, NY), Leaving Rouge (Dearborn, MI) and The Kidcrash (Santa Fe, NM). Created to document the music, spirit and resolve of the independent artist, each volume of This Is Indie Rock: The Best Bands You&amp;#039;ve Never Heard features twelve unreleased and exclusive songs from the hottest new indie rock bands throughout the world. You&amp;#039;ll find a diverse mixture of hardcore, punk, rock, emo, metal, pop and more. By uniting all genres of indie rock, these open-submission compilations are destined to surpass the popularity of Deep Elm&amp;#039;s other highly acclaimed compilation series. &quot;This is indie rock, make no mistake. Deep Elm is admirable in it&amp;#039;s DIY-spirit&quot; says Kerrang. &quot;One of the most reliable curators of indie music...a label that can be trusted&quot; says Splendid. \n\n&quot;The first volume of This Is Indie Rock is so brilliant that I think this is going to be the best compilation series EVER. The record features twelve little known yet very interesting indie bands, covering any genre of music. Among the most famous you can find Clair De Lune, the Deep Elm band that already released the masterpiece Marionettes. There are a lot of surprises on the comp: The Pit That Became A Tower, The Kidcrash, Throat and Siva are some of the finest bands around. Second Hand Stories and Joanna Erdos are two very nice surprises, and be sure to get to know Lakota and Winter In Alaska as well. This Is Indie Rock is super good and it will easily be remembered as one of the top records in 2004.&quot; - Truepunk \n\nVolume 2\n\n01. Maxel Toft - &quot;Band 2: Lesson 37 - Formal Speech&quot;  \n02. Jena Berlin - &quot;The Thief&quot;  \n03. Meredith Bragg - &quot;New York&quot;  \n04. The New Lows - &quot;Cold Shivers&quot;  \n05. Cameran - &quot;Crash Course About Diamonds&quot;  \n06. Sedona - &quot;I&amp;#039;ve Got Nothing For You, Phantom&quot;  \n07. The Forecast - &quot;Red As The Moon&quot;  \n08. Death Ships - &quot;Thelma Lou&quot;  \n09. The Silent Press - &quot;Can&amp;#039;t You Tell&quot;  \n10. The Call Up - &quot;Brand New Life&quot;  \n11. Nature Living - &quot;Nothing Of The Sort&quot;  \n12. Bernard - &quot;My Brain&quot;  \n\nFeaturing UNRELEASED songs by The New Lows (New York, NY), The Forecast (Peoria, IL), Jena Berlin (Southampton, NJ), Death Ships (Skokie, IL), The Silent Press (Troutville, VA), Maxel Toft (Chicago, IL), Sedona (Raleigh, NC), Cameran (Austria), Meredith Bragg and The Terminals (Alexandria, VA), The Call Up (Watertown, MA), Bernard (St. Augustine, FL) and Nature Living (Japan). Created to document the music, spirit and resolve of the independent artist, each volume of This Is Indie Rock: The Best Bands You&amp;#039;ve Never Heard features twelve unreleased and exclusive songs from the hottest new indie rock bands throughout the world. You&amp;#039;ll find a diverse mixture of hardcore, punk, rock, emo, metal, pop and more. By uniting all genres of indie rock, these open-submission compilations are destined to surpass the popularity of Deep Elm&amp;#039;s other highly acclaimed compilation series. &quot;Deep Elm have proven themselves as one of the founding fathers of contemporary independent music...the leading light of the indie scene that progresses to a new level with every new release&quot; says Big Cheese. \n\n&quot;Having raised the bar for compilations to unthinkable heights with the quality of success of The Emo Diaries, Deep Elm returns with their second helping of unknown talent that attempts, and I believe succeeds, to resurrect the great indie rock movement of the early 90&amp;#039;s, when good music played with passion was what mattered. Every band here, sans The Forecast, was completely new to my ears, and I was very impressed with what I heard from Jena Berlin and The New Lows, as both bands employed thick guitar riffs while also generating wonderfully contagious harmonies. The big noise of Cameran was a favorite of mine, but it was offset quite nicely by the more reserved efforts of Meredith Bragg and Death Ships, while Nature Living&amp;#039;s track was accented by well placed screamo-backing vocals. The Forecast are now currently employed by Victory Records, and one can hear why, but my choice for stardom is The Silent Press, whose Can&amp;#039;t You Tell is a sing along favorite waiting to happen. This is a brilliant release, as the bookend tracks of the opening, experimental, hushed, hum of Maxel Toft worked in perfect synchronicity with the atmospheric intricacy and sporadic force of Bernard&amp;#039;s closer. This will restore your faith in music.&quot; - Jersey Beat \n\nGood stuff here.  Deep Elm has perfected the compilation.\n\nIf you like this, check out my other torrents.  I only upload quality stuff!","torrent":{"xt":"urn:btih:46436956e5948ccb45fc973d7af8ea3b099787a2","amp;dn":"%28Indie+Rock%29+This+is+Indie+Rock%21++Volume+1+and+2+%28Deep+Elm%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"46436956e5948ccb45fc973d7af8ea3b099787a2","infoHashBuffer":{"type":"Buffer","data":[70,67,105,86,229,148,140,203,69,252,151,61,122,248,234,59,9,151,135,162]},"announce":[],"urlList":[]}}