{"title":"TrickySpa - Miranda Miller (Distracting Daddy) NEW 11 November 2","uid":12743136,"size":240980301,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:47173510f51834a341641912f356b92ea36f8969&amp;dn=TrickySpa+-+Miranda+Miller+%28Distracting+Daddy%29+NEW+11+November+2&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xxxlavalxxx","files":2,"time":1447268473,"description":"Derrick Pierce's overprotective nature is too much for his daughter Karen to handle. She flees from her father's captivity with her boyfriend Johnny, and asks her best friend, Miranda Miller to help her out in any way possible. Derrick notices Miranda sitting in his backyard, wondering what she is doing there. Miranda tells him Karen said it was ok for her to chill out while she is gone. Derrick wants to speak to her in the living room to find out the whereabouts of his daughter. Miranda tells Derrick she is away with some girlfriends and he has nothing to worry about. Derrick confesses his disapproval with Karen's boyfriend, knowing he's just in it for one thing, and that is sex. This is all too much for Derrick, showing anxiety and stress, so Miranda offers him to relax with a body massage. Thinking nothing of it, Derrick accepts her proposition.He lies down on the couch, shirtless, as Miranda straddles over his upper body, removing all of his stress and tension. Miranda knows she can make Derrick feel a lot better, using more than just her hands on his back and chest. She places her hands over his cock, repeating her invitation for ultimate pleasure. He asserts his disapproval towards her hands over his cock, but it doesn't matter at this point, with her mouth devouring his erection. Miranda looks to have a little more fun by removing her bikini bottom, pushing Derrick's slick cock deep inside her tight pussy, busting a huge load over her cute ass.\r\nTags: Body Massage, Blowjob, Deepthroat, Hardcore, Natural Tits, Teen, Massage, Ass, Colored Hair, Big Dick\r\n \nhttp://imgdone.com/viewer.php?file=74033640195483611494.jpg\r\n \nhttp://imgdone.com/viewer.php?file=89781495655667590788.jpg","torrent":{"xt":"urn:btih:47173510f51834a341641912f356b92ea36f8969","amp;dn":"TrickySpa+-+Miranda+Miller+%28Distracting+Daddy%29+NEW+11+November+2","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47173510f51834a341641912f356b92ea36f8969","infoHashBuffer":{"type":"Buffer","data":[71,23,53,16,245,24,52,163,65,100,25,18,243,86,185,46,163,111,137,105]},"announce":[],"urlList":[]}}