{"title":"dan mangun","uid":4179480,"size":54318591,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:471c355030d62056600998c96aedd5ec9ad68e7c&amp;dn=dan+mangun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DocOctiv","files":12,"time":1210325393,"description":"Daniel Mangan (born April 28, 1983 in Canada), better known as Dan Mangan, is a Canadian singer-songwriter. Growing up amid the rural and urban churches that his mother, a United Church minister, presided at, Dan was surrounded by musical communities from a young age.\n\nAs a child, Dan versed himself in his parents&amp;#039; old vinyls of The Beatles, Paul Simon, Van Morrison and, of course, &quot;Tears Are Not Enough&quot;. By 7 years old, his step brother had taught him how to play most of Abbey Road in proper succession on the piano. At sixteen, he had started a band called Basement Suite with some fellow classmates in Vancouver, BC, terrorizing the local community centres with awfully constructed and hardly listenable folk-rock music. In 2003, at 20 years old, he released his first acoustic EP entitled All At Once, pressing 500 copies which were given away and sold throughout the Vancouver area. The EP allowed Dan to book gigs and begin to attract a small following of supportive listeners. Following All at Once&amp;#039;s moderate success, his second effort Postcards and Daydreaming was released independently in October 2005, produced, recorded and mixed by Daniel Elmes at Dubvibe Productions in Vancouver.\n\nWith a bank loan debt and a small community of players who would offer cheap/free sessions, Dan finally had a product with some serious merit. Learning what he could about the music industry and fueled by the fear that the debt might not have been worth it, Dan sought out booking tours and gaining whatever contacts he could throughout the local music community. Dan met Shannon Martin, who at the time was the label manager for Boompa Records, and formerly BattleAxe Records at the Western Canadian Music Awards in October 2005. Nine months later, they decided to work together. Martin has since started File Under: Music, a record label and management company, and re-released &quot;Postcards and Daydreaming&quot; in Canada with an extended track and new artwork via Outside Music. The record label&amp;#039;s roster also now includes Calgary&amp;#039;s Hot Little Rocket and American act Petra Haden and Miss Murgatroid.\n\nIn 2007, Mangan wrapped two UK tours, playing The Great Escape Festival in Brighton, three USA tours, performing at The Viper Room, MusExpo, The Roxy Theatre, and Austin&amp;#039;s South by Southwest. He also toured Australia, playing The Big Sound festival in Brisbane. Having found noticeable, but restrained success in the Canadian market, Dan found - oddly enough - that touring new territories outside of Canada was a good way to be noticed at home.\n\nIn terms of press, Dan has received accolades from numerous media engines, most notably New Musical Express, but also the Canadian based Exclaim! and his home town Vancouver Province and The Georgia Straight. Blog mentionings, press clippings, quotables have come quickly with the official release of his debut full-length, and momentum seems to be riding high as Dan&amp;#039;s musical career continues to take flight in broader spectrums. Dan returns to the studio in December of 2007 to begin recording his next record with producer John Ellis, whose namesake lends itself to Ridley Bent, Leeroy Stagger, The Be Good Tanyas and Leslie Alexander.","torrent":{"xt":"urn:btih:471c355030d62056600998c96aedd5ec9ad68e7c","amp;dn":"dan+mangun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"471c355030d62056600998c96aedd5ec9ad68e7c","infoHashBuffer":{"type":"Buffer","data":[71,28,53,80,48,214,32,86,96,9,152,201,106,237,213,236,154,214,142,124]},"announce":[],"urlList":[]}}