{"title":"Congkak.2008","uid":4239197,"size":439447552,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:47475b39b2d5f138edd9e2e6aa7d428bc25fd4e9&amp;dn=Congkak.2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dal4741","files":2,"time":1213454225,"description":"Congkak is a Malaysian horror film directed by Ahmad Idham. The film is scheduled to open in Malaysia on 17 April 2008.\n\nPlot\n\nKazman is a dedicated husband who, despite his wife Sufiah&amp;#039;s protests, decided to buy a bungalow for their family near a lake as a family getaway. Anxious in the new house, Sufiah feels as if someone is watching her. Her daughter Lisa, who would always go downstairs at night to play congkak with someone whom she could only see, compounds her uneasiness. Sufiah throws the congkak in the lake, but is awakened the next night by the sound of the congkak being played again and upon investigation, she sees an old lady playing it. When her daughter disappears, the oldest resident in that area, Pak Tua, comes to the family&amp;#039;s rescue and helps in locating the missing family members.\n\nWarning\n\nA warning was imposed advising pregnant women, people with heart problems, and children below 13 years of age not to view this film due to its scary nature.\n\n\nOne movie poster carries this warning sign:\n\n?AMARAN: Ibu-ibu mengandung dan pengidap penyakit jantung dinasihatkan agar tidak menonton filem ini?\n\n&quot;WARNING: Expectant mothers and those suffering from heart ailments are advised against viewing this film&quot;\n\n&lt;aclass=&quot;external text&quot;rel=&quot;nofollow&quot;&gt;Trailer at","torrent":{"xt":"urn:btih:47475b39b2d5f138edd9e2e6aa7d428bc25fd4e9","amp;dn":"Congkak.2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"47475b39b2d5f138edd9e2e6aa7d428bc25fd4e9","infoHashBuffer":{"type":"Buffer","data":[71,71,91,57,178,213,241,56,237,217,226,230,170,125,66,139,194,95,212,233]},"announce":[],"urlList":[]}}