{"title":"The War - Waving White","uid":4072315,"size":25185026,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:488010a1474c9a3ec340c5fc4e2c1394261275c4&amp;dn=The+War+-+Waving+White&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"JoshL11185","files":1,"time":1205108987,"description":"The War&amp;#039;s EP called Waving White\n\nThe War, formerly Starting Tuesday, formed in Chapel Hill, North Carolina. This four piece rock band is made up of Scott Cash, Justin Kitchen, Ken Pittman, and Daniel Goans. \n\nThe band has been playing venues in the Southeast since September 2003 and has built up a loyal fan base, selling close to 10,000 copies of their self-titled album. \n\nPlaying primarily in the Southeast, The War has had opportunities to open for nationally touring acts like Cheyenne Kimball, Teddy Geiger, Saving Jane, and various others. \n\nThe band has undergone a transition as they have recently completed their new EP, recorded with Ed Cash in Nashville, Tennessee. It is during the recording process that the band began to undertake an activist role in the world. \n\nMusic is about more than rock and roll for these guys, although their passion for the music is evident at every single live show. It is important to them to use their music as a platform to speak out for those who have no voice. Oppression and injustice are rampant in this world that we live in, and The War believes that we all have the ability to speak out against these things and bring about change. \n\nThey have been compared to Coldplay, The Fray, Keane, and Switchfoot sonically, and they normally describe themselves saying that they are &quot;edgy rock with pop sensibility.&quot; This new recording that The War has just completed sets a new tone of seriousness and the future looks bright for this heavily hopeful band.\n\n","torrent":{"xt":"urn:btih:488010a1474c9a3ec340c5fc4e2c1394261275c4","amp;dn":"The+War+-+Waving+White","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"488010a1474c9a3ec340c5fc4e2c1394261275c4","infoHashBuffer":{"type":"Buffer","data":[72,128,16,161,71,76,154,62,195,64,197,252,78,44,19,148,38,18,117,196]},"announce":[],"urlList":[]}}