{"title":"The.Mist(2007)_PocketPC(ppcmovies.net)","uid":4079767,"size":268569432,"categoryP":"video","categoryS":"handheld","magnet":"?xt=urn:btih:48c2df421c76c6803ba885db2d35ff5adddd3e75&amp;dn=The.Mist%282007%29_PocketPC%28ppcmovies.net%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gogiyes","files":1,"time":1205510472,"description":"The Mist (2007)\n\n   Everyone thought of it as a harmless lightning storm. When Dave Drayton (Thomas   Jane) notices a strange mist on the lake, he thinks nothing of it. When his son, Billy Drayton (Nathan Gamble), his neighbor Brent Norton (Andre Braugher), and himself travel to the supermarket, the unthinkable happens. On their way to the market, they see the army, the firefighters, and the police, heading toward the mist. When he sees this Brent mentions something about &quot;Project Arrowhead&quot;, a secret military plan that no one knows about. As they are shopping, they see three army men walk in, just to pick up a few things then head toward the mist.All eighty of the store&amp;#039;s shoppers had no clue what was going on until an old man (Jeffery Demunn) runs in the market with a bloody nose and declares &quot;Something in the mist!&quot; He tells them to close the door. About five seconds after they do close the door, the entire store shakes, as though it was lifted feet above the ground. When David is asked to check on the generator, the loading dock door was being pushed by something outside. Then there was a groan heard by Dave. He asks three people to come with him. When Norm the bag-boy(Chris Owen) volunteers to go out, he is taken by a creature with large squid-like tentacles that have mouths, teeth, and arms of their own. When Dave and the other three fight it off, they alarm everyone in the store what is out there. After hearing this, Mrs. Carmody(Marcia Gay Wallace)exclaims that it is the end of times and that God is punishing them. People don&amp;#039;t believe it until Mrs.Carmody has almost everyone in the store on her side. Does &amp;#039;Project Arrowhead&amp;#039; have anything to do with this? Will Dave Drayton, his son, and his friends make it out alive as they make their last stand against this destruction? Or will they be taken by the demon-like creatures of &amp;#039;The Mist&amp;#039;?\n\nNow on: DVD\nImage\nWidth 320 pixels\nHeight 210 pixels\n\nAudio\nDuration 2:05:55\nBit Rate 24 kbps\nAudio format MPEG Layer-3\n\nVideo\nFrame rate 23 frames/second\nData rate 34 kbps\nVideo sample size 24 bit\nVideo compression Divx codec","torrent":{"xt":"urn:btih:48c2df421c76c6803ba885db2d35ff5adddd3e75","amp;dn":"The.Mist%282007%29_PocketPC%28ppcmovies.net%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"48c2df421c76c6803ba885db2d35ff5adddd3e75","infoHashBuffer":{"type":"Buffer","data":[72,194,223,66,28,118,198,128,59,168,133,219,45,53,255,90,221,221,62,117]},"announce":[],"urlList":[]}}