{"title":"Terry Callier ~ Time Peace","uid":4070749,"size":159902484,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:492fef3393dddb317fff41c4ca4d53bb7243c40f&amp;dn=Terry+Callier+%7E+Time+Peace&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gazzjazz","files":16,"time":1205037781,"description":"Terry to me is the new Marvin Gaye...with plenty of room to move\nTerry is Otis Redding meets Marvin in one; plus a little gospel thrown in\nif you love R&amp;B meets soul then this album will blow your mind\nrepeat exposure will lead to total Callier addiction\nJools Holland thinks Terry is the greatest soul singer ever\nI&amp;#039;ve included scanned cover art plus AMG reviews\nplease seed as long as possible friends\ncheers Gazza\n\nBiography\tby Jason Ankeny\n\nFor far too long, folk-jazz mystic Terry Callier was the exclusive province of a fierce but small cult following; a singer/songwriter whose cathartic, deeply spiritual music defied simple genre categorization, he went all but unknown for decades, finally beginning to earn the recognition long due him after his rediscovery during the early &amp;#039;90s. Born in Chicago&amp;#039;s North Side -- also home to Curtis Mayfield, Jerry Butler, and Ramsey Lewis -- and raised in the area of the notorious Cabrini Green housing projects, Callier began studying the piano at the age of three, writing his first songs at the age of 11, and regularly singing in doo wop groups throughout his formative years. While attending college, he learned to play guitar, eventually setting up residency at a Chicago coffeehouse dubbed the Fickle Pickle and in time coming to the attention of Chess Records arranger Charles Stepney, who produced Callier&amp;#039;s debut single &quot;Look at Me Now&quot; in 1962.\n\nIn 1964, Callier met Prestige label producer Samuel Charters, and a year later they entered the studio to record his full-length bow The New Folk Sound of Terry Callier; upon completion of the session, however, Charters traveled to Mexico with the master tapes in tow, and the album went unreleased before finally appearing to little fanfare in 1968. Undaunted, Callier remained a fixture of the Windy City club scene, and in 1970 he and partner Larry Wade signed on with his boyhood friend Jerry Butler&amp;#039;s Chicago Songwriters Workshop. There they composed material for local labels including Chess and Cadet, most notably authoring the Dells&amp;#039; 1972 smash &quot;The Love We Had Stays on My Mind.&quot; The song&amp;#039;s success again teamed Callier with Stepney, now a producer at Cadet, and yielded 1973&amp;#039;s Occasional Rain, a beautiful fusion of folk and jazz textures which laid the groundwork for the sound further explored on the following year&amp;#039;s What Color Is Love?\n\nDespite earning strong critical notices and building up a devoted fan base throughout much of urban America, Callier failed to break through commercially, and after 1975&amp;#039;s I Just Can&amp;#039;t Help Myself he was dropped by Cadet; in 1976, he also suffered another setback when Butler closed the Songwriters Workshop. Upon signing to Elektra&amp;#039;s Jazz Fusion imprint at the behest of label head Don Mizell, Callier resurfaced in 1978 with the lushly orchestrated Fire on Ice; with the follow-up, 1979&amp;#039;s Turn You to Love, he finally cracked the pop charts with the single &quot;Sign of the Times,&quot; best known as the longtime theme for legendary WBLS-FM disc jockey Frankie Crocker. He even appeared at the Montreux Jazz Festival. However, when Mizell exited Elektra, Callier was quickly dropped from his contract; after a few more years of diligent touring, he largely disappeared from music around during the early &amp;#039;80s; a single parent, he instead accepted a job as a computer programmer, returning to college during the evenings to pursue a degree in sociology.\n\nDespite essentially retiring from performing, Callier continued composing songs, and in 1991 he received a surprise telephone call from fan Eddie Pillar, the head of the U.K. label Acid Jazz. Pillar sought permission to re-release Callier&amp;#039;s little-known, self-funded single from 1983, &quot;I Don&amp;#039;t Want to See Myself (Without You)&quot;; seemingly overnight, the record became a massive success on the British club circuit, and the singer was soon flown to Britain for a pair of enormously well-received club dates. In the coming months, more gigs followed on both sides of the Atlantic, and in 1996, Callier even recorded a live LP, TC in DC. In 1997, he teamed with British singer Beth Orton, another of his most vocal supporters, to record a pair of tracks for her superb EP Best Bit; the following year, Callier also released his Verve Forecast debut Timepeace, his first major-label effort in close to two decades. Lifetime followed in 1999, and two years later came Alive, recorded live at London&amp;#039;s Jazz Cafe. Callier returned in 2002 with Speak Your Peace and 2005 with Lookin&amp;#039; Out. \n\nReview\tby Jason Ankeny\n\nWhere has Terry Callier been all of our lives? Outside of the lucky few collectors fortunate enough to possess copies of his 1968 debut The New Folk Sound of Terry Callier and the series of brilliant records he cut for the Cadet label during the mid-1970s, the Chicago singer/songwriter has otherwise slipped through the cracks of contemporary music; his resurrection has been a long time in coming, and Timepeace is indeed well worth the wait. Long ago tagged with the label &quot;folk-jazz,&quot; Callier&amp;#039;s music eludes easy description; cosmic and spiritual, it also bears the influence of gospel and soul, yet synthesizes its disparate elements in unprecedented and breathtaking ways. Sparked by Callier&amp;#039;s spiralling guitar leads, highlights like &quot;Lazarus Man&quot; and &quot;Java Sparrow&quot; seem to tap a higher consciousness, his yearning vocals channeling unfathomable power; the stark opener &quot;Ride Suite Ride&quot; matches the grace of Curtis Mayfield with the poignancy of Nick Drake, while &quot;Coyote Moon&quot; captures an ethereal yet pastoral beauty best likened to extraterrestrial country music. It&amp;#039;s wonderful to have Callier back again -- we need him now more than ever. ","torrent":{"xt":"urn:btih:492fef3393dddb317fff41c4ca4d53bb7243c40f","amp;dn":"Terry+Callier+%7E+Time+Peace","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"492fef3393dddb317fff41c4ca4d53bb7243c40f","infoHashBuffer":{"type":"Buffer","data":[73,47,239,51,147,221,219,49,127,255,65,196,202,77,83,187,114,67,196,15]},"announce":[],"urlList":[]}}