{"title":"Iron City Houserockers - 3 albums","uid":4230807,"size":184523548,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4ab0c61f85ce74878a7ff33f88e3a41b7b84e5c0&amp;dn=Iron+City+Houserockers+-+3+albums&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Monserik","files":33,"time":1213039506,"description":"The Iron City Houserockers were an American rock band from Pittsburgh, Pennsylvania, led by singer/guitarist Joe Grushecky, that existed from 1976 until 1984. Lumped into the heartland rock genre, critically praised but commercially unsuccessful, the band&amp;#039;s fans view them as one of the great &quot;shoulda-beens&quot; in the history of rock and roll.\n\nStarted in 1976 as the Brick Alley Band by Grushecky, a high school special education teacher in Pittsburgh, the band was a fairly typical bar band, distinguished by Grushecky&amp;#039;s taut, focused songs about life in the open hearth and a distinctive, harmonica-and-guitar driven sound owing much to the Rolling Stones, but which seemed to borrow a lot of the thrashy fury of punk rock.\n\nReleased in 1979, their debut album Love&amp;#039;s So Tough suffered from rough, cheap-sounding production but showcased the potential of the band&amp;#039;s sound. &quot;Dance With Me&quot; and &quot;I Can&amp;#039;t Take It&quot; were viewed as standout cuts. Rolling Stone Magazine featured the album as its showcase review with the headline &quot;New American Classic.&quot;\n\nThe band&amp;#039;s follow-up album Have A Good Time But Get Out Alive! is recognized by many as a classic [1]: raw and impassioned, it is not a perfect album, but its flaws are both fascinating and much less than the sum of the high points. The tandem tavern-set tracks &quot;Old Man Bar&quot; and &quot;Junior&amp;#039;s Bar&quot; were especially praised. Production was credited to Ian Hunter and Mick Ronson, although much of the album was produced by an uncredited Steven Van Zandt.\n\nThe Houserockers&amp;#039; third album, Blood on the Bricks, is a bit more restrained, but a lot richer and more consistent; for the first time, Grushecky&amp;#039;s ballads measure up to his faster anthems. Produced by American soul-rock legend Steve Cropper, the album crackles with restrained intensity. The 1983 edition Rolling Stone Record Guide praised it as the band&amp;#039;s best album, although it had good marks for all of them.\n\nHere&amp;#039;s the 3 albums i vinyl rips, processed to eliminate noise.\n\nEnjoy, please comment and seed.\n","torrent":{"xt":"urn:btih:4ab0c61f85ce74878a7ff33f88e3a41b7b84e5c0","amp;dn":"Iron+City+Houserockers+-+3+albums","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ab0c61f85ce74878a7ff33f88e3a41b7b84e5c0","infoHashBuffer":{"type":"Buffer","data":[74,176,198,31,133,206,116,135,138,127,243,63,136,227,164,27,123,132,229,192]},"announce":[],"urlList":[]}}