{"title":"The 'New Berlin' base: Nazis in the Antarctic","uid":4064872,"size":19486506,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b5c56908633a358bad60fee9404657711473934&amp;dn=The+%5C%27New+Berlin%5C%27+base%3A+Nazis+in+the+Antarctic&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xippie","files":1,"time":1204753932,"description":"German Researcher&amp;#039;s summary\n\nWe asked the German researcher to write a summary of the book for the benefit of English-speaking readers:\n\n    About the book\n     \n    I obtained the book from a German UFO society. They had received the book itself (around 400 pages) and two CDs containing the text and several drawings. The envelope had no address on it. However, the postmark reveals that it had been sent from Berlin.\n\n    The book was written by ?Barabou Vedu in cooperation with R. Eckelt&quot; (both anonymous). The author, Barabou Vedu, claims that his writings are an actual report from his experiences on an old alien base, where he was being kept ?somewhere in the eternal ice? until he was 15 years old. He claims that people on the base spoke English and ?Indian? language.\n     \n    About the base\n     \n    The author says that the base is no longer under extraterrestrial but under human control. He says the reason why there are so many human scientists on the base is because this is a place where many exotic phenomena can be observed, like ?vectorial viewing into the future?, ?soul travel via machine?, ?technical telepathy? or what he calls ?eye-movies? (living another&amp;#039;s experiences by proxy).\n\n    The author says that the base where he lived it is located not far from another alien base which bears the name ?New Berlin?. He suspects that the base where he lived was part of the &quot;New Berlin&quot; base. He describes it as a huge building of glass and plastic, several square kilometers in area. During his stay, he says never left the base physically.\n     \n    How he left the base\n     \n    Around the year 1996, the author says that he left the base due to the first signs of schizophrenia; however, he has no conscious memory of how exactly he was ?thrown out?. He woke up outside the base in a mountainous area ?somewhere in Tajikistan?, where he was welcomed by four Turkish people that he later identified as ?one of their criminal mind-control-gangs?. He stayed with them for a while, but then fled and traveled to Germany by train, a trip which took about three weeks. He says that after his arrival in Germany, he was officially accepted as a refugee.\n     \n    Why he wrote the book\n     \n    Because of recurring flashbacks, nightmares and ?apparent signs of post-traumatic stress?, he was assigned to a psychiatric hospital in May 1998. He says that no-one there would believe any of the stories he had to tell which is why he decided to start lying to the doctors. He eventually managed to discharge himself and decided to confide in a person he trusts, whom he told about his past in order to cope with his fears and nightmares.\n\n    It seems that the book is a direct result of these conversations. The author says that it was a good idea to write everything down because it was an effective way to ?get rid of everything?. One may suspect that the aforementioned person ?R. Eckelt? is the one who gained Barabou?s trust and helped him to write down his memories.\n     \n    His memories\n     \n    The author says that he and the other humans on the base followed a schedule. They received their food from a tube which came out of the wall. He describes it as a kind of ?brown paste?, which tasted like fruit. In order to receive food, they were obliged to follow certain tasks for which they received ?bonus points?. Not fulfilling a task resulted in receiving no points, and therefore no food.\n\n    One of the main tasks that he and the other humans had was to ?follow the thought structures of humans outside the base?, using a technology he calls the ?Bereschewan-seat?. The seat itself is described as far too small for a human being - it seems to have been created for beings with another anatomy.\n\n    In order to use the seat, the author says they had to put on a specific suit with a cable which ended in a machine. Using the seat, it was apparently possible to see and feel the world outside as if one would experience it with one&amp;#039;s own senses (sight, smell, sound, touch etc). The author says that he was eventually obliged to draw what he saw. Sometimes he was ordered to distract people outside the base from their original thoughts and to ?implant? different, more violent thoughts. The author furthermore suggests that this manipulation has been going on for a long time - and probably from the future.\n\n    The author says that among the humans, there were also other beings present on the base. He refers to them as ?Lemurs? - reddish, greenish robots which he suspects are inhabited by human souls who failed to accomplish their tasks. Another type of being mentioned is described as small and humanoid in appearance with brown, hairless skin. Humans living on the base worshipped them, considering them to be ?Gods?. In one part of the book, the author describes how he once saw one of these brown beings sitting perfectly at ease on the Bereschewan seat, a detail which suggests that the seat was their technology.\n\n    I have only read, in detail, a quarter of the book so far. There are many more things in the book which are not described in this summary.\n     \n    A glance at the text\n     \n    The book is almost entirely written in German, although some paragraphs are written in bad English and seem to have been translated either by a German-speaking person or by an automatic translator. As for consistency of the content, no apparent contradictions can be observed. On the contrary, throughout the book, the author keeps relating again and again to details he has already mentioned before.\n\n    There is one chapter which contains numerous formulae and diagrams about what the author describes as ?Our theory of everything?. This complex mathematical physics seems to describe an advanced model of a multidimensional universe, and how to travel through it. He states that investigating these formulas might prove the authenticity of his claims, but possibly only ?in 20 or 30 years from now?.\n\n    First steps undertaken so far\n     \n    A very experienced remote viewer has been asked to assist to give an opinion on the book&amp;#039;s authenticity. One initial session has been done so far and more are planned.\n     \n    Recommendations\n     \n    A complete translation into English would be advisable so that researchers from around the world can investigate this independently. The book is obviously linked to the persistent reports that Hitler discovered an alien base in Antarctica and went there before the end of World War II. Therefore a thorough investigation of parallels between the book and existing Alien-Nazi-Antarctica research seems to be a good idea.\n\n","torrent":{"xt":"urn:btih:4b5c56908633a358bad60fee9404657711473934","amp;dn":"The+%5C%27New+Berlin%5C%27+base%3A+Nazis+in+the+Antarctic","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b5c56908633a358bad60fee9404657711473934","infoHashBuffer":{"type":"Buffer","data":[75,92,86,144,134,51,163,88,186,214,15,238,148,4,101,119,17,71,57,52]},"announce":[],"urlList":[]}}