{"title":"Ariana Franklin - The Serpent's Tale","uid":4231469,"size":699111857,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:4b62f762df5953015c242730f1903720a68b9c53&amp;dn=Ariana+Franklin+-+The+Serpent%5C%27s+Tale&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mountain-pa","files":116,"time":1213072460,"description":"2008 Medieval forensic specialist Vesuvia Adelia Rachel Ortese Aguilar returns to action in the second installment in Franklin&amp;#039;s historical series (Mistress of the Art of Death, 2007). The proto-feminist &quot;doctor of death&quot; has come a long way. As this enjoyable romp opens, Adelia has settled into life in the fens of East Anglia, practicing medicine and trying to raise her daughter. Her peace is disrupted by the arrival of a messenger with a royal mandate. King Henry II&amp;#039;s favorite mistress, Rosamund, has been murdered, presumably with poisonous mushrooms, and his estranged wife, Queen Eleanor of Aquitaine, is the chief suspect-Eleanor recently escaped from Henry&amp;#039;s clutches and is known to be both wildly jealous and also brewing rebellion. Before civil war can once again tear the country apart, Henry needs Adelia to uncover the truth about Rosamund&amp;#039;s death. At first unwilling, but keen on avoiding war, she takes on the challenge and in the process uncovers yet another murder and numerous other foul acts, as well as some unexpected information about decaying human flesh. The careful clinician of the first book has become a passionate woman and worried mother, exoticism and novelty traded for a greater range of emotion. A warm, promising continuation of the series. Agent: Helen Heller/Helen Heller Agency \n ","torrent":{"xt":"urn:btih:4b62f762df5953015c242730f1903720a68b9c53","amp;dn":"Ariana+Franklin+-+The+Serpent%5C%27s+Tale","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b62f762df5953015c242730f1903720a68b9c53","infoHashBuffer":{"type":"Buffer","data":[75,98,247,98,223,89,83,1,92,36,39,48,241,144,55,32,166,139,156,83]},"announce":[],"urlList":[]}}