{"title":"Delirious Delhi - Dave Prager","uid":12760940,"size":5704835,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:4b97d3fee8f0901b0a9c8794a8a68ba46e7e68a2&amp;dn=Delirious+Delhi+-+Dave+Prager&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1447531483,"description":"When the Big Apple no longer felt big enough, Dave Prager and his wife, Jenny, moved to a city of sixteen million people—with seemingly twice as many honking horns. Living and working in Delhi, the couple wrote about their travails and discoveries on their popular blog Our Delhi Struggle. This book, all new, is Dave’s top-to-bottom account of a megacity he describes as simultaneously ecstatic, hallucinatory, feverish, and hugely energizing. Weaving together useful observations and hilarious anecdotes, he covers what you need to know to enjoy the city and discover its splendors: its sprawling layout,some  favorite sites, the food, the markets, and the challenges of living in or visiting a city that presents every human extreme at once. Among his revelations: secrets that every Delhiite knows, including the key phrase for successfully negotiating with any shopkeeper; the most fascinating neighborhoods, and the trendiest; the realities behind common stereotypes; tips for enjoying street food and finding hidden restaurants, as well as navigating the transportation system; and the nuances of gestures like the famous Indian head bobble. Delirious Delhi is at once tribute to a great world city and an invitation to explore. Read it, and you’ll want to book the next flight!","torrent":{"xt":"urn:btih:4b97d3fee8f0901b0a9c8794a8a68ba46e7e68a2","amp;dn":"Delirious+Delhi+-+Dave+Prager","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4b97d3fee8f0901b0a9c8794a8a68ba46e7e68a2","infoHashBuffer":{"type":"Buffer","data":[75,151,211,254,232,240,144,27,10,156,135,148,168,166,139,164,110,126,104,162]},"announce":[],"urlList":[]}}