{"title":"Wild.Weather.with.Richard.Hammond-BBC-2014--720p","uid":12817579,"size":3131466058,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:4c38de4c7680a0fcef6cba5c5086fb3e8cb96403&amp;dn=Wild.Weather.with.Richard.Hammond-BBC-2014--720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":6,"time":1448251262,"description":"Wild Weather with Richard Hammond\r\n\r\nBBC 2014 - 3 Episodes\r\n\r\nRichard Hammond travels the globe to discover the unexplained and the unexpected, the unbelievable and the just plain unlikely, in an attempt to reveal the hidden world of weather.\r\n \nhttp://www.bbc.co.uk/programmes/b05nhxtd\r\n_________________\r\n\r\n1280x720 resolution - with subtitles - enjoy !\r\n_________________\r\n\r\nWild Weather with Richard Hammond, Original Series Episode 1 of 3\r\nWind: The Invisible Force\r\nRichard Hammond investigates how wind actually starts. He visits one of the windiest places on the planet, walks into the centre of a man-made tornado and creates a 10-metre high whirlwind - made of fire!\r\nAlong the way he is part of a world first when he joins up with an American meteorologist called Reed Timmer and a bizarre vehicle known as The Dominator III. Their aim is to succeed in doing what no one has ever done before, fire a probe into a tornado to measure its speed where it is at its fastest - right next to the ground. As Reed explains, 'near the base of the tornado is one of the biggest mysteries of tornado science and it's also the most important to understand because those are the wind speeds... that cause all the destruction'. To put that right, Reed and his team take The Dominator into the middle of a real live tornado and attempt to fire a probe into the very heart of it.\r\nRichard also visits one of the few places on the planet capable of duplicating a real-life tornado. The Wind Engineering, Energy and Environment Research Institute (or WindEEE for short) in Ontario in Canada hadn't even opened its doors when Richard asked them to take part in an experiment. The $23 million facility is one of the the world's first hexagonal wind tunnels. As Richard says, 'I've got goosebumps. And that's not just because it's cold in here!'\r\nRichard braves the winds and temperatures of -50 degrees Fahrenheit to take a trip outside on top of Mount Washington in New Hampshire. On April 12th 1934, that station measured one of the highest wind speeds ever measured on land - 231 mph.\r\n\r\nWild Weather with Richard Hammond, Original Series Episode 2 of 3\r\nWater: The Shape Shifter\r\nRichard Hammond investigates the crucial role water plays. Without water there would be almost no weather: no rain, no snow, no hail, no clouds. So Richard goes in pursuit of water in all its forms. He tries to weigh a cloud, finds out how rain could crush a car, and gets involved in starting an avalanche.\r\nAlong the way, he tries to find out why clouds float by building his own cloud with the aid of a cattle trough, some humidifiers and atmospheric scientist Dr Jim McQuaid. But will their cloud float in the air like a real cloud?\r\nHe also drops in on renowned hail scientist Charles Knight in his lab in Boulder, Colorado, to discover that there is far more to hail than meets the eye. In a scientific first, and with the help of Jim Stratton and Craig Zehrung from Purdue University, Richard sets about firing ice and hail at a board to find out which does the most damage.\r\nFinally, in conjunction with the WSL Institute for Snow and Avalanche Research SLF in Davos, Richard joins Walter Steinkogler as he starts an avalanche in an attempt to find out how something as delicate and fragile as a snowflake can travel at extraordinary speeds of up to 250mph on the ground.\r\n\r\nWild Weather with Richard Hammond, Original Series Episode 3 of 3\r\nTemperature: The Driving Force\r\nRichard Hammond investigates the crucial role temperature plays in all weather. Without heat, there would be no weather - no clouds, no rain, no snow, no dust storms, no thunder and lightning.\r\nRichard sets off to find out about hot air and with the help of a quarry and a massive hot plate discovers just why it is so hard to pull a sword out of snow. He discovers, by building his own massive dust storm with the help of a few friends and dust specialist Dr Nigel Tapper, just how sand from the Sahara bounces its way to the UK.\r\nIn Canada he creates his own ice storm. He also drops in on Dan Morgan, who creates lightning bolts in his lab, where Richard is able to see thunder and hear lightning with the aid of some special cameras, light bulbs and a few candles","torrent":{"xt":"urn:btih:4c38de4c7680a0fcef6cba5c5086fb3e8cb96403","amp;dn":"Wild.Weather.with.Richard.Hammond-BBC-2014--720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c38de4c7680a0fcef6cba5c5086fb3e8cb96403","infoHashBuffer":{"type":"Buffer","data":[76,56,222,76,118,128,160,252,239,108,186,92,80,134,251,62,140,185,100,3]},"announce":[],"urlList":[]}}