{"title":"gfi languard network security scanner","uid":4212899,"size":35779454,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4c8ad4352da98f488fa9e1d42218984a72efad82&amp;dn=gfi+languard+network+security+scanner&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"d1am0nd1690","files":2,"time":1212174490,"description":"Three pillars of network vulnerability management\n\nGFI LANguard Network Security Scanner (N.S.S.) is an award-winning solution that allows you to scan, detect, assess and rectify any security vulnerabilities on your network. As an administrator, you often have to deal separately with problems related to vulnerability issues, patch management and network auditing, at times using multiple products. However, with GFI LANguard N.S.S., these three pillars of vulnerability management are addressed in one package. Using a single console with extensive reporting functionality, GFI LANguard N.S.S.?s integrated solution helps you address these issues faster and more effectively.\n\nDetect security vulnerabilities on your network\nGFI LANguard N.S.S. makes use of state of the art vulnerability check databases based on OVAL and SANS Top 20, providing over 15,000 vulnerability assessments when your network is scanned. GFI LANguard N.S.S. gives you the information and tools you need to perform multi-platform scans across all environments, to analyze your network?s security health and effectively install and manage patches on all machines across different operating systems and in different languages. This results in a consistently configured environment that is secure against all vulnerabilities.\n\nAward winning security scanner and patch management\nVoted the best commercial network security scanner by users of Nmap for two years running, named the winner in the Patch Management category in TechTarget?s 2006 &amp;#039;Products of the Year&amp;#039; awards, and voted the winner in the security category of the Best of TechEd Awards 2007, GFI LANguard N.S.S. is the most complete vulnerability management solution in one convenient integrated package. GFI LANguard N.S.S. is an essential, cost-effective solution for businesses to safeguard their systems and networks from hacker attacks and security breaches. &gt;&gt;","torrent":{"xt":"urn:btih:4c8ad4352da98f488fa9e1d42218984a72efad82","amp;dn":"gfi+languard+network+security+scanner","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4c8ad4352da98f488fa9e1d42218984a72efad82","infoHashBuffer":{"type":"Buffer","data":[76,138,212,53,45,169,143,72,143,169,225,212,34,24,152,74,114,239,173,130]},"announce":[],"urlList":[]}}