{"title":"A Perfect Circle - Emotive","uid":4083308,"size":75617045,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:4ca18235c9cc0b3f7019b029ae288f0852f4c164&amp;dn=A+Perfect+Circle+-+Emotive&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ApotheoZ","files":1,"time":1205675518,"description":"A Perfect Circle (often referred to as APC) is an alternative rock supergroup formed by guitarist Billy Howerdel. Howerdel had worked as a guitar tech for bands such as Nine Inch Nails, The Smashing Pumpkins, Fishbone and Tool. He played demos of his music to Tool&amp;#039;s singer, Maynard James Keenan, who offered himself as vocalist should Howerdel ever form a band. Although initially hesitant about this, as he originally wanted a female vocalist, Howerdel eventually agreed and A Perfect Circle was formed in 1999. To distinguish himself from his persona with Tool, Keenan wore long wigs on his otherwise bald scalp for all of A Perfect Circle&amp;#039;s music videos, photo shoots and live performances.\n\nMaynard, when asked at a news conference, stated that the name &quot;A Perfect Circle&quot; originates from the friendships of the band members, all of them met one another in a way resembling &quot;a perfect circle of friendship.&quot; The band&amp;#039;s latest line-up featured Jeordie White (Marilyn Manson and formerly of Nine Inch Nails tour line-up) on bass, James Iha (formerly of The Smashing Pumpkins) on guitar, and prolific session drummer Josh Freese (also known from Nine Inch Nails tour line-up).\n\nAlthough the group never officially disbanded, A Perfect Circle has been on hiatus since 2006, having not written new material, toured or recorded, but the band&amp;#039;s personnel have kept busy with other projects.\n\nOfficial Website : http://www.aperfectcircle.com/","torrent":{"xt":"urn:btih:4ca18235c9cc0b3f7019b029ae288f0852f4c164","amp;dn":"A+Perfect+Circle+-+Emotive","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ca18235c9cc0b3f7019b029ae288f0852f4c164","infoHashBuffer":{"type":"Buffer","data":[76,161,130,53,201,204,11,63,112,25,176,41,174,40,143,8,82,244,193,100]},"announce":[],"urlList":[]}}