{"title":"Fairytale of Kathmandu","uid":4085411,"size":850947640,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:4ca8a84c464fb11b3ac6e8d3faed96459cd87a4a&amp;dn=Fairytale+of+Kathmandu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"comandanteloof","files":1,"time":1205781603,"description":"Very controversial Irish documentary about Irish language poet Cathal O Searcaigh.\n\nProvocative in both content and technique, \\&quot;Fairytale of Kathmandu\\&quot; is ostensibly about a renowned Gaelic poet, Cathal O Searcaigh, but is equally about the doc\\&amp;#039;s director, Neasa Ni Chianain, for whom the making of the film was an idol-smashing experience and rite of passage. \n\nRe-creations can be the bane of documentary watchers everywhere -- inherently artificial, they can feel downright false, depending on how they\\&amp;#039;re handled. But what the young Ni Chianain is attempting to do with her \\&quot;Fairytale\\&quot; is something else -- emotional recreation: When she follows her mentor, O Searcaigh, to his \\&quot;spiritual home\\&quot; of Nepal, she hopes to capture the poet in what he considers his adopted village, where he has sponsored the educations of several young men, and is treated with an entirely different kind of reverence than he gets at home (where he is a celebrated writer, as well as a self-acknowledged gay man in smalltown Ireland). What she finds are villagers who treat the poet as something just short of a deity. He\\&amp;#039;s a hero; she\\&amp;#039;s an acolyte.\n\nIf the reader\\&amp;#039;s red lights are already flashing, it\\&amp;#039;s small wonder. But Ni Chianain feigns naivete in her narration, even as she subtly reveals truths to her viewer -- a boy\\&amp;#039;s worried look, the disdain on the face of the wife of a man O Searcaigh has \\&quot;adopted\\&quot;; the question of a gift bicycle. Even as she shows herself to be in denial, the viewer is coming to know the truth about the poet\\&amp;#039;s relationships with his \\&quot;proteges.\\&quot;\n\nThere are several ethical conundrums here, including the question of whether O Searcaigh gets sandbagged by participating in a film that ultimately outs him. But what could he have expected? The armchair psychologist has to conclude that he wanted to be found out, and that Ni Chianain was merely a vehicle. The age of sexual consent in Nepal is 16 and so are the boys involved, but there\\&amp;#039;s certainly an issue of maturity here, as well as moral questions about power, money and what constitutes coercion.\n\nThat pedophilia is currently so present in Western consciousness will bring some audiences to suspect O Searcaigh\\&amp;#039;s motives from the start; others may go along with Ni Chianain\\&amp;#039;s gambit until her visual storytelling forces them to part company with her. Having assembled the film well after her own epiphany, Ni Chianain is doing something akin to subterfuge -- she\\&amp;#039;s placed her onscreen persona in a time pre-revelation and wants her own shattered illusions to be part of her aud\\&amp;#039;s experience. But she isn\\&amp;#039;t a fool either; her visual asides and the looks on the faces of the boys she photographs show that she knows that we know what\\&amp;#039;s going on.\n\nFinally, Ni Chianain has a confrontation with O Searcaigh that\\&amp;#039;s somewhere in the vicinity of blood-curdling, and the viewer is left with a few questions. But \\&quot;Fairytale of Kathmandu\\&quot; (with its double-entendre-ish title) is a highly emotional trip into a complex relationship, and a glimpse into the vagaries of third-world sex tourism.\n\nCamera (color, HD), Tristan Monbureau; editor, Una Ni Dhonghaile; music, Arnaud Ruest; sound, Guillaume Beauron; sound designer/editor, Reto Stamm; associate producer, Deaglan O Mochain. Reviewed at Intl. Documentary Festival Amsterdam, Nov. 26, 2007. Running time: 60 MIN.\n(English, Irish dialogue)","torrent":{"xt":"urn:btih:4ca8a84c464fb11b3ac6e8d3faed96459cd87a4a","amp;dn":"Fairytale+of+Kathmandu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ca8a84c464fb11b3ac6e8d3faed96459cd87a4a","infoHashBuffer":{"type":"Buffer","data":[76,168,168,76,70,79,177,27,58,198,232,211,250,237,150,69,156,216,122,74]},"announce":[],"urlList":[]}}