{"title":"Dragon Ball. Aventura Mistica","uid":4119815,"size":354850816,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4cc19f31fb0dcf15a4cd8ed45538a14eef2992c7&amp;dn=Dragon+Ball.+Aventura+Mistica&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"cazomdb","files":1,"time":1207495050,"description":"Goku y Krilyn consiguen superar las duras pruebas del entrenamiento de Kame Sennin. Goku y Krilyn ya han repartido botellas de leche, se han enfrentado a una colmena completa de avispas, han navegado por un lago de cocodrilos perseguidos por un dinosaurio, han empujado rocas gigantes y, finalmente, al quitarse un caparazÃƒÂ³n de tortuga de gran peso que llevaban a la espalda, han comprobado con un salto su mejora en agilidad...\nFinalmente, Goku y Krilyn podrÃƒÂ¡n participar en el Torneo de Artes marciales que se celebrarÃƒÂ¡ en MifÃƒÂ¡n. AllÃƒÂ­ pariticiparÃƒÂ¡n los discÃƒÂ­pulos del peor enemigo de Kame Sennin, el Duende Grulla (ademÃƒÂ¡s de Tao Pai Pai). Son Chaoz y Ten Shin Han, que tienen gran confianza entre ellos. Chaoz quiere recuperar su muÃƒÂ±eca perdida y por ello estÃƒÂ¡ buscando las bolas de dragÃƒÂ³n... Ya en el Torneo, Tao Pai Pai asesina al padre de Upah, Bora. Goku decide vengarse y combate duramente con Tao Pai Pai. Durante el largo combate llegan hasta la Villa PingÃƒÂ¼ino, donde vive Arale, una robot muy original que pertenece a otra obra de Akira Torillama (Dr.Slump). Arale derrota sin problemas a Tao Pai Pai. Goku consigue sus habichuelas mÃƒÂ¡gicas en la Torre de KarÃƒÂ­n, que devuelven la energÃƒÂ­a al tomarlas (con una de ellas es suficiente). Finalmente se descubre que Tao Pai Pai y el Duende Grulla pretendÃƒÂ­an utilizar con malos propÃƒÂ³sitos las bolas de dragÃƒÂ³n, traicionando a Chaoz. Finalmente se invoca al dragÃƒÂ³n para resucitar a Bora. Ten Shin Han y Chaoz se apuntan a la escuela de Kame Sennin, el Duende Tortuga.","torrent":{"xt":"urn:btih:4cc19f31fb0dcf15a4cd8ed45538a14eef2992c7","amp;dn":"Dragon+Ball.+Aventura+Mistica","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4cc19f31fb0dcf15a4cd8ed45538a14eef2992c7","infoHashBuffer":{"type":"Buffer","data":[76,193,159,49,251,13,207,21,164,205,142,212,85,56,161,78,239,41,146,199]},"announce":[],"urlList":[]}}