{"title":"McAfee.  AV Total. Protection. 2008. Retail","uid":4220710,"size":94678074,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4d51ede9e79e61094c1c202a3c5e9cb4d759bae1&amp;dn=McAfee.++AV+Total.+Protection.+2008.+Retail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marcexuse","files":258,"time":1212580128,"description":"macafee:::::McAfee Total Protection 2008\n\nMcAfee Total Protection provides comprehensive, proactive 12-in-1 security that guards what you value and with McAfee SiteAdvisor? Plus actively shields your PC from interaction with dangerous websites. Continuously and automatically updating, McAfee service helps prevent online hacker attacks with the latest protection. Also, it features a back-up and restore capability for computer crashes and environmental mishaps.\n\nMcAfee Total Protection includes multi-user ?Parental Controls,? protection from identity theft, spam and scams. With McAfee?s security service you always have the latest enhancements and threat updates that blocks viruses and spyware. Also, it includes a firewall to deter hacking.\n\n12-in-1 Prevention &amp; Protection\n\n    * Safe Search, Safe Surf. McAfee SiteAdvisor? adds ratings to websites to help you avoid online dangers.\n    * Home License Subscription Service. Automatically delivers the latest software features and threat updates and lets you easily manage security subscriptions for all your PCs.\n    * Stops Viruses. Blocks and removes viruses and even stops them before they even get to your PC.\n    * Stops Hackers. Protects and conceals your computer from hackers.\n    * Blocks Spyware. Blocks spyware before it installs on your computer and removes existing spyware.\n    * Improves PC Health. Cleans clutter off your computer so it stays healthy and secure.\n    * Secures Your Identity. Guards your identity from online fraud scams and identity thieves.\n    * Prevents Spam &amp; Email Scams. Shields you from junk email.\n    * Protects Children Online. Filters offensive content, pictures, and websites.\n    * Backs Up &amp; Restores Files. Automated back-up and one-click restore to protect your photos, music and important files.\n    * Home Network Protection. Monitors your entire network for security weaknesses, and lets you easily share files and printers.\n    * SiteAdvisor Plus. Extends safety ratings to links in emails and instant messages, and actively shields your PC from dangerous websites.\n\nAdditional Benefits\n\n    * Redesigned for You. Scan your computer, check for updates and configure your security settings using the new McAfee SecurityCenter?. This essential, easy-to-use program gives you one-click access to your computer?s security information.\n    * Always On, Always Protecting. 24/7 virus and threat protection from McAfee AvertÃƒ?Ã‚Â« Labs continuously monitors worldwide virus activities and provides immediate anti-virus protection and removal solutions.\n    * Always Upgrading, Always Updating. Daily updates are installed automatically. When new versions are available, you get them automatically at no charge during your subscription, ensuring that you always have up-to-date protection.\n    * Convenient, Ongoing Protection. McAfee offers a variety of renewal options to keep your McAfee protection current.\n    * Real People, Real Help. Support from McAfee\\&amp;#039;s computer security experts, via Internet chat, e-mail and phone. (service.mcafee.com)\n( http://download.mcafee.com/products/manuals/en-us/MTP_DataSheet_2008.pdf )\n\nSystem Requirements\n\n    *  MicrosoftÃƒ?Ã‚Â« Windows 2000 with Service Pack 4 (SP4) or higher, Windows XP with Service Pack 1 (SP1) or higher, Windows Vista* Personal computer with Pentium-compatible processor 500 MHz or higher and 256 MB RAM or higher.\n    * 800 X 600 or higher resolution.\n    * Internet connection.\n    * .NET Framework version 1.1.4322 .\n    * MicrosoftÃƒ?Ã‚Â« Internet Explorer 6.0 or later.\n    * Optional: Mozilla Firefox 1.5 or later.\nSupported Email Programs\n\n    * POP3 ? Outlook Express, Outlook, Eudora, Netscape, IncrediMail and Thunderbird; Japanese only: Shuriken, Becky and PostPet.\n    * MAPI ? Outlook.\n    * Web ? MSN/Hotmail, or email account with POP3 access.\n\nSupported Instant Messaging Programs\n\n    * AOL Instant Messenger 2.1 or later.\n    * Yahoo Messenger 4.1 or later.\n    * Microsoft Windows Messenger 3.6 or later.\n    * MSN Messenger 6.0 or later.\n\nRequired For Anti-Spam Toolbar Plug-In\n\n    * Outlook Express 6.0 or later.\n    * Outlook 2000 or later.\n    * Eudora 6.0 or later.\n    * Thunderbird 1.0 or later.\n\n","torrent":{"xt":"urn:btih:4d51ede9e79e61094c1c202a3c5e9cb4d759bae1","amp;dn":"McAfee.++AV+Total.+Protection.+2008.+Retail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d51ede9e79e61094c1c202a3c5e9cb4d759bae1","infoHashBuffer":{"type":"Buffer","data":[77,81,237,233,231,158,97,9,76,28,32,42,60,94,156,180,215,89,186,225]},"announce":[],"urlList":[]}}