{"title":"Colgados En Filadelfia S01E01 [seriesani.]","uid":4239113,"size":179894272,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4d54437fcdaeb869539f964f8730f77523ce8aa0&amp;dn=Colgados+En+Filadelfia+S01E01+%5Bseriesani.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seriesani","files":1,"time":1213450539,"description":"T?tulo: It?s Always Sunny in Philadelphia\nProductora: Sony\nNacionalidad: USA\nTemporada: Primera\nCap?tulos: 7\n\nArgumento: Colgados en Filadelfia es una comedia de media hora de duraci?n que gira en torno a cuatro amigos que poseen y regentan un peque?o bar en un barrio del sur de Filadelfia, la ciudad del amor fraternal, mientras intentan mantener el equilibrio de poder entre su negocio y su amistad. Esta tarea resulta m?s dificultosa de lo que parece, ya que a menudo, cada uno de ellos se centra ?nicamente en sus propios intereses personales, lo que les lleva frecuentemente a situaciones inc?modas, que en vez de mejorar, van cada vez a peor.\n\nEstos cuatro amigos est?n encabezados por Charlie Kelly (Charlie Day, Turno de guardia), un muchacho encantador, que parece gustarle a todo el mundo, excepto a la mujer de sus sue?os, que no hace m?s que ignorarle. Charlie a menudo se ve involucrado en el medio de la controversia, ya sea por su supuesto c?ncer, o por el acoso que sufri? de joven por parte de su profesor de gimnasia, aunque al final siempre se las arregla para salir bien de cualquier situaci?n. Dee &quot;Sweet Dee&quot; Reynolds (Kaitlin Olson, El Bar Coyote) es una actractiva aspirante a actriz que trabaja de camarera en el bar y que est? en plena b?squeda del amor verdadero, aunque es especialista en buscarlo en lugares equivocados. Una habilidad, que en el fondo es una bendici?n, considerando la compa??a y las amistades que encuentra por el camino.\n\nMac (Rob McElhenney, J?venes Prodigiosos) es con facilidad, el m?s impredecible e ingenuo de este grupo de amigos y el peor de ellos cuando se trata de mujeres, de transexuales, de mujeres afroamericanas o de profesores ped?filos, ya que en los sorteos, siempre saca el palo m?s peque?o. Inseguro hasta la m?dula, Mac se esfuerza por abrirse y darse a conocer... por si a alguien le interesa.\n\nSu compa?ero de piso es Dennis Reynolds (Glenn Howerton, Urgencias), que probablemente sea el m?s listo del grupo, aunque eso no sea decir demasiado. Disfruta analizando a sus amigos y siempre est? dispuesto a echar una mano a quien la necesita. Como cuando supo que Charlie ten?a c?ncer, que Dennis pens? que lo mejor ser?a no disgustarle y mentirle para que no sepa que se est? acostando con la chica de la que Charlie ha estado enamorado desde hace a?os.\n\nReparto: \n\nRob McElhenney: Mac\nGlenn Howerton: Dennis\nCharlie Day: Charlie\nKaitlin Olson: Dee\nDanny DeVito: Frank\n\nRip by: Scopare\nFormato: avi\nCodec: XviD\nIdioma: Espa?ol\nCalidad: DVD+DVB\nTama?o total: 171 MB. ","torrent":{"xt":"urn:btih:4d54437fcdaeb869539f964f8730f77523ce8aa0","amp;dn":"Colgados+En+Filadelfia+S01E01+%5Bseriesani.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d54437fcdaeb869539f964f8730f77523ce8aa0","infoHashBuffer":{"type":"Buffer","data":[77,84,67,127,205,174,184,105,83,159,150,79,135,48,247,117,35,206,138,160]},"announce":[],"urlList":[]}}