{"title":"DER UNTERGANG-Last days of Hitler.2004.SWE.SUB","uid":4066015,"size":1467736127,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4d616fb3832ea1027a633baabb73bfae0b6fbfbf&amp;dn=DER+UNTERGANG-Last+days+of+Hitler.2004.SWE.SUB&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Annina09","files":4,"time":1204763858,"description":"Drama 2004(This movie is top rated on IMBD)\n\n\n\nIt&amp;#039;s the last days of Adolf Hitler, April 1945, and Hitler&amp;#039;s personal secretary Traudl Junge finds herself in the Der Fuhrer&amp;#039;s bunker. Facing inevitable defeat, Hilter&amp;#039;s moods range from defiance to fight or flee, remain loyal or opt for self-preservation. Eva Braun parties while Magda Goebbels kills her children. The movie goes on to show how Hitler and Eva lived their last hours in the Bunker. Written by Sujit R. Varma \n\nIn April of 1945, Germany stands at the brink of defeat with the Russian Army closing in from the east and the Allied Expeditionary Force attacking from the west. In Berlin, capital of the Third Reich, Adolf Hitler proclaims that Germany will still achieve victory and orders his Generals and advisers to fight to the last man. &quot;Downfall&quot; explores these final days of the Reich, where senior German leaders (such as Himmler and Goring) began defecting from their beloved Fuhrer, in an effort to save their own lives, while still others (Joseph Goebbels) pledge to die with Hitler. Hitler, himself, degenerates into a paranoid shell of a man, full of optimism one moment and suicidal depression the next. When the end finally does comes, and Hitler lies dead by his own hand, what is left of his military must find a way to end the killing that is the Battle of Berlin, and lay down their arms in surrender\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:4d616fb3832ea1027a633baabb73bfae0b6fbfbf","amp;dn":"DER+UNTERGANG-Last+days+of+Hitler.2004.SWE.SUB","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d616fb3832ea1027a633baabb73bfae0b6fbfbf","infoHashBuffer":{"type":"Buffer","data":[77,97,111,179,131,46,161,2,122,99,59,170,187,115,191,174,11,111,191,191]},"announce":[],"urlList":[]}}