{"title":"Silent Installs (May 2008) by KTMDave7","uid":4181469,"size":791955359,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4d98780d422ae98a23d49dc2216fa2833cd5c6ed&amp;dn=Silent+Installs+%28May+2008%29+by+KTMDave7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KTMDave7","files":27,"time":1210431567,"description":"These Are all for Windows XP (32bit), (x64, Vista, Win2000 not Tested)\n\nThey are my Personal ones, Since I Update Windows OS once a month or earlier.\n\nThey are all Silent Installs (except for onces that say (x Prompts) at the end)that were Created with WinRAR (sfx). They are Compressed .EXE files (you could extract them with WinRAR) and modify or Figure out what Installer does (like edit _Install.cmd file example)\n\nYou need to know a little about stuff like. If you wanted to install\nDAEMON Tools lite. You&amp;#039;d have to Install SPTD_v1.56.exe first. Then Reboot PC\nThen you&amp;#039;d be ok to install DAEMON Tools lite.\n\nIf a certain program needs .NET Framework to be installed first. That would have to be installed First.\n\nIf a certain program needs Java Installed and so forth.\n\nGoing off of memory:\nSPTD is need to install first and then reboot pc for : Alcohol 120%, DAEMON Tools, etc\n\nJava RE is needed to install first for Azureus, LimeWire, etc\n\n\nBrief Description :\n\n! Deamon Tools Lite - Great Prog to Mount Images (You must install SPTD_v1.xx first, then reboot PC) to install this program next.\n\n! Flash Player - needed by some web sites (You Tube, etc) I like silent install for slipstream. (nLite T-13 or whatever)\n\n! Magic Iso Maker - Image Making/Extracting Tool (sometimes I like Ultra ISO better)\n\n! PowerDVD ultra Deluxe - A big Video Codec Installer for me. Sometimes, I&amp;#039;m in a hurry and I hate to have to run this to See a video I have, Others may use KLite Codec pack) I&amp;#039;m not really crazy about this program, but it has let me view some tuff Video files in past.\n\n7-Zip v4.57 - Compression Tool - It past I though it compressed to the lowest of Sizes (out of WinRAR, and WinZIP), but Lately I noticed WinRAR is Slims the file down abit lower. I like WinRAR the best. I haven&amp;#039;t use winZip since v6.x or lower . LOL\n\nDVDFab Gold + Platinum v4.1.2.0 - Great DVD Backup copy program. I use to use &quot;DVD XCOPY Platinum&quot; in Past before they got shut down. Been usinf this prog ever since. I tried a few others Progs, had some probs. I like to stay with the same programs if I Can.\n\nDVD Decoder Pak - Is a very small Program that allows some .vob files to be viewed on WMP. It doesn&amp;#039;t always work. but it has helped in past.\n\nDirectX v9.0c (Mar08) - Video Games needs this. This and all my files are for WinXP 32 bit)\n\nFolder Size v2.4 - A great program to view Folder Sizes in Folders. I go crazy If this isn&amp;#039;t installed. I&amp;#039;m so used to seeing sizes folders. as I move files around or whatever I&amp;#039;m doing on PC.\n\nGuitar Pro v5.2 + RSE - This is the best Guitar Tab program on the market in My Opinion. If you play Guitar, get this. Before this program Power Tab Editor (shareware) was the programn to use - I sill use PTB for some tabs that I just don&amp;#039;t have in GP format. I have tons of tabs (mostly GP + PTB) Later I might have a torrent for that with Individual Compressed Genres)\n\nIntel Indeo Codecs v5.2 - I have this in because I strip this out with nLite, and some games need it. Motocross Madness 2 needs it for example.\n\nJava RE 6.0 Update6 - I hate to have to install this. I never have this installed until I get that Needs Java Error. Then I goto my &quot;E:\\_Silent&quot; folder. click on install and I&amp;#039;m set until next Clean Install of XP. If you use LimeWire or Azureus, you have to have Java Installed. Better Yet, if your using Azureus, try utorrent, then you&amp;#039;ll never go back to old. and hopefully not need JAVA.\n\nKaspersky Internet Security v7.0.2.407_(Silent).exe - I like it for Protection. I&amp;#039;m sure anyone can say Avast, NOD32, PcCillian, NAV, Webroot Spy Sweeper is better. Well my short comments are NAV is A resource HOG like Vista is to OS) McAfee was like as Lame as using KaZaA. I like Webroot Spysweeper + this prog. They are light. I know how to use them. I know That don&amp;#039;t have annoying Popups about protection from a KEYGEN - lol. This program could be a pain if your key is outdated. I&amp;#039;ve never had probs with it, but in testing, Ity wasn&amp;#039;t that tuff to get prompt key is out of date or blacklisted. I test these things out to see how easy it is to get back a newer KEY or whatever I need to fix a potential problem. \n\nMicrosoft Viewers (Excell, PowerPoint, Word) - Excellend Programs to view OFFICE files. I never hardly ever install OFFICE and this gets me out of a jam quickly. If I have to create a file. Then I&amp;#039;ll have to install OFFICE and loose about 3% System Resource.\n\n.Net Framework v1.1 or v2.0 - needed by a few programs. I Install .NET v2.0 for Nlite. I haven&amp;#039;t needed to install v1.1 in a long time.\n\nNero Burning ROM v6.6.1.15d - creat for Creating CD&amp;#039;s or DVD from Files. or burning Images\nI can&amp;#039;t stand v7 or v8 - In My opinion those newer versions are bloated, have more crap in it that I never will need. \nThose newer versions are like in old days when Adobe Acrobat Reader became even more bloated as new versions were out. I use Foxit Reader v2.3.2825 to view .pdf files.\n\nQuicktime Pro v7.4.1.14 - Yuck, I hate to install this also, I&amp;#039;ve tried Quick Time Alternative and not much lighter in my opinion, I&amp;#039;d like a smaller .mov viewer.\nBut i Have just to get out of a jam in a hurry (if needed) I click on it and no worries.\n\nSPTD v1.56 - this is installed if you install Alcohol 120% or Daemon Tools. You need to install this and then reboot PC. Then you could install either Image Mounting Tool Program.\n\nUltraISO v9.1.2.2465 - I like this Image Creating,Editing,Viewing tool better then MagicISO Maker.\n\nUnlocker v1.8.7 - Excellent prog for Taskkilling files or folders if you want to Rename or Delete them. Have you ever wanted to Rename or Delete something? and you get that lame prompt another program is using this. This helps out that problem. I just discovered this program last month. I wish I knew of it sooner.\n\nVista Games (8) - THis is the Vista Games (8) Ready for WinXP. It even has a working copy of the Game &quot;InkBall&quot; I have had only 7 working for months now, until I reciently got this game to work. It is very rare to have the * Working. Vista uses DIrectX 10 and XP Has to use a emulator to allow you to play them. I think from memory , you can&amp;#039;t save scores or minsweep or something. Great download.\n\nVista Sounds Pack v1.0 - This makes WinXP sound Like Vista (Startup, Shutdown, Recycle bin, Error sounds, etc). There are 22 sounds changed.\n\nWinRAR v3.71 - The Best File compression tool around. I&amp;#039;d have to use 7-Zip if WinRAR ever folded.\n\n\n*** At the time of making this (May 10, 2008) these are all the current Updated Versions, except for :\nDVDFAB GOld + Platinum (v5.0.2.0 just released)\nQuickTime Pro (7.4.5.67 is newest maybe)\n\n*** I should have these updated on Next Months Updates along with others. ","torrent":{"xt":"urn:btih:4d98780d422ae98a23d49dc2216fa2833cd5c6ed","amp;dn":"Silent+Installs+%28May+2008%29+by+KTMDave7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4d98780d422ae98a23d49dc2216fa2833cd5c6ed","infoHashBuffer":{"type":"Buffer","data":[77,152,120,13,66,42,233,138,35,212,157,194,33,111,162,131,60,213,198,237]},"announce":[],"urlList":[]}}