{"title":"Filetopia.rar","uid":4087352,"size":1984253,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:4dd49abe0f62d4aaf29a0c0cf71b6bfd7423ed89&amp;dn=Filetopia.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"randy5330","files":1,"time":1205887730,"description":"Filetopia is a free communications software that includes: instant messaging, chat, a powerful file sharing system with a search engine, online friends list and message boards. \n\nWhat is unique to this software is the level of security and privacy that it provides. It uses a choice of strong ciphers and public key techniques for all communications and sophisticated techniques to protect your IP and thus make you truly anonymous and safe from attacks. \n\nSome facts about Filetopia\n\nFiletopia is not just a chat program. It has a chat as an add-on. Still, it is a fairly good chat.\n\nFiletopia is not just about encryption. It has encryption as it is the only way to ensure privacy and security. But we implemented the best encryption techniques available today.\n\nFiletopia source code is in the proccess of being evaluated by recognized experts to certify the correct use of the encryption algorithms, the security of the protocols and the absence of any back-doors. Source code for the encryption components and for the bouncer is also freely available.\n\nFiletopia is about &quot;file sharing&quot; in a secure and productive way. Everything it has works for that purpose. Everything is tightly integrated to give the users the best experience possible.\n\n","torrent":{"xt":"urn:btih:4dd49abe0f62d4aaf29a0c0cf71b6bfd7423ed89","amp;dn":"Filetopia.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dd49abe0f62d4aaf29a0c0cf71b6bfd7423ed89","infoHashBuffer":{"type":"Buffer","data":[77,212,154,190,15,98,212,170,242,154,12,12,247,27,107,253,116,35,237,137]},"announce":[],"urlList":[]}}