{"title":"Marigold.2007 [wacky_p]","uid":4090371,"size":698031604,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4dfda264d772c95d083525eb6693b990dfda1a10&amp;dn=Marigold.2007+%5Bwacky_p%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"wacky_p","files":6,"time":1206039522,"description":"Marigold.2007 [wacky_p] \n------------------------------- \n\nBorn in America, Marigold was the only child in the Lexton family. Her mom died when she was very young. She took an interest in acting and movies, much to the chagrin of her dad, who refused to do anything with her. She started acting in small budget movies as well sequels to popular releases such as Fatal Attraction, Basic Instinct amongst others. She landed a part in Kama Sutra 3 and had an eventful journey to Mumbai, India, and from there by taxi to Goa. It is here she found out that the movie has been canceled, and she has no money to return home as she was provided with a one-way ticket. She lands a singing/dancing role in Manoj Sharma&amp;#039;s film, meets with Dance Instructor, Prem Rajput, who tells her that his grandma had predicted that he would meet and then get married to a woman named Marigold. She becomes attracted to him, even accompanies him to Jodhpur, Rajasthan, to his family home on the occasion of his sister, Pooja&amp;#039;s marriage. It is here she will find out that Prem belongs to a royal family, and his marriage had already been finalized with a woman named Jhanvi, and no one in this family has ever dared to go against arranged marriages and tradition. \n\nTank Joo Kom Agayn !!!","torrent":{"xt":"urn:btih:4dfda264d772c95d083525eb6693b990dfda1a10","amp;dn":"Marigold.2007+%5Bwacky_p%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4dfda264d772c95d083525eb6693b990dfda1a10","infoHashBuffer":{"type":"Buffer","data":[77,253,162,100,215,114,201,93,8,53,37,235,102,147,185,144,223,218,26,16]},"announce":[],"urlList":[]}}