{"title":"Clandestine-RELOADED","uid":12729160,"size":3150717030,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:4e215310cbf4f2eb290a72361c96a79e42eaf404&amp;dn=Clandestine-RELOADED&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Slocate","files":3,"time":1447083200,"description":"Maker: \r\nLogic Artists\r\nWebsite:  \nhttp://www.clandestinethegame.com/\r\nComment: \r\nClandestine is a 2-player or singleplayer stealth/hacking game set in 1996.\r\nAsymmetrical co-op allows one player to take the role of the spy while a\r\nfriend provides overwatch and assistance as the hacker, and unravel a\r\npost-Cold War espionage conspiracy.\r\n\r\nThe year is 1996, five years after the dissolution of the Soviet Union. A\r\nstring of accidents and murders gone mostly unnoticed by the public eye\r\nhave put the world of international espionage on high alert - veteran Cold\r\nWar operatives from both sides of the former Iron Curtain are being\r\nassassinated around the globe. High-ranking officials of the CIA and the\r\nFSB secretly establish a joint task force to investigate the leaks.\r\nCodenamed The Kingbridge Executive, the group is funded with whatever money\r\ncould be skimmed off of official projects and staffed by whoever could be\r\nspared from official operations. As field operative Katya Kozlova or hacker\r\nMartin Symborski, you will be deployed on dangerous missions across Europe\r\nand North America, chasing the source of the leaks.\r\n\r\nKey Features\r\n* Single Player &amp; Asymmetrical co-op: Play as the spy while a friend\r\nguides you through the missions or take on the role of the hacker to\r\ncrack infrastructure and defeat security systems.\r\n* A return to hard-core stealth games where the enemies are lethal and\r\ncombat is unforgiving.\r\n* A deep hacking system built around core stealth game mechanics, rife\r\nwith options to manipulate the game world and mess with your enemies.\r\n* Use social engineering in cooperative dialogue sequences to bypass\r\nsecurity checkpoints and gain entry to restricted areas.\r\n* Your actions won't go unnoticed - the story will respond to how much\r\nevidence you leave in each mission and how many dead bodies you leave in\r\nyour wake.\r\n\r\nPlaying as the Spy:\r\nThe role of the Spy will be familiar to fans of stealth/action games. As\r\nthe Spy, you will experience Clandestine as a 3rd person game, controlling\r\nthe movements and actions of Katya in the game world. Katya is the boots on\r\nthe ground, armed with weapons and gadgets that you can use to stay alive\r\nand evade your opponents. Katya is also well trained in hand-to-hand\r\ncombat, and can use lethal or non-lethal stealth takedowns to take down\r\nenemies, leaving behind as little evidence as possible. During the mission,\r\nit also falls to the Spy to search for dossiers and intel to unlock new\r\nequipment and software for subsequent missions.\r\n\r\nPlaying as the Hacker:\r\nMartin operates in an entirely different way than the spy, which is\r\nreflected in the hacker player's interface and game mechanics. As the\r\nHacker, players have access to four game windows and a toolbar. These game\r\nwindows are: the Camera Feed, the Console, the Network View, and the Tactical Map.\r\n\r\nCamera Feed\r\nThe Camera Feed allows the hacker to observe the game world and scout ahead\r\nfor the Spy. By default, the Camera Feed displays the Operative Camera (a\r\nhidden camera worn by Katya), but you can also jump into surveillance\r\ncameras on the Tactical Map (see below) to look through them and scout the\r\nlevels for enemies and other threats. The Camera Feed also displays the\r\nstatus of the Spy's health.\r\n\r\nConsole\r\nThe Console always displays game Objectives at the top of the window and\r\nprints important information in the Message Log such as cracked keypad\r\ncodes. You can also use it to communicate with the Spy via the in-game text\r\nchat.\r\n\r\nNetwork View\r\nThe Network View window is where Hackers can access the computer network(s)\r\nwhich run all of the electronic infrastructure in the mission area. This\r\nincludes door keypads, PCs, Servers, Firewalls, and Hazards (steam pipes\r\nand electrical boxes which can be triggered to cause &quot;accidents&quot;). Hackers\r\nmust be mindful of the Network Admin, an enemy AI which searches for\r\nchanges in the Network and tries to correct them. Not only will the Admin\r\nkick a hacker from the Network if caught, the Admin will also reset\r\nfirewalls and pass-codes. Hackers can unlock Viruses and DDOS attacks to\r\nkeep the Admin busy when trying to escape or complete an objective.\r\n\r\nTactical Map:\r\nThe Tactical Map is the window Hackers use to provide direct support to\r\ntheir Spy partners. This includes gaining access to cameras for scouting\r\nand observation, tagging enemies so the spy can track their location\r\nwithout maintaining line-of-sight, and use Local Assets to drop ammo or\r\nhealth, &quot;clean up&quot; bodies, cancel alarms before they sound, and even bribe\r\nenemies. \r\nRequirements: \r\nMinimum:\r\nOS: Windows Vista 64-bit, Windows 7 64-bit, Windows 8 64-bit\r\nProcessor: Intel Core 2 Duo E8400 or higher, AMD Phenom X3 8750 or higher\r\nMemory: 4 GB RAM\r\nGraphics: nVidia GeForce 280 GTX or higher, ATI Radeon HD 4870 or higher, 1 GB VideoRAM\r\nDirectX: Version 9.0c \r\n\r\nRecommended:\r\nOS: Windows 7 64-bit, Windows 8 64-bit, Windows 10 64-bit\r\nProcessor: Intel Core i7-3770 or higher, AMD FX-8350 or higher\r\nMemory: 8 GB RAM\r\nGraphics: nVidia GeForce GTX 660 or higher, ATI Radeon HD 7950 or higher, 2 GB VideoRAM\r\nDirectX: Version 11\r\nNetwork: Broadband Internet connection","torrent":{"xt":"urn:btih:4e215310cbf4f2eb290a72361c96a79e42eaf404","amp;dn":"Clandestine-RELOADED","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4e215310cbf4f2eb290a72361c96a79e42eaf404","infoHashBuffer":{"type":"Buffer","data":[78,33,83,16,203,244,242,235,41,10,114,54,28,150,167,158,66,234,244,4]},"announce":[],"urlList":[]}}