{"title":"Hairy Hippie Chicks 2.......FFF","uid":4068880,"size":733630468,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:4ef12c5fc979b400c254da0dc63465a28c8b3a91&amp;dn=Hairy+Hippie+Chicks+2.......FFF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"FatFuckFrank","files":1,"time":1204940221,"description":" &lt;a href=&quot;http://gfx1.gamelink.com/GLImages/prodimages/124431.jpg?qlt=75&amp;wid=175&amp;fmt=jpeg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://gfx1.gamelink.com/GLImages/prodimages/124431.jpg?qlt=75&amp;wid=175&amp;fmt=jpeg&lt;/a&gt;\n\nHairy Hippie Chicks 2 is a Rodney Moore produced video featuring some sexy and horny women. The hairiest girl in the video is a real treat to watch. She is petite with a perfect little body. She is very fair skinned with straight, long black hair, a little pit hair, a little leg stubble and a big, wide bush. Her pussy hair is very full and covers a large area. The hair on either side of her pussy is impressive. It&amp;#039;s like the hair spreads down her inner thighs a couple of inches, goes away a bit, then return to continue down the inside of her thighs. It&amp;#039;s a rather unique hairiness. She models and shows off her body before laying down and playing with her pussy. The scene is long watching her get hotter, her nipples harden, and her pussy get wetter. She plays with herself in a very comfortable way as if she were truly alone. Great scene that makes this a video to buy. There is another woman in the video that fucks Rodney that has a cute hairy pussy too. It&amp;#039;s not overly hairy, but when she spreads her legs, there is a framing of long, soft pussy hair visible. She spends time with Rodney and he blocks some of the views, but not too much. There is also a very sexy blond woman too. She is a big girl. She isn&amp;#039;t fat, but just strong and shapely with huge, large, real tits. She spends her time playing with herself. It&amp;#039;s a really hot scene.\n\nBushes so hairy, year old cum can still be tasted when going down on them\n\n\nlater/FFF","torrent":{"xt":"urn:btih:4ef12c5fc979b400c254da0dc63465a28c8b3a91","amp;dn":"Hairy+Hippie+Chicks+2.......FFF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ef12c5fc979b400c254da0dc63465a28c8b3a91","infoHashBuffer":{"type":"Buffer","data":[78,241,44,95,201,121,180,0,194,84,218,13,198,52,101,162,140,139,58,145]},"announce":[],"urlList":[]}}