{"title":"Death Note Episodes 27-37 (Near &amp; Mello Arc)","uid":4121811,"size":1125210948,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4f796ee9325254c59339a3c2c357086af1fdf68a&amp;dn=Death+Note+Episodes+27-37+%28Near+%26+Mello+Arc%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tycoonalex","files":11,"time":1207594996,"description":"A collection of the second arc of Death Note Series One.\nThis torrent encompasses the episodes after the several year gap. If you like it, please seed. \n\nThis torrent is Japanese with English subtitles.\n\n--Episode List--\n27 - Abduction - Five years later, two new enemies appear in Light&amp;#039;s way. \n\n28 - Impatience - Near contacts Light and both agree to cooperate in order to rescue Sayu. \n\n29 - Father - Mortified over allowing the Death Note to fall into Mello&amp;#039;s hands in order to save his daughter, Soichiro puts himself into harm&amp;#039;s way in order to get it back. \n\n30 - Justice - After getting an important piece of information from Mello, Near starts suspecting Light. Light however, after finally subduing the U.S. government, sets up a trap for him. \n\n31 - Transfer - Knowing he is being investigated by Near, Light orders Misa to execute a backup plan. \n\n32 - Selection - After Mikami chooses a new spokesperson to replace Demegawa, Light finds a way to contact her. \n\n33 - Ridicule - Near arrives in Japan and his group starts to investigate Mikami. \n\n34 - Vigilance - Aizawa uses a trick of his to see through Light&amp;#039;s deception and discover the truth about him. Later, the SPK puts Misa and Mogi into their custody. \n\n35 - Murderous Intent - In a daring operation, Mello makes his move and successfully kidnaps Takada, posing as a hindrance to both Near and Light&amp;#039;s plans. \n\n36 - 1/28 - Each having developed a strategy to bring the other down for good, Light and Near finally meet face to face. \n\n37 - New World - The showdown between Light and Near finally comes to an end. \n\n\n\n---This is my first torrent, comments appreciated.---","torrent":{"xt":"urn:btih:4f796ee9325254c59339a3c2c357086af1fdf68a","amp;dn":"Death+Note+Episodes+27-37+%28Near+%26+Mello+Arc%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f796ee9325254c59339a3c2c357086af1fdf68a","infoHashBuffer":{"type":"Buffer","data":[79,121,110,233,50,82,84,197,147,57,163,194,195,87,8,106,241,253,246,138]},"announce":[],"urlList":[]}}