{"title":"Monty Python's Holy Grail","uid":4213623,"size":733765632,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:4f9d6e27793fcc444b8e37436e2de31b826a06a9&amp;dn=Monty+Python%5C%27s+Holy+Grail&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"radman198","files":1,"time":1212213323,"description":"The movie starts out with Arthur, King of the Britons, looking for knights to sit with him at Camelot. He finds many knights including Sir Galahad the pure, Sir Lancelot the brave, the quiet Sir Bedevere, and Sir Robin the Not-Quite-So-Brave-as-Sir Lancelot. They do not travel on horses, but pretend they do and have their servants bang coconuts to make the sound of horse&amp;#039;s hooves. Through satire of certain events in history (witch trials, the black plague) they find Camelot, but after literally a quick song and dance they decide that they do not want to go there. While walking away, God (who seems to be grumpy) come to them from a cloud and tells them to find the Holy Grail. They agree and begin their search. While they search for the Grail, scenes of the knight&amp;#039;s tales appear and why they have the name they have. Throughout their search they meet interesting people and knights along the way. Most of the characters die; some through a killer rabbit (which they defeat with the holy hand grenade), others from not answering a question right from the bridge of Death, or die some other ridiculous way. In the end, King Arthur and Sir Bedevere are left and find the Castle Arrrghhh where the Holy Grail is. They are met by some French soldiers who taunted them earlier in the film, so they were not able to get into the castle.\n\n\nDirectors:Terry Gilliam\nTerry Jones\n\nWriters:Graham Chapman (written by) &amp;\nJohn Cleese (written by) ...\n\nRelease Date:10 May 1975 (USA) \nGenre:Adventure | Comedy  \nTagline:Makes Ben Hur look like an Epic \n    \nplot:King Arthur and his knights embark on a low-budget search for the Grail, encountering many very silly obstacles.\n \n\nAwards:2 nominations \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0071853/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0071853/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:4f9d6e27793fcc444b8e37436e2de31b826a06a9","amp;dn":"Monty+Python%5C%27s+Holy+Grail","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4f9d6e27793fcc444b8e37436e2de31b826a06a9","infoHashBuffer":{"type":"Buffer","data":[79,157,110,39,121,63,204,68,75,142,55,67,110,45,227,27,130,106,6,169]},"announce":[],"urlList":[]}}