{"title":"Sexually Broken--Pale beauty Aria Alexander blindfolded and tag","uid":12756105,"size":766220059,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:4fea809b59f6b4a877613e4c1423b2d460c9cf5c&amp;dn=Sexually+Broken--Pale+beauty+Aria+Alexander+blindfolded+and+tag+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"merzedes","files":1,"time":1447452218,"description":"Pale beauty Aria Alexander blindfolded and tag team fucked by hard cock while strictly restrained! | Aria Alexander | Matt Williams | Maestro\r\n\r\nNovember 13, 2015\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nStunning beauty blindfolded and gagged and roughly fucked in tight bondage \r\n\r\nThe stunning Aria Alexander is back. And we couldn’t be happier. Aria is a fashion model that turned to the dark side, as she found out that she likes dick more than she liked wearing clothes. We all win here today. Let’s put this stunner through her sexual paces. \r\n\r\nAria is bound on her back, toes pointed towards the ceiling and creamy skin on display. We have a custom made wooden bondage device that our slut is shackled in that puts her at the perfect fucking height. Thick leather belts keep her firmly in place. Black electrical tape makes a blindfold and gag, cutting off all of her vision and turning her into a set of holes. Her flawless shaved pussy peeks out temptingly. We make full use of it.\r\n\r\nOne after the other two hard cocks step up and train out Aria’s tight hole. The bondage holds her tightly in place. She can not wiggle, she can not escape the dick. All she can do is take what we dish out. And what we have to dish out is relentless dick. Big hard cock takes every inch of her pussy, balls deep, as Aria moans and cums behind her strict gag. This model is now serving her true purpose…as a cock sheath. \r\n\r\nWe pound out that pussy until she is wrecked. Our bound starlet is a twitching mess, stuffed full until she is dazed and delirious. There are definitely worse ways to spend the day than fucking fashion models in tight bondage. We really can’t complain. And if Aria were to complain, we would not be able to hear much past that tape gag.  \r\n\r\nScreens \nhttp://www.sexuallybroken.com/sexual/bondage/trailer.php?y=2015&amp;p=11_13aalexander6&amp;u=SexuallyBroken-Aria-Alexander-Matt-Williams-Maestro-Pale-beauty-Aria-Alexander-blindfolded-and-tag-team-fucked-by-hard-cock-while-strictly-restrained\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:4fea809b59f6b4a877613e4c1423b2d460c9cf5c","amp;dn":"Sexually+Broken--Pale+beauty+Aria+Alexander+blindfolded+and+tag+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4fea809b59f6b4a877613e4c1423b2d460c9cf5c","infoHashBuffer":{"type":"Buffer","data":[79,234,128,155,89,246,180,168,119,97,62,76,20,35,178,212,96,201,207,92]},"announce":[],"urlList":[]}}