{"title":"Shoestring Series One &amp; Two","uid":4128699,"size":17068198772,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:4ff873f1b93216a7991ebd54ca8c2f5a80e5effc&amp;dn=Shoestring+Series+One+%26+Two&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"JamesBolivardiGriz","files":23,"time":1207929792,"description":"BBC, 30/9/1979-21/12/1980\n21x55 min episodes in 2 series\n \nProduction Company\tBBC\nProducer\tRobert Banks Stewart\nCreated by\tRobert Banks Stewart\n \tRichard Harris\nMusic\tGeorge Fenton\n\n\nCast: Trevor Eve (Eddie Shoestring), Michael Medwin (Don Satchley), Doran Godwin (Erica Bayliss), Liz Crowther (Sonia)\n\nTrevor Eve became an overnight star playing the valiant and idealistic, yet strangely vulnerable, almost naÃƒ?Ã‚Â¯ve private eye in Shoestring (BBC, 1979-80), a quirky detective series developed by writer-producer Robert Banks Stewart. In collaboration with Richard Harris (who had just finished a stint as script editor on Hazell (ITV, 1978-79)), Banks came up with a private investigator with a slight twist - one who solves cases for listeners of a radio station, in effect a \\&amp;#039;private ear\\&amp;#039;.\nThe main character, although seemingly cast from the traditional mould of the hard-boiled detective, is also thoroughly idiosyncratic. Eddie Shoestring is dogged in his pursuit of criminals, but also has to fight his own inner demons. A former computer programmer, he is recovering from a nervous breakdown which saw him institutionalised after destroying valuable electronic equipment. Eve imbues the neurotic but sympathetic character with an occasionally manic quality, giving a surprising intensity to scenes when he becomes agitated. In \\&amp;#039;Knock for Knock\\&amp;#039; (tx. 7/10/1979), he becomes so exasperated with a reticent informant that he literally kicks him to get him to talk. Never comfortable with authority figures, Shoestring\\&amp;#039;s nervousness, however, is mainly manifested in the sketches he draws as a form of therapy.\nThe supporting cast includes Eddie\\&amp;#039;s landlady and sometimes lover Erica Bayliss (Doran Goodwin), the boss of Radio West, Don Satchley (Michael Medwin) and Liz Crowther as Sonia, the station\\&amp;#039;s enthusiastic secretary. The series was a huge ratings success when first shown, although admittedly the viewing figures settled down somewhat when the 1979 ITV strike came to an end. Apart from its eccentric but charismatic leading man, the series also made good use of locations in and around Bristol and also featured a memorable theme tune by George Fenton.\nThe scripts were mainly in the Raymond Chandler style, with clever twists and often bleak or ironic finales. The action scenes however could be humorous, like the mud fight in \\&amp;#039;Knock for Knock\\&amp;#039;, or violent as with the final confrontation with a stalker in \\&amp;#039;Mocking Bird\\&amp;#039; (tx. 19/10/1980). Memorable guest appearances include a young Toyah Willcox and a powerful performance by Harry H. Corbett in \\&amp;#039;Nine Tenths of the Law\\&amp;#039; (tx. 4/11/1979) in an uncharacteristically dark and threatening role.\nWorried about being typecast, Eve opted not to continue after two series, so Banks devised Bergerac (BBC, 1981-1991), using much of the production crew from the earlier series.\n\n\n\nThis is the entire two series BBC drama as shown on UK Drama. The qulaity is excellent and there are no adverts. Maybe the BBC will take there fingers out of there arses and release this on DVD. \n\nI look forward to hearing from the BBC and hope they have lawyers able to pursue me into a foreign jurisdiction. :D \n\nSUPPORT PIRATE BAY\n\nAlso coming Spender the entire 3 series collection plus one off special.\n\nPlease feedback quality comments\n","torrent":{"xt":"urn:btih:4ff873f1b93216a7991ebd54ca8c2f5a80e5effc","amp;dn":"Shoestring+Series+One+%26+Two","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"4ff873f1b93216a7991ebd54ca8c2f5a80e5effc","infoHashBuffer":{"type":"Buffer","data":[79,248,115,241,185,50,22,167,153,30,189,84,202,140,47,90,128,229,239,252]},"announce":[],"urlList":[]}}