{"title":"Archiv des Todes - 13 tlg. DDR Kriegsserie von Rudi Kurz","uid":4187567,"size":4812329838,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:50947aa59c13c8df143f233771f9bcdb6171cb86&amp;dn=Archiv+des+Todes+-+13+tlg.+DDR+Kriegsserie+von+Rudi+Kurz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Falco2two","files":14,"time":1210764404,"description":"Archiv des Todes - 13 tlg. DDR Kriegsserie von Rudi Kurz (Buch und Regie) - Deutsche Erstausstrahlung: 04.01.1980 (DDR1)\n\nKurzinfo:\nIn den Morgenstunden des 8. November 1944 ueberfliegen fuenf Maenner in einem kleinen Flugzeug die Front, ihr Ziel liegt weit hinter den deutschen Linien in Polen. Sie haben einen Auftrag auszufuehren, den nur Georg, ein Deutscher Kommunist, und Boris, Oberleutnant der sowjetischen Aufklaerung kennen. Der Gruppe gehoeuren weiter an: Hauptmann Ernst, der vor 12 Monaten mit den Resten seiner Einheit zur sowjetischen Armee uebergelaufen ist, Heiner, ein ehemaliger Hitlerjunge und der Pole Janek, der als Partisan in Polen kaempfte.\n\nBevor die Maschine ihr Ziel erreicht, wird sie beschossen und die fuenf Maenner muessen ueber unbekanntem Gebiet abspringen. Georg wird dabei schwer verletzt und verliert die Verbindung zu seinen Freunden. So scheint der Geheimauftrag schon vor seinem Beginn gescheitert... \n\nInfo:\nEnde 1944 versuchen fuenf Widerstandskaempfer in das besetzte Polen zu kommen: Anfuehrer sind der deutsche Kommunist Georg (Juergen Zartmann) und der sowjetische Agent Boris (Gojko Mitic). Ausserdem dabei: Ernst (Gerd Blahuschek), ein deutscher Hauptmann, der zur sowjetischen Armee uebergelaufen ist, Heiner (Krzysztof Stroinski), ein ehemaliger Hitlerjunge, und der polnische Partisan Janek (Leon Niemczyk). Die Gruppe soll im Auftrag der sowjetischen Militaerabwehr das &quot;Archiv des Todes&quot; finden, das die SS in einem Bergwerk bei Krakau eingerichtet haben soll und das brisantes Geheimdienstmaterial und Plaene zum Aufbau einer Nachkriegs-Untergrundorganisation der Nazis enthaelt. Doch das Flugzeug der Gruppe wird abgeschossen, die Mitglieder werden teils schwer verwundet und voneinander getrennt. Ihre Mission scheint kaum mehr erfuellbar, die deutsche Abwehr ist ihnen auf den Fersen, und SS Standartenfuehrer Hauk (Alfred Struwe) scheut keine Grausamkeit, um das Geheimnis zu schuetzen und die Informationen auch noch in letzter Sekunde vor der sowjetischen Eroberung zu retten. Mit wichtigen Informationen versorgt die Gruppe die Funkerin Renate Wiesner (Renate Blume).\n\nPolitisch-historische Abenteuerserie. Eine Variante desselben Themas mit denselben Mitwirkenden lief, ebenfalls als Serie, vier Jahre spaeter unter dem Titel Front ohne Gnade. Die Folgen waren jeweils eine Stunde lang und wurden freitags um 20.00 Uhr gezeigt.\n\n13 Episoden\n-----------\n01. Ein Mann wird gejagt\n02. Ueberall lauert der Tod\n03. Die Spur geht verloren\n04. Ein Toter gibt keine Auskunft\n05. Der raetselhafte Funkspruch\n06. Spuk im Hoellental\n07. Gelber Topas\n08. Signale aus der Schlucht\n09. Wettlauf mit der Zeit\n10. Der Tote im Salz\n11. Das Grab im Schacht\n12. Der falsche Fotograf\n13. Kennwort Pilatus\n\n\nBesetzung:\nJuergen Zartmann - Georg\nGojko Mitic - Boris\nGerd Blahuschek - Hauptmann Ernst\nLeon Niemczyk - Janek\nKrzysztof Stroinski - Heiner\nAlfred Struwe - Standartenfuehrer Hauk\nBarbara Brylska - Hanka\nRenate Blume - Renate Wiesner\nHeidemarie Wenzel - Frl. von Teschendorf\nUlrich Voss - Obersturmbannfuehrer Flint\n\nDrehbuch &amp; Regie:\nRudi Kurz\n\n-------------------------------------\n\nAufnahmen vom MDR (2008)\n\nPS:\nArchiv des Todes - 01. Ein Mann wird gejagt.avi hat ne kleine Hacke am Anfang :-(\nGing nicht besser.... Leider !\n\nDatei Namen:\nArchiv des Todes - 01. Ein Mann wird gejagt.avi\nArchiv des Todes - 02. Ueberall lauert der Tod.avi\nArchiv des Todes - 03. Die Spur geht verloren.avi\nArchiv des Todes - 04. Ein Toter gibt keine Auskunft.avi\nArchiv des Todes - 05. Der raetselhafte Funkspruch.avi\nArchiv des Todes - 06. Spuk im Hoellental.avi\nArchiv des Todes - 07. Gelber Topas.avi\nArchiv des Todes - 08. Signale aus der Schlucht.avi\nArchiv des Todes - 09. Wettlauf mit der Zeit.avi\nArchiv des Todes - 10. Der Tote im Salz.avi\nArchiv des Todes - 11. Das Grab im Schacht.avi\nArchiv des Todes - 12. Der falsche Fotograf.avi\nArchiv des Todes - 13. Kennwort Pilatus.avi\n\nWeite: 512px - Hoehe: 384 px\n\n-------------------------------------\n\nZusatzerklÃƒÂ¤rung !\nDer Film hat keine Untertitel. (nicht wie fÃƒÂ¤lschlicherweise, oben angegeben)\nIch musste damals beim Hochladen zwingend einen Untertitel angeben um den Torrent starten zu kÃƒÂ¶nnen. Ich denke mal der Bug ist bei thepiratebay.se mittlerweile behoben, aber ich kann im Nachhinein beim Editieren, die Untertitel nicht wieder abwÃƒÂ¤hlen !\n\nSorry fÃƒÂ¼r das MissverstÃƒÂ¤ndnis !","torrent":{"xt":"urn:btih:50947aa59c13c8df143f233771f9bcdb6171cb86","amp;dn":"Archiv+des+Todes+-+13+tlg.+DDR+Kriegsserie+von+Rudi+Kurz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50947aa59c13c8df143f233771f9bcdb6171cb86","infoHashBuffer":{"type":"Buffer","data":[80,148,122,165,156,19,200,223,20,63,35,55,113,249,188,219,97,113,203,134]},"announce":[],"urlList":[]}}