{"title":"MSN Messenger (Windows NT) 5.0.0544","uid":4070884,"size":4159170,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:50c580d67dea4c7e3ebaaf53ed66bdc982c95ded&amp;dn=MSN+Messenger+%28Windows+NT%29+5.0.0544&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"robin.phlp","files":1,"time":1205046568,"description":"\nMSN Messenger is an instant-messaging program that notifies you when your friends are online so you can send messages or chat with several friends at once. In addition, MSN Messenger notifies you when you have new e-mail in your Hotmail account and allows you to access your in-box with the click of a button. You have full control over who can contact you and view whether you are online. At any time, you can see a list of all users who have added you to their lists, and you can easily block them if you choose to do so. You also can invite someone in your list to meet over the Internet or to play an Internet game using NetMeeting. The program will even notify you when someone you are communicating with is typing so you can avoid overlapping messages. MSN Messenger also offers integration with Outlook Express 5.0.\n\nYou can visit chat rooms and join in, arrange your contacts into groups, select emoticons from a drop-down list, and get quick access to all MSN Messenger&amp;#039;s features with a single click.\n\nNote: Windows NT does not support the latest version of MSN Messenger; therefore, if you use Windows NT, please use this version of MSN Messenger 5.0.","torrent":{"xt":"urn:btih:50c580d67dea4c7e3ebaaf53ed66bdc982c95ded","amp;dn":"MSN+Messenger+%28Windows+NT%29+5.0.0544","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50c580d67dea4c7e3ebaaf53ed66bdc982c95ded","infoHashBuffer":{"type":"Buffer","data":[80,197,128,214,125,234,76,126,62,186,175,83,237,102,189,201,130,201,93,237]},"announce":[],"urlList":[]}}