{"title":"Rocky Hexalogy Collected By Jeffrey","uid":12821890,"size":4364039256,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:50dba9abb84eb0016dc42a38324952ef66888806&amp;dn=Rocky+Hexalogy+Collected+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gljeffrey45","files":6,"time":1448299234,"description":"Rocky Hexalogy Collected By Jeffrey\r\n\r\nRocky (1976)\r\n\r\nVerenigde Staten\r\nDrama\r\n119 minuten\r\n\r\ngeregisseerd door John G. Avildsen\r\nmet Sylvester Stallone, Talia Shire en Burt Young\r\n\r\nRocky Balboa is een tweederangs bokser uit Philadelphia. Hij is een mislukking: hij woont in \r\n\r\neen afgedankt appartement en als bijbaantje is hij een inner van schulden. Ook probeert hij \r\n\r\nindruk te maken op de ietwat verlegen Adrian, zijn grote liefde. Dan krijgt Rocky de kans \r\n\r\nvan zijn leven als hij door een publiciteitsstunt mag vechten tegen de wereldkampioen, \r\n\r\nApollo Creed, om de wereldtitel. Rocky is vastberaden om het 15 rondes vol te houden, niet \r\n\r\nalleen voor zijn zelfvertrouwen, maar ook zodat hij kan bewijzen dat hij niet een of andere \r\n\r\nschooier van de straat is.\r\n\r\n\r\nRocky II (1979)\r\n\r\n\r\nVerenigde Staten\r\nActie / Drama\r\n119 minuten\r\n\r\ngeregisseerd door Sylvester Stallone\r\nmet Sylvester Stallone, Talia Shire en Carl Weathers\r\n\r\nRocky Balboa loopt een ernstige oogwonde op tijdens het gevecht met zwaargewicht Apollo \r\n\r\nCreed en moet geopereerd worden. Hoewel de ingreep geslaagd is, adviseren de artsen niet \r\n\r\nmeer te boksen. Rocky volgt hun advies op maar ontdekt al snel dat het leven buiten de ring \r\n\r\nmoeilijk en hard is. Hij heeft geen diploma's en moet zich tevreden stellen met \r\n\r\nslechtbetaalde baantjes. Daar komt nog bij dat zijn vrouw Adrian zwanger is. Rocky wil voor \r\n\r\nhaar en de baby alles kopen wat hun hartjes verlangen\r\n\r\nRocky III (1982)\r\n\r\nVerenigde Staten\r\nActie / Drama\r\n99 minuten\r\n\r\ngeregisseerd door Sylvester Stallone\r\nmet Sylvester Stallone, Carl Weathers en Mr. T\r\n\r\nNa Apollo Creed verslagen te hebben heeft Rocky eindelijk de tijd om het eens wat rustiger \r\n\r\naan te doen. Hij raakt bevriend met Creed en brengt meer tijd met zijn vrouw door. Wanneer \r\n\r\nhij echter verslagen wordt door de nieuweling Clubber Lang wil niemand meer iets van hem \r\n\r\nweten. Creed weet Rocky over te halen om een rematch te organiseren.\r\n\r\n\r\nRocky IV (1985)\r\n\r\nVerenigde Staten\r\nActie / Drama\r\n91 minuten\r\n\r\ngeregisseerd door Sylvester Stallone\r\nmet Sylvester Stallone, Carl Weathers en Dolph Lundgren\r\n\r\nWanneer Rocky's vriend Apollo Creed doodgeslagen wordt tijdens een gevecht met de superfitte \r\n\r\nRussische bokser Ivan Drago, geeft Rocky zichzelf hier de schuld van. Opgehitst door de \r\n\r\narrogantie van de Rus besluit Rocky het gevecht met hem aan te gaan, dit keer echter in \r\n\r\nRusland.\r\n\r\n\r\nRocky V (1990)\r\n\r\nVerenigde Staten\r\nActie / Drama\r\n104 minuten\r\n\r\ngeregisseerd door John G. Avildsen\r\nmet Sylvester Stallone, Burt Young en Sage Stallone\r\n\r\nNadat gebleken is dat de Russische bokser Ivan Drago Rocky permanente hersenbeschadiging \r\n\r\nheeft toegebracht, is Rocky gedwongen om te stoppen. Wanneer hij thuiskomt komt hij er \r\n\r\nachter dat al zijn geld gestolen is. Rocky besluit een jonge bokser te gaan trainen. Hij kan \r\n\r\nechter niet op tegen de hoge salarissen die de jongen aangeboden worden door andere \r\n\r\nmanagers.\r\n\r\n\r\nRocky Balboa (2006)\r\n\r\nVerenigde Staten\r\nActie / Drama\r\n102 minuten\r\n\r\ngeregisseerd door Sylvester Stallone\r\nmet Sylvester Stallone, Burt Young en Antonio Tarver\r\n\r\nRocky Balboa, één van de grootste bokskampioenen in de geschiedenis, heeft al jaren niet \r\n\r\nmeer gebokst, The Italian Stallion, die bekend stond om zijn stalen kaak en zijn wilskracht \r\n\r\nom te winnen. Zijn vrouw Adrian is inmiddels overleden en zijn zoon en hij zijn inmiddels \r\n\r\nuit elkaar gegroeid. Rocky woont weer in de straten van Philadelphia waarin hij een \r\n\r\nrestaurant runt. Wanneer ESPN een virtuele match toont tussen hem en de huidige \r\n\r\nwereldkampioen, Mason Dixon, en belachelijk wordt gemaakt op tv, begint Rocky na te denken. \r\n\r\nUiteindelijk wordt hij door de manager van Dixon overgehaald om nog één keer de ring in te \r\n\r\n\r\n                                                                                     BLIJVEN DELEN AUB","torrent":{"xt":"urn:btih:50dba9abb84eb0016dc42a38324952ef66888806","amp;dn":"Rocky+Hexalogy+Collected+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"50dba9abb84eb0016dc42a38324952ef66888806","infoHashBuffer":{"type":"Buffer","data":[80,219,169,171,184,78,176,1,109,196,42,56,50,73,82,239,102,136,136,6]},"announce":[],"urlList":[]}}