{"title":"The Pilgrimage Project","uid":4094663,"size":461789796,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:5225ec0cf9dc2975a44a48a95671c94688afb666&amp;dn=The+Pilgrimage+Project&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BaoUnit","files":1,"time":1206244830,"description":"&quot;The following video is a medium-quality download of The Pilgrimage Project.  This is a full-length documentary about Lisses - the birthplace of parkour - and about parkour itself.  It contains footage of over a hundred and fifty traceurs, and was shown to David Belle for approval before release.\n\nThe file is 440 MB.  I&amp;#039;m sorry that it is so large, but it is an hour and a half long, and it was important to keep the quality at a respectable level.  If anyone is capable of compressing it further, PLEASE DO SO AND POST HERE.  If anyone is willing to mirror the file and make a new download link, PLEASE DO SO AND POST HERE.  If anyone is willing to set up a bittorrent, PLEASE DO SO AND POST HERE.\n\nIt is important that everyone understand ... this is not just a &quot;parkour video.&quot;  It&amp;#039;s not just a bigger and better sampler.  It is different, and it deserves a different kind of attention.  Comments beginning &quot;I couldn&amp;#039;t be bothered to watch the whole thing, but ...&quot; will be ignored.  Please try to watch it all in one sitting if you can ... set aside enough time to see the whole thing.  Watch it with friends, talk it over ... and then let me know what you think.  I spent over a thousand work hours making this, and I care very deeply about it, and I am eager to know what you think.\n\n\n-Duncan Germain","torrent":{"xt":"urn:btih:5225ec0cf9dc2975a44a48a95671c94688afb666","amp;dn":"The+Pilgrimage+Project","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5225ec0cf9dc2975a44a48a95671c94688afb666","infoHashBuffer":{"type":"Buffer","data":[82,37,236,12,249,220,41,117,164,74,72,169,86,113,201,70,136,175,182,102]},"announce":[],"urlList":[]}}