{"title":"The Six Wives of Henry the VIII - BBC 1970 - Part 2 of 6","uid":4124407,"size":904743588,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:52e7a7baa2a2ded05bde26368822712421188a14&amp;dn=The+Six+Wives+of+Henry+the+VIII+-+BBC+1970+-+Part+2+of+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anca13","files":1,"time":1207708319,"description":"Please seed after download. Thanks :)\n\nBy \tfelicitaz &quot;felicitaz&quot; (NY, USA) \n\nI saw this series as a child, and it profoundly influenced my life, making me an eager historian and costumer ever after. Just a year or so ago, my brother gave this series to me as a gift, and it is even better than I remembered it. \n\nThe reign of the Tudors followed the War of the Roses, a bloody, chaotic part of British history, characterized by civil war and royal asassinations. The two little princes in the Tower, murdered by order of Richard III, were Henry VIII&amp;#039;s uncles. His father, Henry VII, ended the strife by defeating Richard III, and marrying the Yorkist heir, Elizabeth. Their union brought stability to England. \n\nYou have to keep these events in mind when watching this series, because they make Henry VIII&amp;#039;s actions understandable. His seemingly monomaniacal need for a son was his effort to ensure that nothing like the War of the Roses would happen again. \n\nThis series is for the serious Tudor buff. It comes from the era of BBC productions that were richly intellectual, subtly acted and true to the original material. Also, looking at it again after so many years, I realize what a parade of first class British actors participated: Annette Crosbie, Dame Dorothy Tutin, Patrick (&quot;Dr. Who&quot;) Troughton, Bernard Hepton, and even Mollie (&quot;Are You Being Served&quot;) Sugden. \n\nKeith Michell delivers a Henry VIII whom you can hate and yet sympathize with--very human, sometimes weak, sometimes funny. He is a scholar, musician, knight, statesman, victim, tyrant, penitent, cuckold, and philosopher, as events dictate. His Henry is very complex; and one of the pleasures of this production is that you find yourself watching to see which Henry is going to emerge. One can imagine that his wives and courtiers also walked on eggshells, not knowing which facet of his personality might turn itself in them at any given time. \n\nOf the six episodes: \n\nANNE BOLEYN: Dorothy Tutin does an excellent job of portraying the historical Anne--not the romance-novel heroine, but the bitch-siren-victim who comes through from contemporary documents and accounts. Without ignoring the ruthless side of her character, she is able to also show a sympathetic Anne as she realizes that her star is on the descendant, and that she is following in the footsteps of Catherine, her deposed predecessor. Anne&amp;#039;s notorious rages and hysterical fits are brilliantly done by Ms. Tutin--the terror of a woman who realizes that she&amp;#039;s caught in a trap of her own making. \n\n","torrent":{"xt":"urn:btih:52e7a7baa2a2ded05bde26368822712421188a14","amp;dn":"The+Six+Wives+of+Henry+the+VIII+-+BBC+1970+-+Part+2+of+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"52e7a7baa2a2ded05bde26368822712421188a14","infoHashBuffer":{"type":"Buffer","data":[82,231,167,186,162,162,222,208,91,222,38,54,136,34,113,36,33,24,138,20]},"announce":[],"urlList":[]}}