{"title":"Scooby-Doo -by Surtan","uid":4118213,"size":4295482097,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:5355bdfb9b29343e606023882fda836b8949048d&amp;dn=Scooby-Doo+-by+Surtan&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"surtan","files":10,"time":1207418787,"description":"Hello, movie lovers..! Here is a favourite in replay. This is the real movie, and not a cartoon.\n\nYou are looking on one of my uploads, and I want you to know, that I myself like this movie a lot - otherwise it wont appear on any Surtan page.\n\nSearchin for - in my opinion - good downloads isn&amp;#039;t as easy as I thougt it should be, and there is nothing that dissappoints me more than to wait a day for a download just to find that some genious have destroyed the sound in a movie, or make it a DTS with 50% videocompression.\nSome people like to up- or download a 700Mb copy of a movie, and that&amp;#039;s just fine. Others upload the &quot;whole thing&quot; and put up 7G or more - beautiful! If you have very good space on the harddrive, and are blessed whith a lot of paciens.\n\nI make the best possible copys in DVD5 format.\n\n\n\nThis means;\n\nAlways DolbyDigital 5.1 at least - Some of my Classics excluded, of cause. I love DTS, but never on the expence of video quality. \n\n\nVideo uncompressed or shrinked as little as possible. If I can&amp;#039;t make the torrent as good that I won&amp;#039;t see any differens whith my own eyes I don&amp;#039;t upload it.\n\n\nMenues is usually stripped. It isn&amp;#039;t worth even 1% compression of the videoquality to have menues, but sometimes there is space for them, and if that&amp;#039;s the case, they are included.\n\n\nSubs and languages shows at the top of this side.\n\n\nSFV-file included\n\n\n\n\nDon&amp;#039;t comment the seeding, please.\nWe got a upload limit on TPB on 128kbs, and when you start a new torrent, it&amp;#039;s just to be pacient. I sometimes put up more than one torrent at the time, and then I have to prioritate one to get fast help with the seeding. This sometimes means that it can take a day or two before you got a acceptable seed, and I&amp;#039;m sorry for that.\n\nAny other comments is of cause welcomed!\n\nIf you like my uploads - help me seed them! Then I can put up more torrents of the movies you like. It really is that simple. If I have to use my bandwith to seed old torrents, I can&amp;#039;t put up any new ones.\nThis is the way to make sites like TPB work. Help eachother!\n\n\nThis aint illegal. It can&amp;#039;t be. This is true, wordwide, unstopable love amongs people - sharing very waned things among eachother with no payment in mind at all.\n\n\nIt&amp;#039;s simply beautiful... \n\n\n\n\nEnjoy!\n\nSurtan","torrent":{"xt":"urn:btih:5355bdfb9b29343e606023882fda836b8949048d","amp;dn":"Scooby-Doo+-by+Surtan","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5355bdfb9b29343e606023882fda836b8949048d","infoHashBuffer":{"type":"Buffer","data":[83,85,189,251,155,41,52,62,96,96,35,136,47,218,131,107,137,73,4,141]},"announce":[],"urlList":[]}}