{"title":"Battlefiend 1942 +Serial","uid":4192734,"size":1282496142,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:53aaa9d68560f77498442cb14ea5b64f974b4af7&amp;dn=Battlefiend+1942+%2BSerial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Duvandi","files":5,"time":1211047710,"description":"Battlefield 1942, or BF1942 as it is more commonly known, combines the best elements of both a 1st and 3rd person shooter, and is based during WWII. One of the most groundbreaking ideas introduced in this game is the ability to drive a whole range of vehicles. When combined with the amazing Battlefield communities out there, it is easy to see that this is currently one of the most popular online games, and it looks set to stay that way. \n\n\n\nFeatures\n\nBattlefield 1942 is not only groundbreaking for its technical details, but also because of its stunning graphics. Even now, its graphics have yet to be improved upon in a multiplayer online game. The game currently includes 6 countries, which are divided into two forces, the \\\\\\&amp;#039;Allies\\\\\\&amp;#039; and the \\\\\\&amp;#039;Axis\\\\\\&amp;#039;. Each country - America (Allies), Britain (Allies), Russia (Allies), Canada (Allies), Germany (Axis) and Japan (Axis) - bring a whole range of unique weapons and vehicles to the battlefield. This gives you the freedom to play the game exactly how you want to, playing as either the \\\\\\&amp;#039;good guys\\\\\\&amp;#039;, or the \\\\\\&amp;#039;bad guys\\\\\\&amp;#039;. Thanks to this truly unique style of gameplay and freedom, Battlefield 1942 manages to balance fun and realism in a way that means once you\\\\\\&amp;#039;ve played it once, you won\\\\\\&amp;#039;t want to stop. \n\n\n\nWeapons and Vehicles\n\nOne of the great things about Battlefield 1942 is the wide variety of weapons available, from Bazookas to Medi Packs. Also, there are huge amounts of vehicles to drive around in such as submarines, jeeps, tanks and airplanes. All of these vehicles are fully controllable, meaning any class of player can jump into one and begin driving it instantly. You can also pick up weapons from the floor, allowing you to change class without having to respawn. \n\n\n\nGameplay\n\nAlthough there is a lot you can do in the game, there is still a limit on your activities - you can do whatever you like as long as it would be possible in real life. This isn\\\\\\&amp;#039;t a bad thing though, far from it. This keeps the came realistic but still fun. Without these limits the game would lose a lot of its playability. So while you can jump in a plane and bomb enemy targets, or mow down enemy troops, you still need to look out for fire from the ground or else you\\\\\\&amp;#039;ll be heading for a crash landing behind enemy lines. The possibilities and scenarios available in this game are pretty much endless - even experienced players frequently do something they\\\\\\&amp;#039;ve never tried before. \n\n\n\nSingle Player\n\nAlthough Battlefield 1942 was primarily designed as a multiplayer game to be played online, it still has an amazing single player option. Although this option doesn\\\\\\&amp;#039;t follow the traditional idea of single player mode with storylines (such as in Medal of Honour games), it does use an ingenius bot system. These bots are computer controlled players with a sophisticated Artificial Intelligence system. They act and play just like other players would in a real online multiplayer game. They jump in planes and engage in dog fights, take part in a tank battles, man AA guns and do all the things a regular human player would do. This special bot system was designed in such a way that you\\\\\\&amp;#039;ll never face the same threat or play on the same team twice - because bot actions are calculated \\\\\\&amp;#039;on the fly\\\\\\&amp;#039; making them truly dynamic. This is where Battlefield 1942\\\\\\&amp;#039;s single player option is far superior to that in Medal of Honour games - in MoH you will play the exact same missions again and again, but in Battlefield they are always changing. The game also features an \\\\\\&amp;#039;Instant Action\\\\\\&amp;#039; mode. This lets you briefly pick a number of options (number of bots, maps, and so on) and then throws you into straight into battle. \n\n\n\nMultiplayer\n\nBattlefield 1942 was created to be a thoroughly enjoyable and diverse online game - and this is where it\\\\\\&amp;#039;s strength lies. The maps, weapons and teams incorporated in this mode are exactly identical to those used in single player mode. The only difference is that this time your opponents are real humans, all around the world, rather than AI powered bots. Upto 64 players can take part in a number of differrent game modes over the internet or a LAN. Current modes included in the game are: Conquest, Team Deathmatch, Capture The Flag, Cooperation (Co-Op). If you\\\\\\&amp;#039;re a thrill-seeking adrenaline junky then multiplayer is definitley for you. \n\n\n\nLocations\n\nBoth the Single and Multi player options allow you to wage war in a number of different parts of the world. Every location engages you in a new deadly battle, with different landscapes which you must use to your advantage if you are to be victorious. Commencing in 1942 and finishing in 1945 you\\\\\\&amp;#039;ll travel from Africa to Europe fighting for your life and freedom; you must keep yourself alive while winning every battle, and ultimately the war, in any way you can.","torrent":{"xt":"urn:btih:53aaa9d68560f77498442cb14ea5b64f974b4af7","amp;dn":"Battlefiend+1942+%2BSerial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"53aaa9d68560f77498442cb14ea5b64f974b4af7","infoHashBuffer":{"type":"Buffer","data":[83,170,169,214,133,96,247,116,152,68,44,177,78,165,182,79,151,75,74,247]},"announce":[],"urlList":[]}}