{"title":"Psychotic Waltz Discography [MP3/320] - FIXED","uid":4212301,"size":979413699,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:547399296170a18151f4b60dd55a88c632d914bb&amp;dn=Psychotic+Waltz+Discography+%5BMP3%2F320%5D+-+FIXED&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Pentrio","files":112,"time":1212146003,"description":"\tThere was a small problem with the first torrent, all fixed now.\n\nThe first incarnation of the band was under the name Aslan, after a character in the novel &quot;The Lion, the Witch and the Wardrobe&quot;, by C. S. Lewis. With money earned from local shows and T-shirts, they recorded a self-titled demo tape in 1986. After discovering another band with the same name, they changed theirs to Psychotic Waltz and recorded a new four-song demo in 1988.\n\nIn 1990 they debuted with their independently financed debut A Social Grace, which was released in Europe via a licensing deal with the German label Rising Sun Productions. Even though the album was very well received in Europe, being named album of the month in some European magazines, the situation in US was more difficult. As it was released under their own Sub Sonic Records label, with practically no promotion and minimal distribution, it remained an extremely underground item. Nevertheless, in 1991 they appeared in the famous Dynamo Festival in Holland.\n\nAfter the tour, the band&amp;#039;s guitarist, Dan Rock, suffered a near-fatal accident after falling off a bridge while rappelling. After he recovered, the band went on to record their second album, titled Into the Everflow. The album was recorded from August to October 1992 at Phoenix Studios in Herne, Germany and was produced by Mekong Delta&amp;#039;s main man, Ralph Hubert. The CD was released in Europe from Dream Circle Records and was also very well received, getting album of the month honors in many European magazines. After the recording, the band did a small tour as a preview of the coming album while Dan Rock was still recovering from his accident.\n\nBy that time, the band was at the peak of its popularity. They signed with Ralph Hubert&amp;#039;s own label, Zardoz Music, for their third album, Mosquito. Recording took place in late 1994 in Record Plant and Madhatter studios in Los Angeles with the help of the famous metal producer, Scott Burns. The initial response for this album was mixed, as the more conventional songwriting that the band followed, led some hardcore fans of the band to label it as a &quot;sell-out&quot;. This was the last album that was recorded with their initial lineup, as bassist Ward Evans left the band after two tours in Europe and was replaced with Phil Cuttino.\n\nThey entered the studio once again in 1996 for what proved to be their last studio work together, Bleeding. This time Scott Burns did the engineering, but the record was mixed by Dan Rock and engineer Woody Barber. Before the band started touring in support for the new album, guitarist Brian McAlpine announced that we would not be able to follow the band due to familial obligations. He was replaced by Steve Cox for the band&amp;#039;s final two European tours. Phil Cuttino filmed a promotional video for the track &quot;Faded&quot;. This proved to be disastrous for the band, as a crew member sued the band, claiming that a light on the set caused him blindness.\n\nThe lengthy court battle that followed, coupled with the different musical interests that the band members had, contributed in the band&amp;#039;s demise. Buddy Lackey was the first to leave the band. For a short while the remaining band members tried to continue with the band, but soon each of them followed separate ways. Dan Rock recorded two instrumental albums with his project Darkstar. Norm Leggio and Steve Cox created the band Teabag and Buddy Lackey changed his name to Devon Graves and formed the band Deadsoul Tribe.\n\n- Taken from Wikipedia\n &lt;a href=&quot;\nhttp://www.psychoticwaltz.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.psychoticwaltz.com&lt;/a&gt;\n\nContaining\n\nBleeding [1996]                                      Including .m3u, .sfv, .nfo, lyrics.txt\nInto the Everflow bonus disc [2004]      Including .m3u, sfv, .nfo\nA Social Grace [1990]                              Including .m3u, .sfv, .nfo, lyrics.txt\nLive &amp; Archives[1991][2 CD&amp;#039;s]                Including .m3u, sfv, .nfo\nInto the Everflow[1992]                          Including .m3u, .sfv, .nfo, lyrics.txt\nMosquito [1994]                                      Including .m3u, .sfv, .nfo, lyrics.txt","torrent":{"xt":"urn:btih:547399296170a18151f4b60dd55a88c632d914bb","amp;dn":"Psychotic+Waltz+Discography+%5BMP3%2F320%5D+-+FIXED","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"547399296170a18151f4b60dd55a88c632d914bb","infoHashBuffer":{"type":"Buffer","data":[84,115,153,41,97,112,161,129,81,244,182,13,213,90,136,198,50,217,20,187]},"announce":[],"urlList":[]}}