{"title":"Forensic and Anatomical Examination of the Female Genital Tract","uid":4117299,"size":2557285428,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:5476ee28b24e3c99c760011c287c0c9c1b68de38&amp;dn=Forensic+and+Anatomical+Examination+of+the+Female+Genital+Tract&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"funnyguy1234","files":83,"time":1207373256,"description":"Forensic and Anatomical Examination of the Female Genital Tract by Professor Anil Aggrawal, Maulana Azad Medical College, New Delhi, India.\n\nIn this video Professor Anil Aggrawal, arguably the most notable forensic pathologist from India, shows to his postgraduates how female genital system should be examined at autopsy, especially in cases of rape, sexual assault and criminal abortion.  Such videos are not commonly available and thus it is believed that this would prove very beneficial, especially to young  forensic pathologists, who want to learn proper techniques of dissection. The film would be of limited use to anatomists also.\n\nThe files are large and those downloading them must contend with a few caveats, so they know what exactly to expect from these films. First and foremost, this is NOT a professionally shot video, and thus may lack high quality which one may expect from professional films. Secondly the lighting is less than perfect at some places. Finally, the commentaries accompanying the dissections are extempore, and may not be exhaustive. It is believed that when the professor was taking one of his routine classes, one of his postgraduate students shot the film for the benefit of us all.\n\nHaving said this, it must be said, that this is one of the finest videos related to medico legal dissection. Considering the fact that dissections of female genital system are simply non-existent, it may be worthwhile to download and watch it, if only to know how to go about in cases of rape, sexual assault and criminal abortion.\n\nThe complete film is of 25 minutes duration (23 minutes and 13 seconds to be very exact), and is divided into 15 parts to make the downloading easier. Each part is detailed below.\n\n01.avi (4 minutes 15 seconds) -&gt; External examination of female genital system. Explanation of boundaries of perineum (anatomical and gynecological). How the incision is to be made in such cases.\n\n02. avi (2 minutes 39 seconds) -&gt; Abdominal incision is joined with the perineal incision. Examination of uterus and adnexa, urinary bladder and sigmoid colon in situ.\n\n03.avi (1 minute 30 seconds) -&gt; Tying the sigmoid colon to avoid spillage during later dissection. Releasing the sigmoid colon.\n\n04.avi (20 seconds) -&gt; Releasing the perineum from attachments around.\n\n05.avi (33 seconds) -&gt;  Mobilizing the perineum further.\n\n06.avi (1 minute 7 seconds) -&gt; Whole perineum taken out along with urinary bladder, uterus and adnexa, and sigmoid colon,  rectum and anal canal. Recapitulation of external genital anatomy.\n\n07.avi (36 seconds) -&gt; Examination of clitoris, examination of urethra and paraurethral glands (Skene's glands).\n\n08.avi (1 minute 42 seconds) -&gt; Examination of vulva, Labia Majora, Vestibule (above vaginal opening), fossa navicularis  (below vaginal opening), fourchette (near the posterior commissure).  Examination of Bartholin?s glands (Greater vestibular glands). Examination of bladder, vesicouterine pouch, uterus,  rectouterine pouch (Pouch of Douglas). Examination of uterus, broad ligaments, fallopian tubes, ovarian ligament, suspensory ligament of the ovary, round ligament of the uterus, Organ of RosenmÃƒÂ¼ller, epoÃƒÂ¶phoron (equivalent to efferent ducts in the male) and duct of epoÃƒÂ¶phoron (Gartner's duct, equivalent to Vas deferens in the male), ParaoÃƒÂ¶phoron (equivalent to paradidymis in the male). Examination of mesometrium, mesosalpinx and mesoovarium.\n\n09.avi (1 minute 8 seconds) -&gt; Examination of bladder by opening it from the top. Examination of internal urethral meatus and openings of the ureters. Examination of trigone.\n\n10.avi (2 minutes 24 seconds) -&gt; Examination of the urethra, Tracing the urethra up to the external urethral meatus.\n\n11.avi (1 minute 45 seconds) -&gt; Examination of vaginal canal, rugosities of the vagina, measurements of vaginal walls on the anterior (7.5 cm) and posterior (9.0 cm) sides. Examination of the external os of the cervix.\n\n12.avi (2 minute 13 seconds) -&gt; Measuring the size of the uterus (normal 7.5 cm x 5.0 cm x 2.5 cm or 3&quot;x2&quot;x1&quot;). Taking weight of uterus (normal weight 40 g). Measuring the size of the ovaries (normal 3cm x 2cm x 1cm). Taking the weight of ovaries (normal weight of both ovaries in adults 4 g, the ratio of uterus wt: ovary wt being about 10:1). Opening of the cervix.  \nExamination of isthmus of the cervix (British obstetricians' lower segment - fetal membranes don't stick to this portion!).  Identification and examination of ridges on the cervical canal (arbor vitae uteri), which normally remain interlocked, closing the cavity of the cervix completely. Uterus must be cut from the side preferably.\n\n13.avi (58 seconds) -&gt; Opening up of the uterine cavity and examination of endometrium for any traumatic injuries. These are quite common in criminal abortions, and also in sadistic sexual murders, where the murderer sticks some external object up  the vagina before or after the murder. Seen sometimes in necrophiliacs too.\n\n14.avi (12 seconds) -&gt; Flushing out all fecal material out of the anal canal.\n\n15.avi (1 minute 51 seconds) -&gt; examination of anus, and perianal area. Examination of the gynecological perineum and perineal body. Opening up of the anal canal and rectum. Examination of the anal sphincter.","torrent":{"xt":"urn:btih:5476ee28b24e3c99c760011c287c0c9c1b68de38","amp;dn":"Forensic+and+Anatomical+Examination+of+the+Female+Genital+Tract","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5476ee28b24e3c99c760011c287c0c9c1b68de38","infoHashBuffer":{"type":"Buffer","data":[84,118,238,40,178,78,60,153,199,96,1,28,40,124,12,156,27,104,222,56]},"announce":[],"urlList":[]}}