{"title":"Led Zeppelin 1971.03.05 - Belfast","uid":4191748,"size":603158351,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:558469cc7b47d8df6e434a63cbf8010a0c46aff4&amp;dn=Led+Zeppelin+1971.03.05+-+Belfast&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TimD54","files":23,"time":1210999386,"description":"\nThis show was originally very well written up by Keith Lambert in December 2000 - I&amp;#039;ll let him tell the story:\n\nBelfast, Ireland - 1971.03.05\n\nThe first show of 1971, after recording their fourth album.\nFirst live performance of Black Dog, Stairway To Heaven, Going To California, and Rock And Roll.\nGreat versions of Rock and Roll and Bring it on Home.\n\nAbout the release name &quot;911117&quot;: Gibson EDS1275 6/12 Double Neck. Made especially for Jimmy by the Gibson Custom Shop for playing Stairway to Heaven on-stage, serial number 911117. (Just in case you were wondering. )\n\n\nThere are three versions of this show:\n&quot;911117 (Tarantura2000), Black Helmet (Sharaku), &amp; Black Velvet (Empress Valley)\n\nEV was the first to release this show on cd. They have &quot;completed&quot; songs from different shows. EV doesn&amp;#039;t bother to tell us that this is a multiple show mix.\n\nTarantura2000 is strictly from the one concert. The screeching sound (faulty tape recording equipment) that starts during Stairway has been carefully removed from this release.\n\nSharaku is identical to Tarantura2000.\n\nThere&amp;#039;s no tape generation difference between these titles. EV has amplified theirs, bringing up the music and background noise.&quot; http://www.bootledz.com/comparisons/6871.htm\n\n\n\n&quot;The band played to approximately 1200 people at the Ulster Hall. Now, for the first time ever, we can hear the show in all it&amp;#039;s unabated glory. And what a show! The recording is slightly distorted as per many of the audience recordings of the time. However, it is very listenable and hugely enjoyable. Make no mistake about it, what you are hearing is Led Zeppelin at the very top of their game. Their hiatus from the live arena isn&amp;#039;t evident for one second; quite the opposite in fact. The rest period appears to have charged Zeppelin&amp;#039;s batteries to maximum capacity! The show seems to get better and better with repeated listening too. The band take to the stage and John Bonham settles in behind his kit. He hits the snare drum twice. One perpetual memory of an audience member interviewed for these liner notes reflects the ear-bleeding volume of these notes, literally shocking those around him who quickly became aware of what was about to come. Tonight&amp;#039;s set kicks off with a bombastic Immigrant Song, crushing the audience with it&amp;#039;s immense volume. A superb Heartbreaker follows, complete with a compact guitar solo and a wave of rhythmic clapping by the crowd who are already very loose! For sure, this concert is a must for any Robert Plant fan. He gives the show 110% and the unbelievable power of his amazing high pitched vocals is evident right from the start. No wonder they had to postpone the BBC &amp;#039;Live In Concert&amp;#039; Paris Theater recording later that month! Next, Robert introduces &amp;#039;Since I&amp;#039;ve Been Loving You&amp;#039; which is greeted by an almighty roar and more clapping to the beat from the Irish fans. Again, there are some great vocals in the last section and the taper&amp;#039;s companion comments &quot;That was pretty good wasn&amp;#039;t it....?&quot;. After some comments about the &amp;#039;toilet roll&amp;#039; set list and the positive feedback from the crowd, the first premiere of the evening follows. A full-on version of Black Dog complete with a mistake in the first instrumental passage; Well, the number is a musical conundrum after all! A reasonably short but brilliant Dazed And Confused only serves to increase the hysteria with Plant telling the audience to &quot;SWEAT!!!!&quot; during the spaced out section. The crowd show their appreciation during Jimmy&amp;#039;s bow solo. For a long time, we have all wondered what the first ever public performance of &amp;#039;Stairway To Heaven&amp;#039; must have been like. Well, wonder no more for now it can be heard. The recording is slightly cut and the band turn in a fairly standard rendition of the number with no real surprises. It has often been said that a deathly silence hung over the audience after this number, followed by a standing ovation. Not so, applause is offered immediately after the finale of this great opus. The only acoustic number of the night is another world first from Led Zeppelin IV; Going To California&amp;#039;. What follows is possibly one of the best ever live versions of &amp;#039;What Is And What Should Never Be&amp;#039;. The band perform this number as if it were their last ever show. John Bonham utilizes the gong to great effect, seemingly trying to put a few dents in the damn thing during Jimmy&amp;#039;s &amp;#039;power chord&amp;#039; chops. The band are definitely firing on all six by now! Bonzo has already &amp;#039;set his stall out&amp;#039; during the first half of the show but the percussion &amp;#039;army&amp;#039; on display during Moby Dick has to be heard to be believed! One audience member remembers seeing the rest of the band drinking beer at the side of stage during this number, heckling Bonham mercilessly. He beckoned to them, hoping that they would return to finish the song. Bonzo breaks his sticks during Moby Dick, perhaps he was venting some frustration at his colleagues! His violent mood was to remain with him until the band reached Dublin where he picks a fight with Richard Cole and an angry hotel chef! Now into the &amp;#039;home run&amp;#039;, Led Zeppelin finish the main set with a compact &amp;#039;Whole Lotta Love&amp;#039; medley. Jimmy&amp;#039;s soaring and dipping theramin solo is followed by fantastic versions of Boogie Woogie, Honey Bee, Needle Blues and The Lemon Song. The finale has the crowd singing &quot;Way...!&quot; with all their might! Returning to the stage, Robert apologizes to the audience &quot;for not playing here two and a half years ago....&quot; and the band launch into a mental rendition of &amp;#039;Communication Breakdown&amp;#039; complete with mid-section jam. At the end of the number, someone in the audience exclaims &quot;Jesus Christ.....&quot;, an apt reflection of Zeppelin&amp;#039;s amazing performance. Plant does his bit for world peace, telling the crowd that &quot;if everybody was like this to each other every day, there would be no problems.....&quot;. This sentiment is met with an overwhelming response from their Irish followers. The next encore number is another &amp;#039;first time round off&amp;#039; performance. This time it&amp;#039;s &amp;#039;Rock &amp; Roll&amp;#039;, played at a frantic pace and complete with &amp;#039;studio version&amp;#039; vocals. The fast tempo of the number is somewhat confused by enthusiastic hand clapping of the now riotous Belfast audience. &amp;#039;Bring It On Home&amp;#039; is the very rare final encore. The number is preceded by a comment from Robert who jokingly chastises a member of the audience for knocking some of the PA over! To my knowledge, this is the only 1971 version of the song ever captured on tape and a very unusual version it is too. The middle section boasts and extended harmonica and guitar solo. There are no vocals or harp in the final section and a bombastic finale to the song closes this amazing show.&quot;\n\nLed Zeppelin 1971-03-05\n&quot;Listen to this Murphy&quot;\nUlster Hall\nBelfast, Northern Ireland\n911117 Tarantura 2000\nIssue Limit of 100 copies, May 2005\n\nOriginal Silvers&gt;CDR&gt;EAC&gt;FLAC6\n\nDisc 1\n01 Immigrant Song\n02 Heartbreaker\n03 Since I&amp;#039;ve Been Loving You\n04 Black Dog\n05 Dazed And Confused\n06 Stairway To Heaven\n07 Going To California\n08 What Is And What Should Never Be\n\nDisc 2\n01 Moby Dick\n02 Whole Lotta Love Medley\n03 Communication Breakdown\n04 Rock And Roll\n05 Bring It On Home","torrent":{"xt":"urn:btih:558469cc7b47d8df6e434a63cbf8010a0c46aff4","amp;dn":"Led+Zeppelin+1971.03.05+-+Belfast","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"558469cc7b47d8df6e434a63cbf8010a0c46aff4","infoHashBuffer":{"type":"Buffer","data":[85,132,105,204,123,71,216,223,110,67,74,99,203,248,1,10,12,70,175,244]},"announce":[],"urlList":[]}}