{"title":"Hide IP NG 1.02","uid":4085227,"size":886017,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:55c7215239223363c56a3ba61957bb12748b1c8f&amp;dn=Hide+IP+NG+1.02&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mixmixi","files":4,"time":1205775376,"description":"Hide IP NG (short for Hide IP Next Generation) is the software you are looking for! Keeping your privacy is simple and easy: just run Hide IP NG! It will find the proxy server available to you and set it as your proxy server automatically. There is nothing need you to concern. Hide IP have done everything for you! \nHide IP NG searches for high anonymous proxy server and makes you complete invisible to any Web sites you are surfing. With Hide IP you can hide your ID in the Internet, avoid your personal information be used to send you spam and junk e-mails by many marketers and advertising agencies who have information about your interests and know your IP address as well as your e-mail. It can also keep your computer away from hacker attacks by hiding your IP address.\n\nKey Features of Hide IP NG:\n- A single click and ready to go. Hide your IP address without any configuration. Everybody can use it.\n- 1024 bits encryption prevent your ISP and your Boss from spying on you!\n- Prevent others from reading any data you transmit in Wi-Fi Hotspots.\n- Use with a web based mail service to send anonymous email.\n- Post on bulletin boards without displaying your real IP address.\n- Bypass the restrictions by some owners of Internet resources on users from certain countries or geographical regions.\n- Great for monitoring your overseas search engine campaigns.\n- Keeping your computer away from hacker attacks by hiding your IP address as well as information about your operation system.\n- Protect you from any website that wants to monitor your reading interests and spy upon you through your unique IP address - your ID in the Internet.\n- Avoid your personal information be used to send you spam and junk emails by many marketers and advertising agencies who having information about your interests and knowing your IP address as well as your email.\n- Works with Internet Explorer, Opera, Netscape, Mozilla Firefox in Windows 98, ME, 2000, XP, 2003, Vista\n\n","torrent":{"xt":"urn:btih:55c7215239223363c56a3ba61957bb12748b1c8f","amp;dn":"Hide+IP+NG+1.02","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"55c7215239223363c56a3ba61957bb12748b1c8f","infoHashBuffer":{"type":"Buffer","data":[85,199,33,82,57,34,51,99,197,106,59,166,25,87,187,18,116,139,28,143]},"announce":[],"urlList":[]}}