{"title":"Allo Allo AVI Season6","uid":4198530,"size":1948288664,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:5790517138b61d7c4c3d5798270a324f7a4569bf&amp;dn=Allo+Allo+AVI+Season6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rambam1776","files":16,"time":1211329140,"description":"Another uploader, 974613, uploaded the entire series as one big 21 gig torrent on Dec 1 2007. That torrent is still going strong. The problem is that it took nearly a month to download the thing despite a large numbers of seeders but even larger number of leechers. I got to 95% and sat there at .1 or less for 2 weeks. The original provider states in the comment section that ??I seeded the torrent for 5 days straight. I uploaded almost 3TB then. Yes, you read well, 3 freaking terabytes. There were so many hit and runs, and I stopped seeding. It makes me sick that so many people just closed their client after they finished the download.?\n\nMy guess is that just about nobody is willing to store and seed any torrent larger than about 10-12 gig, and not even THAT for very long. Well, since this show is excellent and nobody should have to wait a month to collect a torrent that has more than a thousand leechers, I am taking 974613s torrent of Allo Allo .avi DVD rips and breaking them up by season. I hope that the smaller sizes will encourage and allow people to seed them for longer periods. I will seed each torrent exclusively until it has other seeders, then upload the next one.\n\nI am including below the original information supplied by 974613, and I want to formally thank and acknowledge that uploader for getting these files to us in the first place. For purists, it looks like DVDRs are also available - mostly in PAL format ? with a quick search.\n\n974613 ? ?This torrent contains all of the episodes from the popular British TV show Allo Allo which had 9 seasons. The list of episodes can be found here: http://en.wikipedia.org/wiki/List_of_%27Allo_%27Allo%21_episodes\n\nMost of the rips are done by a scene group named NodLabs, and there are rips from other groups too. The rips are all done from a retail DVD, so the quality is excellent.\n\nEnjoy the show people.?\n\nOriginal torrent is here: http://thepiratebay.se/tor/3916535/Allo_Allo_Complete_Pack_DVDRip ","torrent":{"xt":"urn:btih:5790517138b61d7c4c3d5798270a324f7a4569bf","amp;dn":"Allo+Allo+AVI+Season6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5790517138b61d7c4c3d5798270a324f7a4569bf","infoHashBuffer":{"type":"Buffer","data":[87,144,81,113,56,182,29,124,76,61,87,152,39,10,50,79,122,69,105,191]},"announce":[],"urlList":[]}}