{"title":"vir2_instruments_accoustic_legends_hd_(3dvd)","uid":4125942,"size":12369075652,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:57c8359e4d7b34a411d9b6b7e95559c9f54d1ea4&amp;dn=vir2_instruments_accoustic_legends_hd_%283dvd%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Krupz","files":4,"time":1207785507,"description":"        &lt;a href=&quot; http://www.vir2.com/vir2/products/acousticlegendshd/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.vir2.com/vir2/products/acousticlegendshd/index.html&lt;/a&gt;         \n \n                                RELEASE NOTES\n\n     Presenting $40,000 of the finest acoustic guitars in the world,\n     sampled in glorious high definition 24-bit 96kHz stereo, now available\n     in this premium three-DVD, 19 gigabyte collection. This broad\n     collection of acoustic guitars is sampled in the finest detail in a\n     variety of playing styles, including picked notes, finger picked\n     notes, natural and artificial harmonics, harmonic chords, mutes,\n     chords, release layers, and even fret noise sampled for each guitar.\n      \n     Included in the library are several different steel string guitars,\n     nylon strings, twelve strings, acoustic bass, as well as a bonus\n     folder featuring mandolin, ukulele, and banjo. Acoustic Legends HD\n     features the world&amp;#039;s best guitars from McPherson, Taylor, Gibson,\n     Martin, and other manufacturers.\n      \n     Also featured are numerous bonus patches of special effects, doubled\n     guitars, and more. Acoustic Legends HD also features chord banks\n     containing twelve different chord types in varying positions, with\n     multiple velocity layers and multiple takes per layer, and with both\n     up-strokes and down-strokes, making it simple to create fully\n     authentic rhythm guitar parts. Experience legendary acoustic guitars,\n     sampled in gorgeous detail and now available in one exquisite virtual\n     instrument.\n     \n     \n     Features\n     \n     * 19 gigabytes of acoustic guitars \n     \n     * 24-bit, 96kHz samples, utilizing the finest in high-end microphones \n       and preamps, sampled in thorough detail including release layers,   \n       fret noise, finger noise, and more \n     \n     * Numerous articulations and styles of playing, including finger    \n       picked, plastic picked, harmonics, harmonic chords, mutes, single    \n       notes, and chord banks \n     \n     * Massive chord instruments, both 6-string and 12-string guitars,  \n       featuring 12 different chord types, optional capo control, down- and  \n       up-strokes, mute strums, and body knocks, making it possible to  \n       create authentic rhythm guitar strumming patterns \n     \n     * Multiple and contrasting guitars sampled within each folder,  \n       including 2 different nylon-stringed guitars, 7 different steel- \n       stringed guitars, 2 different twelve-stringed guitars, etc. \n     \n     * Variation patches for each guitar, including delays, phasers,  \n       choruses, flangers, compressors, and unusual effects \n     \n     * Bonus content including acoustic bass, banjo, mandolin (single  \n       notes, chords, and tremolo), ukulele (single notes and chords), and  \n       guitar effects (body knocks, fret noise) \n     \n     * Bonus special effects content featuring dozens of unusual sound  \n       design patches, based upon the sample sets of the acoustic guitars  \n       but warped in unique and musically distinct ways \n     \n     * Optimized onscreen EQ controls \n     \n     * Easy-to-use built-in reverb module and stereo width control \n     \n     * Remote control of various sonic parameters available via MIDI CC \n     \n     * Multitimbral operation, supporting up to 64 simultaneous instruments\n       (subject to RAM availability), receiving up to 64 MIDI channels (16 \n       in plug-in mode) \n     \n     * Kontakt Player 2 engine, supporting standalone operation as well as \n       plug-in operation in all major hosts that support AudioUnits, VST,  \n       RTAS, or DXi plug-ins \n     \n     \n     Compatibility   \n     \n     Acoustic Legends HD is compatible with both Macintosh and Windows\n     platforms and includes the standalone Kontakt Player 2 application as\n     well as AudioUnit, VST, RTAS, and DXi plug-ins. All of these versions\n     ship in the same box.\n      \n     The Macintosh version requires a G4 1.4gHz or faster, 512MB of RAM, a\n     DVD drive, and OS 10.4.x or higher. Intel-powered Macs are supported.\n     For optimum performance, Vir2 Instruments recommends a G5 or\n     Intel-powered Mac, and a minimum of 1GB of RAM. The library requires\n     19GB of free hard drive space.\n      \n     The Windows version requires a processor speed of 1.4gHz or higher,\n     512MB of RAM, a DVD drive, and Windows XP SP2. For optimum\n     performance, Vir2 Instruments recommends a minimum of 1GB of RAM. The\n     library requires 19GB of free hard drive space.\n     \n     Acoustic Legends HD will run in standalone mode and is also compatible\n     with every major sequencing package in the world, including but not\n     limited to: Apple Logic and GarageBand, MOTU Digital Performer,\n     Digidesign Pro Tools (TDM, LE, and M-Powered), Steinberg Cubase and\n     Nuendo, Ableton Live, and more.\n","torrent":{"xt":"urn:btih:57c8359e4d7b34a411d9b6b7e95559c9f54d1ea4","amp;dn":"vir2_instruments_accoustic_legends_hd_%283dvd%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"57c8359e4d7b34a411d9b6b7e95559c9f54d1ea4","infoHashBuffer":{"type":"Buffer","data":[87,200,53,158,77,123,52,164,17,217,182,183,233,85,89,201,245,77,30,164]},"announce":[],"urlList":[]}}