{"title":"Vlog It!","uid":4092861,"size":193700753,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5808ff74603a191b4b9a62d1e78cc1326eb34d5d&amp;dn=Vlog+It%21&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Magpie13","files":1,"time":1206148258,"description":"So many of you have shared with me....so finally my chance to share back!\n\ncouldnt find this software anywhere on torrents, so had to buy it!\n\nThis was created by Serious Magic, who were bought by Adobe recently.\n\nYou may know some of their other products which have now become\nAdobe Visual Communicator, Adobe Ultra and Adobe OnLocation respectively.\n\nThis product hasn&amp;#039;t yet been &amp;#039;adobe-fied&amp;#039;, and it doesnt look like they&amp;#039;re going to (its basically a lighter version of visual communicator and has most features, but for a fraction of the cost - and an even bigger fraction to you! mwa ha ha!)\n\nThis is a really cool, really easy to use video creation app.  its best for vlogs (video logs), or you-tube videos you want to do, etc. It produces very high quality results, very easily, and with the built in teleprompter and such easy to add newsroom style features, you can turn your drab vlog into something that will engage even the most impatient you-tuber!\n\nSo - Welcome to Vlog It! (below copied from Adobe site) \n\nHOPE YOU ENJOY!!!\n\nThe Magpie\n\n\n\n\nOVERVIEW\n\nVlog It creates video blogs faster and easier than traditional video editing software because there&amp;#039;s no editing! In fact, it&amp;#039;s more like an automatic TV newsroom right inside your computer.\n\n\nCreate your video blog\n\nDrag and drop photos, video clips or music into Vlog It. You get plenty of customizable graphics, effects, titles, music and templates to complement your video blog. Use them to express yourself in fun and exciting ways.\n\nNarrate your video blog\n\nWhen using the teleprompter, you can quickly add narration to digital images and video clips you acquire from your digital camera, camcorder or cell phone. This handy tool ensures you speak clearly and confidently without memorizing lines and can be paused at any time for the ultimate form of self-expression - the tangent.\n\nStep in front of the camera\n\nPosition a webcam or camcorder directly above your computer monitor for the ultimate in video blogging - the personal newscast. When you read your script from the teleprompter, it looks as if you&amp;#039;re staring into the camera. After you press record, all your news-style graphics, titles, images, and videos will show up automatically as you talk.\n\n\nShare your video blog\n\nAfter recording your video blog, click Publish to automatically create a FlashÂ® video viewable by virtually every computer on earth. All the techie details like video compression, file transfer and thumbnail creation are handled behind the scenes by Vlog It. You just drag and drop the video thumbnail icon into your blog edit screen. When readers click on the thumbnail your vlog will play automatically. *\n\n\n\nREASONS TO BUY (edit by me - ok, not buy, download! :D)\n\nAutomate the video creation process\n\nCreate a video blog quickly with the Automated Wizard. Choose to create a video based on a particular look or style, such as Contemporary, Financial or High Tech.\nNarrate your videos\n\nNarrate you video blog using the teleprompter to sound professional and eliminate the need to memorize lines. Easily adjust the speed of the teleprompter to adapt to different reading styles. Pause the teleprompter to elaborate on a topic without breaking your focus.\nReplace your background\n\nPlace a one-color backdrop (such as green fabric) behind you to digitally replace the background with any image or video clip.\nRecord daily video blogs \n\nCreate template-based video blogs that remember the format of the last video created so you can quickly record daily blog postings.\nUpdate commonly-used videos without rendering\n\nShoot segments out of sequence or at different times. Start in the middle, begin at the end, or update any section of your video blog at any time without re-recording the entire video.\nChange video content quickly\n\nReplace audio, images or video while you&amp;#039;re actually recording.\nView your video before recording\n\nAll clips and recordings play back in frame-accurate, real-time preview.\nSee your edits in real-time\n\nScroll through your production easily while seeing all special effects, images and video recordings immediately.\nDrop media directly into Vlog It!\n\nDrag-and-drop graphics, audio, video, and photos from your computer, cell phone or video camera into the Action Tray to customize your video blog.\nCreate special titling effects\n\nGenerate title styles for opening/closing slates and lower third graphics. Lower third titles are transparent in the top two thirds of the image and can be superimposed over video blogs, still images or graphics to look like a newscast.\nCreate fun or dramatic scene changes\n\nCustomizable transitions make video blogs flow easily from one scene, image or video to another. You get over-the-shoulder graphic transitions too.\n\n\n\nREVIEWS\n______________________________\n\n\nDigital Content Producer\n\n    &quot;Serious Magic has created a program that serves not only bloggers, but Windows-based video professionals looking to share footage and communicate with clients and crew alike.&quot;\n\n    Read the full review\n\n\nWhat Digital Camcorder, UK\n5 out of 5 stars\n\n    &quot;If video journalism makes as big an impact on the web as text blogging, then Vlog It! could, and should, become a cult hit.&quot;\n\n\nDigital Media Net\nHighly recommended.\n9.7 of 10 stars.\n\n    &quot;Vlog It is as near-perfect as a consumer-oriented video editing package can possibly be. It&amp;#039;s easy to use, and performed flawlessly throughout all of my testing. I found it a delight to use, and it doesn&amp;#039;t require any professional skill whatsoever to get it to work. As long as users have a simple webcam, and preferably a separate microphone, they should be able to get up and running quickly, creating their own video logs in no time flat.&quot;\n\nNetwork World\n5 out of 5 stars\n\n&quot;Vlog It can cut down on the need for video-editing software, saving lots of time in the process.&quot;\n\n\nThe Detroit Free Press\n5 out of 5 stars\n\n&quot;Vlog It is targeted at bloggers who want to add video posts to their online journals, it also works great for families who would like to send video greeting cards, or schools that want to create a Web TV station for students and parents...The results look strikingly professional -- even with an inexpensive webcam -- and Vlog It&amp;#039;s simple approach for producing them is what makes the program stand out. 5 out of 5 stars.&quot;\n\n\nInternet Video Magazine\n\n    &quot;This is really cool. If you are interested in getting started in creating your own video blog, the new Vlog It software may be just the tool you need.&quot;\n\n\nWashington Post\n\n    &quot;Vlog It generates a personal video that looks much like a regular TV newscast or documentary.&quot;\n\n\nPC Magazine\n\n    &quot;Vlog It! lets anybody create a video blog (vlog) without requiring specialized technical skills or experience with video.&quot;\n\n","torrent":{"xt":"urn:btih:5808ff74603a191b4b9a62d1e78cc1326eb34d5d","amp;dn":"Vlog+It%21","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5808ff74603a191b4b9a62d1e78cc1326eb34d5d","infoHashBuffer":{"type":"Buffer","data":[88,8,255,116,96,58,25,27,75,154,98,209,231,140,193,50,110,179,77,93]},"announce":[],"urlList":[]}}