{"title":"Zenwalk 5.2","uid":4233227,"size":529721344,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:58af7033eb2bd24adf0e71722a0dffc30eae8849&amp;dn=Zenwalk+5.2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blackangel1","files":1,"time":1213167589,"description":"The long awaited Zenwalk 5.2 is now available.\n\nIn the 4 months since the last release many enhancements have been made. The Zenwalk GNU/Linux OS brings to its users both the latest stable software, a well polished Desktop and an ever-increasing software repository.\n\nWhat&amp;#039;s new or improved in Zenwalk 5.2?\n\nThe Zenwalk 5.2 release includes nearly 500 changes to software packages including a broad sweeping number of updated software, bug fixes and enhanced replacements for some software. Notable updates include the Linux kernel version 2.6.25.4 and the Xfce Desktop 4.4.2.\n\nAn Improved package manager: Netpkg &quot;new generation&quot; is now at version 4 and has been completely rewritten in Perl-GTK. This new version introduces many Improvements: better layout, treelike view of packages, many help pop-ups, ultra-intuitive user interface, automatic colorization of icons depending on the status of each package; full internationalization of the user interface; real-time recursive dependency computing, and full-text search.\n\nImproved Multimedia support: Mplayer is now provided with the latest dvdnav (DVD menus support). The Brasero CD/DVD burning software has now completely replaced the nautilus-cd-burner and comes with many new features. Zenwalk also now ships with the latest version of the Pidgin Instant messaging client, Gtkam photo viewing software and version 2.4.6 of the GIMP which provides a complete set of tools for both the hobbiest and professional digital artists alike.\n\nRefined system power usage: Suspend and resume functions have been improved.\n\nThe beautiful and well polished XFCE desktop has been refreshed with new artwork.","torrent":{"xt":"urn:btih:58af7033eb2bd24adf0e71722a0dffc30eae8849","amp;dn":"Zenwalk+5.2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58af7033eb2bd24adf0e71722a0dffc30eae8849","infoHashBuffer":{"type":"Buffer","data":[88,175,112,51,235,43,210,74,223,14,113,114,42,13,255,195,14,174,136,73]},"announce":[],"urlList":[]}}