{"title":"The Alex Jones Show - Alex Jones - ALL FOUR PLUS HOURS AND OVERD","uid":4180776,"size":49463744,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:58d3c3daf3c81b834d7833ba8b2cfeea0f800a5e&amp;dn=The+Alex+Jones+Show+-+Alex+Jones+-+ALL+FOUR+PLUS+HOURS+AND+OVERD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anotha_modemho","files":1,"time":1210387936,"description":"THE EMPIRE IS ON THE RUN..........All 4 PLUS Hours AND OVERDRIVE\n\nAlex is known for not just talking the talk, but walking the walk. He combines his media presence with actual physical activism, a practice that once led to him being arrested on the personal order of George W. Bush! Alex Jones has gained international attention for standing up for what he believes in.\n\nFrom Italy&amp;#039;s La Prensa to the Wall Street Journal and USA Today, Jones has brought the information war to the mainstream print media worldwide, speaking out against tyranny in defense of the Constitution.\n\nTotal Recorder 4.4 Capture in 48 kbs stereo from Ku satellite feed or 56 kbs internet streaming audio with commercial edit. About 6.25 hr listening time.\n\nPM me with any of your comments.\n\nTodays gueststopic: Jason Bermas stands in for Alex\n\n1st HR. - News and OpenLines. Jason discusses the issues of the day and takes your calls. On today&amp;#039;s show, Jason welcomes as guests Tommy Chong, subject of Josh Gilbert&amp;#039;s documentary, a/k/a Tommy Chong!\n\n2nd HR. - News and OpenLines. Jason discusses the issues of the day and takes your calls. Decorated former policeman and radio host, Jack McLamb, and Washington, D.C.-based investigative journalist, author, and syndicated columnist, Wayne Madsen.\n \n3rd HR. - News and OpenLines. Jason discusses the issues of the day and takes your calls. Decorated former policeman and radio host, Jack McLamb, and Washington, D.C.-based investigative journalist, author, and syndicated columnist, Wayne Madsen.","torrent":{"xt":"urn:btih:58d3c3daf3c81b834d7833ba8b2cfeea0f800a5e","amp;dn":"The+Alex+Jones+Show+-+Alex+Jones+-+ALL+FOUR+PLUS+HOURS+AND+OVERD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"58d3c3daf3c81b834d7833ba8b2cfeea0f800a5e","infoHashBuffer":{"type":"Buffer","data":[88,211,195,218,243,200,27,131,77,120,51,186,139,44,254,234,15,128,10,94]},"announce":[],"urlList":[]}}