{"title":"Naruto [Manga Ita Cbr] vol. 01-72 [TNT Village]","uid":12747000,"size":3796188877,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:5b682ede68ed0178c0a1bec2e6a70d19ed13c188&amp;dn=Naruto+%5BManga+Ita+Cbr%5D+vol.+01-72+%5BTNT+Village%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"turchez90","files":72,"time":1447324258,"description":".:Locandina:.\r\n\r\n[img]http://i.imgur.com/MVXEIoM.jpg[/img]\r\n\r\n.:Scheda:.\r\n\r\nAutore: Masashi Kishimoto\r\nTitolo: Naruto\r\nTipologia: Manga\r\nPagine: 200 circa a volume\r\nVolumi: 72\r\nAnno: 1999-2014\r\nNazionalità: Giappone\r\nGenere: Shonen\r\nFormato del file: Cbr (JPG-PNG)\r\n\r\n.:Trama:.\r\n\r\nNaruto Uzumaki è un ninja dodicenne del Villaggio della Foglia con il sogno di diventare Hokage, il ninja più importante del villaggio. Naruto ha passato l'infanzia nell'emarginazione e, durante uno scontro con Mizuki, un ninja traditore, viene a scoprirne il motivo: dentro di lui è sigillata la Volpe a Nove Code, uno dei nove cercoteri, giganteschi demoni sovrannaturali. Dopo avere sconfitto Mizuki, Naruto viene promosso all'accademia ninja e viene integrato nel gruppo sette composto, oltre a lui, da Sasuke Uchiha, Sakura Haruno e il maestro Kakashi Hatake. Dopo varie avventure, Sasuke decide di abbandonare il villaggio per allenarsi con Orochimaru ed ottenere il potere necessario per uccidere suo fratello Itachi con lo scopo di vendicare il suo clan, da lui apparentemente sterminato senza un chiaro movente. Con il tentativo fallito di redimere Sasuke e la sua conseguente fuga dal paese, Naruto decide di abbandonare il Villaggio della Foglia e intraprendere con il maestro Jiraiya un lungo allenamento.\r\n\r\nDopo circa due anni e mezzo, Naruto fa ritorno al Villaggio della Foglia e riprende il suo ruolo come membro del gruppo sette. L'Organizzazione Alba, dedita alla cattura ed all'imprigionamento di tutti i nove cercoteri insiti in altrettante forze portanti per portare a termine un enigmatico scopo, è alla ricerca di Naruto, il quale dovrà scontrarsi con alcuni suoi membri. Con la morte del fratello Itachi, Sasuke scopre la verità dietro allo sterminio del clan Uchiha; consumato nuovamente dall'odio e dalla vendetta, il giovane ninja traditore si unisce ad Alba per ottenere da questa la forza per distruggere il villaggio natio. Le avventure di Naruto procedono quindi nel tentativo di difendere se stesso ed il suo villaggio dall'Organizzazione Alba mentre cerca di riportare sulla retta via l'amico Sasuke.\r\n\r\n.:Screenshots:.\r\n\r\n[img]http://i.imgur.com/ZIBK2xr.jpg[/img]\r\n\r\n[img]http://i.imgur.com/nTqJlF3.png[/img] [img]http://i.imgur.com/SGsIPLG.png[/img]\r\n\r\n[img]http://i.imgur.com/TvS63qb.png[/img]","torrent":{"xt":"urn:btih:5b682ede68ed0178c0a1bec2e6a70d19ed13c188","amp;dn":"Naruto+%5BManga+Ita+Cbr%5D+vol.+01-72+%5BTNT+Village%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5b682ede68ed0178c0a1bec2e6a70d19ed13c188","infoHashBuffer":{"type":"Buffer","data":[91,104,46,222,104,237,1,120,192,161,190,194,230,167,13,25,237,19,193,136]},"announce":[],"urlList":[]}}