{"title":"Shirley Bassey - Greatest Hits - (1993)[FLAC-EAC-CUE]","uid":4237028,"size":292714607,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:5c417a89b3f7d71a3d3eadb49425e8ac932eb071&amp;dn=Shirley+Bassey+-+Greatest+Hits+-+%281993%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"seanprince","files":26,"time":1213349580,"description":"Shirley Bassey - Greatest Hits - (1993)[FLAC-EAC-CUE]\n\nTrack list\n\nShirley Bassey - Greatest Hits\n\n01.\tWhat Now My Love\t\t02:57\n02.\tSomething\t\t\t03:28\n03.\tAs Long As He Needs Me\t\t03:49\n04.\tKiss Me Honey Honey\t\t03:38\n05.\tAs I Love You\t\t\t03:01\n06.\tBig Spender\t\t\t02:01\n07.\tSend In The Clowns\t\t03:53\n08.\tI Am What I Am\t\t\t03:09\n09.\tGoldfinger\t\t\t02:49\n10.\tI (Who Have Nothing)\t\t02:51\n11.\tNathalie\t\t\t04:11\n12.\tAnd I Love You So\t\t04:32\n13.\tNever Never Never\t\t04:26\n14.\tFor All We Know\t\t\t02:33\n15.\tThis Is My Life\t\t\t03:52\n16.\tIf You Don&amp;#039;t Understood\t\t04:10\n\nBiography\tby John Bush\n\nKnown to Americans most for her belting rendition of the theme to Goldfinger, the 1964 edition in the James Bond series (as well as 1971&amp;#039;s Diamonds Are Forever and 1979&amp;#039;s Moonraker), Shirley Bassey was one of the most popular female vocalists in Britain during the last half of the 20th century. Known as Bassey the Belter and also the Tigress of Tiger Bay, her early career in touring shows and cabaret brought her a recording contract with Philips by the late &amp;#039;50s. After reaching the top of the British charts in 1959 with &quot;As I Love You&quot; and later &quot;Reach for the Stars/Climb Every Mountain,&quot; Bassey was tapped to swing the theme song to the third James Bond vehicle. Her voice, brassy and sexy, conveyed the James Bond myth perfectly and became a big hit in America. Though later chart placings in the U.S. were few, she continued to do well in Great Britain, France and the Netherlands into the mid-&amp;#039;70s.\nBorn in January 1937 in Tiger Bay, Cardiff, Wales, Shirley Bassey was the youngest of seven children. Her parents, a Nigerian sailor and an English woman, divorced before she was three years old, but they kept the family together for the most part, and Shirley was able to sing duets with her brother at family get-togethers. After finishing school, she found a job at a local factory, and earned extra money singing at men&amp;#039;s clubs after-hours. Bassey traveled around the country in revues during the early &amp;#039;50s, and made her big breakout in 1955 at a London Christmas show given by comedian Al Read (though it was promoted by bandleader Jack Hylton, who had caught Bassey&amp;#039;s act at the nearby Albany Club). Soon after, Shirley Bassey began appearing in Read&amp;#039;s revue, Such Is Life. The show ran for over a year, and gained her a recording contract for Philips Records. &quot;Banana Boat Song&quot; hit the British Top Ten in early 1957, followed by her number one hits, 1959&amp;#039;s &quot;As I Love You&quot; and 1961&amp;#039;s &quot;Reach for the Stars/Climb Every Mountain.&quot; A 1962 pairing with arranger Nelson Riddle increased her prestige in America, and a vaunted live show gained her headlining spots in both New York and Las Vegas during the early &amp;#039;60s. Popular recognition in the United States came in early 1965, when &quot;Goldfinger&quot; hit number eight in the American charts, instantly becoming her signature song across the Atlantic. (Strangely though, it missed even the Top 20 in Great Britain.)\nBassey&amp;#039;s hits in the U.K. continued into the mid-&amp;#039;70s, led by Top Ten entries such as &quot;Something,&quot; &quot;For All We Know&quot; and &quot;Never Never Never.&quot; After the crowning achievement of her career, a 1977 Britannia Award for Best Female Solo Singer in the Last 50 Years, Shirley Bassey gained her own highly rated BBC-TV show in the late &amp;#039;70s, but gradually slowed down her busy schedule during the next decade. Semi-retired to Switzerland by 1981, she nevertheless emerged quite frequently, spurred by the recording of several television specials and LPs, including a 1987 date with the synth-pop group Yello. Bassey became much more visible during the &amp;#039;90s, opening a nightclub in Cardiff, and touring the world several times.\n\nEnjoy","torrent":{"xt":"urn:btih:5c417a89b3f7d71a3d3eadb49425e8ac932eb071","amp;dn":"Shirley+Bassey+-+Greatest+Hits+-+%281993%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c417a89b3f7d71a3d3eadb49425e8ac932eb071","infoHashBuffer":{"type":"Buffer","data":[92,65,122,137,179,247,215,26,61,62,173,180,148,37,232,172,147,46,176,113]},"announce":[],"urlList":[]}}