{"title":"Real Player v.11.0.9.372 Gold Premium Multi-Media FuLL 2008","uid":4189743,"size":14543981,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:5c4b9eca7fb8a9112ec1dc51405ac1637a0243cb&amp;dn=Real+Player+v.11.0.9.372+Gold+Premium+Multi-Media+FuLL+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mr_DMP","files":3,"time":1210882303,"description":"Hey guys this is my first upload via torrent\n\nEnjoy.\n\niNFo:\nReal Player plays all major media formats including RealVideo, RealAudio, Windows Media and Quicktime. This makes it easier for end users to decide on the media they want to access, not the format or software. We take universality a step further by providing RealPlayers for Windows, Macintosh, Linux, Unix, mobile phones, portable devices, set top boxes, DVD players and gaming consoles.\n\nFast Facts about the New Real Player:\n\nConsumers can use the innovative, single-click process to quickly download and save videos for later enjoyment.\n* Consumers can download multiple videos simultaneously with RealPlayer, allowing people to save time and easily multitask. Users can also start downloading in the middle of watching a video, and the entire video will be captured.\n* Consumers don&amp;#039;t need to worry about video format compatibility issues ? the new RealPlayer supports videos created in the most popular formats, including Flash, Windows Media, QuickTime, and Real.\n* Consumers can easily burn videos to CD (or to DVD, using RealPlayer Plus). The Video CD format used by RealPlayer can be played in most DVD players.\n* Consumers can send links of their favorite videos to their friends with a convenient &quot;Share with a Friend&quot; feature. The link that arrives in their friends&amp;#039; email will direct them to the online source of the video content their friend downloaded.\n* RealPlayer supports both downloading and recording for popular streaming format (Windows Media, Real, and QuickTime)\n* RealPlayer will only download/record video that is not protected by DRM (Digital Rights Management) systems.\n* RealPlayer features an improved look and feel, a streamlined installation process and faster video playback.\n* RealPlayer will first be released for Windows, and will work with both Microsoft Internet Explorer and Mozilla Firefox. Real plans a version for the Mac to be released later in the year.","torrent":{"xt":"urn:btih:5c4b9eca7fb8a9112ec1dc51405ac1637a0243cb","amp;dn":"Real+Player+v.11.0.9.372+Gold+Premium+Multi-Media+FuLL+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5c4b9eca7fb8a9112ec1dc51405ac1637a0243cb","infoHashBuffer":{"type":"Buffer","data":[92,75,158,202,127,184,169,17,46,193,220,81,64,90,193,99,122,2,67,203]},"announce":[],"urlList":[]}}