{"title":"Phantasmagoria Sierra Installer - Works in Windows XP","uid":4237192,"size":36466557,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:5d29967650a3d9294b90ddcf29023cb38e5eab89&amp;dn=Phantasmagoria+Sierra+Installer+-+Works+in+Windows+XP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dalkarlen2","files":2,"time":1213315900,"description":"Phantasmagoria Sierra Installer - Works in Windows XP\n\nThis Installer enables it to completely copy of all seven Phantasmagoria CDs onto your hard disk to play it without the CDs. You can also simply burn it to a single DVD. \n\nPlease be sure to also read the important notes at the end of this text! \n\nFeatures of this Installer: \n\n* Windows XP compatibility \n* Bypassing the problematic Sierra-Installer \n* Automatically changes your display mode - No more to swapping CDs during game play \n* Path independent (the installation can be copied as is and played from anywhere) \n* Choice of Music synthesizers for newer Soundcards during installation \n* Can be played in a window or full screen \n* Includes extras for die hard Phantasmagoria fans  \n\nYou must have all seven Phantasmagoria CDs during the installation! Please note that the installer may repeatedly ask for a CD - be patient, this is a one time process! \n\nNOTES: \n\n1. You must insert the CDs in the correct sequence exactly as each CD is indicated. Some files have the same name on the various CDs even though they may be different files. \n\n2. This installer was designed for the German version. It may also work with other versions but, other Phantasmagoria versions may have a different layout that could cause problems. \n\n3. After the installation, a small DOS-routine will run. This must not be interrupted. \n\nThis was tested only with the German version of Phantasmagoria. With other versions it might crash or lead to unexpected results. Use this installer at your own risk! \n\nCredits: This Installer uses CreateInstall, windows INF-Script as well as the tool UniSCI (c) of Enrico Rolfi ( http://vogons.zetafleet.com/gkpatches) ","torrent":{"xt":"urn:btih:5d29967650a3d9294b90ddcf29023cb38e5eab89","amp;dn":"Phantasmagoria+Sierra+Installer+-+Works+in+Windows+XP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5d29967650a3d9294b90ddcf29023cb38e5eab89","infoHashBuffer":{"type":"Buffer","data":[93,41,150,118,80,163,217,41,75,144,221,207,41,2,60,179,142,94,171,137]},"announce":[],"urlList":[]}}