{"title":"African Migrants and Europe: Managing the ultimate frontier","uid":12854281,"size":3285576,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5db7493bcb16d5c72f32cdfda78ffe7e7b711515&amp;dn=African+Migrants+and+Europe%3A+Managing+the+ultimate+frontier&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TopShelfBook","files":2,"time":1448652476,"description":"African Migrants and Europe: Managing the ultimate frontier (Routledge Studies in African Politics and International Relations) \r\n\r\nThe process of migration control mirrors the trajectories of the people who traverse national boundaries, making today’s borders flexible and fluid.\r\n\r\nThis book explores the transformation of migration control in the post 9/11 era. It looks at how border controls have become more diffuse in the face of increased human flows from Africa and presents a critical analysis of the dispositif of European migration control, including detention without trial, derogation of human rights law, torture, &quot;extraordinary rendition&quot;, the curtailment of civil liberties and the securitization of migration. By examining the role of Gaddafi’s Libya in the last ten years as a gendarme of Europe, it argues for a re-visioning of borders and frontiers in ways that can account for their dialectical nature, and for the dialectical nature of political life.\r\n\r\nThis text will be of key interest to scholars and students of European studies, African studies, security studies, international relations, global studies, comparative politics, cultural geography, migration studies and border theory.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:5db7493bcb16d5c72f32cdfda78ffe7e7b711515","amp;dn":"African+Migrants+and+Europe%3A+Managing+the+ultimate+frontier","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5db7493bcb16d5c72f32cdfda78ffe7e7b711515","infoHashBuffer":{"type":"Buffer","data":[93,183,73,59,203,22,213,199,47,50,205,253,167,143,254,126,123,113,21,21]},"announce":[],"urlList":[]}}