{"title":"Washington's Circle -The Creation of the President (2015) Gooner","uid":12861361,"size":20059817,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:5f36ba186e609d598fb8ff8cf1a1e871ec2eef50&amp;dn=Washington%27s+Circle+-The+Creation+of+the+President+%282015%29+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"GoonerTPB","files":1,"time":1448742151,"description":"Washington's Circle - The Creation of the President (2015).epub Gooner\r\n\r\nPublisher: Random House (March 17, 2015)\r\nLanguage: English\r\nISBN-10: 1400069270\r\nISBN-13: 978-1400069279\r\n\r\nHistory enthusiasts and admirers of Team of Rivals will rejoice in this magisterial account of the extraordinary Americans who served the nation’s first chief executive: Together, they created the presidency for a country disgusted by crowns and the people who would wear them.\r\n \r\nIn 1789, as George Washington became the first president of the United States, the world was all but certain that the American experiment in liberty and representative government would founder. More than a few Americans feared that the world was right. In Washington’s Circle, we see how Washington and his trusted advisers, close friends, and devoted family defied the doomsayers to lay the foundation for an enduring constitutional republic. This is a fresh look at an aloof man whose service in the Revolutionary War had already earned him the acclaim of fellow citizens. Washington was easy to revere, if difficult to know.\r\n \r\nDavid S. Heidler and Jeanne T. Heidler reveal Washington’s character through his relationship with his inner circle, showing how this unlikely group created the office of the presidency. Here is a story of cooperation, confrontation, triumph, and disappointment, as the president, Congress, and the courts sorted out the limits of executive power, quarreled over funding the government, coped with domestic strife, and faced a world at war while trying to keep their country at peace.\r\n \r\nEven more, it is a story of remarkable people striving for extraordinary achievements. Many of these characters are familiar as historic icons, but in these pages they act and speak as living individuals: the often irked and frequently irksome John Adams, in the vice presidency; the mercurial Alexander Hamilton, leading the Treasury Department; the brilliant, deceptively cunning Thomas Jefferson, as secretary of state; James Madison, who was Washington’s advocate—and his eyes and ears—in Congress; and Washington’s old friend and former brother-in-arms Henry Knox, at the administration’s beleaguered War Department. Their stories mingle with those of Edmund Randolph, John Jay, Gouverneur Morris, and the others who stood with a self-educated Virginia farmer to forge the presidency into an institution protective of its privileges but respectful of congressional prerogatives.\r\n \r\nWritten with energy, wit, and an eye for vivid detail, Washington’s Circle is the fascinating account of the people who met the most formidable challenges of the government’s earliest hours with pluck, ability, and enviable resourcefulness. When the world said they would fail, they rolled up their sleeves. This is their story","torrent":{"xt":"urn:btih:5f36ba186e609d598fb8ff8cf1a1e871ec2eef50","amp;dn":"Washington%27s+Circle+-The+Creation+of+the+President+%282015%29+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"5f36ba186e609d598fb8ff8cf1a1e871ec2eef50","infoHashBuffer":{"type":"Buffer","data":[95,54,186,24,110,96,157,89,143,184,255,140,241,161,232,113,236,46,239,80]},"announce":[],"urlList":[]}}