{"title":"TweakMASTER_PRO_v2.50.2822","uid":4199563,"size":2842112,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:604a2ff3b9a9ff29488a3a731c51df97992b131e&amp;dn=TweakMASTER_PRO_v2.50.2822&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tomolup","files":1,"time":1211419092,"description":"TweakMASTER, the premier Internet Optimizer, which has sped up Internet connections worldwide for millions of users is now free! No purchase necessary.\nInternet Connection Optimization\nTweakMASTER will substantially improve your web surfing and download speeds. It works for all types of connections: dial-up, DSL, Cable or Wireless. Even AOL users will be amazed with the improvement TweakMASTER provides.\n\n\nThe Optimization Wizard will walk you through some recommended settings using several different &quot;optimization strategies&quot;. It asks a few simple questions and then optimizes your Internet Connection Automatically.\n\nYou may also wish to experiment with some other settings in the Advanced Optimization Settings dialog to obtain the fastest possible connection. TweakMASTER places you in total control of all networking configuration parameters on your computer.\n\nLinkFox (TweakMASTER PRO only)\nTweakMASTER LinkFox is the first truly discriminating web accelerator for Internet Explorer. It will intelligently load only the links you want to look at, so they will load instantly the moment you are ready to view them. LinkFox is a great timesaver for any serious web surfer. This function is available only in Professional version of TweakMASTER. ","torrent":{"xt":"urn:btih:604a2ff3b9a9ff29488a3a731c51df97992b131e","amp;dn":"TweakMASTER_PRO_v2.50.2822","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"604a2ff3b9a9ff29488a3a731c51df97992b131e","infoHashBuffer":{"type":"Buffer","data":[96,74,47,243,185,169,255,41,72,138,58,115,28,81,223,151,153,43,19,30]},"announce":[],"urlList":[]}}