{"title":"PlaneShift-v0.4.00-NELSONMANDELA","uid":4085237,"size":325931468,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:6065eb4136b197885e32318f48c028da67bc1166&amp;dn=PlaneShift-v0.4.00-NELSONMANDELA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"copyright2008","files":1,"time":1205775836,"description":"PlaneShift is a Role Playing Game immersed into a 3D virtual fantasy world which is FULLY FREE to play. Fully free means you will have no surprises of premium content which will limit your gameplay or unbalance the game. There are no limitations in skills, ranks, abilities, items you can gain with your free account. There are no time limits or additional constraints. Other similar games just advertize the &quot;free&quot; concept to sell you premium accounts. We don&amp;#039;t. Servers and bandwidth will be donated by sponsors.\n\nAt the present state of development, PlaneShift is not a complete game, but what we call a &quot;tech demo&quot;. With this definition we mean that the game is still under heavy development, so you may easily find bugs, glitches and missing features. We decided to open it to the public because we want to have your feedback on improving the game and because we have enjoyed seeing our progress being put into productive use from the beginning. Apart from this, the game is enjoyable and has hundreds of active players.\n\nToday you can explore the virtual world, interact with other players or with server controlled creatures, fight monsters, cast spells, solve quests and puzzles, improve your character, gain magical items and more.\n\nRemember that PlaneShift is a Role Playing Game - be sure to read our Roleplay guidelines! We think the RPG part of the mmorpg definition has a meaning!\n\nFor the future we will focus our efforts on the reproduction of a real world with politics, economy, improving the artificial intelligence of non-player-characters controlled by the server that will bring our world to life!\n\nOur virtual world is persistent, and this means you can connect to it at any hour of the day and you will always find players and NPCs wandering our realms. You will be able to disconnect and reconnect again as many times as you like because your character is stored on the server, so you will never have to worry about saving the game. A player can start from humble beginnings and advance to greatness in whatever path they may choose.\n\nYou will use a client program to interact with our world that enables you to have a 3D view of the surroundings.\n\nHere are 10 reasons why you should become a player and a fan of PlaneShift:\n\n   1. Planeshift is a great place to find new friends from all over the world!\n   2. PlaneShift is a virtual world where you&amp;#039;ve always dreamed of living.\n   3. PlaneShift is the first 3D MMORPG to be fully free for players.\n   4. Thanks to our open development process the game will be expanded endlessly for years to come.\n   5. Planeshift is a game made by roleplayers to bring you all the immersion you need from a virtual world.\n   6. A unique setting, realistic combat rules, great magic system.\n   7. No budgetary constraints will stop development of the world or prevent the addition of new ideas.\n   8. You will be able to build your house, your castle, your realm.\n   9. You have the option to live as an adventurer or as a normal citizen - both paths will be rewarded in the game.\n  10. You can submit comments, ideas, bugs and the dev team will take those into account in future releases.\n\nGame features\n\n      The following list represents some of the features of the final product. Please remember that today PlaneShift is still under heavy development.\n\n      12 playable races with unique traits!\n      Unlimited professions through a skill system,\n      Original magic system with six Ways of magic,\n      Hundreds of spells,\n      Numerous huge worlds to explore,\n      A great number of quests to test your wit and skill,\n      Monsters and NPCs with good AI that produce game events,\n      A world that evolves with or without player interaction,\n      Create your own house or castle,\n      Politics and economy,\n      ... and much much more!\n\nClient features\n\n     The following list represents some of the features of the final product.\n\n      3D graphics and sounds for an immersive experience,\n      Support for most major platforms: Windows (Vista, XP, 2000),                 Linux (x86 and amd64), and MacOSX,\n      OpenGL support with advanced graphics capability through the           Crystal Space 3D engine,\n      Easy interaction with other players through messages and chat,\n      Drag-n-drop objects between world and inventory,\n      A complex character generator, with parents, jobs, life events, etc.,\n      ... and much much more!\n\n\n\nSYSTEM REQUIREMENTS!\n\nMinimum Requirements:\nWindows (2000, XP or Vista), Mac OS X 10.4, Linux (2.6 kernel, glibc 2.3.2), FreeBSD or Solaris\nGeForce 2 or higher 3D graphics card (64MB of video memory at least)\n1 Ghz CPU\n512 MB RAM\n1 GB free disk space\n56k modem Internet connection\n\nRecommended Requirements:\nWindows (XP or Vista), Mac OS X 10.4, Linux (2.6 kernel, glibc 2.4)\nGeForce 4 or higher 3D graphics card\n2 Ghz CPU\n1 GB RAM\n1 GB free disk space\nBroadband Internet connection\n\n\nACCOUNT CREATION:\n &lt;a href=&quot;\nhttp://www.planeshift.it/register.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.planeshift.it/register.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6065eb4136b197885e32318f48c028da67bc1166","amp;dn":"PlaneShift-v0.4.00-NELSONMANDELA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6065eb4136b197885e32318f48c028da67bc1166","infoHashBuffer":{"type":"Buffer","data":[96,101,235,65,54,177,151,136,94,50,49,143,72,192,40,218,103,188,17,102]},"announce":[],"urlList":[]}}