{"title":"Contropotere - CP/01 (Cyborg 100%) [1994] electronic (V0 VBR)","uid":4122670,"size":101189715,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:611ab4e1250aaec732524284ffe9a57f11125a2e&amp;dn=Contropotere+-+CP%2F01+%28Cyborg+100%25%29+%5B1994%5D+electronic+%28V0+VBR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"blots","files":28,"time":1207630968,"description":"Contropotere - CP/01\n(Cyborg 100%)\nSelf-Released, 1994\n\n\nfrom rateyourmusic:\n\nContropotere&amp;#039;s final beautiful swan song. Otherwise known as &quot;the shitty techno album.&quot; I&amp;#039;ve listened to this album somewhere around 10 times since I first heard it a few years ago, most of them have been in the last couple of months. This record has a BAD reputation with the punks...at least in america. I&amp;#039;m still only getting to know it, but by my rating you can tell I consider it a &amp;#039;masterpiece&amp;#039;. A few songs here are classic Contropotere and would have fit in fine on their other records, the rest are heavily built around electronics. This is as experimental and tribal as they&amp;#039;ve ever been, but they&amp;#039;re using new instruments. Using them very well as far as I can hear. Why that&amp;#039;s such a failure for punks is one of many questions I ask myself and find I&amp;#039;ve walked another few miles away from punkland. It&amp;#039;s not a big deal until the music that&amp;#039;s important to you--the meaning it&amp;#039;s connected to in your head--can&amp;#039;t be shared with anybody you know. To be fair that&amp;#039;s no unique characteristic of punk. But for some reason, even though you&amp;#039;ve moved away from every single other thing you were a part of, that&amp;#039;s a sad one. Not sure who this should be recommended to, it&amp;#039;s taken me a little while to believe in it myself. Those who appreciate heavy music and electronic music might be a good start, or those that already like this band and are willing to give the album a chance. I&amp;#039;ve listened to a lot of music and don&amp;#039;t have anything else that sounds like this...some early dancey industrial maybe or other sample/beat-heavy hardcore bands (Christdriver, Sweat Engine, Beat to Death?--I haven&amp;#039;t heard these bands in a few years, I may be way off) could be a point of reference. Although really this album goes beyond that genre. The band mentions CP/01 on their website but it&amp;#039;s hard to make out everything from the translation other than that Andrea DeMarco (played on &quot;Il Seme della Devianza&quot;) brought the &amp;#039;linea tekno-logica&amp;#039; and, &quot;After a troubled two years of transformations, inside and external, in the &amp;#039;94 go out CP01/Cyborg 100%.&quot; There&amp;#039;s also the phrase &quot;Cyber d&amp;#039;azione&quot;. Cyber of action? Hopefully some new people will hear it.\n\nTracklist:\n\n01 Diritto all&amp;#039;inferno 4:01\n02 Embryo 3:46\n03 Rovine  5:28\n04 Sarajevo 6:25\n05 Agente provocatore 3:17\n06 Moto perpetuo 3:59\n07 4?? Sakti 3:21\n08 Attacco al visus 5:16\n09 Fuga 4:48\n10 Succube 4:01\n11 Bollettino n?? 22 4:24\n12 Tempesta magnetica 4:41\n13 Oltresuoni 5:29\n\n\nNotes about rip:\n\nAs you can see from the original log I had some trouble getting track 11 and track 13 to rip without error. Track 11 is from dBpoweramp CD Ripper, using secure mode. The others are all from EAC. I couldn&amp;#039;t get a clean rip of this track from EAC, and while dBpoweramp did give a warning, it passed it as secure (that&amp;#039;s the best I&amp;#039;m going to get from this CD, it does have scratches). I would have just done the whole rip with dBpoweramp, but oddly I couldn&amp;#039;t get a secure rip of track 13 from that program. So, this ended up every track ripped from EAC with the exception of this track (track 11). See the log for track 13 to verify it as a secure rip. I&amp;#039;ve tested and edited the cue sheet to make sure it still works and it does (though if you have any problems, according to EAC the original CD has no gaps in it). Normally I wouldn&amp;#039;t go to so much trouble for a couple of inaudible errors, but this is a rare CD and I didn&amp;#039;t want anybody to pass it by on account of something...silly. MP3ers don&amp;#039;t get a cue sheet ;-)\n\nThe artwork was all taken from the band&amp;#039;s (official, who would have thought?) myspace. The individual band member pictures are cropped from the lyric pages (sorry, I don&amp;#039;t have a scanner right now). I&amp;#039;ve typed the lyrics up separately. And yes, that is the actual front cover.\n\nThis album often doesn&amp;#039;t even get mentioned in the Contropotere discography, or is referred to as &quot;The Techno Album&quot; by those who should know better. Compared to a couple of years ago when you could type this band&amp;#039;s name into google and not be sure whether the few results had anything to do with them, information has come a long way (like I said: myspace? GISM didn&amp;#039;t get an official one too in the time I was away, did they?). But I thought it would be nice all the same to give this album a proper rip in hopes that it would get out to a few people more willing (able?) to give it a chance than punks were. There was a rip floating around on soulseek before, but it was 128 kbps with a few tracks in 192. Listenable enough, but difficult to share with anybody not already familiar with the band and thus unlikely to put up with techno bullshit.\n\nI&amp;#039;ve seen this called &quot;cyberpunk&quot; which is a fair enough description. If you play this record as loud as you would (should?) their other records, I don&amp;#039;t think it will leave you so lost and confused. If so, maybe read the lyrics? Those that are coming to this with a background in electronic music may find something interesting in how computers are used here. Then again, you may not...it&amp;#039;s really hard for me to tell these days. While those who have never ever listened to music before, ever, are in for a real treat.\n\nIf you can tell I put a lot of love and effort into this (and more money than i have right now to pay may&amp;#039;s rent). I have a lot of love for this band. This is a unique record.","torrent":{"xt":"urn:btih:611ab4e1250aaec732524284ffe9a57f11125a2e","amp;dn":"Contropotere+-+CP%2F01+%28Cyborg+100%25%29+%5B1994%5D+electronic+%28V0+VBR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"611ab4e1250aaec732524284ffe9a57f11125a2e","infoHashBuffer":{"type":"Buffer","data":[97,26,180,225,37,10,174,199,50,82,66,132,255,233,165,127,17,18,90,46]},"announce":[],"urlList":[]}}