{"title":"Glimpses of World History- Jawaharlal Nehru (gnv46)","uid":12746519,"size":18912789,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:61615f99bbe59630ae2af45a6aa7d371c95bcc12&amp;dn=Glimpses+of+World+History-+Jawaharlal+Nehru+%28gnv46%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gnv65","files":4,"time":1447317265,"description":"Glimpses of World History\r\nby Jawaharlal Nehru\r\nThe John Day Co. | 1960 | ISBN: N/A | scanned PDF | 320 pages | 18.3 mb\r\n\r\nGlimpses of World History, a book written by Jawaharlal Nehru in 1934, is a panoramic sweep of the history of humankind. It is a collection of 196 letters written between 1930-1933, as an introduction to the world history to his daughter Indira, then thirteen years old. The letters, written in a span of thirty months when Nehru was imprisoned in various places by the British, starts off with one he sends to his daughter on her birthday. He says he is sad about not being able to send her any &quot;material&quot; gift from prison, so he would try to give her something he can &quot;afford&quot;, a series of letters from his heart. Written from prison, where he had no recourse to reference books or a library but his personal notes, Glimpses of World History contains the history of humankind from 6000 BC to the time of writing of the book. \r\n\r\nIt covers the rise and fall of great empires and civilizations from Greece and Rome to China and West Asia; great figures such as Ashoka and Genghis Khan, Gandhi and Lenin; wars and revolutions, democracies and dictatorships. He wrote about many cultures throughout the globe in detail because, as he himself said, he didn't like the way history was taught in schools where it was confined to the history of a single country and that too narrow, and he wanted his daughter Priyadarshini to know why people did what they did. It was possible only through knowing the history of the whole world. The letters are written in informal language, with the contemporary and personal events too are mentioned. They reflect the world view of Nehru, and his grasp of history. It could be considered as one of the first attempts at historiography from a non-Eurocentric angle. The book is comparable to The Outline of History by H. G. Wells. \r\n\r\nThe New York Times described it as . . . one of the most remarkable books ever written . . . Nehru makes even H.G.Wells seem singularly insular . . . One is awed by the breadth of Nehru's culture.\r\n \nhttp://s23.postimg.org/vqkzjg84b/Glimpses_of_World_History.jpg","torrent":{"xt":"urn:btih:61615f99bbe59630ae2af45a6aa7d371c95bcc12","amp;dn":"Glimpses+of+World+History-+Jawaharlal+Nehru+%28gnv46%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61615f99bbe59630ae2af45a6aa7d371c95bcc12","infoHashBuffer":{"type":"Buffer","data":[97,97,95,153,187,229,150,48,174,42,244,90,106,167,211,113,201,91,204,18]},"announce":[],"urlList":[]}}