{"title":"ConvertXtoDVD 3.0.0.9","uid":4123921,"size":20782446,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:61ab25c3e77d4d5dc5d9704eb92bb56345598e2f&amp;dn=ConvertXtoDVD+3.0.0.9+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"twiztiddad","files":4,"time":1207689216,"description":" ConvertXtoDVD: convert avi to dvd and burn dvd\n\nWith ConvertXtoDVD, video conversion software, you can convert and burn all your videos and convert Avi to DVD!\nBackup and transfer your movies to DVD and enjoy watching them on any home DVD player. All in one conversion and burning software.\n\nThis award-winning divx to dvd video converter software supports most video and audio formats for video conversion (avi, mpg, mov, wmv, mkv, ogm and more) and even handles DVD to DVD copy!\n\nKey Features\n\n    * Video formats supported: avi, divx, xvid, mov, mkv, flv, mpeg-1, mpeg2-, mpeg-4, nsv, dvr-ms, tivo, ts, ifo, vob, asf, wmv, realmedia, rm, rmvb, ogm, existing files from digital camcorders, TV/Sat, capture cards, etc. No external codecs needed like avi codec download\n    * Create DVD menus with different templates available, possibility to add background video, image or audio, have chapter and audio/subtitle menus\n    * Conversion advisor wizard, control of the conversion speed vs. quality\n    * Fast and quality encoder, typically less than 1 hour for converting 1 movie, and supports Multi-Core processors!\n    * Included burning engine with burn speed control choice of SAO or packet writing methods, supports all DVD formats\n    * Custom and or automatic chapter creation with markers and preview window\n    * Advanced file merging possibilities\n    * Audio formats supported internal and external: AC3, DTS, PCM, OGG, MP3, WMA and more...\n    * Subtitles files supported internal and external: SRT, .SUB/IDX, .SSA with color and font selection, and supports tags like italic, bold\n    * Video output for video standard (NTSC, PAL), TV Screen (Widescreen 16:9, Fullscreen 4:3) and DVD Resolution (Full D1, Boradcast D1, Half D1, SIF), or choose automatic for all choices listed above. Also convert video from NTSC to PAL or PAL to NTSC\n    * Video post processing settings like video resize-pad/cropping and de-interlacing options\n    * Multilingual support available languages...\n    * Optimized for Windows 2000 / XP / Vista\n\n","torrent":{"xt":"urn:btih:61ab25c3e77d4d5dc5d9704eb92bb56345598e2f","amp;dn":"ConvertXtoDVD+3.0.0.9+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"61ab25c3e77d4d5dc5d9704eb92bb56345598e2f","infoHashBuffer":{"type":"Buffer","data":[97,171,37,195,231,125,77,93,197,217,112,78,185,43,181,99,69,89,142,47]},"announce":[],"urlList":[]}}