{"title":"CNN Presents - War In Iraq - The Road to Baghdad","uid":4186313,"size":732588032,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:626f81bbb23f1e7585d574962ccc4a5e9d30ce22&amp;dn=CNN+Presents+-+War+In+Iraq+-+The+Road+to+Baghdad&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":1,"time":1210696298,"description":"Slight error during Rip, the DVD menu is included. Just fast forward a tic and you get to the documentary.\n\nWhat?s shown here is the reporting on the actual war phase of taking Iraq, and the first brief period of the occupation, followed by highlights of President Bush?s speeches from the Oval Office announcing the start of the war and his speech from the carrier announcing the end of major combat operations. Produced near the end of 2003, this film does not speak to any of the issues or revelations since that time.\n\nThere is a fairly nasty debate at http://www.amazon.com/CNN-Presents-Iraq-Road-Baghdad/dp/B00009MECP/ref=sr_1_1?ie=UTF8&amp;s=dvd&amp;qid=1210687390&amp;sr=1-1 regarding the worth of the film, with some calling it a fair and neutral presentation and others referring to it as anti American propaganda. I will not go into my own political opinions except to say that each side seems to be represented by exactly who you would expect, SAYING exactly what you would expect. Either way, there is more than enough important footage here to make it a relevant historical document.\n\nOne note; I have uploaded a few things in the past that gave people the opportunity to spew their political opinions in the comment section. This is a torrent site. Let me assure you that this is not the place for quality geopolitical debate, nor does anybody really give a damn what you think. If you want to comment on the film, its rip quality, etc, that?s fine. If you want to argue for or against aspects of the war, or Bush, then go start a blog somewhere.\n","torrent":{"xt":"urn:btih:626f81bbb23f1e7585d574962ccc4a5e9d30ce22","amp;dn":"CNN+Presents+-+War+In+Iraq+-+The+Road+to+Baghdad","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"626f81bbb23f1e7585d574962ccc4a5e9d30ce22","infoHashBuffer":{"type":"Buffer","data":[98,111,129,187,178,63,30,117,133,213,116,150,44,204,74,94,157,48,206,34]},"announce":[],"urlList":[]}}