{"title":"Edward Cufaude - Sound Sunrise (Promo) (Electronica-Big Beat-Bre","uid":4080157,"size":28687617,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:62ba3061481b16ae76155b17fc986fef33a5a510&amp;dn=Edward+Cufaude+-+Sound+Sunrise+%28Promo%29+%28Electronica-Big+Beat-Bre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"edwardcufaude","files":6,"time":1205523389,"description":"Edward Cufaude - Sound Sunrise (Official Promo Torrent)\n-------------------------------------------------------\n\nEdward Cufaude\nIndependant Musician\nElectronic based, if you like old style prodigy, crystal method, chemical brothers, orbital etc then you might enjoy my tracks. Give them a try.\n\n\nFrom the Readme File Included\n-----------------------------\n\nAbout This Torrent:\n\nThank you for downloading my music :). 4 tracks 192kbps MP3 files (20 minutes). It is 100% legal to download and distribute as long as you keep this readme text file in there or credit me as the composer. \n\nI am an independent musician and have released this torrent as a way of promoting myself and also my upcoming album called &quot;Sound Sunrise&quot; to be released 15th May 2008. I shall be releasing the album via my site at www.edwardcufaude.com and torrent site such as The Pirate Bay and Mininova for free download at 192kbps MP3 files. For a donation of your choice 320Kbps MP3 files or FLAC files will be available from the release date as well as some bonus tracks. The album will also be available from Napster, Amazon MP3, eMusic, Rhapsody and iTunes (might not be available straight away).\n\n\nTorrent Includes:\n\nIncluded in this torrent are these tracks from my upcoming album\n\nEdward Cufaude - Sound Sunrise - Part I (Part II on Album) \nEdward Cufaude - Rise of the Synthesizers\n\nA remix of NUDE&amp;#039;s Track Dreams www.nude-music.com\n\nNude - Dreams (Edward Cufaude Remix)\n\nAlso included is the added bonus track exclusive to this torrent.\n\nEdward Cufaude - Green Bubbly Hit\n\nThis is just a bit of fun I had with a beat I made, a turntable and some vinyl. I hope to incorporate scratching into my main tracks at a later stage, still praticing and need to get my own samples onto vinyl. :)\n\n\nWant More of My Music:\n\nFind the torrent file included to download my first torrent which includes my first release The Rhythm Creator EP, 3 pre-release tracks from my upcoming album Sound Sunrise (15th May 2008) and a track exclusive to that torrent.\n\n\nHelp Support My Music:\n\nThere are loads of different ways you can help to support me as a musician if you like the included tracks (which don&amp;#039;t involve any money...)\n\n1. Seed this torrent\n2. Contact me and comment on my tracks :) Good or Bad. I love to hear that people like my tracks and also suggestions for improving them.\n3. Distribute my tracks to friends who might be interested. Including this text file.\n4. Add me as a friend on Myspace\n5. Visit/Promote my music making blog at www.rhythmcreation.com\n6. Visit/Promote my personal web site at www.edwardcufaude.com\n7. StumbleUpon my web site at www.edwardcufaude.com by going and clicking on I Like It and let others know about my music.\n8. Use my tracks for FREE/UNCOMMERCIAL projects such as YouTube Videos, Podcasts, Online Radio etc, as long as you credit me as the composer.\n9. I need people to offer me some invites thru my email address on www.edwardcufaude.com to sites like what.cd, stmusic and waffles.fm and any other torrent places so I can upload and seed my album on release date.\n\n\nSome Shout Outs:\n &lt;a href=&quot;\nhttp://www.tsmradio.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.tsmradio.net&lt;/a&gt; - TSM Radio UK - Thanks for playing my tracks regularly, If you like listening to independent/unsigned music go check them out.\n &lt;a href=&quot;\nhttp://www.jamendo.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.jamendo.com&lt;/a&gt; - Jamendo - Thanks for a great platform for musicians like me. Go check out all the great tracks on there from other great musicians.\n\n\nThanks to all the people who contacted me with kind comments and support and also all the people who help seed :)\n\nThanks for downloading my tracks and sharing the music  :)\n\nEdward Cufaude\n\nwww.edwardcufaude.com\nwww.rhythmcreation.com","torrent":{"xt":"urn:btih:62ba3061481b16ae76155b17fc986fef33a5a510","amp;dn":"Edward+Cufaude+-+Sound+Sunrise+%28Promo%29+%28Electronica-Big+Beat-Bre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"62ba3061481b16ae76155b17fc986fef33a5a510","infoHashBuffer":{"type":"Buffer","data":[98,186,48,97,72,27,22,174,118,21,91,23,252,152,111,239,51,165,165,16]},"announce":[],"urlList":[]}}