{"title":"Brazil Disk Image Encryption System","uid":4089001,"size":20044506,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:63998902d6509e3c0cba8afef3363c7cc95ea3c6&amp;dn=Brazil+Disk+Image+Encryption+System&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lampreysystems","files":1,"time":1205969254,"description":"Brazil Disk Image Encryption System\nVersion 1.0\nÂ© Copyright 2008 Lamprey Systems\nwww.lamprey-systems.com\n\nWhat does Brazil do?\n\n Brazil uses Mac OSX&amp;#039;s Unix shell to create, mount, unmount and hide disk images.  You can securely store all manner of documents within these disk images. Brazil can also mount and read remote disk images across the Internet.\n\nHow do I install Brazil?\n\nCopy the Brazil application to your hard drive.  Brazil does not have to be in your Applications folder to run, and Brazil does not add any additional files to your hard drive.\n\nWhat type of encryption does Brazil use?\n\nDisk images created by Brazil are encrypted using Advanced Encryption Standard (AES) 128 bit encryption.  This cipher is currently approved by the NSA for the encryption of TOP SECRET information... be careful of 12 year-old Russian hackers, though.\n\nWhy does Brazil seem hung up sometimes?\n\nCreating, deleting or remotely mounting large disk images can take some time; and Brazil waits for the shell to finish these operations before executing any other commands. Think of this as an opportunity to do some healthy stretching.\n\nDoes Brazil store disk images passwords?\n\n The only passwords Brazil stores are the Logon and Paranoia passwords. The passwords for your disk images are not retained.  If you forget your disk image password you will be unable to access the contents of the disk image.\n\nWhat does Paranoia do?\n\nThe Paranoia setting enables you delete all of your disc images at the startup password prompt by entering a special password. There are no further dialogs or any indication that this process is taking place. This feature is for extreme CYA.\n\nCan I use the Paranoia feature besides at Startup?\n\nYes.  If you have enabled Paranoia, clicking on the &amp;#039;Delete&amp;#039; button while holding the Shift and Option keys will cause Brazil to securely delete all of your disk images. There will be NO warning dialog, so be careful with this feature.\n\nWhat if I forget my Logon password?\n\nYou are fucked.\n\nCan I mount my disk images without using Brazil?\n\nYes.  If the image is visible just double-click the image and enter your password when prompted.\nIf the image is invisible you will need to make it visible by removing the &amp;#039;.&amp;#039; in front of its name.  This can be done using Brazil or using the Terminal.\n\nHow do I set up a remote disk image?\n\nCreate a disk image using Brazil or Disk Utility.  Next upload it to the directory where your web page resides.\nRemote users may then use Brazil to mount the disk image.  Note: remote disk images are read-only.","torrent":{"xt":"urn:btih:63998902d6509e3c0cba8afef3363c7cc95ea3c6","amp;dn":"Brazil+Disk+Image+Encryption+System","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63998902d6509e3c0cba8afef3363c7cc95ea3c6","infoHashBuffer":{"type":"Buffer","data":[99,153,137,2,214,80,158,60,12,186,138,254,243,54,60,124,201,94,163,198]},"announce":[],"urlList":[]}}