{"title":"U2 1983-06-05 Red Rocks Soundboard","uid":4222799,"size":557712985,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:63c331c101f2b8d69499732a49658f83b14969e6&amp;dn=U2+1983-06-05+Red+Rocks+Soundboard&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"u2unes","files":23,"time":1212678776,"description":"Brought to you by www U2unes com\n\n=====\n\nU2\n1983-06-05 Red Rocks Amphitheater, Morrison (Denver), Colorado\n\nDisc One\n--------\n01  Out Of Control\n02  Twilight\n03  An Cat Dubh\n04  Into The Heart\n05  Surrender\n06  Two Hearts Beat As One\n07  Seconds\n08  Sunday Bloody Sunday\n09  The Cry / Electric Co.\n\nDisc Two\n--------\n01  I Fall Down\n02  October\n03  New Year&amp;#039;s Day\n04  I Threw A Brick Through A Window\n05  A Day Without Me\n06  Gloria\n07  Party Girl\n08  11 O&amp;#039;Clock Tick Tock\n09  I Will Follow\n10  &quot;40&quot;\n\nSource: Soundboard Master &gt; DAT &gt; CDR Master &gt; EAC (WAV) &gt; MKW (SHN) &gt; TLH (WAV) &gt; iTunes (Apple Lossless)\n\nU2?s now-legendary Red Rocks show on June 5, 1983, had all the makings for a classic disaster.\n\nThe weather bordered on sleet and rain all day ? hardly idyllic conditions for a video shoot that included countless cameras and three giant torches sitting atop the rocks.The promoters were in California until the afternoon of the show, and when they flew into a blustery Stapleton Airport, they called the mountain amphitheater?s backstage to see where the show had been moved.\n\nBut the band wasn?t about to move the concert.\n\n?I asked them why they didn?t call me, and the people said, ?The band wouldn?t let us, because they knew you?d want to move the show,? ? retired promoter Barry Fey remembered.\n\n?Then Paul McGuinness, their manager, got on the phone, and then Bono got on the phone, and then Chuck (Morris) and I headed home to change out of our sunny California gear into something much heavier before heading up to Red Rocks.?\n\nAs fans, local and abroad, mark the 25th anniversary of the legendary show ? captured dramatically on video and record under the title ?Under the Blood Red Sky? ? record companies will also use the occasion as their opportunity to remaster the music on a CD (with a bonus disc), due in stores June 24, and finally release the remarkable performance on DVD, due in August.\n\nThe video, a venture among the band, their label and Feyline Concerts, captures the enduring image of U2?s early years. It was played heavily on MTV, and it?s been credited as the single piece of media that solidified U2?s reputation as an epic live band ? and Red Rocks? status as the world?s premiere outdoor amphitheater.\n\nIt was no accident that U2 chose Red Rocks as the location for their live video experiment, an outing that cost the band their life savings, they said at the time.\n\nIn the summer of 1981, U2 played two shows in Colorado, at Fort Collins? Lincoln Center and Denver?s Rainbow Music Hall. The day after the Rainbow show, promoter Morris, working with Fey at the time, loaded the band in his Jeep for a field trip.\n\n?I took them up to Red Rocks so they could see it,? Morris said. ?I told them they were going to play there some day. But their second record wasn?t doing that well, even though it got great reviews, and they weren?t so sure. But I was. I drove them to the top. We walked down to the stage, and they were, like, ?Oh my God, this is the greatest place we?ve ever seen.? ?\n\nYears later, McGuinness was sitting in Fey?s office, setting up a partnership with the band, the promoter and the label, Island Records, to shoot a live video at Red Rocks. Everybody was happy.\n\nUntil the morning of the show, when the weather was so foul. A group of 15 or 20 hard-core fans sat in the front rows at Red Rocks under their ponchos, and around 10 or 11 a.m., Bono found his way to the catering room backstage, where he met Nancy May, who was running errands for Fey at the time.\n\n?(Bono) was suddenly in the food room, and he said, ?It?s really cold out there. Can we get these people some coffee and tea?? I said sure, and we made it up, and then Bono went out and served the fans some coffee and tea. He was out there chatting over tea with 10 or 20 people, and we were like, ?Wow.? I?d never seen a rock star do that in all those years.?\n\nThe day progressed, and the weather worsened. Morris and Fey arrived, and Bono called a Denver radio station, telling his fans that the Red Rocks show would go on ? but there would also be another indoor show the following night at the CU Field House in Boulder for those who didn?t want to brave the elements.\n\nAnd after a short introduction from Fey, the show was on. Red Rocks, which holds nearly 10,000 people, was about half-full with 4,400 in attendance. The venue has never looked more mystical, alluring. Red Rocks was ready for its close-up.\n\n?For years, when I told people in L.A. that I worked at Red Rocks, people would always say, ?Did you see the U2 video?? ? said May, now a production manager for the Denver Performing Arts Center. ?When I went to Los Angeles to work for Dick Clark, everybody knew that video. And everybody knew Red Rocks because of that video.?\n\nLooking back at the 25-year-old footage, it?s amazing how powerful it remains. The band couldn?t have purchased those kinds of special effects: The sleety mist softened all the edges, and the steam coming out of Bono?s mouth with each word gave the footage an otherworldly feel.\n\nAnd they were just kids. The Edge still had hair, and you could hear his towering backup vocals waver as he nervously looked down at his guitar. Alternating between a little girl?s skip and a soldier?s march, Bono had never looked stronger. ?This song is not a rebel song,? he said at one point, wearing a sleeveless shirt and looking like an ?80s movie star. ?This song is ?Sunday Bloody Sunday.? ? The band?s 6-minute take on their beloved anthem was capped with Bono planting a white flag of truce in the crowd, and it?s one of the most iconic moments in rock history. And it was a Sunday.\n\n?One person remarked that it was a religious experience, and it was,? said Greg Wigler, one of three professional photographers at the show. ?The show was way beyond anything I?d seen before.?\n\nFans agreed. ?Under a Blood Red Sky? is the all-time best-selling recording in the U.K. Fey jokes that he recouped his investment very quickly.\n\n?But had it been another 78 degree day, it would have been just another concert,? Fey said. ?Instead it was an amazing concert. You knew you were seeing some kind of history. I stood alone at the side of the stage, and my feet were locked. I couldn?t go anywhere.?\n\nMorris calls it ?one of my finest hours of promoting.?\n\n?The way Bono played with the crowd, getting all into the audience, and the way the fire looked up on the sides with the rain coming down, and everyone was freezing, but they couldn?t care less. In my long career, nothing has come close to that.?\n\nA popular rumor every other summer is that U2 is coming back to Red Rocks. But for 25 years now, that?s been nothing but a rumor.\n\n?I can?t speak for the band on something like that,? Morris said. ?Would I love it? Absolutely.?\n\nAdded Fey: ?I asked them many years ago, ?You wanna give Red Rocks another try?? They said, ?Absolutely not.? And you can?t blame them. They couldn?t do anything that would be comparable to that. This is the 25th year, and I asked them if they wanted to do it again. But you can?t duplicate that. You?d be foolish to try and duplicate that. It would be like going to Humphrey Bogart and Ingrid Bergman and saying, ?Hey, let?s shoot ?Casablanca? over again.? ?\n\nBy Ricardo Baca, Denver Post Pop Music Critic\n\n","torrent":{"xt":"urn:btih:63c331c101f2b8d69499732a49658f83b14969e6","amp;dn":"U2+1983-06-05+Red+Rocks+Soundboard","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"63c331c101f2b8d69499732a49658f83b14969e6","infoHashBuffer":{"type":"Buffer","data":[99,195,49,193,1,242,184,214,148,153,115,42,73,101,143,131,177,73,105,230]},"announce":[],"urlList":[]}}