{"title":"Gale Robbins - I'm A Dreamer  1957","uid":4178206,"size":64972643,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:645080c0f0918b18a74eccb5eb58fcfe799be85c&amp;dn=Gale+Robbins+-+I%5C%27m+A+Dreamer++1957&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"glum22","files":13,"time":1210255242,"description":"Gale Robbins - I&amp;#039;m A Dreamer  1957\n\n\n\n\n\nLittle known singer/actress Gale Robbins was a knockout-looking blue-eyed redhead who made a slight dent in post-war Hollywood. Born in Mitchell, Indiana (some say Chicago, Illinois) on May 7, 1921 (some say 1924), and educated at Jennings Seminary at Aurora, Illinois and Flower Tech. in Chicago, Gale had a natural flair for music and appeared in glee clubs and church choirs in the early days. She started out in entertainment as a model for the Vera Jones Modeling School in Chicago, but her singing talents soon took over. Signed by a talent agency, she teamed with some male singers for a swing band and called themselves &quot;The Duchess and Her Dukes.&quot; She went on to work with some of the top radio and live &amp;#039;big bands&amp;#039; of that era including the Ben Bernie, Jan Garber, and Hal Kemp orchestras. 20th Century-Fox caught sight of this looker and quickly signed her up, her first film being the pleasant time-filler In the Meantime, Darling (1944). A semi-popular cheesecake pin-up, Gale appeared on the cover of &quot;Yank, The Army Weekly&quot; in 1944 and toured with Bob Hope in Europe the next year. Her post-war parts, mostly sultry second leads, were typically lightweight in nature. Moreover, she was often lent out to other studios and not always in a singing mode. Gale&amp;#039;s better known film work includes Race Street (1948), The Barkleys of Broadway (1949), Three Little Words (1950), The Fuller Brush Girl (1950) and Calamity Jane (1953). She hosted the &quot;Hollywood House&quot; TV program in 1949 and appeared on &quot;The Colgate Comedy Hour&quot; in 1951. In the late 50s the gal with the smooth and sexy vocal style put out an easy-listening album (&quot;I&amp;#039;m a Dreamer&quot;) for the Vik Label backed by Eddie Cano &amp; His Orchestra. She covered such standards as &quot;Them There Eyes&quot; and &quot;What Is This Thing Called Love.&quot; After her last film Quantrill&amp;#039;s Raiders (1958) and some additional TV parts, Gale decided to phase her career out to focus full-time on raising her family. When her husband, a construction engineer, was tragically killed in a 1968 building accident, Gale, left with two daughters to raise, decided to make a comeback of sorts. Besides appearing in nightclubs, she was glimpsed in the film Stand Up and Be Counted (1972) and appeared on stage in Stephen Sondheim&amp;#039;s musical &quot;Company&quot; in 1975. She died of lung cancer in 1980.\n\n\n\n\n\n\n1. What Is This Thing Called Love\n2. Them There Eyes\n3. How Deep Is The Ocean\n4. Ain&amp;#039;t Nothin&amp;#039; Wrong With That Baby\n5. Golden Earings\n6. The Nearness Of You\n7. They Can&amp;#039;t Take That Away From Me\n8. Here I Go\n9. I&amp;#039;m A Dreamer, Aren&amp;#039;t We All\n10. Best Of All\n11. Music, Maestro, Please\n12. Ain&amp;#039;t Misbehavin&amp;#039;\n\nRecorded in Hollywood, 1957","torrent":{"xt":"urn:btih:645080c0f0918b18a74eccb5eb58fcfe799be85c","amp;dn":"Gale+Robbins+-+I%5C%27m+A+Dreamer++1957","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"645080c0f0918b18a74eccb5eb58fcfe799be85c","infoHashBuffer":{"type":"Buffer","data":[100,80,128,192,240,145,139,24,167,78,204,181,235,88,252,254,121,155,232,92]},"announce":[],"urlList":[]}}