{"title":"Contact your US Senators and congress for free with cheat sheet","uid":4064430,"size":686643,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:645adc48dc465fdf5741f34339b9a2a5206c182e&amp;dn=Contact+your+US+Senators+and+congress+for+free+with+cheat+sheet&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vcab100","files":8,"time":1204738657,"description":"Contact your US Senators for free w/cheat sheet\n\nFree and easy way to let your state senators know what you think about current issues\n\nCall this Toll Free 800 number and it will automatically direct you to the appropriate senator for your state.  These numbers are paid for by foreign national groups and organizations whose only concern is immigration and don&amp;#039;t care about America as a whole. \n\nI was totally surprised to find out that foreign nationals are claiming our senators and congressmen as their own and lobbying them directly.  They are handing out flyers at their churches and other gatherings to garner support for their agendas.  I picked up one of the copies at a church gathering myself.\n\nTwo of the groups are La Raza (http://www.discoverthenetworks.org/groupProfile.asp?grpid=6781) and the Re-Conquistas (http://www.freerepublic.com/focus/f-news/1416424/posts)\n\nHere are the numbers:  \n1-800-417-7666 (English)\n1-800-882-2005 (spanish)\n\nYou are up against many corporations with a lot of money who are also lobbying our representatives to benefit their own financial goals so it is probably a good idea to call as often as you can. (Daily or weekly at a minimum) (It is free, and only takes a few minutes.)\n\nHere are a few of the points you may want to remember when you call. (Use as you wish)\n\n1.\tIf you vote for any kind of amnesty bill for immigrants I will not be supporting you financially or voting for you.\n2.\tI am tired of our politicians using this false terrorist excuse to tear apart our constitution and remove our rights. Leave our rights alone!\n3.\tI am tired of this open trade policy which is de-valuing the dollar and wiping out our manufacturing base.  Please stop sending our jobs over-seas.  I would like to see NAFTA and CAFTA repealed and the North American Union dissolved.  Please start protecting our national sovernty.\n4.\tI cannot continue to stand by while our country goes to other countries and kills their people to cut off the oil supplies and raise our gas prices.\n5.\tI am tired of our country sending our soldiers over seas to protect the borders of other countries while our borders are wide open and the influx of 36 million illegal entries into our country is about to bring down our public services.\n6.\tWe want a new law which states that all babies born in the United States are only citizens if their parents are both already citizens.\n7.\tWe are tired of all the double speak, spin and lies emanating out of Washington.  Please don&amp;#039;t tell lies or you will be called out on it.\n8.\tPlease stop the control of the media by government agencies.  We are tired of the lies and propaganda we are bombarded with daily.\n9.\tWe know the FDA is a farce which just takes money from the pharmaceutical companies and do not help the people in any way.  Please get this fixed.\n10.\tWe will not continue to stand by while our public servants blatantly commit treason and high treason without consequences.\n11.\tI oppose the Real ID act, please do not support it.  I will not tolerate any kind of chipping programs either.\n\n\n\nYou have to have your ZIP+4 zip code to locate your congressman.\nYou can get your +4 from here: &lt;a href=&quot; http://zip4.usps.com/zip4/welcome.jsp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://zip4.usps.com/zip4/welcome.jsp&lt;/a&gt;\n\nFind your local congress contact information here: &lt;a href=&quot;\nhttp://www.house.gov/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.house.gov/&lt;/a&gt;\n","torrent":{"xt":"urn:btih:645adc48dc465fdf5741f34339b9a2a5206c182e","amp;dn":"Contact+your+US+Senators+and+congress+for+free+with+cheat+sheet","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"645adc48dc465fdf5741f34339b9a2a5206c182e","infoHashBuffer":{"type":"Buffer","data":[100,90,220,72,220,70,95,223,87,65,243,67,57,185,162,165,32,108,24,46]},"announce":[],"urlList":[]}}