{"title":"Fergie - Clumsy","uid":4240593,"size":148279300,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:6515c6b9f9f65cc9da60e44941f5b5687f830bc7&amp;dn=Fergie+-+Clumsy&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"2nafish","files":1,"time":1213523460,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 kbps\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nThe music video for &quot;Clumsy&quot; is directed by Marc Webb and Rich Lee. It was wrapped up on September 7, 2007. The video premiere was on AOL Music site in October 12, 2007. The video premiered on iTunes October 26, 2007.\n\nThe video is done in the style of a pop-up book. It begins with the book opening, displaying the directors&amp;#039; names, the artist and the title. Fergie begins to sing and the page flips to reveal a little pop-up concert, featuring Fergie with a beehive hairstyle, followed by a pop-up of a Dsquared fashion show where Fergie becomes attracted to a man (Swedish supermodel and Professional Paintball Player for the Russian Legion, Alex Lundqvist) in the audience. Another page flip reveals Fergie in a car, and she sees the man again. She then shows off with the car, but it breaks down and the man leaves. At the song&amp;#039;s bridge she is singing in a pop-up rocket and at the same time at the concert she then knocks down a dancer and the concert begins to fall down. While in the rocket she pushes the &quot;airlock&quot; button, which blows the man out of the rocket. After this, it shows Fergie in a plane flying around a pop-up world. To conclude the video, Fergie is getting ready on a rooftop photo shoot and she sits down on a ledge to read a message and she falls off the building and is caught by the man. They walk off toward a sunset and the book closes.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:6515c6b9f9f65cc9da60e44941f5b5687f830bc7","amp;dn":"Fergie+-+Clumsy","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6515c6b9f9f65cc9da60e44941f5b5687f830bc7","infoHashBuffer":{"type":"Buffer","data":[101,21,198,185,249,246,92,201,218,96,228,73,65,245,181,104,127,131,11,199]},"announce":[],"urlList":[]}}