{"title":"Sexually Broken--Asian fuck doll Kalina Ryu shackled down blindf","uid":12837913,"size":892002781,"categoryP":"porn","categoryS":"hd___movies","magnet":"?xt=urn:btih:653c9f1a93e615038340c156827cb68ded09f698&amp;dn=Sexually+Broken--Asian+fuck+doll+Kalina+Ryu+shackled+down+blindf&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"merzedes","files":1,"time":1448475276,"description":"\nAsian fuck doll Kalina Ryu shackled down blindfolded and fucked without mercy by hard cock! | Kalina Ryu | Maestro | Jack Hammer \r\n\r\nNovember 25, 2015\r\n\r\n\r\nHigh MP4 only.\r\n\r\n\r\nBent over blindfolded fuckdoll roughly taken from both ends \r\n \r\nWe couldn’t help ourselves. We had to have her back. And if you have ever seen the legendary Asian fuck doll go at it, you would understand why. Kalina Ryu is unstoppable. She devours men. She just laughs at the dick you throw at her. She can not be sexually broken, we realized that long ago. These days, we are content with just fucking her until we get winded.\r\n\r\nThe bondage is just to give us a fighting chance. We will still lose of course, but anything to give us an edge. Bent over in half and shackled to a wooden post with her flawless ass jutting out, Kalina is ready to do. A blindfold cuts off all vision, reducing her to nothing but a mouth and pussy. She loves it of course. Kalina was born to be a cheerful bag of holes. A bag of holes that destroys men. Here goes nothing.\r\n\r\nWe tag team back and forth, taking whichever end we so desire. The strict metal shackles keep her wrists and neck firmly in place. She can not escape or dodge the dick. All she can do is take what we dish out. Which she does. With relish. It doesn’t matter how hard we fuck her, we can not wipe that huge grin off her face. It is a futile task. She drools and cums and drools some more, an Asian fuckdoll in her happy place.\r\n\r\nWe stop when we run out of breath. It is pointless to try and sexually break this one. If we didn’t have her bound, she would chase us down and fuck us to death. Asian fuck doll, you win again. Like you do. We always have fun trying, but the outcome is always the same. This one is indestructible.  \r\n\r\nScreens \nhttp://www.sexuallybroken.com/sexual/bondage/trailer.php?y=2015&amp;p=11_25kryu4&amp;u=SexuallyBroken-Kalina-Ryu-Maestro-Jack-Hammer-Asian-fuck-doll-Kalina-Ryu-shackled-down-blindfolded-and-fucked-without-mercy-by-hard-cock\r\n\r\nUploaded by Merzedes and Shallow2\r\n\r\n19 000 Femdom/BDSM/Fetish torrentuploads completed. Man.. feels like every 1000 goes by faster and faster ;)\r\n\r\nJust keep on leaving us the nice comments below and we are happy :)\r\n\r\nAny Questions ?? Read our FAQ!!\r\n \nhttps://yuq.me/users/23/079/W2kwa6hEeP.png\r\n \nhttp://s16.postimg.org/rxyfmji7p/Merzedes_Shallow2_FAQ_The_Pirate_Bay.jpg\r\n\r\nCheers :-)","torrent":{"xt":"urn:btih:653c9f1a93e615038340c156827cb68ded09f698","amp;dn":"Sexually+Broken--Asian+fuck+doll+Kalina+Ryu+shackled+down+blindf","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"653c9f1a93e615038340c156827cb68ded09f698","infoHashBuffer":{"type":"Buffer","data":[101,60,159,26,147,230,21,3,131,64,193,86,130,124,182,141,237,9,246,152]},"announce":[],"urlList":[]}}