{"title":"Land of Look Behind (Movie &amp; Soundtrack)","uid":4225155,"size":976607431,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6584bbcf886ca5fe99498d4f82c9f0a13763e42f&amp;dn=%09Land+of+Look+Behind+%28Movie+%26+Soundtrack%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"binkles","files":42,"time":1212785364,"description":"    Runtime ..........: 1:29:50                       \n    Language .........: English                                                             \n    IMDb URL..........: http://imdb.com/title/tt0157918/                              \n    Video Codec ......: DivX \n    Resolution .......: 640 x 480\n    Audio Codec ......: mp3 \n    Audio Bitrate ....: 128kbps\n    Subtitles ........: Most of it has English subs \n\n\n** Land of Look Behind.srt is the subtitle file now included in this re-seed.  For those that have already downloaded the other files, please manually select this one file and download it to the Land of Look Behind (Movie &amp; Soundtrack) folder. \n\n\n--------------------------------------------------------------------------\n\n\nJAMAICA IS THE &amp;#039;LAND OF LOOK BEHIND&amp;#039;\n\nBy ROBERT PALMER \nPublished: December 26, 1982\n\nIn his book &amp;#039;&amp;#039;Heart of Glass,&amp;#039;&amp;#039; Alan Greenberg describes how Werner Herzog made a film of that name with the entire cast under hypnosis. The Jamaican reggae musicians, poets and mystics who drift through Mr. Greenberg&amp;#039;s first film, &amp;#039;&amp;#039;Land of Look Behind,&amp;#039;&amp;#039; could easily be mistaken for subjects in a hypnosis experiment that somehow went awry. But one suspects that they are simply in a haze of smoking the potent marijuana cigars that the island&amp;#039;s Rastafarians call &amp;#039;&amp;#039;spliffs.&amp;#039;&amp;#039; \n\n&amp;#039;&amp;#039;Land of Look Behind,&amp;#039;&amp;#039; which can be seen at the Film Forum today at 4, 6, 8 and 10 P.M. and Tuesday at 6, 8 and 10 P.M., takes a leisurely swing around Jamaica during May and June, 1981 - the months following the death of Bob Marley, who popularized reggae music around the world. It begins in Trelawney Parish, in the Look Behind forest, where a countryman warns of &amp;#039;&amp;#039;sinkholes, cliffs that drop off, that you fall off and you die, and you are never seen again.&amp;#039;&amp;#039; Next, the roving camera moves along to Mr. Marley&amp;#039;s funeral, and to a dreadlocked Rasta on a Kingston street corner who says, &amp;#039;&amp;#039;Reggae is the best, not just a little rocky-rocky something. Some people think Mr. Marley&amp;#039;s death is a blow to reggae. We miss him, yes, but the work must go on.&amp;#039;&amp;#039; \n\nA concert sequence showcases the melliflous singing of Gregory Isaacs, whose lyrics, &amp;#039;&amp;#039;a rich man&amp;#039;s heaven is a poor man&amp;#039;s hell,&amp;#039;&amp;#039; are characteristic of reggae&amp;#039;s social conscience. The camera passes Gun Court, a prison stockade where a man cries out through a slit in the wall, &amp;#039;&amp;#039;My name is Keith, man. Life sentence.&amp;#039;&amp;#039; And finally we take a dirt road back to Look Behind, where Rastas smoke their dutchies (pipes) and let their bloodshot gazes rest on the whitecaps of the Caribbean, and on the horizon that separates Central and South America from Africa. \n\nMr. Greenberg&amp;#039;s cinematographer was Jorg Schmidt-Reitwein, a longtime associate of Werner Herzog, and his eye for color and detail and use of a pleasantly grainy film stock give &amp;#039;&amp;#039;Land of Look Behind&amp;#039;&amp;#039; its distinctive appearance and texture. K. Leimer&amp;#039;s electronic background music contributes some drama and a sense of movement. But the film is basically static. \n\n&amp;#039;&amp;#039;Land of Look Behind&amp;#039;&amp;#039; began as an exploration of Bob Marley&amp;#039;s contributions to Jamaican pop music and Jamaican life. But somewhere along the way it became something different, a kind of meditation on the is@land&amp;#039;s music and religion, its traditions and its pride, the feel of its inhabitants&amp;#039; everyday activities and some of their hopes for the future. &amp;#039;&amp;#039;Land of Look Behind&amp;#039;&amp;#039; won&amp;#039;t satisfy viewers who like having things spelled out for them, whether by a voice-over or a mundane, predictable plot. It has neither, and that is both its minor weakness and its distinguishing strength.\n\n\n--------------------------------------------------------------------------\n\nThe DVD\n\nVIDEO:\n\nThe film was shot on 16mm in harsh conditions. The grain is visible. They&amp;#039;ve gone through a lot to clean up the image, but it is far from pristine. The picture is 1.78:1 anamorphic. \n\nAUDIO:\n\nThe soundtrack is Mono. Th sound is rather rough with the field recordings. The levels are good enough so you don&amp;#039;t have to crank the system. The audio commentary track features Greenberg and Werner Herzog. Norman Hill, the producer of the DVD does an exceptional job at keeping them talking and explaining elements including the title. There are plenty of weird stories about the crew being kidnapped at gunpoint and a producer stealing the budget. The subtitles are in English. \n\nEXTRAS:\n\nExploring Land of Look Behind (24:21) has director Alan Greenberg explaining how the film came around. The ghost of Bob Marley requested he make the film. \n\nWorking with Herzog (18:01) explores how Greenberg dropped everything to work with Herzog in Germany.\n\nCast &amp; Crew Bios are short text pieces on various folks in the project. \n\nThe Soundtrack has 18 tracks that mixes audio from the film with reggae songs from Bob Marley and the Wailers. \n\n--------------------------------------------------------------------------\n\n &lt;a href=&quot;\nhttp://www.amazon.com/Land-Look-Behind-Gregory-Isaacs/dp/B000HXDWT6/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Land-Look-Behind-Gregory-Isaacs/dp/B000HXDWT6/&lt;/a&gt;","torrent":{"xt":"urn:btih:6584bbcf886ca5fe99498d4f82c9f0a13763e42f","amp;dn":"%09Land+of+Look+Behind+%28Movie+%26+Soundtrack%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6584bbcf886ca5fe99498d4f82c9f0a13763e42f","infoHashBuffer":{"type":"Buffer","data":[101,132,187,207,136,108,165,254,153,73,141,79,130,201,240,161,55,99,228,47]},"announce":[],"urlList":[]}}