{"title":"Led Zeppelin 1973.07.06 - Chicago - Soundcheck","uid":4117274,"size":99163555,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:65cc525b83582b35922a9ba0885963acf97d7c67&amp;dn=Led+Zeppelin+1973.07.06+-+Chicago+-+Soundcheck&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TimD54","files":23,"time":1207371569,"description":"We&amp;#039;re staying in Chicago this week, for a treat that&amp;#039;s been underground\nfar too long.  I&amp;#039;m talking about the 7.6.73 soundcheck, variously known\nas &quot;Soundcheck&quot; or &quot;Johnny Kidd and the Pirates&quot; or &quot;A Tribute To Johnny\nKidd and the Pirates.&quot;  This is, of course, the Soundcheck version,\nwhich is Master &gt; DAT &gt; FLAC thanks to Presence.\n\nJohnny Kidd and the Pirates were a very popular and influential pop\ngroup from England before the Liverpool sound of the Beatles became\ndominant on the music scene - everyone must have known of them, and they\nincluded Clem Cattini on drums at one time.  They dressed like pirates\nonstage and have been thought of as a novelty act because of this, but\nwere quite underrated and a quality band throughout their career, which\nran through several lineups (members left to form The Tornadoes in 1961,\nand other players came and went throughout 1962 and 1963) and still\nappears occasionally today.\n\nThe point of all this is that the JK&amp;TP tracks &quot;Hungry For Love,&quot;\n&quot;Shakin&amp;#039; All Over,&quot; and &quot;I&amp;#039;ll Never Get Over You&quot; appear at the end of\nthis soundcheck, which also includes several Chuck Berry classics and\nearly R&amp;B numbers such as &quot;Sugar Baby&quot; and &quot;Move On Down The Line.&quot;\n\nMy recording differs a little from the artwork and the accepted\ntracklist of this bootleg - this is the way I got it, and I take issue\nwith the ID of a few tracks on the boot tracklist - for example, the\nartwork says there is a track called &quot;School Days&quot; but I know &quot;Hail Hail\nRock &amp;#039;n Roll&quot; when I hear it.\n\nAlso on this recording are rehearsal versions of &quot;Night Flight,&quot; &quot;The\nRover&quot; and &quot;The Wanton Song,&quot; mostly incomplete rehearsal rundowns of\nthe tracks - presumably &quot;The Wanton Song&quot; hadn&amp;#039;t been recorded yet, as\nanecdotally it was recorded at Headley Grange in 1974 using the Rolling\ntruck Stones thing parked outside.  &quot;Night Flight&quot; and &quot;The Rover&quot; date\nfrom 1970, even though &quot;The Rover&quot; was recorded in the form we know in\n1974 at the Grange, having started as an acoustic track at Bron-Yr-Aur\nin 1970.  So there are at least two songs here being rehearsed (and\npossibly in the writing process) before having been recorded in their\nfinal form.\n\nAlso interesting is the nature of the recording.  The sound is\noutstanding.  But to be honest, I can&amp;#039;t tell if it&amp;#039;s a soundboard, or\njust a really good AUD with no actual audience in the venue - an AUD\nrecorded in an empty arena by someone with a good recorder would sound\nabout like this.  Guys and gals, this set is a blast to listen to and\nreally shows the mastery and chemistry of our guys playing the music\nthat made them fall in love with rock and roll.  Jimmy&amp;#039;s performance on\n&quot;Hail Hail Rock &amp;#039;n Roll&quot; would make Chuck Berry blush with\nembarrassment.  And you can really hear that the advance in rock music\ncame with the evolution of the rhythm section - you&amp;#039;ll be shocked how\namazing and up-to-date and relevant these old songs sound with Zeppelin\nroaring through them.\n\nAnyway, this is a fun, lighthearted disc that every Zeppelin fan should\nhave in their collection, and now you all can.  \n\nLed Zeppelin\nSoundcheck\nChicago Stadium - 7.6.73\nMaster &gt; DAT &gt; FLAC by Presence\n\n1.  Sugar Baby - 1:34\n2.  Sugar Baby - 3:01 3.  The Wanton Song - 1:13\n4.  The Wanton Song - 0:56\n5.  The Wanton Song - 0:51\n6.  The Rover - 4:20\n7.  The Rover - 2:54\n8.  The Rover - 2:19\n9.  Night Flight - 3:16\n10. Hail Hail Rock &amp;#039;n Roll - 2:45\n11. Nadine - 1:02\n12. Round and Round - 3:03\n13. Move On Down The Line - 2:06\n14. Love Me Like A Hurricane - 2:32\n15. Come On - 1:25\n16. Dynamite - 0:26\n17. Shakin&amp;#039; All Over - 2:30\n18. Hungry For Love - 2:01\n19. I&amp;#039;ll Never Get Over You - 2:08\n20. Reelin&amp;#039; and Rockin&amp;#039; - 2:47 \n","torrent":{"xt":"urn:btih:65cc525b83582b35922a9ba0885963acf97d7c67","amp;dn":"Led+Zeppelin+1973.07.06+-+Chicago+-+Soundcheck","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"65cc525b83582b35922a9ba0885963acf97d7c67","infoHashBuffer":{"type":"Buffer","data":[101,204,82,91,131,88,43,53,146,42,155,160,136,89,99,172,249,125,124,103]},"announce":[],"urlList":[]}}