{"title":"Southland Tales DVDRip XviD-CROPTHIS","uid":4067226,"size":1480181566,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:661c3fc289b90fcd3e76b4bfd8d98e235e0d8949&amp;dn=Southland+Tales+DVDRip+XviD-CROPTHIS&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"hysoka","files":4,"time":1204858593,"description":"More Movies at\n\n\nwww overget com\n\n\n\nTitle ...: Southland Tales\nGenre ...: drama / comedy     \nRelease.date : 04-03-08\nRating ..:   6.6 / 2,639      \nRun.time ....: 144 min\nSize ....: 1.37 G          \nImdb ....: http://www.imdb.com/title/tt0405336/\n\nTechnical info:\nBitrate ...: 1492 kb/s\nResolution : 640 x 256\nAudio .....: AC3 English\n\nPlot Summary:\nCalifornia is at the epicenter of a political and environmental disaster that threatens to destroy the world in this ambitious fusion of comedy, drama, dystopia science fiction, and music. In the year 2005, a nuclear attack wipes out part of the state of Texas, and three years later America is a virtual police state, with the government taking control of nearly every part of people&amp;#039;s lives, supposedly for their own good. A German firm has found a way to generate energy using seawater, but both public and private concerns are desperate to prevent the new technology from being introduced in the gasoline-starved United States. A Marxist underground based on the West Coast is determined to bring down the federal government through violent revolution. In this midst of this chaos, we follow a number of stories that continually return to three principle characters. Boxer Santaros is an actor famous for his role in action films; he&amp;#039;s trying to secure financing for a new project, but reality keeps mirroring the events in his script and he struggles to hold on to his identity following a bout with amnesia. Krysta Now is a porn star who is reinventing herself as a television pundit offering her views on politics, contemporary culture, and teenage sex. And Roland Taverner is an L.A. police officer whose identity has mysteriously split in two and he struggles to track down his other half.\n\nwww overget com","torrent":{"xt":"urn:btih:661c3fc289b90fcd3e76b4bfd8d98e235e0d8949","amp;dn":"Southland+Tales+DVDRip+XviD-CROPTHIS","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"661c3fc289b90fcd3e76b4bfd8d98e235e0d8949","infoHashBuffer":{"type":"Buffer","data":[102,28,63,194,137,185,15,205,62,118,180,191,216,217,142,35,94,13,137,73]},"announce":[],"urlList":[]}}