{"title":"Coast to Coast Radio Program! Commercial Free! May 4th thru May","uid":4187159,"size":499831501,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:664d5b64044e8c75e9c6c6bf1f81b32dbc0cfff3&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+May+4th+thru+May+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stokeman","files":45,"time":1210735083,"description":"Expanding the Consciousness of the entire planet! Coast to Coast with George Noory! Yes, my friends, it is another weekly upload of C2C! I&amp;#039;m sorry I&amp;#039;m a little late, but I&amp;#039;m sure you all expect that from me every now and then. I hope you all enjoy these uploads and I hope you all share them with other sites and many other people. Thanks in advance to the seeders and leechers. Keep it up! Later All! Until we meet again next week. Stokeman Out.......\n\n\nSunday May 4th, 2008\nIntuition &amp; Synchronicity\nIn the middle two hours, counselor, educator, and healer Colette Baron-Reid discussed shared consciousness, synchronicity, and the scientific underpinnings of intuition. She described experiencing &quot;retro cognition,&quot; knowing details of the past and... \nHost: George Noory\nGuest(s): Colette Baron-Reid, Lionel Fanthorpe, Bruce Burgess\n\nMonday May 5th, 2008\nPower of the Crystal Skulls\nScientific researcher of ancient artifacts, Richard Shafsky discussed his work with the Mayan crystal skull and how it has conveyed important information about Earth history and changes. He was first introduced to the Mayan skull in the 1970&amp;#039;s via a Mayan... \nHost: George Noory\nGuest(s): Richard Shafsky, Al Bielek, Jim Berkland\n\nTuesday May 6th, 2008\nMen, Women, &amp; Stress\nRelationship expert Dr. John Gray discussed his latest work on how men and women handle stress differently, due to gender-related chemical differences. Most &quot;lifestyle&quot; diseases are the result of how we respond to stress, he noted. Stress can cause...\nHost: George Noory\nGuest(s): John Gray, Noe Torres, Ruben Uriarte, John M. Curtis, Christian Wilde, Richard C. Hoagland\n\nWednesday May 7th, 2008\nMemoirs of a Remote Viewer\nWriter and physicist Russell Targ discussed his new memoir Do You See What I See?, which chronicles his tale as a visually impaired scientist who helped create the Remote Viewing program at SRI, and offers info on how to separate the psychic signal from... \nHost: George Noory\nGuest(s): Russell Targ, Dean Pomerleau\n\nThursday May 8th, 2008\nWater as Fuel Supplement\nDuring the middle two hours, Ari Cohen &amp; Fred Gutierrez of water4gas spoke about the technology for converting water into hydrogen, which can be used as a supplement for gasoline or diesel in order to boost performance and increase gas mileage. The... \nHost: George Noory\nGuest(s): Walter L. Wagner, Ari Cohen, Fred Gutierrez\n\nFriday May 9th, 2008\nUnbelievable True Stories\nDuring Open Lines, George offered a special line for callers who have told true stories to people who would not believe them. Joyce said a 6-ft tall &quot;dark-hooded figure&quot; appeared by her bed one night, with a &quot;small, impish figure&quot; standing next to him.... \nHost: George Noory\nGuest(s): Open Lines, Jeffrey L. Peckman\n\nSaturday May 10th, 2008\nRich Get Richer on Gov&amp;#039;t Subsidies\nPulitzer Prize-winning reporter for The New York Times, David Cay Johnston discussed his book, Free Lunch, which exposes how everyone from golf course developers and sports team owners to Paris Hilton and other super rich are getting richer off of government...\nHost: Ian Punnett\nGuest(s): David Cay Johnston, Carl Zimmer\n\nSunday May 11th, 2008\nThe Monkey Virus\nInvestigator Ed Haslam discussed his research into a 1964 murder of a cancer researcher which links to the JFK assassination and the contamination of the polio vaccine. In describing the complex web of intrigue that he had uncovered, he said, &quot;I look... \nHost: Ian Punnett\nGuest(s): Ed Haslam, Bob Fletcher\n\nMonday May 12th, 2008\nEarth &amp; Solar Changes\nAuthor &amp; researcher Mitch Battros discussed his work on the history and current state of earth changes, including the Sun/Earth connection and the implications of Solar Cycle 24. We&amp;#039;ll see an escalation of earth changes and extreme weather as we move...\nHost: George Noory\nGuest(s): Mitch Battros, James McCanney","torrent":{"xt":"urn:btih:664d5b64044e8c75e9c6c6bf1f81b32dbc0cfff3","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+May+4th+thru+May+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"664d5b64044e8c75e9c6c6bf1f81b32dbc0cfff3","infoHashBuffer":{"type":"Buffer","data":[102,77,91,100,4,78,140,117,233,198,198,191,31,129,179,45,188,12,255,243]},"announce":[],"urlList":[]}}