{"title":"Eric Clapton - Reptile (2001).flac by JuLeBox","uid":4223324,"size":468183851,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:66bb9ae37a003aa3608e1d623e07fe1dad9a31a5&amp;dn=Eric+Clapton+-+Reptile+%282001%29.flac+by+JuLeBox&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SergioPlayboy","files":27,"time":1212698591,"description":"For a musician known to strive for authenticity, Eric Clapton has always been curiously obsessed with appearances, seemingly as interested in sartorial details and hairstyles as in the perfect guitar lick. It&amp;#039;s hard to find two photographs of him from the 1960s and early &amp;#039;70s that appear to be the same person, and even after he formally launched his solo career he switched looks frequently. Thus, the album sleeve of his 13th solo studio album of new material, Reptile, its &quot;concept&quot; credited to the recording artist, seems significant. The album cover shows a smiling Clapton as a child, and there are family photographs on the back cover and in the booklet, along with a current photograph of the artist, who turned 56 in the weeks following the album&amp;#039;s release, in an image that does nothing to hide the wrinkles of late middle age. This photograph faces a sleeve note by Clapton that begins with his explanation of the album title: &quot;Where I come from, the word &amp;#039;reptile&amp;#039; is a term of endearment, used in much the same way as &amp;#039;toe rag&amp;#039; or &amp;#039;moosh.&amp;#039;&quot; (Thanks, Eric. Now, all listeners have to do is find out what &quot;toe rag&quot; and &quot;moosh&quot; mean!) The note then goes on to dedicate the album warmly to Clapton&amp;#039;s uncle. All of this might lead you to expect an unusually personal recording from a man who has always spoken most eloquently with his guitar. If so, you&amp;#039;d be disappointed. Reptile seems conceived as an album to address all the disparate audiences Clapton has assembled over the years. His core audience may think of him as the premier blues guitarist of his generation, but especially as a solo artist, he has also sought a broader pop identity, and in the 1990s, with the hits &quot;Tears in Heaven&quot; and &quot;Change the World,&quot; he achieved it. The fans he earned then will recognize the largely acoustic sound of such songs as &quot;Believe in Life,&quot; &quot;Second Nature,&quot; and &quot;Modern Girl.&quot; But those who think of Clapton as the guy who plays &quot;Cocaine&quot; will be pleased with his cover of another J.J. Cale song, &quot;Travelin&amp;#039; Light,&quot; and by the time the album was in record stores mainstream rock radio had already found &quot;Superman Inside,&quot; which sounds like many of his mid-tempo rock hits of the &amp;#039;80s. This diversity is continued on less familiar material, especially the many interesting cover songs. Somebody, perhaps the artist himself, has been busy looking for old chestnuts, since Reptile contains a wide variety of them: the 1930 jazz song &quot;I Want a Little Girl,&quot; recorded by McKinney&amp;#039;s Cotton Pickers among others; John Greer&amp;#039;s 1952 R&amp;B hit &quot;Got You on My Mind&quot;; Ray Charles&amp;#039; 1955 R&amp;B hit &quot;Come Back Baby&quot;; James Taylor&amp;#039;s 1972 hit &quot;Don&amp;#039;t Let Me Be Lonely Tonight&quot;; and Stevie Wonder&amp;#039;s 1980 hit &quot;I Ain&amp;#039;t Gonna Stand for It.&quot; The two earliest of these songs are old and obscure enough that Clapton is able to make them his own, and he recasts the Taylor song enough to re-invent it, but remaking songs by Charles and Wonder means competing with them vocally, and as a singer Clapton isn&amp;#039;t up to the challenge. He is assisted by the current five-man version of the Impressions, who do much to shore up his vocal weaknesses, but he still isn&amp;#039;t a disciplined or thoughtful singer. Of course, when that distinctive electric guitar sound kicks in, all is forgiven. Still, Reptile looks like an album that started out to be more ambitious than it ended up being. There may be a song here for each of the artist&amp;#039;s constituencies (and, more important to its commercial impact, for every major radio format except talk and country), but as a whole the album doesn&amp;#039;t add up to the statement Clapton seems to have been hoping to make.\n\nWilliam Ruhlmann, AMG\n\n\n\nEAC Log, Cue &amp; Complete Artwork Included.\n\nEnjoy! \t\t","torrent":{"xt":"urn:btih:66bb9ae37a003aa3608e1d623e07fe1dad9a31a5","amp;dn":"Eric+Clapton+-+Reptile+%282001%29.flac+by+JuLeBox","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"66bb9ae37a003aa3608e1d623e07fe1dad9a31a5","infoHashBuffer":{"type":"Buffer","data":[102,187,154,227,122,0,58,163,96,142,29,98,62,7,254,29,173,154,49,165]},"announce":[],"urlList":[]}}