{"title":"zurlini.la.prima.notte.di.quiete","uid":4221992,"size":732121177,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67466c06ffb64a3056d943c7f1c9bf3e8664578c&amp;dn=zurlini.la.prima.notte.di.quiete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"robsonmed2004","files":4,"time":1212634973,"description":"This is forgotten Italian master Valerio Zurlini\\&amp;#039;s third best film after \\&quot;Family Diary\\&quot; and \\&quot;Le Soldattese.\\&quot; It features one of Alain Delon\\&amp;#039;s very best performances and an equally good supporting one from Giancarlo Giannini. Delon plays a hard-drinking and gambling professor of poetry who is fascinated by the sullenness of a beautiful student(Sonia Petrovna) and gradually falls in love with her. He finds out through his gambling buddies that she is involved in a pornography-prostitution operation of some kind. Zurlini\\&amp;#039;s great film uses a slightly over-the-top melodramatic style to delve deep into the existentialist despair of Delon\\&amp;#039;s character as he hangs around the discos of a very liberal and swinging early \\&amp;#039;70s post-sexual-revolution Italy, depressed by all the empty people around him desperately trying to distract themselves any way they can. The underlying Antonioni-like theme of people trying to distract themselves and merge into a crowd rather than individuate and painfully grow is very similar to that of \\&quot;Desert of the Tartars,\\&quot; a film that couldn\\&amp;#039;t be more different than \\&quot;The Professor\\&quot; on the surface. Dario Di Palma\\&amp;#039;s deep-focus color cinematography in this film is one of the most breathtakingly gorgeous displays of virtuosity this side of Carlo Di Palma\\&amp;#039;s soft-focus work in Antonioni\\&amp;#039;s \\&quot;Red Desert.\\&quot; \n\n","torrent":{"xt":"urn:btih:67466c06ffb64a3056d943c7f1c9bf3e8664578c","amp;dn":"zurlini.la.prima.notte.di.quiete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67466c06ffb64a3056d943c7f1c9bf3e8664578c","infoHashBuffer":{"type":"Buffer","data":[103,70,108,6,255,182,74,48,86,217,67,199,241,201,191,62,134,100,87,140]},"announce":[],"urlList":[]}}