{"title":"Deborah Coleman ~ Soft Place to Fall &amp; Livin' On Love","uid":4091569,"size":211741812,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:677be107efa1c40d78c3367fa9d89afee53d6643&amp;dn=Deborah+Coleman+%7E+Soft+Place+to+Fall+%26+Livin%5C%27+On+Love&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gazzjazz","files":32,"time":1206097702,"description":"A great blues-rock-soul guitarist with plenty of energy and talent, who writes &amp; performs most of her own songs.\n\nI&amp;#039;ve included scanned cover art plus a biography &amp; these two great AMG reviews\n\n\nSoft Place to Fall:\n\nReview\tby Michael G. Nastos\n\nFor her third recording, Coleman continues to show the promise that her previous CDs gave a glimpse of. While still \n\nnot as much of a blues devotee as she could be, she gives all indications of being a solid performer, a steadily \n\nimproving vocalist, and a decent guitarist. She wrote three of the 11 cuts here, and they&amp;#039;re the best of the lot. \n\n&quot;What Goes Around&quot; is a good 12-bar tune about cheatin&amp;#039; and messin&amp;#039; around; &quot;Another Hoping Fool&quot; is a slinky blues \n\nnumber about waiting by the telephone for that reassuring late-night call; and the title track sounds much like a \n\nDire Straits tune, especially in the spare guitar playing of Coleman and Jack Holder. Coleman interprets Little \n\nJohnny Taylor&amp;#039;s &quot;If You Love Me Like You Say&quot; in a cool funk mode, jumps into the direct blues of the adapted \n\nclassic &quot;I&amp;#039;m a Woman,&quot; and rocks the Jerry Williams number &quot;Nothin&amp;#039; to Do With Love,&quot; which has all the potential \n\nto be a legitimate hit. On the boogie beat of &quot;Don&amp;#039;t Lie to Me&quot; and the hard swing of the getting-back-to-love \n\nstatement &quot;So Damn Easy,&quot; Coleman changes up a bit to a more authentic blues style. She rocks on the simple &quot;Look \n\nWhat You Do to Me,&quot; rocks even harder for &quot;Confused,&quot; and goes into a more Southern-rock area on &quot;The Day It \n\nComes.&quot; She also uses pop/R&amp;B-ish background vocals on &quot;Look What You Do,&quot; &quot;The Day,&quot; and &quot;So Damn Easy.&quot; Deborah \n\nColeman is still on the trail of eclipsing Sue Foley, Debbie Davies, and Susan Tedeschi to take her place as the \n\nhigh priestess of contemporary blues. While not there yet, she has all the tools and musical ability to reach that \n\nlofty perch. \n\nLivin&amp;#039; On Love:\n\nReview\tby Dave Sleger\n\nDeborah Coleman detected a void in the music stratum and successfully filled it: A lead guitarist/vocalist playing \n\nthe in the male dominated world of blues-rock. Others like Bonnie Raitt and Marie Muldaur have contributed to \n\nvarying degrees in the contemporary blues scene (and other styles) but Coleman with her string of five consistently \n\nstrong albums in only seven years demonstrates that she is serious about her craft and knows her calling as a \n\nblueswoman. Livin&amp;#039; on Love combines slow-grind blues pieces, R&amp;B and gutsy rockers with a soulful voice and \n\nexemplary guitar playing proving that she&amp;#039;s here to stay, not merely passing through. ","torrent":{"xt":"urn:btih:677be107efa1c40d78c3367fa9d89afee53d6643","amp;dn":"Deborah+Coleman+%7E+Soft+Place+to+Fall+%26+Livin%5C%27+On+Love","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"677be107efa1c40d78c3367fa9d89afee53d6643","infoHashBuffer":{"type":"Buffer","data":[103,123,225,7,239,161,196,13,120,195,54,127,169,216,154,254,229,61,102,67]},"announce":[],"urlList":[]}}