{"title":"freebird 2008 DVDRip","uid":4229859,"size":598077556,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:67a1acdf54047f8c7448bd6cdf09263e2e7690ac&amp;dn=freebird+2008+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"greeveso","files":1,"time":1212993806,"description":"Freebird is an independent British comedy that uses the world of motorcycles and rock music as its backdrop.\n\nFred (Gary Stretch), Tyg (Geoff Bell) and Grouch (Phil Daniels), three London motorcycle couriers, set off from London in search of an elusive hippy and his cannabis farm in the Welsh mountains. Fred has found himself making a promise to his old friend The Chairman (Peter Bowles) that whatever situations arise he will not return empty-handed. What was originally intended as a nice weekend in the country becomes a mission.\n\nGrouch has also made a promise: come Monday morning hell be moving himself and his belongings into his new found love Lucindas flat, and finally making an attempt at the world of serious relationships.\n\nAs for Tyg: no such pact. This is a man whos never been further than the outskirts of London, and as far as hes concerned an industrial unit near Heathrow Airport is pretty much the back of beyond. No, Tygs just out for fun: to explore the world; to broaden his horizons; to lose any ignorance and soak up the hospitality of another nation.\n\nBut what are those wild beast noises coming from the woods? And why is the area thronging with revenge-seeking biker gangs? Was that really a seven-foot, lovesick, masked wrestler in the pub? Can the mysterious hippy really see into the future? Perhaps its all just something to do with all those wild mushrooms our intrepid couriers had for breakfast.\n\nIts a three and a half hour journey from London to the Welsh Mountains but for Fred, Tyg and Grouch its just about to turn into the trip of a lifetime. \nWidescreen 5.1 Audio Enjoy\nAsh","torrent":{"xt":"urn:btih:67a1acdf54047f8c7448bd6cdf09263e2e7690ac","amp;dn":"freebird+2008+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"67a1acdf54047f8c7448bd6cdf09263e2e7690ac","infoHashBuffer":{"type":"Buffer","data":[103,161,172,223,84,4,127,140,116,72,189,108,223,9,38,62,46,118,144,172]},"announce":[],"urlList":[]}}