{"title":"black santas revenge","uid":4213048,"size":193084418,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:6827d0d9d8cafae0f911b5db0bf908a6316b22d7&amp;dn=black+santas+revenge&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"starscream86","files":1,"time":1212180565,"description":"\n\nKen Foree (Dawn of the Dead, The Devil?s Rejects, From Beyond) stars in this epic short film based on the popular comic book story that appeared in the pages of BadAzz MoFo magazine.\n\nWritten, produced and directed by BadAzz MoFo creator David Walker, BLACK SANTA?S REVENGE is a two-fisted tale of yuletide vengeance reminiscent of the classic blaxploitation and revenge films of the 1970s and 80s?think William Lustig?s Vigilante meets Ivan Dixon?s Trouble Man. Adapted from the short comic book story drawn by Rusty Beach and written by Walker, the film version of BSR is filled with all the classic elements of exploitation cinema?graphic violence, gratuitous nudity, and tons of profanity?all crammed into a 20-minute running time.\n\nDavid Walker worked closely with Ken Foree, who co-produced BLACK SANTA?S REVENGE, for nearly three years, carefully developing the character and the project into something they could both be proud of. The final result is a ?mini epic? that has quickly developed a loyal cult following. Co-starring Todd Robinson, with original poster art by Stephen Romano and music by Ryan Sorensen (of Engorged fame) and the phenomenal Lifesavas, BLACK SANTA?S REVENGE is destined to become a classic.\n\n","torrent":{"xt":"urn:btih:6827d0d9d8cafae0f911b5db0bf908a6316b22d7","amp;dn":"black+santas+revenge","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6827d0d9d8cafae0f911b5db0bf908a6316b22d7","infoHashBuffer":{"type":"Buffer","data":[104,39,208,217,216,202,250,224,249,17,181,219,11,249,8,166,49,107,34,215]},"announce":[],"urlList":[]}}