{"title":"Black Sabbath - Never Say Die! (1978) (W.B.Rhino Rem. 2004) [EAC","uid":4228362,"size":626490577,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:682c9f2d0d42a57c534fb732c685c1adf34fd087&amp;dn=Black+Sabbath+-+Never+Say+Die%21+%281978%29+%28W.B.Rhino+Rem.+2004%29+%5BEAC&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sworduigi","files":96,"time":1212921855,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure \nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nCodec: Flac 1.2.1;  Level 8  \n\nSource: Found (Ripped by Necromandus)\nArtwork: Full scans + 80 Pages Booklet (600 dpi).\n\n\nGeneral Info:\n\n\nAlbum:  Never Say Die!\n\nLabel Warner Bros/Rhino (2004) \n\n\n          Tracklist:\n   1. &quot;Never Say Die!&quot; ? 3:49\n   2. &quot;Johnny Blade&quot; ? 6:28\n   3. &quot;Junior&amp;#039;s Eyes&quot; ? 6:42\n   4. &quot;A Hard Road&quot; ? 6:04\n   5. &quot;Shock Wave&quot; ? 5:15\n   6. &quot;Air Dance&quot; ? 5:17\n   7. &quot;Over to You&quot; ? 5:22\n   8. &quot;Breakout&quot; ? 2:35\n   9. &quot;Swinging the Chain&quot; ? 4:17\n\n\n\n\n\n                   LINE UP:\n\n        * Ozzy Osbourne ? lead vocals\n    * Tony Iommi ? guitar, backing vocals on &quot;A Hard Road&quot;\n    * Geezer Butler ? bass guitar, backing vocals on &quot;A Hard Road&quot;\n    * Bill Ward ? drums, lead vocals on &quot;Swinging the Chain&quot;, backing vocals on &quot;A Hard Road&quot;\n\n    * Don Airey ? keyboards\n    * John Elstar ? harmonica\n    * Will Malone ? brass arrangements\n    *Dan Hersch, Bill Inglot ? remastering (2004)\n\n\n\nReview taken from metal-observer.com:\nThe first six BLACK SABBATH albums laid out the Ten Commandments of Heavy Metal, or depending on whom you \n\nask, it might just have been the first four. Either way, it?s undeniable ? SABBATH had a huge impact on the Metal \n\nworld, arguably the largest and most forceful impact any band has ever had and most likely will have. After those \n\nalbums, though, the fan base is split deeper and wider than the American public is when it comes to politics. Some \n\nfans renounce anything after ?Sabotage,? discrediting any SABBATH fronted by Dio, Tony Martin, Ian Gillan, or Glenn \n\nHughes as, well, not BLACK SABBATH. On the other hand, there are some who sing the praises of the first six albums \n\nand accept the band?s later works as solid efforts. Rare are the fans in either camp, however, that acknowledge the \n\nexistence of the in-between albums, ?Technical Ecstasy? and ?Never Say Die!? These albums are much maligned by \n\nmany casual and die-hard SABBATH fans alike. Now, I?ll go on the record and say that while I think that the hatred of \n\nthese two records is a bit exaggerated, I pretty much agree when it comes to ?Technical Ecstasy.? On the other \n\nhand, I do not have the same feelings about ?Never Say Die!?\nThis album is a lot more Hard Rock-oriented than other BLACK SABBATH, less riff-driven and more focused on Tony \n\nIommi?s musical experimentations. The band had been incorporating new ideas into their songs ever since ?Vol. 4,? \n\nand each album found an increasing amount of pianos, synths, and other surprises. On ?Technical Ecstasy,? the band \n\nsounded bogged down by these experiments, which, coupled with Ozzy?s poor vocal delivery and the frail production, \n\nseriously wounded the record. On ?Never Say Die!? the experimentation fits in perfectly alongside the hard riffage, \n\nresulting in a record with both variety and flow.\nSure, ?A Hard Road? and ?Shock Wave? are pretty nondescript rockers lacking the usual quality of Tony Iommi?s \n\ntrademarked riffs, but the other songs more than make up for it. The title track starts the album out in upbeat \n\nfashion, and though the song is slightly weak sounding, it?s fun and very catchy. ?Johnny Blade? sounds the most like \n\nclassic SABBATH here, though with futuristic synth worked into the song ? and it actually sounds good, not forced! \n\n?Junior?s Eyes? is a down-tempo emotional rocker, written by Geezer about Ozzy?s (at the time) recently deceased \n\nfather, and is tied with ?Johnny Blade? for best song on here. So far, that makes three great tracks and two \n\nsomewhat boring ones.\nThe second half of the record gets pretty weird, and is probably the reason most people despise this record. It is \n\nhardly recognizable as BLACK SABBATH at all. ?Air Dance? is a bass-driven, jazzy song featuring mostly acoustic \n\nguitars and pianos underneath Ozzy?s vocals ? in the end, it sounds a lot like the mellow breaks worked into the \n\nsongs of ?Sabbath Bloody Sabbath? and ?Sabotage,? but expanded into a full track. ?Over To You? is another pretty \n\ngood song, with a nice angular riff and lots of piano flourishes and an emotional delivery by Ozzy. ?Breakout? reminds \n\nme of the distant cousin of ?Supertzar? from ?Sabotage,? featuring a nice Iommi riff accompanied by a horn section \n\nand guitar soloing, which acts as a sort of an into track to ?Swinging The Chain,? a heavy bluesy number sung by Bill \n\nWard with Ozzy on harmonica. This half of the album has nothing in the vein of ?Iron Man? or ?Children Of The \n\nGrave,? but it definitely has its merits.\nBLACK SABBATH tried a lot of new things on ?Never Say Die!?, and for the most part, I?d say that they worked. Ozzy \n\nsounds MUCH better than he did on ?Technical Ecstasy,? though still a little flat compared to ?Sabotage? and the \n\nearlier records. I really think that this album would have been better received had it come directly after ?Sabotage? ? \n\n?Technical Ecstasy? spelled the doom (no pun intended) of the Ozzy-era SABBATH. If ?Technical Ecstasy? had never \n\nexisted, I?d bet that people would be talking instead about the classic first seven SABBATH albums, rather than just \n\nthe first six.\nThen again, most people would probably disagree with a lot of what I?ve said in this review, so maybe I?m just \n\ninsane.","torrent":{"xt":"urn:btih:682c9f2d0d42a57c534fb732c685c1adf34fd087","amp;dn":"Black+Sabbath+-+Never+Say+Die%21+%281978%29+%28W.B.Rhino+Rem.+2004%29+%5BEAC","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"682c9f2d0d42a57c534fb732c685c1adf34fd087","infoHashBuffer":{"type":"Buffer","data":[104,44,159,45,13,66,165,124,83,79,183,50,198,133,193,173,243,79,208,135]},"announce":[],"urlList":[]}}