{"title":"HISTORY OF POP AND ROCK MUSIC - part 596","uid":12744221,"size":294391445,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:68b2e76125ed70510a158c75cd6a70a5422f14b3&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+596&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pupovaczlatko","files":7,"time":1447280367,"description":"\n\r\n                      PART  596\r\n\r\n\r\n\r\n          RIHANNA  Feat. Mikky Ekko     Stay  (2013)\r\n          MAJOR LAZER  &amp; DJ SNAKE   Ft. MШ - Lean On  (2015)\r\n\r\n\r\n\r\n                &quot;Stay&quot; is a song by Barbadian recording artist Rihanna, from her seventh studio album, Unapologetic (2012). It features guest vocals by Mikky Ekko, and was released as the second single from the album on January 7, 2013. &quot;Stay&quot; was co-written by Ekko and Justin Parker. It is a pop ballad, featuring piano and guitar chords. Upon the release of Unapologetic, &quot;Stay&quot; charted on multiple charts worldwide. Following its release as a single, it has reached number one in Bulgaria, Canada, the Czech Republic, Denmark and Israel and the top five in twenty-four countries worldwide including Australia, France, Germany, New Zealand, Norway, Switzerland and the United Kingdom. It peaked at number three on the US Billboard Hot 100, becoming Rihanna's twenty-fourth top ten on the chart, thus surpassing Whitney Houston's tally. Furthermore, it has charted at number one on the US Pop Songs chart and 16 on the Hot Dance Club Songs chart. &quot;Stay&quot; received mostly positive reviews from music critics. Jon Dolan for Rolling Stone was complimentary of Rihanna's execution of the song, writing that she performs it &quot;within an inch of its life&quot; and &quot;pleads at the piano.&quot; Dolan continued to state that it is &quot;stark&quot; and &quot;shadowy&quot; which is &quot;confrontationally honest.&quot; Dan Martin for NME described &quot;Stay&quot; as Unapologetic's highlight, writing that it is a &quot;gorgeous piano ballad.&quot; Martin continued to write that the song &quot;puts a vulnerable spin on the Brown situation, repeating another theme of the album&quot;, a reference to her relationship with Chris Brown.  Smokey Fontaine for the Huffington Post also praised &quot;Stay&quot;, placing emphasis on Rihanna's vocal performance. He wrote that &quot;Three years ago, no one would have paid attention to a beautiful piano-ballad like 'Stay.' Not because of the events we all witnessed, but because of how honest and emotionally-connected her vocals are.&quot;\r\n\r\n\r\n                 &quot;Lean On&quot; is a song recorded by American EDM group Major Lazer and French producer DJ Snake, taken from the former's third studio album, &quot;Peace Is the Mission&quot;  (2015), featuring vocals from Danish singer MO.   &quot;Lean On&quot; was released through Mad Decent independently (Because Music for Europe, WMG for Australia) as the lead single from the album on March 1, 2015.  It is a moombahton, dancehall and electronic song being also described as a house music ballad. &quot;Lean On&quot; was a commercial success, peaking at number four on the US Billboard Hot 100 and at number two on the UK Singles Chart. It reached number one in several other countries including Australia, Ireland, the Netherlands, New Zealand, Denmark and Switzerland. In September 2015, &quot;Lean On&quot; was named by Spotify as the most globally streamed song of the summer. The accompanying music video for &quot;Lean On&quot; was filmed in ND Studios, Karjat and Kaul Heritage City, Vasai in Maharashtra, India, and premiered on March 23, 2015.\r\n\r\n\r\n               Moom-b?-ton   is a fusion genre of house music and reggaeton that was created by American DJ and producer Dave Nada  n Washington, D.C., in 2009.  Identifying characteristics of moombahton include a thick and spread-out bass line, dramatic builds; and a two-step pulse, with quick drum fills.   Occasionally moombahton includes ravey synthesizers and acappella rap samples.   Nada coined the name as a portmanteau of &quot;Moombah&quot; (a track by Dutch house DJ Chuckie) and reggaeton (itself derived from combining the term reggae with the Spanish suffix -on signifying &quot;big&quot;)","torrent":{"xt":"urn:btih:68b2e76125ed70510a158c75cd6a70a5422f14b3","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+596","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"68b2e76125ed70510a158c75cd6a70a5422f14b3","infoHashBuffer":{"type":"Buffer","data":[104,178,231,97,37,237,112,81,10,21,140,117,205,106,112,165,66,47,20,179]},"announce":[],"urlList":[]}}