{"title":"The Katrina Effect On the Nature of Catastrophe (2015)pdf Gooner","uid":12749479,"size":3052102,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6912cc2804b04d265be8a8aa7627d40842d2487f&amp;dn=The+Katrina+Effect+On+the+Nature+of+Catastrophe+%282015%29pdf+Gooner&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GoonerTPB","files":1,"time":1447359647,"description":"Publisher: Bloomsbury Academic (August 27, 2015)\r\nLanguage: English\r\nISBN-10: 1472595165\r\nISBN-13: 978-1472595164\r\n\r\nOn August 29th 2005, the headwaters of Hurricane Katrina's storm-surge arrived at New Orleans, the levees broke and the city was inundated. Perhaps no other disaster of the 21st century has so captured the global media's attention and featured in the 'imagination of disaster' like Katrina. The Katrina Effect charts the important ethical territory that underscores thinking about disaster and the built environment globally. Given the unfolding of recent events, disasters are acquiring original and complex meanings. This is partly because of the global expansion and technological interaction of urban societies in which the multiple and varied impacts of disasters are recognized.\r\n\r\nThese meanings pose significant new problems for civil society: what becomes of public accountability, egalitarianism and other democratic ideals in the face of catastrophe? This collection of critical essays assesses the storm's global impact on overlapping urban, social and political imaginaries. Given the coincidence and 'perfect storm' of environmental, geo-political and economic challenges facing liberal democratic societies, communities will come under increasing strain to preserve and restore social fabric while affording all citizens equal opportunity in determining the forms that future cities and communities will take. Today, 21st century economic neo-liberalism, global warming or recent theories of 'urban vulnerability' and resilience provide key new contexts for understanding the meaning and legacy of Katrina","torrent":{"xt":"urn:btih:6912cc2804b04d265be8a8aa7627d40842d2487f","amp;dn":"The+Katrina+Effect+On+the+Nature+of+Catastrophe+%282015%29pdf+Gooner","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6912cc2804b04d265be8a8aa7627d40842d2487f","infoHashBuffer":{"type":"Buffer","data":[105,18,204,40,4,176,77,38,91,232,168,170,118,39,212,8,66,210,72,127]},"announce":[],"urlList":[]}}