{"title":"The Killing Zone.avi","uid":4192588,"size":495878154,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:691de3a8c78774ce3762be0c7493ae384ec62a5f&amp;dn=The+Killing+Zone.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bannerboyz","files":1,"time":1211042621,"description":"This program is from Channel 4, UK\n\nAs the Israel-Palestinian conflict threatens to plunge into all out war, this program lays bare the shocking level of violence and murderous hatred in the Gaza Strip.\n\nPalestinian civilians live under constant threat of Israeli military attacks. Israeli settlers live in fear of suicide bombs.\n\nNow it is not only Palestinians and Israelis who are dying. In recent weeks westerners have come under attack from the Israeli army.\n\nIn this report for Britain&amp;#039;s Channel 4, reporter Sandra Jordan and producer Rodrigo Vasquez face gunfire and tear gas within hours of arriving at a memorial service for Rachel Corrie, the peace activist crushed by an army bulldozer two days before.\n\nThat sets the scene for the next five weeks during which they also document the grievous wounding of British peace activist Tom Hurndall, the death of award winning cameraman James Miller, shot as he filmed Israeli troops bulldozing Palestinian homes, and the killing and maiming of civilian residents of Gaza.\n\nThe Dispatches team reveal what life is really like in a war zone. They capture the aftermath of an Israeli missile attack that assassinates a leader of the deadly Hamas group. Children playing in the street nearby are killed or have limbs blown off.\n\nThey film the impact of an attack in which Israeli troops fire shells that explode in mid air above densely populated areas and spray thousands of razor sharp darts in a wide arc. The team also encounters sniper fire from Israeli watchtowers, and endures tank shelling alongside a class of cowering schoolchildren. ","torrent":{"xt":"urn:btih:691de3a8c78774ce3762be0c7493ae384ec62a5f","amp;dn":"The+Killing+Zone.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"691de3a8c78774ce3762be0c7493ae384ec62a5f","infoHashBuffer":{"type":"Buffer","data":[105,29,227,168,199,135,116,206,55,98,190,12,116,147,174,56,78,198,42,95]},"announce":[],"urlList":[]}}