{"title":"Anders de la Motte - Bubble (Svensk Retail EPUB)","uid":12757777,"size":1075213,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6946b44a5cc5af794c8c431273a292a100ebdede&amp;dn=Anders+de+la+Motte+-+Bubble+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1447471946,"description":"Författare: Anders de la Motte\r\n       Titel: Bubble (Geimtrilogin #3)\r\nUtgivningsår: 2012\r\n       Språk: Svenska\r\n        ISBN: 9789150115048\r\n\r\nDen som äger det förflutna kontrollerar framtiden. Sex månader har gått sedan HP fick sitt sista uppdrag. Han har använt tiden väl - om man med väl menar att spela dataspel och dra handtrallor... Han känner sig fortfarande förföljd och vågar knappt lämna sin lägenhet. Det han behöver är en plan, en exitstrategi för att ta sig ur rävsaxen han hamnat i. Correction - som dom har hamnat i... Rebecca har nyss byggt färdigt livvaktssektionen av Sentry Security, den senaste medlemmen i PayTag-gruppens växande affärsimperium och om bara någon vecka kommer koncernens VD i egen hög person på besök för att inviga den gigantiska serverhall man byggt i ett av Försvarets gamla bergrum norr om Stockholm. En plats där man kan erbjuda säker informationslagring åt inte bara Sverige utan hela norra Europa. Företag, myndigheter och organisationer står redan i kö för att anförtro PayTag sin konfidentiella information. Men alla är inte lika förtjusta... PayTag och dess ledning har nyligen mottagit allvarliga hot från en hemlig organisation som motsätter sig alla försök att styra informationsflödet på nätet. Rebecca har dessutom fått ett problem av mer privat natur. Ett gammalt bankfack som troligen tillhört hennes pappa visar sig ha ett mycket märkligt innehåll. Hon kontaktar pappans gamle vän Tage Sammer och med dennes till synes motvilliga bistånd börjar hon bit för bit pussla ihop faderns okända förflutna. Men efterhand som bitarna faller på plats börjar hon inse att mönstret de bildar blir allt mer invecklat. För att inte säga fasansfullt... Den allt mer paranoide HP blir plötsligt kontaktad av en grupp avhoppade Spelare, ledda av en hemlig insider kallad Källan. Gruppen försöker övertala honom att hjälpa dem att bryta sig in i PayTags välbevakade bergrum och med hjälp av ett virus punktera företagets allt mer växande informationsbubbla. Men HP tvekar. Till att börja med tror han sig ha räknat ut vem den mystiska Källan egentligen är. Dessutom börjar han bli allt mer övertygad om att en medlem i gruppen i själva verket är en förrädare... Efter hand som Stockholm än en gång rustar för ett ståtligt kungabröllop hamnar HP och Rebecca allt mer på kollisionskurs. Och den här gången är frågorna fler än någonsin. Vad är Spelet egentligen? Vilka krafter ligger bakom det? Om man inte längre kan skilja spel från verklighet, hur vet man då vem som är vän, vem som är fiende? Om nu inte fienden i själva verket är en vän?? En väldigt nära vän","torrent":{"xt":"urn:btih:6946b44a5cc5af794c8c431273a292a100ebdede","amp;dn":"Anders+de+la+Motte+-+Bubble+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6946b44a5cc5af794c8c431273a292a100ebdede","infoHashBuffer":{"type":"Buffer","data":[105,70,180,74,92,197,175,121,76,140,67,18,115,162,146,161,0,235,222,222]},"announce":[],"urlList":[]}}