{"title":"Youssou N'Dour - Nothing's in Vain [FLAC] TQMP","uid":4193266,"size":378632192,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:69576edc3f0f1258f604a2136ef031747685c56d&amp;dn=Youssou+N%5C%27Dour+-+Nothing%5C%27s+in+Vain+%5BFLAC%5D+TQMP&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"pastafari","files":23,"time":1211076896,"description":"Youssou N'Dour - Nothing's in Vain (Coono du Reer)\n2002\n\nBrought to you by TQMP\nThe Quality Music Project\n\nBBC review\nSenegalese singer/songwriter/superstar Youssou N'Dourhas a punishing recording schedule. Every year he releases two albums: one for the Dakar nightclubs and thriving West African street-market cassette trade, and one for Western world music fans.\n\nParadoxically, it's the 'local' set that's always the most westernised: his previous album, Ba Tay, was an electrified guitar/keyboard/percussion number. It had no sleevenotes, a token shot of mbalax (modernised traditional Wolof) drumming, and a single dancefloor hit.\n\nThe strange feature about Nothing In Vain is that it's equally 'non-traditional', but in a different way. For the first time in a full session N'Dour has used traditional Senegalese instruments that wouldn't normally be found in a 'standard' mbalax line-up. The harp-like kora, the xalam (lute), and the riti (a sort of violin) all have their place in other Senegalese traditions, but rarely in company with mbalax tama and sabar drumming.\n\nThe results, almost entirely acoustic throughout, are generally enchanting. The first four songs showcase the 'new' instruments. All are in slowish tempo, including radically chilled re-arrangements of &quot;Moor Ndadje&quot; and &quot;Genne&quot;, the two dance-orientated songs off Ba Tay. It's only with the fifth tune, &quot;La Femme Est L'Avenir De L'Amour&quot;, that Youssou coaxes us back into more familiar Afro-Parisian territory. He seals the link with the next composition, &quot;Mbeggeel Noonu La&quot;, a reflective revisiting of the spirit of his biggest ever hit, 1985's &quot;Immigres&quot;.\n\nThere are a couple of turkeys, &quot;So Many Men&quot; and &quot;Africa Dream Again&quot; (is it just personal prejudice, or does Youssou's voice sound unconvincing in English?). But the best two tracks are definitely saved till last. In &quot;Doule&quot; and &quot;Yaru&quot;, both slow-burning dancefloor 'builders', the arrangements really hit their stride, the acoustic instrumentation making sense dynamically as well as aesthetically and making a neat fit with the tama drums.\n\nA lot of extravagant claims are made for Youssou. Some, such as 'the greatest Senegalese singer of all time' are highly questionable: many Senegalese would rate Thione Seck or Baaba Maal at least as equal to (or better than) N'Dour. But his one undoubted quality of genius is his ability, like Baaba Maal, to see the bigger picture in West African music. And it's that talent that will preserve his name long after many more parochial African acts have disappeared.\n\nA great introduction if you're new to Youssou N'Dour: a pleasant surprise if you're not.\n-- John Armstrong &lt;a href=&quot;\nhttp://www.bbc.co.uk/music/release/qcjw/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbc.co.uk/music/release/qcjw/&lt;/a&gt;\n\nTracks\n1- Tan Bi (Heat, Breeze, Tenderness)\n2- Moor Ndaje (Mr. Everywhere)\n3- Li Ma Weesu (As in a Mirror)\n4- Genne (For Those Displaced)\n5- La Femme Est l'Avenir de l'Amour (Women Are the Future of Love)\n6- Mbeggeel Noonu La (Because Love's Like That)\n7- Il N'y a Pas d'Amour Heureux (There Is No Happy Love)\n8- Sagal Ko (Honor Her)\n9- C'Est l'Amour (It's Love)\n10- Doole (Show Your True Mettle)\n11- So Many Men\n12- Yaru (The Makings of Respect)\n13- Africa, Dream Again\n\nArtwork (300dpi scan), EAC log and CUE sheet included.\n\nTools used -\nExact Audio Copy 0.99 prebeta 3\nFLAC frontend 1.7.1\nFLAC encoder/decoder 1.2.1\nreference libFLAC 1.2.1 20070917\n\nFormat: FLAC (Free Lossless Audio Codec) &lt;a href=&quot;\nhttp://flac.sourceforge.net/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://flac.sourceforge.net/index.html&lt;/a&gt; \n\nEnjoy, seed and inhale!\n\nLegalise it!\n\nPastafari &lt;a href=&quot;\nhttp://thepiratebay.se/user/pastafari/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/pastafari/&lt;/a&gt;\nProud Member of the Church of the Flying Spaghetti Monster  &lt;a href=&quot;\nhttp://venganza.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://venganza.org&lt;/a&gt;","torrent":{"xt":"urn:btih:69576edc3f0f1258f604a2136ef031747685c56d","amp;dn":"Youssou+N%5C%27Dour+-+Nothing%5C%27s+in+Vain+%5BFLAC%5D+TQMP","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"69576edc3f0f1258f604a2136ef031747685c56d","infoHashBuffer":{"type":"Buffer","data":[105,87,110,220,63,15,18,88,246,4,162,19,110,240,49,116,118,133,197,109]},"announce":[],"urlList":[]}}