{"title":"Walk Hard The Dewey Cox Story DC DVDRip XviD-DiAMOND","uid":4094247,"size":745548236,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6a41a696c1189a0b7680811fa8b553e5dcf7dc7a&amp;dn=Walk+Hard+The+Dewey+Cox+Story+DC+DVDRip+XviD-DiAMOND&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":5,"time":1206223149,"description":"Life made him tough. Love made him strong. Music made him hard.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0841046/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0841046/&lt;/a&gt;\n\nAs a huge fan of the previous Apatow movies, I drove recklessly through traffic to make it into an early screening of Walk Hard, and I\\&amp;#039;m happy I did. I think this movie is a different direction for Judd and his band, as it is more similar to Airplane in style than it is to Knocked Up. But that impressed me that they took that risk and made it work -- and it definitely worked as me and the rest of the theatre were laughing with regularity.\n\nWithout getting too much into the details of the movie because I hate spoilers, the thing that made this movie great to me was the unexpected humor. Like Airplane, there are a lot of times when you just don\\&amp;#039;t see the next line coming, and those are the best laughs. Besides John C. Reilly in the lead role, who obviously got a lot of the funniest lines, Tim Meadows as Dewey Cox\\&amp;#039;s drummer really cracked me up, and Paul Rudd as Jon Lennon cracked up the entire theatre.\n\nIt was definitely one of those movies where you\\&amp;#039;re recalling a lot of funny parts a day later. So while it may be a different type of movie than the Apatow groups\\&amp;#039; other work, the sense of funny is still there, and I think this is up there with the best comedies of the year.\n\n","torrent":{"xt":"urn:btih:6a41a696c1189a0b7680811fa8b553e5dcf7dc7a","amp;dn":"Walk+Hard+The+Dewey+Cox+Story+DC+DVDRip+XviD-DiAMOND","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6a41a696c1189a0b7680811fa8b553e5dcf7dc7a","infoHashBuffer":{"type":"Buffer","data":[106,65,166,150,193,24,154,11,118,128,129,31,168,181,83,229,220,247,220,122]},"announce":[],"urlList":[]}}