{"title":"Albert Espinosa - Se mi chiami mollo tutto [Pdf Epub - Ita]","uid":12764608,"size":1631331,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:6afe00951ad0bfc502405e9083d0e57b3b530959&amp;dn=Albert+Espinosa+-+Se+mi+chiami+mollo+tutto+%5BPdf+Epub+-+Ita%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vitolanz","files":2,"time":1447583328,"description":"Albert Espinosa - Se mi chiami mollo tutto [Pdf Epub - Ita][TNTVillage]\r\n----------------------------------------\r\n: Dettagli :.\r\n\r\nAutore: Albert Espinosa\r\nTitolo: Se mi chiami mollo tutto\r\nAnno: 2012\r\nLingua: Italiana\r\nGenere: Romanzo \r\nDimensione del file: 808 KB (PDF), 784 KB (Epub)\r\nFormato del file: PDF + Epub\r\n----------------------------------------\r\n\r\n.: Trama :.\r\n\r\nÈ un momento difficile nella vita di Dani. La sua compagna sta per lasciarlo, il loro rapporto sembra essere giunto a un punto morto, anche se lui sa di amarla ancora. Proprio mentre la donna sta facendo le valigie, Dani riceve la telefonata di un padre disperato, che gli chiede aiuto. Dani infatti si dedica a trovare bambini scomparsi, un mestiere strano, che ha origine nel suo passato e nella sua disperata voglia di fuggire... La ricerca di questo ragazzino lo porterà a Capri, un luogo magico nel quale riaffioreranno ricordi della sua difficile infanzia e delle due persone che hanno lasciato il segno nella sua vita, due incontri casuali ma fondamentali per lui. Un ritorno al passato che porterà Dani a riflettere sul suo presente, sulla sua difficile relazione e sulle cose che contano davvero.\r\n----------------------------------------\r\n\r\n.: Biografia dell'autore :.\r\n\r\nAlbert Espinosa (Barcellona, 1973), laureato in ingegneria chimica, è uno dei più noti scrittori, registi, autori di teatro e televisione spagnoli. \r\nIl mondo giallo è il primo libro che ha scritto: in esso l’autore ha riversato l’esperienza intensissima dei dieci anni della sua giovinezza segnati dal tumore. Espinosa ne ha poi tratto una fortunatissima fiction, Pulseras rojas, i cui diritti sono stati acquistati all’estero: la Rai e Palomar ne hanno infatti realizzato uno sceneggiato in onda da gennaio 2014 dal titolo Braccialetti rossi (il libro omonimo è pubblicato in Italia da Salani - Rai Eri).\r\nNegli Stati Uniti, i diritti sono stati acquistati da Steven Spielberg, che realizzerà una fiction dal titolo The Red Band Society. \r\nSalani ha pubblicato con grande successo anche gli altri romanzi di Albert Espinosa: Tutto quello che avremmo potuto essere io e te se non fossimo stati io e te (2011), Se mi chiami mollo tutto però chiamami (2012) e Bussole in cerca di sorrisi perduti (2013)","torrent":{"xt":"urn:btih:6afe00951ad0bfc502405e9083d0e57b3b530959","amp;dn":"Albert+Espinosa+-+Se+mi+chiami+mollo+tutto+%5BPdf+Epub+-+Ita%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6afe00951ad0bfc502405e9083d0e57b3b530959","infoHashBuffer":{"type":"Buffer","data":[106,254,0,149,26,208,191,197,2,64,94,144,131,208,229,123,59,83,9,89]},"announce":[],"urlList":[]}}