{"title":"War is a Racket - USMC's most decorated blows whistle on Mili","uid":4202207,"size":15416084,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6b13010df8069e90ba32e9a8880ad2f93de4554c&amp;dn=War+is+a+Racket+-+USMC%5C%27s+most+decorated+blows+whistle+on+Mili&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"PeaceTorrent","files":3,"time":1211565199,"description":"Smedley Darlington Butler, nicknamed &quot;The Fighting Quaker&quot; and &quot;Old Gimlet Eye,&quot; was a Major General in the U.S. Marine Corps and, at the time of his death, the most decorated Marine in U.S. history.\n\nDuring his 34 years of Marine Corps service, Butler was awarded numerous medals for heroism including the Marine Corps Brevet Medal (the highest Marine medal at its time for officers), and subsequently the Medal of Honor twice. Notably, he is one of only 19 people to be twice awarded the Medal of Honor, and one of only three to be awarded a Marine Corps Brevet Medal and a Medal of Honor, and the only person to be awarded a Marine Corps Brevet Medal and a Medal of Honor for two different actions.\n\nIn addition to his military career, Smedley Butler was noted for his outspoken anti-interventionist views, and his book War is a Racket. His book was one of the first works describing the workings of the military-industrial complex and after retiring from service, he became a popular speaker at meetings organized by veterans, pacifists and church groups in the 1930s.\n\nIn 1934, he informed the United States Congress that a group of wealthy industrialists had plotted a military coup known as the Business Plot to overthrow the government of President Franklin D. Roosevelt.\n","torrent":{"xt":"urn:btih:6b13010df8069e90ba32e9a8880ad2f93de4554c","amp;dn":"War+is+a+Racket+-+USMC%5C%27s+most+decorated+blows+whistle+on+Mili","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b13010df8069e90ba32e9a8880ad2f93de4554c","infoHashBuffer":{"type":"Buffer","data":[107,19,1,13,248,6,158,144,186,50,233,168,136,10,210,249,61,228,85,76]},"announce":[],"urlList":[]}}