{"title":"Medeski, Martin &amp; Wood - Let's Go Everywhere[FLAC - LOSSLESS]","uid":4226903,"size":256638967,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:6b911f4fd151f4e8e88f31de00d4ad97fcd36db1&amp;dn=Medeski%2C+Martin+%26+Wood+-+Let%5C%27s+Go+Everywhere%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"99AM","files":19,"time":1212872513,"description":"FLAC files + CUE sheet\nRelease date: Jan 8, 2008.\n\n\nTrack Listing:\n1. Waking Up\n2. Let&amp;#039;s Go Everywhere\n3. Cat Creeps\n4. The Train Song\n5. Where&amp;#039;s The Music\n6. Pat A Cake\n7. Pirates Don&amp;#039;t Take Baths\n8. Far East Sweets\n9. On An Airplane\n10. The Squalb\n11. Let&amp;#039;s Go\n12. Old Paint\n13. Hickory Dickory Dock\n14. All Around The Kitchen\n15. We&amp;#039;re All Connected\n\n\n\nThroughout their decade-and-a-half-long career together, Medeski, Martin &amp; Wood have managed to straddle many difficult boundaries. They have all the trappings of a jam-band, but maintain an avant-garde appeal. They keep a large cadre of fans around the globe, even as their inventiveness and pursuit of new sounds make them seem like they should be difficult to latch onto.\n\nWith the new children&amp;#039;s album Let&amp;#039;s Go Everywhere, MMW is again bridging a gap, and a particularly thorny one in jazz circles: the apparent distance between inexperienced and veteran listeners. From the album art to the song titles (?The Squalb? and ?Pirates Don?ake Baths?), this record might appear to be a great departure. More than half the tracks have lyrics?and these are not lyrics ? ?Your Name is Snake Anthony? from the 2002 Uninvisible (Blue Note). Medeski, Martin &amp; Wood are writing to draw people in, to give the uninitiated a chance to really get into jazz and have fun in the process.\n\nUnderneath the cartoonish veneer, though, MMW is still offering the same kind of fun that they always have. ?Our music is best when we create from a child&amp;#039;s perspective,? the trio confesses in the liner notes. And as you listen to it, you realize that this has indeed always been the epitome of this group: infusing jazz with a child&amp;#039;s sort of joy.\n\nSome of these songs, truly, could be on any MMW album of the last ten years. The slinky ?Cat Creeps,? a minor blues with a lumbering bass line from Chris Wood, has the same subtle groove that familiar listeners have come to expect from this trio. Before the vocals enter ?The Train Song,? the band slowly enters the two-chord vamp and gradually picks up the tempo like a single entity?it&amp;#039;s tricks like this that defined their earlier songs, like ?Bubblehouse? off of Shack-Man (Gramavision, 1996). But then the vocals come in, and the listener realizes that this is both new and old at the same time: a familiar driving force as the foundation for a new kind of accessibility.\n\n?Where&amp;#039;s the Music,? for example, allows for just such a synthesis. The trio maintains a single-chord boogaloo-style jam, similar to many of their previous inventions. But, whereas in the past a song like this would have been affected by coordinated tempo shifts or solo breaks to vary the form, here the ?interruptions? are silences filled up by the voices of children, demanding that the music turn back on. In itself, it&amp;#039;s an almost Sesame Street-like conceit: use the back-and-forth of presence and absence to make young listeners more conscious of what they&amp;#039;re hearing. At the same time, though, the trio is replacing the kind of very energetic audience response that their strong grooves usually inspire with an actual audience inside the track. Like the best of children&amp;#039;s television, the material presented is at once for the children and by the children. Having ?active participation? like this on the track itself not only echoes the kind of audience response that MMW usually inspires?it also teaches the new listener how to listen to this music. And somehow, in doing that, it no longer matters if the jazz novice is four years old or forty.\n\n(Review from AllAboutJazz.com by Jay Deshpande)\n\n\nEnjoy! ","torrent":{"xt":"urn:btih:6b911f4fd151f4e8e88f31de00d4ad97fcd36db1","amp;dn":"Medeski%2C+Martin+%26+Wood+-+Let%5C%27s+Go+Everywhere%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6b911f4fd151f4e8e88f31de00d4ad97fcd36db1","infoHashBuffer":{"type":"Buffer","data":[107,145,31,79,209,81,244,232,232,143,49,222,0,212,173,151,252,211,109,177]},"announce":[],"urlList":[]}}