{"title":"Nine Dead Gay Guys (2003)","uid":4078256,"size":733163906,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6de851b81f81a7cd6117b2f38108b348398f3ca6&amp;dn=Nine+Dead+Gay+Guys+%282003%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Big swede2","files":2,"time":1205435093,"description":" &lt;a href=&quot;http://www.rottentomatoes.com/m/nine_dead_gay_guys/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.rottentomatoes.com/m/nine_dead_gay_guys/&lt;/a&gt;\n\nSynopsis: \n\n9 Dead Gay Guys is a truly original comic romp of epic proportions. Two straight lads from Belfast, Kenny (Glenn Mulhern) and Byron (Brendan Mackey), embark upon a voyage of discovery through London&amp;#039;s outrageous gay scene, with the intention of finding their fortune. They are on the lookout for what they loosely term &amp;#039;gainful affair;&amp;#039; that is to say turning tricks of the non-penetrative nature for UFO&amp;#039;s or ugly fat old men. However, when Kenny manages to polish off his first guy, Jeff (Steven Berkoff), he is forced to admit that he is evidently not straight, has a gigantic personal appendage and that a new method of financing themselves must be found and fast. A roller coaster of events and extraordinary characters greet the lads as they commence upon an odyssey to find the legendary &quot;bread in the bed,&quot; a wedge of cash rumored to reside in Golders Green (Simon Godley), a gay Orthodox Jew&amp;#039;s bed. In order to get anywhere near his famous bed, you must first have passed the &quot;really hard Red Bull test.&quot; ust as well because Kenny is a &quot;big&quot; boy. Unfortunately, the kiss of death seems to follow this pair in their adventure. The gentlemen who come into contact with them seem to be quite literally dropping like flies. Is sex possible without money? Is there such a thing as love? Well, these are the questions our unlikely heroes discover themselves confronted with. A dwarf, an electric cattle prod and three West African Brothers later, make this one film that twist and turns to raucous conclusion. -- Ã‚Â© TLA Releasing ","torrent":{"xt":"urn:btih:6de851b81f81a7cd6117b2f38108b348398f3ca6","amp;dn":"Nine+Dead+Gay+Guys+%282003%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6de851b81f81a7cd6117b2f38108b348398f3ca6","infoHashBuffer":{"type":"Buffer","data":[109,232,81,184,31,129,167,205,97,23,178,243,129,8,179,72,57,143,60,166]},"announce":[],"urlList":[]}}