{"title":"Five_Sorrows_Prelude.zip","uid":4069355,"size":46663318,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6e3a84d2ff91212b4d675910eb30f8290e3af9fb&amp;dn=Five_Sorrows_Prelude.zip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"and.there.were.five","files":1,"time":1204971153,"description":"To celebrate the fact that the hardcopy version of the debut Five Sorrows EP &quot;prelude&quot; is now unofficially out of print and sold out, we are releasing it in its entirety for free.  We are also including all original artwork from the CD as well.  It is our hope that you will download it, listen to it, enjoy it and maybe even share it with others.\n\nAccolades for Prelude: \n\n?Very unique sound...A whole new breed of trip hop?makes for good listening.? -RedCloud, rap artist. \n\n?a 10 out of 10... definitely a fresh breath to industrialized goth/metal music and also to the underground?somewhere between Pretty Hate Machine/Downward Spiral?a soon to be goth/industrial CLASSIC?? -S.O.I. Records/ Extreme Metal Zine\n\nAbout Five Sorrows\n\nFamed fantasy writer Neil Gaiman once wrote a short story entitled ?Violent Cases? about gangsters in the 1930s who carried their machine guns in the guise of violin cases. This is similar to the tactics employed by Five Sorrows creator Kenn Little. Five Sorrows performs industrial, electronic- based goth rock similar to Nine Inch Nails, Linkin Park, Stabbing Westward and Circle of Dust; and while these artists may be influences, Five Sorrows possesses a sound which is uniquely its own. Fusing elements of industrial, goth, hip hop and various electronica with lush strings and melancholy piano, Five Sorrows creates sounds that evoke, mimic and sometimes mock the very human emotions we experience on a daily basis. Lyrically, Five Sorrows tends to explore the often turbulent relationship between God and His creations. Five Sorrows explores the struggles that exist within this relationship as well as the simple need for it. Though often dark, beautiful and sometimes violent, Five Sorrows maintains that there is Hope in this relationship if you have faith enough to accept it. The project itself began sometime in 2003. The individual himself began sometime in 1977. The Five Sorrows debut EP, &quot;Prelude&quot; was released in July of 2006 and is available here, on official site and at live shows.\n &lt;a href=&quot;\nhttp://www.fivesorrows.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.fivesorrows.com&lt;/a&gt;\n","torrent":{"xt":"urn:btih:6e3a84d2ff91212b4d675910eb30f8290e3af9fb","amp;dn":"Five_Sorrows_Prelude.zip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6e3a84d2ff91212b4d675910eb30f8290e3af9fb","infoHashBuffer":{"type":"Buffer","data":[110,58,132,210,255,145,33,43,77,103,89,16,235,48,248,41,14,58,249,251]},"announce":[],"urlList":[]}}