{"title":"Nuclear is not the Answer - mp3 - Dr. Helen Caldicott","uid":4239253,"size":97429776,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:6ebebb7601c37827ae5dcf554a95ca55fc6b5614&amp;dn=Nuclear+is+not+the+Answer+-+mp3+-+Dr.+Helen+Caldicott&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"RevolutionaryNonviolence","files":20,"time":1213455640,"description":"From Publishers Weekly\nCaldecott&amp;#039;s latest antinuke book searingly debunks the claim that the impending &quot;nuclear power renaissance,&quot; purported by some to be the only answer to global warming, is &quot;clean and green.&quot; She covers all the bases, from the carbon emitted in the creation of nuclear power (higher than fossil fuels if the entire process from uranium mining to waste disposal is included) to the cost of nuclear plants (too high to be viable without large government subsidies) and the health risks and possibility of accidents and terrorists&amp;#039; access (more than we&amp;#039;d like to think). She also points out that, despite proponents&amp;#039; assurances, we still haven&amp;#039;t found a safe place to store the waste materials for the necessary thousands of years, and that state-of-the-art nuclear plant technology is still full of unresolved problems. Caldecott&amp;#039;s predictable alternative is also sensible: switch to wind and other benign renewables, turn down the thermostat, wear a sweater, use energy efficient lights and dry clothes on the clothesline. Detractors will complain that she is strident and incendiary, but those who believe that facts matter will want to read her frighteningly convincing argument. (Sept.)\nCopyright Ã‚Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. --This text refers to the Hardcover edition.\n\nFrom Booklist\nNever one to mince words, renowned physician and activist Caldicott presents exhaustive evidence to refute the now-resurgent claim that nuclear power is the solution to global warming. Eschewing hyperbole and speculation, Caldicott diligently presents the facts about the grave problems attendant on nuclear power. For starters, enormous amounts of fossil fuel are burned during the nuclear-energy process, and nuclear reactors use and pollute vast amounts of water. Radioactive emissions do escape and are released from nuclear facilities, and man-made radioactive elements regularly enter the food chain and our bodies to deleterious effect. Nuclear-power plants are vulnerable to natural disasters and to terrorists; all nuclear plants generate plutonium, seeding the proliferation of nuclear weapons; and we have yet to discover a safe place or method for storing waste that remains deadly for millennia. Add to that the scandalously corrupt and hypocritical economics and politics of nuclear power. So numerous and so severe are the problems Caldicott precisely records and clearly interprets that, as it stands today, nuclear power would appear to be a costly, dangerous, even ludicrous technology. Donna Seaman\nCopyright Ã‚Â© American Library Association. All rights reserved --This text refers to the Hardcover edition. ","torrent":{"xt":"urn:btih:6ebebb7601c37827ae5dcf554a95ca55fc6b5614","amp;dn":"Nuclear+is+not+the+Answer+-+mp3+-+Dr.+Helen+Caldicott","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ebebb7601c37827ae5dcf554a95ca55fc6b5614","infoHashBuffer":{"type":"Buffer","data":[110,190,187,118,1,195,120,39,174,93,207,85,74,149,202,85,252,107,86,20]},"announce":[],"urlList":[]}}