{"title":"The Navigators","uid":4071323,"size":925029902,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6ed5113b89cbe7d292f6151fe681043bd1bf2252&amp;dn=The+Navigators&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Jason210","files":1,"time":1205070365,"description":"A superb film by Ken Roach, set in Sheffield in the UK about railway workers. It&amp;#039;s 1995, and the Tories have just carried out their disastrous, pea-brained scheme to break up the railways. We follow the fortunes of a gang of track workers in as they find themselves confronted with all the fallout of privatisation--redundancies, cost-cutting, corner-cutting and the wholesale junking of any concern with safety or quality of work.\n\nSympathies lie firmly with the ordinary working blokes, not above of bit of banter and skiving, but essentially trying to do a decent job and stay loyal to their mates in the face of managerial double-talk and corporate devotion to the bottom line.\n \nThree scenes encapsulate the tragic-comic tone of the film. At one point the disbelieving workers are ordered by managers to smash up a load of equipment; it&amp;#039;s surplus to requirements, but can&amp;#039;t possibly be sold to &quot;the competition&quot;, their former British Rail workmates at the depot down the line. \n\nLater, called to a derailment, the track workers walk past a whole series of hard-hat wearing managers, each paying no attention to what needs doing but muttering fiercely into a mobile phone trying to pass the buck for the accident to another company.\n\nFinally - my favourite. The gaffer enters the mess room and announces to the workers that the dept is going to close down. The cleaner who works in the mess room says &quot;Shite. I&amp;#039;ve just bought a fucking new mop and bucket!&quot;\n\n\nLoach cast the film using local actors and comics, and there&amp;#039;s a strong sense of authenticity in the flat accents and dry Yorkshire humour. The film is often  hilarious, but ultimately this is a lament for the destruction, not only of what was once a great rail network, but of the pride and camaraderie of those who worked on it. The film&amp;#039;s ending is fittingly bleak. \n\nQuality: Excellent\nLanguage: English\nSubtitles: None\n","torrent":{"xt":"urn:btih:6ed5113b89cbe7d292f6151fe681043bd1bf2252","amp;dn":"The+Navigators","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6ed5113b89cbe7d292f6151fe681043bd1bf2252","infoHashBuffer":{"type":"Buffer","data":[110,213,17,59,137,203,231,210,146,246,21,31,230,129,4,59,209,191,34,82]},"announce":[],"urlList":[]}}