{"title":"The Night of the Iguana","uid":4069047,"size":733157376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:6eff480cfa1bcfc213eab6b82b75285222794170&amp;dn=The+Night+of+the+Iguana&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"marcosau","files":1,"time":1204951527,"description":"A Noite do Iguana\nTÃƒÂ­tulo Original: The Night of the Iguana\n\nDireÃƒÂ§ÃƒÂ£o:John Huston\nRoteiro:John Huston, Anthony Veiller\nProduÃƒÂ§ÃƒÂ£o:John Huston, Ray Stark\nMÃƒÂºsica Original:Benjamin Frankel\nFotografia:Gabriel Figueroa\nEdiÃƒÂ§ÃƒÂ£o:Ralph Kemplen\nDireÃƒÂ§ÃƒÂ£o de Arte:Stephen Grimes\nFigurino:Dorothy Jeakins\nEfeitos Sonoros:Basil Fenton-Smith, Van Allen James\nPaÃƒÂ­s:USA\nGÃƒÂªnero:Drama\nAudio:Ingles\nLegenda:PortuguÃƒÂªs-BR\nAno:1964\nNota:7,4\n\nPrÃƒÂªmios:Academia de Hollywood  -  Oscar de Melhor Figurino\n\nFestival de San SebastiÃƒÂ¡n, Espanha  -  PrÃƒÂªmio de Melhor Atriz  (Ava Gardner)\n\nIndicaÃƒÂ§ÃƒÂµes: Academia de Hollywood  -  Indicado aos Oscars de Melhor Fotografia, Melhor DireÃƒÂ§ÃƒÂ£o de \n\nArte e de Melhor Atriz Coadjuvante  (Grayson Hall)\n\nAcademia BritÃƒÂ¢nica  - Indicado ao PrÃƒÂªmio de Melhor Atriz Estrangeira  (Ava Gardner)\n\nGlobo de Ouro  - Indicado aos PrÃƒÂªmios de Melhor Filme (Drama), Melhor DireÃƒÂ§ÃƒÂ£o, Melhor Atriz - \n\nDrama  (Ava Gardner), Melhor Ator Coadjuvante  (Cyril Delevanti) e de Melhor Atriz Coadjuvante  \n\n(Grayson Hall)\n\nElenco\n\t\n Richard Burton- Rev. Dr. T. Lawrence Shannon\n Ava Gardner-Maxine Faulk\n Deborah Kerr-Hannah Jelkes\n Sue Lyon-Charlotte Goodall\n Grayson Hall-Judith Fellowes\n James Ward-Hank Prosner\n Cyril Delevanti-Jonathan Coffin, avÃƒÂ´ de Hannah\n Mary Boylan-Srta. Peebles\n Fidelmar DurÃƒÂ¡n-Pepe\n Eloise Hardt-Professora\n Gladys Hill-Srta. Dexter\n Barbara Joyce-Professora\n Roberto Leyva-Pedro\n Billie Matticks-Srta. Throxton\n Betty Proctor-Professora\n Liz Rubey-Professora\n Bernice Starr-Professora\n Dorthy Vance-Professora\n\n\nSinopse\n\nRev. Dr. T. Lawrence Shannon, um ex-pastor protestante e alcoÃƒÂ³latra, trabalha como guia turÃƒÂ­stico na Costa Oeste mexicana.  Em uma de suas excursÃƒÂµes, ele parte em um ÃƒÂ´nibus da empresa com um grupo de professoras idosas em fÃƒÂ©rias.  Uma delas, Judith Fellowes, lidera o grupo, alÃƒÂ©m de ser a responsÃƒÂ¡vel pela jovem Charlotte Goodall.\n\nDesde a saÃƒÂ­da, Charlotte passa a dar em cima de Shannon, embora este nÃƒÂ£o corresponda aos seus avanÃƒÂ§os.  Nas pousadas, ao longo do roteiro, por exemplo, a jovem entra sem permissÃƒÂ£o no quarto do religioso e este a pÃƒÂµe para fora.  Para a Sra. Fellowes, entretanto, ÃƒÂ© o religioso quem estÃƒÂ¡ tentando seduzir a garota.  Por mais que ele se explique, ela nÃƒÂ£o muda seu modo de pensar e passa a ameaÃƒÂ§ÃƒÂ¡-lo, alegando que seu influente irmÃƒÂ£o e juiz, pode conseguir que ele seja demitido do \nemprego.\n\nNuma das paradas, ela telegrafa para o irmÃƒÂ£o, pedindo-lhe que tome informaÃƒÂ§ÃƒÂµes sobre a vida de Shannon e que lhe dÃƒÂª retorno por telefone, ligando para o Hotel Ambos Mundos, em Puerto Vallarta, onde ela vai estar nos prÃƒÂ³ximos dias.  Ao tomar conhecimento de sua atitude, atravÃƒÂ©s de Hank Prosner, o motorista do ÃƒÂ´nibus, Shannon assume a direÃƒÂ§ÃƒÂ£o, passa por Puerto Vallarta sem parar, indo direto atÃƒÂ© a pousada &quot;Miss Malaya&quot;, de propriedade de sua amiga, Maxine Faulk.  Uma vez lÃƒÂ¡, \nretira o cabo do distribuidor do ÃƒÂ´nibus, a fim de evitar qualquer possibilidade de retorno do grupo para Puerto Vallarta.  As tensÃƒÂµes entre ele e a Sra. Fellowes crescem.\n\nÃƒ? pousada, chegam Hannah Jelkes, uma pintora, e seu avÃƒÂ´ de 97 anos.  Sem dinheiro, ela diz que viaja com ele e pagam suas estadas com recitais do avÃƒÂ´, considerado o mais velho poeta vivo em atividade, e com a venda de suas aquarelas e de esboÃƒÂ§os rÃƒÂ¡pidos que faz em carvÃƒÂ£o e pastel.  Em princÃƒÂ­pio, Maxine nÃƒÂ£o os aceita como hÃƒÂ³spedes, mas Shannon, mesmo pensando que pode se tratar de uma vigarista, intercede pelos dois e faz com que eles fiquem na pousada.\n\nEnquanto isso, a Sra. Fellowes consegue finalmente a demissÃƒÂ£o de Shannon, atravÃƒÂ©s de seu irmÃƒÂ£o juiz, que alegou aos seus empregadores ser o reverendo um sedutor contumaz de menores.  Depois de mais uma investida sem sucesso contra Shannon, Charlotte ÃƒÂ© finalmente correspondida, ao se aproximar de Hank.  Juntos, os dois jovens conseguem reaver o cabo do distribuidor do ÃƒÂ´nibus e o grupo de turistas deixa a pousada.  Demitido, Shannon nÃƒÂ£o segue com eles.\n\nAgradecida por ter sido aceita na pousada, Hannah procura ajudar Maxine e Shannon, este por causa de seu estado emocional.  Depois de alguns dias, seu avÃƒÂ´ compÃƒÂµe um novo poema e morre em seguida. \n\n Ao se preparar para partir, recebe uma proposta de Maxine:  administrar a pousada em troca de 50% dos lucros obtidos, desde que Shannon a ajude pois, segundo ela, toda pousada precisa da presenÃƒÂ§a de um homem.  Perguntada sobre o que pretende fazer, Maxine responde que se sente uma viÃƒÂºva jovem e bonita e que pretende recomeÃƒÂ§ar sua vida em El Paso.\n\nAo sentir que Maxine ama Shannon, jÃƒÂ¡ que sua proposta nada mais foi do que uma crise de ciÃƒÂºmes, Hannah nÃƒÂ£o a aceita e deixa a pousada.  Os dois decidem, finalmente, recomeÃƒÂ§ar juntos suas vidas.\n\n\nCrÃƒÂ­ticas\n\nBaseado numa peÃƒÂ§a de Tennessee Williams, &quot;A Noite do Iguana&quot; ÃƒÂ© um ÃƒÂ³timo filme.  Dirigido pelo lendÃƒÂ¡rio cineasta John Huston, que tambÃƒÂ©m participou da elaboraÃƒÂ§ÃƒÂ£o do roteiro e da produÃƒÂ§ÃƒÂ£o, o filme ÃƒÂ© marcado por seus diÃƒÂ¡logos inteligentes, uma das caracterÃƒÂ­sticas da obra de Tennessee Williams.\n\nNuma praia paradisÃƒÂ­aca do MÃƒÂ©xico, reÃƒÂºnem-se um ex-pastor protestante, que se acha no fundo do poÃƒÂ§o, uma bela mulher traumatizada pela perda do marido hÃƒÂ¡ menos de um mÃƒÂªs, e uma pintora fracassada e sem dinheiro.  Durante algum tempo, hÃƒÂ¡ ainda os problemas criados por uma ninfeta e sua protetora.  Ãƒ? nesse ambiente, principalmente depois que ficam apenas os trÃƒÂªs personagens inicialmente citados, que se desenvolve uma verdadeira terapia, muito bem explorada por Williams, constituindo-se num dos pontos mais importantes do filme.\n\nImagem: 544x304pixels\nÃƒ?udio: \n\tDate Rate:128kbps\n\tFormato:Mpeg Layer\nVÃƒÂ­deo:\n\tDate Rate:728kbps\n\tTaxa de Quadros:25.000\n\tCompactaÃƒÂ§ÃƒÂ£o: Xvid\nTamanho: 699mb\n","torrent":{"xt":"urn:btih:6eff480cfa1bcfc213eab6b82b75285222794170","amp;dn":"The+Night+of+the+Iguana","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6eff480cfa1bcfc213eab6b82b75285222794170","infoHashBuffer":{"type":"Buffer","data":[110,255,72,12,250,27,207,194,19,234,182,184,43,117,40,82,34,121,65,112]},"announce":[],"urlList":[]}}