{"title":"Dr. John - In the Right Place + The Sun, Moon &amp; Herbs@320","uid":4072764,"size":196915377,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:6fcbbf9ea2b2c2ed25165e6e23b8eec6380cf671&amp;dn=Dr.+John+-+In+the+Right+Place+%2B+The+Sun%2C+Moon+%26+Herbs%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alekow1","files":26,"time":1205143273,"description":"1. Dr. John - In the Right Place (1973)\n\n\nDr. John finally struck paydirt here and was certainly In the Right Place. With the hit single &quot;Right Place Wrong Time&quot; bounding up the charts, this fine collection saw many unaware listeners being initiated into New Orleans-style rock. Also including Allen Toussaint&amp;#039;s &quot;Life,&quot; and a funky little number entitled &quot;Traveling Mood,&quot; which shows off the good doctor&amp;#039;s fine piano styling, and with able help from the Meters as backup group, In the Right Place is still a fine collection to own.\n\n\n\n01. Right Place Wrong Time                                                                                              \n02. Same Old Same Old                                                                                                   \n03. Just The Same                                                                                                       \n04. Qualified                                                                                                           \n05. Traveling Mood                                                                                                      \n06. Peace Brother Peace                                                                                                 \n07. Life                                                                                                                \n08. Such A Night                                                                                                        \n09. Shoo Fly Marches On                                                                                                 \n10. I Been Hoodood                                                                                                      \n11. Cold Cold Cold          \n\n\n\n\n2. Dr. John - The Sun, Moon &amp; Herbs (1971)\n\n\nOriginally intended as a triple album, The Sun, Moon &amp; Herbs was chopped up, whittled down and re-assembled into this single-disc release, and while Dr. John never liked this version much, perhaps the single disc is testament to the &quot;less is more&quot; theory. The seven cuts are all quite lengthy and the spells Dr. John and his consorts weave are dark and swampy. &quot;Black John the Conqueror&quot; comes from old Cajun folklore which the good Dr. has modernized and given a beat. The swampy &quot;Craney Crow&quot; is the younger sibling of his earlier &quot;Walk On Guilded Splinters&quot; and has a similar effect on the listener. &quot;Pots on Fiyo (Fils Gumbo)&quot; combines Latin American rhythms with lots of Cajun chants and spells. The vocals are nearly incomprehensible and actually serve as another instrument in the mix. &quot;Zu Zu Mamou&quot; is so thick that you can almost cut the music with a knife. Here, the atmosphere takes on a whole other meaning altogether. The Sun, Moon &amp; Herbs is best listened to on a hot, muggy night with the sound of thunder rumbling off in the distance like jungle drums. Dr. John was definitely onto something here, but just what is left up to the listener.\n\n\n\nPersonnel includes: Mac &quot;Dr. John&quot; Rebennack (vocals, keyboards); Eric Clapton, Mick Jagger, Victor Brox, P.P. Arnold, Graham Bond, Chris Mercer, Doris Troy, Bobby Whitlock, Bobby Keys, Carl Radle, Jim Gordon, Jim Price.\n\n\n\n01. Black John The Conqueror                                                                                            \n02. Where Ya At Mule                                                                                                    \n03. Craney Crow                                                                                                         \n04. Familiar Reality - Opening                                                                                          \n05. Pots On Fiyo (File Gumbo)Who I Got To Fall On (If The Pot Get Heavy)                                                \n06. Zu Zu Mamou                                                                                                         \n07. Familiar Reality - Reprise \n\n\n\n\n\nBITRATE: 320\n\nMy cd-rips (EAC and Lame)\nCovers Included\n\n\n\n\n\nEnjoy,Seed and Share\t","torrent":{"xt":"urn:btih:6fcbbf9ea2b2c2ed25165e6e23b8eec6380cf671","amp;dn":"Dr.+John+-+In+the+Right+Place+%2B+The+Sun%2C+Moon+%26+Herbs%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"6fcbbf9ea2b2c2ed25165e6e23b8eec6380cf671","infoHashBuffer":{"type":"Buffer","data":[111,203,191,158,162,178,194,237,37,22,94,110,35,184,238,198,56,12,246,113]},"announce":[],"urlList":[]}}