{"title":"RollerCoaster Tycoon 4 Mobile v1.7.0 [Free Shopping]","uid":12743797,"size":90706515,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:7151f3a4e93b7f4c7a67b675da781371c8175b99&amp;dn=RollerCoaster+Tycoon+4+Mobile+v1.7.0+%5BFree+Shopping%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":".BONE.","files":2,"time":1447275990,"description":"RollerCoaster Tycoon 4 Mobile v1.7.0 [Free Shopping]\r\nRequirements: 4.0.3+\r\nOverview: Build your park, make your peeps happy, and play with millions of other players online today! The game includes all new mini-games including slots and others\r\n\r\nWe are thrilled to announce RollerCoaster Tycoon 4 Mobile including Queue Lines! Enjoy a whole new level of customization, watch your peeps line-up and wait for rides while increasing the BUZZ each one produces. Build your park, make your peeps happy, and play with millions of other players online today! The game includes all new mini-games including slots and others!\r\n\r\nRollerCoaster Tycoon 4 Mobile is a completely free-to-play game with an addictive mixture of strategic planning and simulation. Based on the beloved RollerCoaster Tycoon franchise, this game takes many of the fan-favorite features from the original PC games and brings them to mobile.\r\n\r\nCreate and share your ultimate theme park. Construct incredible roller coasters. Building your theme park is only the first step in your journey to become the ultimate tycoon!\r\n\r\nThe RCT4M team will continue to release new customization, franchise favorite content and features - this is only the beginning!\r\n\r\nFeatures:\r\n•FREE-TO-PLAY\r\n•Intuitive RollerCoaster Editor.\r\n•20 pre-designed coasters.\r\n•Customize your theme park with different attractions, restaurants, businesses, concession stands, hotels and decorations.\r\n•Play a Slots mini-game within your park.\r\n•Unlock new materials to construct cooler, faster and taller coasters.\r\n•Grow your economy by creating the ultimate amusement park.\r\n•Share roller coaster blueprints.\r\n•New content and features released all the time.\r\n\r\nNote: A network connection is required to play. \r\n\r\nWhat's new:\r\n- NEW feature - Multiparks. Ability to own up to three parks on one account.\r\n- Various bug fixes\r\n- Stability and performance improvements\r\n\r\nThis app has Tapjoy advertisements","torrent":{"xt":"urn:btih:7151f3a4e93b7f4c7a67b675da781371c8175b99","amp;dn":"RollerCoaster+Tycoon+4+Mobile+v1.7.0+%5BFree+Shopping%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7151f3a4e93b7f4c7a67b675da781371c8175b99","infoHashBuffer":{"type":"Buffer","data":[113,81,243,164,233,59,127,76,122,103,182,117,218,120,19,113,200,23,91,153]},"announce":[],"urlList":[]}}