{"title":"13Ghosts- Cicada(2004)","uid":4087849,"size":114339228,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:715b56dfeba03fd790457f09b985f0f7f6d6d2d1&amp;dn=13Ghosts-+Cicada%282004%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"e5150","files":23,"time":1205915944,"description":"In late 2004, Birmingham, Ala.-based 13ghosts self-released their third full-length, Cicada, in an outsize, bulky package that was perhaps eye-catching in stores but a bane to anyone hoping to shelve it between 10,000 Maniacs and 50 Cent. Coming just over a year later, this new reissue on local label Skybucket is housed in a digipak and includes new artwork, but that original box remains a pretty good metaphor for the band&amp;#039;s sound, which is similarly unwieldy. Cicada is chockablock with ideas, encompassing an impressive breadth of styles and sounds-- sharp Southern rock, drowsy gospel, laidback 1970s pop, buzzing indie lo-fi, Sparklehorse-style self-destructive folk, percolating lounge rhythms, threadbare Americana, a little country, a little blues, a few drum machines and some George Harrison-style guitarwork-- all jammed together in 21 tracks with unusual arrangements, jostling transitions, and abrupt endings that musically enact the lyrics&amp;#039; obsession with untimely death and departure.\n\nThe core of 13ghosts, which takes its name from the William Castle horror flick (filmed in Illusion-O!), is duo Brad Armstrong and Buzz Russell, who trade off vocal and songwriting duties throughout the album and whose voices and influences often contrast dramatically. Russell&amp;#039;s songs, including &quot;Trodden Way&quot; and &quot;The Trouble With Actual Organs&quot;, pair strong pop melodies with spacey atmospherics, recalling bands like the Comas and Modest Mouse. Armstrong has a slightly wider range; in fact, I thought he was two different people at first. He alternates between a low-key, world-weary voice on tracks like &quot;Just Got Dead&quot; and &quot;Song from Down Here&quot; and a louder, brasher rasp on &quot;The Storm&quot; and &quot;Worldshaker&quot;. His &quot;Robert J.&quot; is the album&amp;#039;s centerpiece; perhaps the most straightforward melody and arrangement on Cicada, it&amp;#039;s a cautionary tale about a local singer scared of being swallowed up by his music, and it sounds like it could have been written by or about The Band. Armstrong doesn&amp;#039;t romanticize or sentimentalize Robert J., but he and Russell clearly identify with him and certainly sympathize with his predicament, especially when 13ghosts&amp;#039; own music threatens to swallow them up.\n\nCicada sounds larger than just two people. Thanks to a cast of supporting musicians-- including Azure Ray&amp;#039;s Maria Taylor, who sings on &quot;Three Little Birds (After Bob Marley)&quot;-- the music itself is always changing, swirling unsteadily around them, barely controlled. For example, the soft, spacy &quot;Toby Dammit Part One&quot; ends with a loud guitar outro that leads perfectly into &quot;Wormhead, My Dear&quot;, which itself changes shape as it transitions into &quot;Ain&amp;#039;t It Low&quot;. It&amp;#039;s not simply that anything could happen at any time on Cicada, but, more crucially, that everything seems to be happening all at once, as if the band felt life was too short or death too near to withhold any ideas or deny any possibilities. If Cicada sounds long, messy, and unfocused, it is-- but fascinatingly so. That scattershot aesthetic proves to be the album&amp;#039;s life force, as the music derives its power from the crawlspaces between these sounds and styles. It makes for a strange, often unsettling listen, but one no less exciting for being so constantly disorienting.","torrent":{"xt":"urn:btih:715b56dfeba03fd790457f09b985f0f7f6d6d2d1","amp;dn":"13Ghosts-+Cicada%282004%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"715b56dfeba03fd790457f09b985f0f7f6d6d2d1","infoHashBuffer":{"type":"Buffer","data":[113,91,86,223,235,160,63,215,144,69,127,9,185,133,240,247,246,214,210,209]},"announce":[],"urlList":[]}}