{"title":"Paranormal Activity 1tm6 NL Collected By Jeffrey","uid":12765966,"size":5639884191,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7210957d2b740617b4c2706dc3d0bc1563bb7ad6&amp;dn=Paranormal+Activity+1tm6+NL+Collected+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gljeffrey45","files":9,"time":1447599450,"description":"Paranormal Activity 1tm6 NL Collected By Jeffrey \r\n\r\nParanormal Activity 1 (2007) \r\n\r\nVerenigde Staten \r\nThriller / Horror \r\n86 minuten / 97 minuten (extended version) \r\n\r\ngeregisseerd door Oren Peli \r\nmet Micah Sloat, Katie Featherston en Amber Armstrong \r\n\r\nEen jong duo lijkt alles uitstekend voor elkaar te hebben. Tot op de dag dat er plotseling allerlei bizarre dingen gebeuren in het huis van het tweetal. Ze besluiten om een videocamera aan te schaffen en vast te leggen wat zich er precies in hun huis afspeelt als ze liggen te slapen. \r\n\r\n\r\nParanormal Activity 2 (2010) \r\n\r\nVerenigde Staten \r\nHorror / Thriller \r\n91 minuten / 97 minuten (unrated versie) \r\n\r\ngeregisseerd door Tod Williams \r\nmet Brian Boland, Sprague Grayden en Molly Ephraim \r\n\r\nDe familie van Katie (Katie Featherston) installeert na een serie gebeurtenissen, waarvan ze denken dat het inbraken zijn, beveiligingscamera's in hun huis. Het blijkt dat een paranormale aanwezigheid en Katie zelf verantwoordelijk zijn voor de schade. Overtuigd dat er iets bovennatuurlijks aan de hand moet zijn met een geest, moet de familie Katies kwellingen doorstaan terwijl de geest op haar kleine neefje Hunter aast. \r\n\r\n\r\nParanormal Activity 3 (2011) \r\n\r\nVerenigde Staten \r\nHorror / Mystery \r\n83 minuten / 94 minuten (unrated director's cut) \r\n\r\ngeregisseerd door Henry Joost en Ariel Schulman \r\nmet Chloe Csengery, Jessica Tyler Brown en Katie Featherston \r\n\r\nAchttien jaar voor de gebeurtenissen van deel 1 en 2 volgen we Katie en haar zus Kristi in het huis van hun ouders. Na verloop van tijd merkt Dennis dat Kristi zich raar begint te gedragen nadat ze heeft beweerd een onzichtbare vriend te hebben, genaamd Toby. Op aanraden van Randy plaatst Dennis een aantal camera's in het huis om te zien of er ook echt iets rondspookt. Ze doen een schokkende ontdekking... \r\n\r\nParanormal Activity 4 (2012) \r\n\r\nVerenigde Staten \r\nHorror \r\n88 minuten / 96 minuten (unrated versie) \r\n\r\ngeregisseerd door Henry Joost en Ariel Schulman \r\nmet Kathryn Newton, Katie Featherston en Bradley Allen \r\n\r\nHet verhaal speelt zich af in 2011, vijf jaar nadat Katie haar vriend Micah, haar zus Kristi en haar echtgenoot Daniel heeft vermoord en hun baby Hunter heeft meegenomen. Alex en haar familie, ervaren vreemde gebeurtenissen in hun huis. Alex begint een vermoeden te krijgen dat het te maken heeft met de eigenaardige vrouw en haar zoontje die aan de overkant van de straat wonen. \r\n\r\nParanormal Activity 5: The Marked Ones (2014) \r\n\r\nVerenigde Staten \r\nHorror \r\n84 minuten / 101 minuten (unrated versie) \r\n\r\ngeregisseerd door Christopher Landon \r\nmet Molly Ephraim, Richard Cabral en Andrew Jacobs \r\n\r\nNa de dood van zijn buurvrouw, begint Jesse rare en vreemde dingen mee te maken, die niet zomaar te verklaren zijn. Het duurt niet lang tot hij ontdekt dat hij gebrandmerkt is, door een demonische entiteit. Het is een kwestie van tijd, voor hij helemaal onder de invloed van deze entiteit zal zijn.... \r\n\r\nParanormal Activity 6: The Ghost Dimension (2015) \r\n\r\nVerenigde Staten \r\nHorror \r\n95 minuten \r\n\r\ngeregisseerd door Gregory Plotkin \r\nmet Chris J. Murray, Brit Shaw en Ivy George \r\n\r\nDe familie Fleeges, bestaande uit vader Ryan, moeder Emily en hun jonge dochter Leila, verhuist naar een nieuwe woning. In de garage ontdekken ze een videocamera en een doos met videobanden. Als ze door de lens van de camera kijken beginnen ze de paranormale activiteiten die zich rond hen afspelen te zien, met inbegrip van de wederopstanding van de jonge Kristi en Katie","torrent":{"xt":"urn:btih:7210957d2b740617b4c2706dc3d0bc1563bb7ad6","amp;dn":"Paranormal+Activity+1tm6+NL+Collected+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7210957d2b740617b4c2706dc3d0bc1563bb7ad6","infoHashBuffer":{"type":"Buffer","data":[114,16,149,125,43,116,6,23,180,194,112,109,195,208,188,21,99,187,122,214]},"announce":[],"urlList":[]}}