{"title":"Pokemon Advanced - Eindelijk Op Weg","uid":4176534,"size":4209125376,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:72170b4684ab266fa37d70f8d8da4509ae8b01ec&amp;dn=Pokemon+Advanced+-+Eindelijk+Op+Weg&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Pepneus","files":10,"time":1210167116,"description":"EINDELIJK OP WEG:\nPikachu is erg ziek geworden van de laatste aanval van Team Rocket. Hij heeft veel koorts en is gevaarlijk explosief! Omdat er geen Pokemon centrum in de buurt is, zoekt Ash hulp bij Professor Birch. Die kan Pikachu wel genezen, maar ze moeten hem wel eerst zien te vangen. Intussen is May op weg naar Professor Birch om haar eerste Pokemon te ontvangen. Zou zij de situatie kunnen helpen?\n\nEEN RUINE MET UITZICHT:\nAsh gaat samen met May op weg naar Oldale Town om zich in te schrijven voor de Hoenn League. Oldale Town is niet alleen in het bezit van een mooi Pokemon centrum, maar ook van een bijzondere ruÃƒÂ¯ne. Als Team Magma voor problemen zorgt, moeten Ash en May de boel zien te redden. Maar wie is toch die mysterieuze Pokemon in de ruÃƒÂ¯ne?\n\nOOST WEST, HOENN BEST:\nAsh en May komen aan in Petalburg City, de eerste stad met een Gym. Ash wil zo snel mogelijk in gevecht gaan met de Gym leader om zijn eerste badge te winnen. May voelt zich een beetje ongemakkelijk. Zou dat komen omdat ze Ash niet heeft verteld dat Norman, de Gym leader, haar vader is?\n\nTROTSE TAILLOW:\nAsh, May en haar kleine broertje Max zijn op weg naar Rustboro City, en ze hebben honger! De vrienden ontdekken een paar appelbomen, maar verstoren daar per ongeluk een boze groep Taillow. Ash en de rest kunnen de grote groep Pokemon niet aan, maar uit het niets verschijnt Brock met zijn Foretress! Ash is dolblij hem te zien, maar zal hij onze vrienden kunnen redden?\n\nReleasedatum:\t        6 mei 2008\nGenre: \t                Animatie\nSubgenre: \t        Jeugd\nSpeelduur: \t        100 minuten\nKijkwijzerleeftijd: \tLet op met kinderen tot 6 jaar \nKijkwijzer: \t        Geweld \nGesproken talen: \tNederlands\nGeluid: \t        Dolby Digital 2.0\nBeeld: \t                4:3\nProductiejaar: \t        2007\nSoort artikel: \t        DVD\nAantal DVD&amp;#039;s: \t        1 Disc\nEANNummer:\t        8711983487109","torrent":{"xt":"urn:btih:72170b4684ab266fa37d70f8d8da4509ae8b01ec","amp;dn":"Pokemon+Advanced+-+Eindelijk+Op+Weg","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"72170b4684ab266fa37d70f8d8da4509ae8b01ec","infoHashBuffer":{"type":"Buffer","data":[114,23,11,70,132,171,38,111,163,125,112,248,216,218,69,9,174,139,1,236]},"announce":[],"urlList":[]}}