{"title":"Fighting Pistol","uid":4074228,"size":2292436992,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:7230d1e2a5b30b4b53bfb2a4585bad70fa1bdf70&amp;dn=Fighting+Pistol&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BobTheBuilder2","files":7,"time":1205212584,"description":"Tactical Response - Fighting Pistol \n\nFINALLY a DVD training system that trains the brain before the body!\n\nThe root word to &quot;gunfight&quot; isn&amp;#039;t &quot;gun&quot;. It is &quot;FIGHT&quot;!\n\nThis is the DVD adaptation of the most comprehensive handgun course in the world that everyone is talking about! Tactical Response?s Fighting Pistol course prepares you to prevail in a real world violent confrontation and now this DVD captures the Mindset, Tactics, and Legal lectures that Tactical Response has become famous for and it takes you for a one-on-one range session with James Yeager. This intensive DVD covers an incredible amount of material so watch it with a note pad!\n\nTopics include the role and attributes of the handgun, Mindset, Tactics, legal aspects of deadly force, anatomical stopping power, and mental conditioning for combat. Live fire drills include both one- and two-handed shooting, shooting on the move, use of cover and concealment, tactical-emergency-and speed loading, using both eye level and retention techniques, at a variety of ranges and from a variety of tactical body positions.\n\nThis DVD is only for serious practitioners and is HEAVY with lecture on mindset, tactics, skill, and legal issues so if you are looking for another ?shoot ?em up? DVD set that doesn?t address the REAL issues than this one is not for you. There is rangetime in this set but it mostly concentrates on the mental aspects of fighting. ","torrent":{"xt":"urn:btih:7230d1e2a5b30b4b53bfb2a4585bad70fa1bdf70","amp;dn":"Fighting+Pistol","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7230d1e2a5b30b4b53bfb2a4585bad70fa1bdf70","infoHashBuffer":{"type":"Buffer","data":[114,48,209,226,165,179,11,75,83,191,178,164,88,91,173,112,250,27,223,112]},"announce":[],"urlList":[]}}