{"title":"# World Series of Poker Championship 3datinum Release #","uid":4235343,"size":47493759,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:726364f2361161f4e3ccc44ad295f1a41c6b2c75&amp;dn=%23+World+Series+of+Poker+Championship+3datinum+Release+%23&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ssshameshane","files":1,"time":1213278973,"description":"# World Series of Poker Championship 3d Platinum Release #\n\nThough World Series of Poker Championship 3d Platinum Release offers both a single-player mode and a multiplayer option, multiplayer is really what you&amp;#039;ll want to stick to. The single-player mode, despite offering a number of tournaments, standard games, and specific scenarios (such as being the short stack at the final table, or going heads-up with even stacks), has an artificial intelligence that&amp;#039;s so severely boneheaded that it makes the mode all but worthless. You can mercilessly bully any opponent into folding, no matter what the table position is or how much they&amp;#039;ve already committed to the pot. After a couple of rounds, you should be able to just win any single-player game every single time if you know what you&amp;#039;re doing. \n\nIf you don&amp;#039;t, Texas Hold &amp;#039;em is adequate in terms of showing you the rules of the game, but don&amp;#039;t expect to pick up any real strategies unless you go online. And even then, stick to tournaments and games against friends you know aren&amp;#039;t going to play like clowns, as the open-table games are littered with players going all-in every single chance they get. Those are the breaks when you play with fake money, but it&amp;#039;s still pretty annoying to put up with. Another annoyance is that you&amp;#039;ll often find yourself waiting for long periods of time to get into open-table games, due to the fact that you&amp;#039;ll have to wait for the big blind to come back around to you before you can jump in. This is a completely understandable provision, as it forces people to pay to start playing, but if someone busts out before it comes back around to you, and it screws up the flow of the blinds, the game sometimes resets the queue, forcing you to wait even longer. Given how many people like to go all-in, this could happen to you a lot. \n","torrent":{"xt":"urn:btih:726364f2361161f4e3ccc44ad295f1a41c6b2c75","amp;dn":"%23+World+Series+of+Poker+Championship+3datinum+Release+%23","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"726364f2361161f4e3ccc44ad295f1a41c6b2c75","infoHashBuffer":{"type":"Buffer","data":[114,99,100,242,54,17,97,244,227,204,196,74,210,149,241,164,28,107,44,117]},"announce":[],"urlList":[]}}