{"title":"Yasujiro Ozu - Tokyo Monogatari","uid":4088389,"size":1798346073,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7272c235d046e119071a900abd256429d4714a21&amp;dn=Yasujiro+Ozu+-+Tokyo+Monogatari&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":4,"time":1205943296,"description":"[XVID JAP SUB ITA-ENG]Yasujiro Ozu - Tokyo Monogatari\n\nDetails:\t[IMG]http://img299.imageshack.us/img299/9517/tokyomonogatariwk1.jpg[/IMG]\n\nYASUJIRO OZU - TOKYO MONOGATARI\n\t\n\nYasujiro Ozu - Tokyo Monogatari\n\nPiece Size: 2.00 MB\nOzu&amp;#039;s Tokyo Story is a serene and contemplative look at the breakdown in the relationship between grown children and their elderly parents shortly after World War II. The film concerns itself with problems many of us must face: the struggle to maintain a self-fulfilling life independent of parental expectations, the changes in relationships wrought by time, and the inevitability of separation and loss. Ozu does not point the finger at either parents or children but, like many of his films, offers a thoughtful meditation on the transitory nature of life. \n\nAs the film opens, we see an empty street, empty train tracks and an empty pier, perhaps an early indicator of the sense of loss that pervades the film. An elderly father, Shukishi Hirayama (Chishu Ryu) and his wife Tomi (Chieko Higashiyama) are preparing to travel by train to visit their children in Tokyo. When they arrive, they are met with indifference by daughter Shige (Haruko Sugimura), their grandchildren Minoru (Zen Murase) and Isamu (Mitsuhiro Mori), and son Koichi (So Yamamura), a Tokyo pediatrician. When Koichi is called to visit a patient and Shige cannot leave her beauty salon, the Harayamas postpone a sightseeing trip and start to complain that they expected the children would be living in more comfortable circumstances. Their widowed daughter-in-law Noriko (Setsuko Hara), however, welcomes them warmly and gives them the experience of being appreciated. \n\nTo give themselves some breathing room, the children pool their resources and send their parents to Atami, a health spa. Their visit, however, is cut short when the noise and crowds make going home seem like a better alternative. When they get back to Tokyo, Shige tells them she has a meeting scheduled at her house and Tomi decides to spend the night with Noriko. Shukishi, in a very humorous scene, goes out drinking with old friends and shows up late at night at Shige&amp;#039;s house completely drunk. When the elderly parents return to Onomichi, the mother suddenly becomes very ill and the entire family, including youngest son Keizo from Osaka, must come and visit them. The moment of epiphany comes when the youngest daughter Kyoko (Kyoko Kagawa) asks Noriko whether or not life is disappointing. Her answer mirrors Ozu&amp;#039;s concept of mono no aware, that we cannot avoid the sadness of life, but her beaming face tells us that things are just the way that they are and that it is perfect.\n\n","torrent":{"xt":"urn:btih:7272c235d046e119071a900abd256429d4714a21","amp;dn":"Yasujiro+Ozu+-+Tokyo+Monogatari","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7272c235d046e119071a900abd256429d4714a21","infoHashBuffer":{"type":"Buffer","data":[114,114,194,53,208,70,225,25,7,26,144,10,189,37,100,41,212,113,74,33]},"announce":[],"urlList":[]}}