{"title":"Michael ft.Justin – Love never felt so good","uid":12742479,"size":76635496,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:73273ec262d522bea80ccf20613fccbaecf40d0e&amp;dn=Michael+ft.Justin+%26ndash%3B+Love+never+felt+so+good&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vitolanz","files":1,"time":1447254091,"description":"Michael ft.Justin – Love never felt so good[720p - H264 - Aac][TNTVillage]\r\n----------------------------------------\r\n.: Scheda del Video :.\r\n\r\nTitolo originale: Love never felt so good\r\nArtista: Michael Jackson ft. Justin Timberlake\r\nNazionalità: Stati Uniti D’America\r\nGenere: Rhythm and blues, Disco, Soul\r\nAlbum: Xscape\r\nData uscita:13 Maggio 2014\r\n----------------------------------------\r\n.: Descrizione :.\r\nLove Never Felt So Good è una canzone dell'artista statunitense Michael Jackson, registrata in versione demo nel 1983[1] e pubblicata come primo singolo dell'album postumo Xscape il 2 maggio 2014. Il brano è stato pubblicato in tre versioni diverse: la versione originale incisa nel 1983, contenuta nel CD 2 della Deluxe Edition dell'album, e due versioni rivisitate dal produttore statunitense Timbaland; la Xscape Version, in cui è presente solo la voce di Michael Jackson, e la Remix Version, in cui il re del pop duetta con Justin Timberlake.La canzone è stata lanciata in anteprima mondiale il 1º maggio 2014 durante la serata degli iHeartRadio Music Awards.\r\nIl videoclip prodotto per il singolo è stato diretto da Rich Lee e Justin Timberlake[6][7], ed è stato pubblicato il 14 maggio 2014 su YouTube, sul canale Vevo di Michael Jackson. Il video vede protagonisti Justin Timberlake, un gruppo di ragazzi e un gruppo di ballerini che ballano eseguendo passi di danza del Re del pop, i quali presero parte ai più importanti videoclip del re del pop, dei quali vengono riproposte anche le relative location (la sala biliardo di &quot;Beat it&quot;, la stazione metropolitana di &quot;Bad&quot;). Si riconoscono, tra gli altri, la ragazza che chiude la carrellata multirazziale di &quot;Black or white&quot;, e il ballerino di breakdance che strappa il manifesto in &quot;Bad&quot;. Viene anche ricordata, tramite una insegna luminosa, la partecipazione dell'attore Vincent Price come voce parlante in &quot;Thriller&quot;; Michael Jackson appare nel video in alcune scene di questi video musicali, tra i quali: ABC, Blame It on the Boogie, Don't Stop 'Til You Get Enough, Billie Jean, Beat It, Thriller, Bad, Smooth Criminal, The Way You Make Me Feel, Speed Demon, Liberian Girl, Another Part of Me, Jam, Black or White, Remember the Time, In the Closet e Blood on the Dance Floor","torrent":{"xt":"urn:btih:73273ec262d522bea80ccf20613fccbaecf40d0e","amp;dn":"Michael+ft.Justin+%26ndash%3B+Love+never+felt+so+good","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73273ec262d522bea80ccf20613fccbaecf40d0e","infoHashBuffer":{"type":"Buffer","data":[115,39,62,194,98,213,34,190,168,12,207,32,97,63,204,186,236,244,13,14]},"announce":[],"urlList":[]}}