{"title":"Roguelands v0.4.6","uid":12725378,"size":108399225,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7346db70544068e13cd8cef32c840a27d6d60e7e&amp;dn=Roguelands+v0.4.6&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dauphong","files":1,"time":1447051175,"description":"\nAbout This Game\r\nIn the rush to invent, conquer, and create, the ultimate consequences are sometimes forgotten.\r\n\r\nEarth lies in ruin. Our ever advancing Aether technology opened a rift to another time, unleashing an ancient beast upon the galaxy. Known as the Destroyer, this massive creature travels from world to world devouring the Aether in planet cores only to leave a dead shell in its wake.\r\n\r\nYou play as a Galactic Cadet, tasked with traveling to hostile planets in search of precious resources before The Destroyer rips through the planet core. Team up with friends, gather resources, and craft powerful gear on your home planet so you can aid the fight to save the galaxy!\r\nFeatures:\r\n\r\n    Explore Procedurally Generated Worlds: Each world is generated as you and your Combat Squad beam down. With exotic creatures, hostile monsters, and unique ores and vegetation, each planet provides a different experience and challenge that will test your skill and knowledge of survival in Roguelands.\r\n\r\n    Unique Crafting System Gathering resources in Roguelands is unlike any other game. Instead of using a pickaxe or a hatchet to gather resources from ore deposits and trees, you command your Droids to do all of the work for you! Droids have different passive abilities and can cut down trees, mine ores, gather herbs, and even fight for you in combat. Once you've acquired 10 pieces of any loot, you can craft an Emblem. Combine any 3 Emblems at the Gear Forge to acquire a new piece of gear and expand your recipe log!\r\n\r\n    Permanent Death, but Permanent Progress Upon death your Galactic Cadet will die: losing all weapons, armor, and loot in their inventory. But anything that you've stored back on your ship will remain persistent across ALL of your characters! After tons of character deaths you'll have permanently unlocked new Races, Variants, Augments, and Starting Uniforms that you can mix and match to create a unique play style. Also, any upgrades to your ship and saved NPCs will be permanent, so your new characters can have access to all of your hard earned resources!\r\n\r\n    Master Every Weapon Type &amp; Variant: Roguelands features tons of exciting weapon types that players can experiment with. By progressing further through the galaxy by slaying monsters and crafting items, players will unlock new weapon variants with unique stats and randomly generated augments. Craft the perfect piece of gear through combining and forging!\r\n\r\n    Collect All Combat Chips: Every Galactic Cadet can equip up to five Combat Chips before beaming out to a planet. These special augments can provide not only passive buffs for you and your squad, but also active abilities such as teleportation or enabling the use of Darkfire. Through exploration of both hostile planets and neutral cities and towns, players will amass a collection of these powerful chips and enable a variety of playstyles and character archetypes.\r\n\r\n    Unlock the Secrets Behind the Destroyer &amp; the Scourge: The more NPCs you save, the more knowledge you'll acquire about the galaxy's chaotic and mysterious history. Where did the Destroyer come from? What is its true purpose?","torrent":{"xt":"urn:btih:7346db70544068e13cd8cef32c840a27d6d60e7e","amp;dn":"Roguelands+v0.4.6","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7346db70544068e13cd8cef32c840a27d6d60e7e","infoHashBuffer":{"type":"Buffer","data":[115,70,219,112,84,64,104,225,60,216,206,243,44,132,10,39,214,214,14,126]},"announce":[],"urlList":[]}}