{"title":"deus ex mac /classic/","uid":4064848,"size":708923018,"categoryP":"games","categoryS":"mac","magnet":"?xt=urn:btih:73dc13b205da005b161c3540cc3e1b696eb29344&amp;dn=deus+ex+mac+%2Fclassic%2F&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"esoldatov","files":2,"time":1204753016,"description":"Deus Ex is a cyberpunk-themed action role-playing game developed by Ion Storm Inc. and published by Eidos Interactive which combines gameplay elements of first-person shooters with those of role playing games. The game received almost universal critical and industry acclaim, including being named Best PC Game of All Time in a poll carried out by UK gaming magazine PC Zone.[2] It was a frequent candidate for and winner of Game of the Year awards.[3][4][5][6]\nSet in a dystopian world during the 2050s, the central plot follows rookie United Nations Anti-Terrorist Coalition agent JC Denton, as he sets out to combat terrorist forces, which have become increasingly prevalent in a world slipping ever further into chaos. As the plot unfolds, Denton becomes entangled in a deep and ancient conspiracy, encountering fictional recreations of organizations such as Majestic 12, the Illuminati, and the Hong Kong Triads throughout his journey.\nThe game was modestly successful commercially and was among the top selling computer role-playing games at the time of its release.[7] First published for personal computers running Windows, Deus Ex was later ported to Macintosh systems, as well the PlayStation 2 game console, the latter under the title Deus Ex: The Conspiracy. Loki Games worked on a Linux version of the game, but the company went out of business before releasing it.[8] A sequel to Deus Ex, titled Deus Ex: Invisible War, was released on December 2, 2003 for both Windows and the Xbox video game console.[9] On November 26, 2007, it was confirmed that Eidos Montreal is developing a second sequel, Deus Ex 3.[10]","torrent":{"xt":"urn:btih:73dc13b205da005b161c3540cc3e1b696eb29344","amp;dn":"deus+ex+mac+%2Fclassic%2F","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"73dc13b205da005b161c3540cc3e1b696eb29344","infoHashBuffer":{"type":"Buffer","data":[115,220,19,178,5,218,0,91,22,28,53,64,204,62,27,105,110,178,147,68]},"announce":[],"urlList":[]}}