{"title":"Zion Train - 1994 - Natural wonders of the world in dub (128k)","uid":4170399,"size":59921520,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:74d4bd9c5492034ec652faf86ef162a16c347e22&amp;dn=Zion+Train+-+1994+-+Natural+wonders+of+the+world+in+dub+%28128k%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"vinonovello85","files":16,"time":1209831482,"description":"Titolo: Zion Train - Natural Wonders Of The World In Dub\nAnno: 1994\nGenere: dub\nMp3 Bitrate: 128 kbps\nCovers: front\n\n-----------\nThis LP was recorded at the same time as many of the early Dub House tunes and was used as a chill out for ZT after the manic sessions for some of those. By now a Spirit Studio 24-8-2 desk had been purchased with money ZT got from an aborted production deal with Big Life. There was also had an Akai S3200 which radically improved sampling abilities. The M3R still supplied the rock solid bass and a variety of guest percussionists stepped from vinyl into the tunes to add a feel we had previously eluded us.\n\nPercussion is a vital part of Jamaican Dub yet none of ZT has any real skill as a percussionist and so for many years they have relied on samples to add that part to the mix. It has never been the intention to replicate Jamaican Dub music but ZT have always let it serve as a reference and eagerly absorbed any information about Jamaican studios and musicianship.\n\nA Lexicon PCM70 was added to the studio - excellent reverb sounds along with Tascam DATs to enhance the mastering sound.\n\nEach of the tracks on this LP is a beautiful place that ZT have either visited or read about and many people have been affected by these references. John Peel spoke to the band with great emotion about memories of Llanberis Pass and was amazed that anyone had written a song about it.\n\nThe extra tracks simply reflect the longer playing time available on a CD but the overall track programming with these included was very much designed to flow, as with all ZT&amp;#039;s CD releases.\n\nThe LP was remastered for 2005 release as a double vinyl featuring the original cd bonus tracks after being long unavailable.\n-------------------\nplease seed and enjoy us @","torrent":{"xt":"urn:btih:74d4bd9c5492034ec652faf86ef162a16c347e22","amp;dn":"Zion+Train+-+1994+-+Natural+wonders+of+the+world+in+dub+%28128k%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"74d4bd9c5492034ec652faf86ef162a16c347e22","infoHashBuffer":{"type":"Buffer","data":[116,212,189,156,84,146,3,78,198,82,250,248,110,241,98,161,108,52,126,34]},"announce":[],"urlList":[]}}