{"title":"X64 Security Pack 2008","uid":4097167,"size":112017639,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7559092fcb0004d7604670e6b3da78aaf8a51493&amp;dn=X64+Security+Pack+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"vmaster19","files":18,"time":1206382903,"description":"*ONLY TO USE WITH XP &amp; VISTA X64:\n\nAll software in this package have been released for free by their authors, and have been downloaded from their \noriginal servers.\n\nUsing cracked software means using viruses and Trojans as your means of security.\nCracked anti-virus applications do not scan for viruses designed by the cracker, and cracked firewalls will always have a couple of back doors open \nfor the author and his sponsors to come and visit.\n\nDO NOT BECOME A SLAVE OF THE BOTNET, SECURE YOURSELF FROM CRACKED SOFTWARE!\n\n\nBEST Installation order:\n\n1.AVG anti-virus\n2.Comodo BOClean Anti-Malware\n3.Lavasoft Ad-aware 2007\n4.Peerguardian\n5.Firefox and it&amp;#039;s plugins\n6.COMODO Firewall Pro 3\n\n\n\nDESCRIPTIONS:\n\nAVG anti-virus 7.5\n-----------------\n\nAVG is a decent anti-virus application.\nIt&amp;#039;s no kaspersky, but it&amp;#039;ll do the job for free on your x64 system.\n\nMaybe in the near future comodo free anti-virus will also go x64.. When so, make the switch.\n\n\n\nComodo BOClean Anti-Malware\n----------------------------\n\nThis application will protect your system 24/7 from all kinds of Malware.\n\n\nsource: http://www.comodo.com\n\n\nU.S. Lavasoft Ad-aware 2007\n----------------------------\n\nFor all your basic annual adware scans.\n\n*I advice you all to do a fast basic scan with this software every time prior you are about to buy something over the Internet.\nIt will always catch that last keylogger you thought you were free off.\n\n\n\nSOURCE: http://www.lavasoftusa.com/\n\n\n\nComodo personal firewall 3\n---------------------------\n\nThis firewall is quit amazing, and absolutely free. \nIf improperly configured it will nag you to death with stupid connection requests, but on the overall scale \nit&amp;#039;s a good product.\nIt&amp;#039;s pretty designed, and does not slow your shit down like some other firewalls did in the past.\n\n\nSource: &lt;a href=&quot; http://www.comodo.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.comodo.com&lt;/a&gt;\n\n\nPeerguardian 2 \n---------------\n\nUse peerguardian to secure your Internet connection and filter out bad peers.\nPeerguardian is free (open-source) and uses free Internet updated IP block lists to filter out Time Warner, sony and other company&amp;#039;s from \nconnecting to your computer and prosecuting you later on with the facts that you have been sharing their shit!\nAlso filter out Anti-P2P company&amp;#039;s sending out corrupts data to the torrent hive to slow shit down. \n(plus governmental and educational institutions, advertising and reported malicious servers.)\n\n\nFAQ:\n\n*Some people are having trouble updating Peerguardian, in this case you can disable it whilst updating and then enable it again after it finished.\n\n*Don&amp;#039;t forget to configure your peerguardian to either not log your connections or at least delete your logs everyday. \n(if peerguardian will continue to log without removal of the log, after a couple of months you&amp;#039;ll have a log of about 1 GB, and that will slow your shit down!)\n\n*When changing configuration settings within peerguardian, shutdown peerguardian after completion of your actions and restart the application. \n(this will ensure your configuration changes have been written down in the configuration file)\n\n\n\nSource: http://phoenixlabs.org/pg2/\n\n\n\n\n\nFIREFOX PLUGINS:\n\nNoscript\n----------\n\nThe NoScript Firefox extension provides extra protection for Firefox, Flock, Seamonkey and others mozilla-based browsers: \nthis free, open source add-on allows JavaScript, Java, Flash and other plugins to be executed only by trusted web sites of your choice \n(e.g. your online bank), and provides the most powerful Anti-XSS protection available in a browser.\n\nNoScript&amp;#039;s unique whitelist based pre-emptive script blocking approach prevents exploitation of security vulnerabilities \n(known and even not known yet!) with no loss of functionality..\n\n\nPhistank\n-----------\nPhishing is a fraudulent attempt, usually made through email, to steal your personal information. \nThe best way to protect yourself from phishing is to learn how to recognize a phish.\nPhishing emails usually appear to come from a well-known organization and ask for your personal information ? such as credit card number, \nsocial security number, account number or password. Often times phishing attempts appear to come from sites, \nservices and companies with which you do not even have an account.\nIn order for Internet criminals to successfully &quot;phish&quot; your personal information, they must get you to go from an email to a website. \nPhishing emails will almost always tell you to click a link that takes you to a site where your personal information is requested. \nLegitimate organizations would never request this information of you via email.\n\nAnd Phistank will protect you from the Nigerian niggers!\n\n\nAdblock Plus\n--------------\nOne of the best anti-advertisement plugins I have ever seen.\n\n\n\n***************************\nJust drag these plugins individually onto your open firefox browser window and the installer will appear.\n\n\nSource for all plugins: https://addons.mozilla.org\n***************************\n\n\nUSE MOZILLA FIREFOX INSTEAD OF INTERNET EXPLORER, SINCE IT HAS BEEN PROVEN TO BE MORE SECURE THEN I.E.:\n\nGo get it for free at:\n &lt;a href=&quot;\nhttp://download.mozilla.org&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://download.mozilla.org&lt;/a&gt;\n\n\n\n\n\nKEYWORDS: X64, anti-virus, virus, antivirus, firewall, fire wall, addware, adware, \nad aware,adaware, trojan, trojans, virusses, security, secure, phish, phishing, security pack, free\n\n64-bit\n\n64 bit\n\n","torrent":{"xt":"urn:btih:7559092fcb0004d7604670e6b3da78aaf8a51493","amp;dn":"X64+Security+Pack+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7559092fcb0004d7604670e6b3da78aaf8a51493","infoHashBuffer":{"type":"Buffer","data":[117,89,9,47,203,0,4,215,96,70,112,230,179,218,120,170,248,165,20,147]},"announce":[],"urlList":[]}}