{"title":"Oven Fresh HTML Button Maker 2.0","uid":4187339,"size":2841621,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:75cf7a8864d4bd34dbbe3a39f8e5d66ea78f156d&amp;dn=Oven+Fresh+HTML+Button+Maker+2.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Loaiqngrens","files":1,"time":1210746491,"description":"Oven Fresh HTML Button Maker is the quicker and easier way to make HTML buttons for your Website without writing a single line of code. No HTML or JavaScript experience needed. In just a couple of minutes, you can create professional HTML buttons for a variety of uses. The WYSIWYG button preview pane (What You See is What You Get) enables the instant update of your design while you work. You can link to a web page, Website, image, or email program.You can open the linked document in an IFrame (parent, self. or top) or you can open the document in a named IFrame.You can also open the document in a named Frame of a Frameset. Alternatively, you can open the linked document in a new window. So it&amp;#039;s extremely easy to open a linked document anywhere on a Website. You can elect to trigger an event when the button is pressed. The user can be directed to go back to the last page, forward, close the window, print the page, disable the button, hide the button, refresh the page, reset the form, submit a form, and scroll to the top of the page. Button text can change to something new when the button is pressed. For example, a &quot;Submit&quot; button when clicked would read &quot;Submitting...&quot;. You can assign an access key to allow the user to jump immediately to your link or trigger the event by pressing a single key on their keyboard. Many elements can be customized easily including button text, text color, fonts, and more to fit your Website theme and layout. For example, use an icon with text, or just an image instead of text if you wish. Other features include, id and name attributes, cursor selections, tip text, and more. So it&amp;#039;s convenient to make the HTML button you need to fit almost any purpose on your Website. How does it work? HTML Button Maker uses JavaScript to notify a browser to initiate the specified link or trigger an event when the button is pressed","torrent":{"xt":"urn:btih:75cf7a8864d4bd34dbbe3a39f8e5d66ea78f156d","amp;dn":"Oven+Fresh+HTML+Button+Maker+2.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"75cf7a8864d4bd34dbbe3a39f8e5d66ea78f156d","infoHashBuffer":{"type":"Buffer","data":[117,207,122,136,100,212,189,52,219,190,58,57,248,229,214,110,167,143,21,109]},"announce":[],"urlList":[]}}