{"title":"The Place to Stand ebook epic pdf","uid":4084298,"size":4540314,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:76d57f7e5fc87354300e0e2d9290885a1f6cc828&amp;dn=The+Place+to+Stand+ebook+epic+pdf&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"robertlukens","files":1,"time":1205714375,"description":"More Info and other formats available at http://soverindi.com\n\nAmerica&amp;#039;s founding fathers seized the lever of freedom. This handful of men gave the rest of Mankind a brief glimpse of freedom. They raised the world, if only for a golden moment. Freedom&amp;#039;s well-meaning defenders were outwitted and outperformed by their enemies.  Was that one valiant attempt mankind&amp;#039;s last effort? There are no new worlds left.Â  \n\nAs you read this, every inch of the globe is under constant surveillance. There is a frantic scramble to close every avenue of escape from whatever is planned for man&amp;#039;s future. There is no refuge for those not content with living as domesticated  animals, blindly following the self-appointed rulers. Were a new group of men to decide to actively pursue freedom, as opposed to merely talking about it, could they find a foothold, a place to stand,  from which to raise the world?Â Â  \nRead &quot;The Place to Stand&quot; the E-book that originated the word &quot;Soverindi,&quot; symbol of  the sovereign individual.\n\nQuestion: What does the richest, most intelligent man in the world do when  warned that  powerful forces behind the scenes of the US government and the European Community are determined to destroy him, merely because his self-reliant independence, his rationality, and his extraordinary success  set a compelling example for possible imitators, while his foes are dead set on fostering dependence on ever more powerful government and  on dumbing down the citizenry to unconscious subservience?Â \nAdvised to merely cut his losses, if he can, resistance being essentially impossible, his indomitable spirit refuses to submit. He is determined to find a solution.Â Â \nCan there be a  solution that will  serve no matter what form the attack might take, whenever it may come?Â \nIf even he, with all his consummate resources,  is defenseless, can there be any hope for the rest of mankind? What can he do?\nAnswer: That&amp;#039;s what this book is about.Â Â \nIt is the story of one man&amp;#039;s quest for the freedom that is due to every man, the freedom to control his own life and his own destiny - the freedom to be truly human.\nHe and a handful of like-minded individuals are determined to to be free to have, do, and be all that they can have, do, and be,  to live as full-fledged human beings, and not to live at the subhuman level of sheep that would follow their leader over a cliff and even believe it their duty to do so.Â \nTheir foes are nothing less than the governments of the world and those who control them.  It is David against a world of Goliaths.Â \nTheirs may well be Man&amp;#039;s last struggle for real freedom. The future of mankind may hang in the balance.\n***\nSize:Â  445,000 words - (1052 pages in MS Word, or if it were a printed book)Â \n","torrent":{"xt":"urn:btih:76d57f7e5fc87354300e0e2d9290885a1f6cc828","amp;dn":"The+Place+to+Stand+ebook+epic+pdf","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76d57f7e5fc87354300e0e2d9290885a1f6cc828","infoHashBuffer":{"type":"Buffer","data":[118,213,127,126,95,200,115,84,48,14,14,45,146,144,136,90,31,108,200,40]},"announce":[],"urlList":[]}}