{"title":"Cincom Smalltalk 2008 Non-Commercial (VisualWorks 7.6 + ObjectSt","uid":4172354,"size":531900416,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:76d820e0ffaaa89ede7897a4ba0511911f52fce1&amp;dn=Cincom+Smalltalk+2008+Non-Commercial+%28VisualWorks+7.6+%2B+ObjectSt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bpopov","files":1,"time":1209937723,"description":"Cincom includes VisualWorks as part of the Cincom Smalltalk Suite. VisualWorks is an enterprise-class application development and delivery platform used by world-class companies in areas such as semiconductor manufacture, shipping, financial risk management, insurance, banking, government, education and health care. VisualWorks is instantly portable across a wide range of platforms: Windows (ME/2000/XP/200x/CE ARM &amp; x86), Mac OS 9, Mac OS X PowerPC and Intel, Linux (x86/SPARC/PPC), HPUX, AIX, SGI Irix, Solaris (SPARC/x86), with full 64-bit support on Linux (x86-64) and Solaris (SPARC/x86-64). For Linux, we have have tested against RedHat Enterprise Linux specifically.  VisualWorks includes components for any type of work your team might contemplate: Web Applications, WS* (Web Services), Internet Connectivity, and Database Connectivity - with a set of superior development tools. VisualWorks now includes best of breed tools such as the Refactoring Browser and the Professional Debugger Package, fully integrated with the product.\n\nCincom includes ObjectStudio as part of Cincom Smalltalk. ObjectStudio is the first - and only - Windows Vista certified Smalltalk environment. For customers needing to build applications that cleanly fold into a Microsoft-centric infrastructure, ObjectStudio is the best choice. ObjectStudio is a Windows-specific platform that is oriented toward building client applications that need good connectivity to databases.\n","torrent":{"xt":"urn:btih:76d820e0ffaaa89ede7897a4ba0511911f52fce1","amp;dn":"Cincom+Smalltalk+2008+Non-Commercial+%28VisualWorks+7.6+%2B+ObjectSt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"76d820e0ffaaa89ede7897a4ba0511911f52fce1","infoHashBuffer":{"type":"Buffer","data":[118,216,32,224,255,170,168,158,222,120,151,164,186,5,17,145,31,82,252,225]},"announce":[],"urlList":[]}}