{"title":"RayFire","uid":4075224,"size":5640626,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7721743655161da8dc93ebfb673985ab8f455e65&amp;dn=RayFire&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Electronburn","files":1,"time":1205265358,"description":"RayFire Tool gives You ability to shoot, destroy, demolish, ruin, break down, make havoc, blow up, burst, detonate, explode and do other similar things You have always dreamed of to do in Max\n\n\nRayFire Tool gives You ability to shoot, destroy, demolish, ruin, break down, make havoc, blow up, burst, detonate, explode and do other similar things You have always dreamed of to do in Max..\n\nFeature list:\n\nReactor Hit. Creates realistic physical interaction of impact objects with bullets. \nDisplace. Automatically subdivides impact faces and creates detailed animated dents. \nHoles. Creates holes and destruct Impact objects piece by piece totally in real time. \nFragmentation. Allows you to fragment geometry objects on many pieces. \nReactor Explosion. Allows you to realistically explode objects. \nInstant Action. Allows you to shoot and explode without gun, manually defining all impact spots on impact object. \nVarious effects, such as Impact flash, Muzzle Flash, Particle Debris, Geometry Debris, Fragmented Debris from Holes, Smoke, Sparks, Blood, Decals, Bullets and any Custom objects which you can define by yourself. \nInteractive Layer Manager. Allows you to interactively change properties in the already created effects, select, hideunhide, freezeunfreeze and delete any created layer or effect. \nMultiple animated Guns. You can shoot from as many guns as you like. \nMultiple animated Impact objects. Also you can use skinned, pointcached or deformed in any other ways objects.\n\nRRP $200,00","torrent":{"xt":"urn:btih:7721743655161da8dc93ebfb673985ab8f455e65","amp;dn":"RayFire","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7721743655161da8dc93ebfb673985ab8f455e65","infoHashBuffer":{"type":"Buffer","data":[119,33,116,54,85,22,29,168,220,147,235,251,103,57,133,171,143,69,94,101]},"announce":[],"urlList":[]}}