{"title":"Rick James - Street Songs &amp; Throwin' Down@320","uid":4088300,"size":192151535,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:780cdb570a838eceb5ea65c9e10822351cd12d8b&amp;dn=Rick+James+-+Street+Songs+%26+Throwin%5C%27+Down%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"alekow1","files":23,"time":1205939150,"description":"This is a &amp;#039;2LP in 1CD&amp;#039; Release\n\n\n\n1. Rick James - Street Songs\n\n\n\nDisappointed because Garden of Love wasn&amp;#039;t as well received as it should have been, Rick James made a triumphant return to defiant, in-your-face funk with the triple-platinum Street Songs. This was not only his best-selling album ever, it was also his best period, and certainly the most exciting album released in 1981. The gloves came all the way off this time, and James is as loud and proud as ever on such arresting hits as &quot;Super Freak,&quot; &quot;Give It to Me Baby,&quot; and &quot;Ghetto Life.&quot; Ballads aren&amp;#039;t a high priority, but those he does offer (including his stunning duet with Teena Marie, &quot;Fire and Desire&quot;) are first-rate. One song that&amp;#039;s questionable (to say the least) is the inflammatory &quot;Mr. Policeman,&quot; a commentary on police misconduct that condemns law enforcement in general instead of simply indicting those who abuse their authority. But then, the thing that makes this hot-headed diatribe extreme is what makes the album on the whole so arresting -- honest, gut-level emotion. James simply follows what&amp;#039;s in his gut and lets it rip. Even the world&amp;#039;s most casual funksters shouldn&amp;#039;t be without this pearl of an album.\n\n\n\n\n01. Give It To Me                                                                                                       \n02. Ghetto Life                                                                                                         \n03. Make Love To Me                                                                                                     \n04. Mr. Policeman                                                                                                       \n05. Super Freak                                                                                                         \n06. Fire And Desire                                                                                                     \n07. Call Me Up                                                                                                          \n08. Below The Funk  \n\n\n\n\n\n2. Rick James - Throwin&amp;#039; Down\n\n\n\nRick James fans generally agree that 1981&amp;#039;s Street Songs is his finest album -- in fact, Street Songs is essential listening for anyone with even a casual interest in hardcore funk. Unfortunately, James tried to recycle the album&amp;#039;s formula on many of his subsequent albums, and by the mid-&amp;#039;80s, he had become a very predictable and redundant caricature of himself. But in 1982, James was still exciting. That year&amp;#039;s Throwin&amp;#039; Down, the album that followed Street Songs, falls short of essential but is still rewarding. Many of the songs are excellent, including the cynical &quot;Money Talks&quot; and the major hits &quot;Standing on the Top&quot; (which features the Temptations) and &quot;Dance Wit&amp;#039; Me.&quot; Not surprisingly, hardcore funk dominates the record, although Throwin&amp;#039; Down contains a few pleasing soul ballads as well. &quot;Happy,&quot; a duet with Teena Marie, and &quot;Teardrops&quot; point to the fact that James can be a very expressive ballad singer even though he is best known for his up-tempo material. This album does sound like recycled Street Songs at times, but in 1982, James had yet to run the formula into the ground. All things considered, Throwin&amp;#039; Down was an enjoyable, if imperfect and slightly uneven, addition to the funkster&amp;#039;s catalog.\n\n\n\n\n09. Dance Wit&amp;#039; Me                                                                                                       \n10. Money Talks                                                                                                         \n11. Teardrops                                                                                                           \n12. Throwdown                                                                                                           \n13. Standing On The Top                                                                                                 \n14. Hard To Get                                                                                                         \n15. Happy                                                                                                               \n16. 69 Times                                                                                                            \n17. My Love                                                                               \n\n\nLabel: Motown Rec.\nDate: 1986\n\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\n\n\nEnjoy,Seed and Share\t\n","torrent":{"xt":"urn:btih:780cdb570a838eceb5ea65c9e10822351cd12d8b","amp;dn":"Rick+James+-+Street+Songs+%26+Throwin%5C%27+Down%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"780cdb570a838eceb5ea65c9e10822351cd12d8b","infoHashBuffer":{"type":"Buffer","data":[120,12,219,87,10,131,142,206,181,234,101,201,225,8,34,53,28,209,45,139]},"announce":[],"urlList":[]}}