{"title":"Katrina Ville1x02 [SPANiSH HDTV][seriesani.]","uid":4240508,"size":360665088,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:781aef2934bd51e44c5fd773f625b44484b5d284&amp;dn=Katrina+Ville1x02+%5BSPANiSH+HDTV%5D%5Bseriesani.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seriesani","files":1,"time":1213516179,"description":"A?o: 2007\nT?tulo original: &quot;K-Ville&quot;\nG?nero: Crimen, Drama\nTemporada: 1?Temporada\nIdioma: Espa?ol\nCalidad: Hdtv+Dvb\nCapitulos: 13\nTama?o X Capitulo: 350Mb Aprox.\n\n\n\nInterpretaci?n:\nCole Hauser\nAnthony Anderson\nBlake Shields\nTawny Cypress\nJohn Carroll Lynch\nMichele Adams\nElise Neal\n\n\nSinopsis:\nK-Ville es una serie del canal FOX, estrenada el 17 de septiembre del 2007, que cuenta en el elenco con Anthony Anderson (The Shield), Cole Hauser, Maximiliano Hernndez, Blake Shields, Tawny Cypress (Heroes) y John Carroll Lynch (Close to Home, Carnivale).\nLa serie se centra en la historia de los personajes dos a?os despu?s del hurac?n Katrina, cuando la ciudad de New Orleans todav?a est? en pleno caos. Muchos oficiales de polic?a ya no lo son, las comisar?as y los laboratorios que trabajan con ellas no han sido reconstruidos o no lo han hecho totalmente. Aunque todav?a hay algunos polic?as que encuentren el coraje de seguir en su duro oficio a pesar de las condiciones dif?ciles que se les presentan a diario. Marlin Boulet (Anthony Anderson ) forma parte de una unidad llamada Felony Action Quad, especializada en la b?squeda de los criminales m?s peligrosos. A pesar del abandono de su compa?ero durante la tempestad, se qued? en su puesto, pasando d?as enteros en el agua para salvar idas y hacer respetar el orden. Est? convencido en todo caso que desde ahora en adelante van a tener que bordear a veces las normas para coger a los enemigos de la ley. El nuevo compa?ero de Boulet, Trevor Cobb (Cole Hauser), era un soldado en Afganist?n antes de unirse a la unidad especializada. Es estricto y voluntario. Si est? muy poco conforme con los m?todos de Boulet, es porque esconde un secreto terrible... Desde ahora en adelante New Orleans ser? el lugar donde purgue sus pecados, pero la redenci?n puede ser peligrosa a veces. ? Podr? Boulet confiar en ?l? ?Qu? esconde el pasado de Cobb que puede poner en peligro a ambos compa?eros?\nUno de los triunfos de la serie ya en su piloto es tener de tel?n de fondo New Orleans, un lugar bell?simo que queda siempre impecable de trasfondo de una historia. Pero, evidentemente, la serie integra en su gui?n la cat?strofe de septiembre del 2005. Es pues un New Orleans post-Katrina, lentamente levant?ndose de sus ruinas. Y eso es lo que nos encontramos, no el lugar id?lico que todos hemos visto en alguna pel?cula. Un aspecto a priori interesante que la serie trata y que nos aleja de la atm?sfera acostumbrada y festiva con m?sica de una banda de jazz que las series y las pel?culas grabadas all? nos suelen mostrar. Conservando la esencia de esta ciudad, la serie se interesa evidentemente m?s por el caos que ha sufrido todo y todos tras inundaciones, la de los habitantes que abandonaron sus casas y la de los que se quedaron, las de todos los que sufren secuelas psicol?gicas. Traumatismo de los ni?os frente al agua o, los adultos, los recuerdos de esos d?as de infierno pasados por agua.\nMarlin Boulet es un hombre profundamente sacudido por los acontecimientos, siempre sobre la brecha, que se apresura por hacer renacer su ciudad. Pero el telespectador percibe detr?s de estos excesos de violencia a un hombre que coquetea peligrosamente con sus l?mites y que corre el peligro de romperse o de hundirse a cada momento. Los resbalones que sufre ya podemos apreciarlos en el piloto de la serie; en el momento en el que est? a punto de matar a su nuevo compa?ero... As?, el episodio inicial pone en el tapete todas las consecuencias humanas y materiales del Katrina.\n","torrent":{"xt":"urn:btih:781aef2934bd51e44c5fd773f625b44484b5d284","amp;dn":"Katrina+Ville1x02+%5BSPANiSH+HDTV%5D%5Bseriesani.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"781aef2934bd51e44c5fd773f625b44484b5d284","infoHashBuffer":{"type":"Buffer","data":[120,26,239,41,52,189,81,228,76,95,215,115,246,37,180,68,132,181,210,132]},"announce":[],"urlList":[]}}