{"title":"Advanced Security Level 7.5","uid":4179081,"size":2401211,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:789f3b911f5382b672169e183611e41dd5f76b17&amp;dn=Advanced+Security+Level+7.5&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"p0lanc054","files":4,"time":1210300537,"description":"Fize Size:1904KB \n\nLanguage:English \n\nOS:Win2000/XP/2003 \n\nDate added:March 6,2008\n\nLicense:Shareware\n\nAdvanced Security Level is the special computer security application for Windows-based computers. It gives you flexible administrative support to control the user access rights for your computer by setting up the desired access control level for each user. You can restrict access to the Control Panel applets including Display, Network, Passwords, Printers, System, Add/Remove Programs, etc. You can assign the separate system profile folders for computer users providing each of them with own custom Desktop, Start Menu, Favorites, My Documents, etc. Optionally you can hide desktop icons, local and network drives; disable Start Menu items, DOS, boot keys, Registry editing, task bar, task manager and network access; lock screen with password; and much more. You can apply password protection for Windows and restrict users from running specific applications. Security restrictions can be applied to all or just for specific user. Advanced Security Level supports the Internet Explorer security that allows you to customize and secure Internet Explorer web browser. So you can disable an individual menu items, tabs in the Internet Options dialog with specific settings; prevent others from editing your Favorites. The program offers you a complete password protection and ability to import and export PC security settings. Secure your PC is a part of the Security &amp; Privacy direction of our development which offers a comprehensive collection of PC security and privacy applications to protect your PC. Great for both home and office environments, these programs will protect everything from personal data to passwords. Try our Advanced Security Level for free.\n\n","torrent":{"xt":"urn:btih:789f3b911f5382b672169e183611e41dd5f76b17","amp;dn":"Advanced+Security+Level+7.5","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"789f3b911f5382b672169e183611e41dd5f76b17","infoHashBuffer":{"type":"Buffer","data":[120,159,59,145,31,83,130,182,114,22,158,24,54,17,228,29,213,247,107,23]},"announce":[],"urlList":[]}}