{"title":"Coast to Coast Radio Program! Commercial Free! May 22nd thru Jun","uid":4218179,"size":608934074,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:78ec35ff2379e732e9b07b1a0cc9ea39686cbc48&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+May+22nd+thru+Jun&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stokeman","files":55,"time":1212451628,"description":"I know I am late, but I am positive that everyone will enjoy the last 11 programs of C2C! The broadcasts have been, in my opinion, spectacular! Well, anyway, without any further procrastination, here they are! Download, SEED, and Enjoy! Thanks in advance to all the seeders! Until sometime next week, Stokeman Out.....\n\nThursday May 22nd, 2008\nThe Ancient Crystal Skulls\nEgyptologist and pre-historian Stephen Mehler discussed ancient crystal skulls (photos), exploring their debated history, and mysterious functions and properties. He refuted a recent report that the skulls are &quot;modern fakes,&quot; and said academic scientists... \nHost: George Noory\nGuest(s): Stephen S. Mehler, Charles Ostman\n\nFriday May 23rd, 2008\nRemote Viewing Updates\nArt Bell welcomed foremost remote viewing teacher Major Ed Dames, who discussed some current cases of his Matrix Intelligence Agency as well as provided updates on past predictions. Dames said a world food crisis is coming that will be caused...\nHost: Art Bell\nGuest(s): Major Ed Dames\n\nSaturday May 24th, 2008\nD.B. Cooper &amp; Organized Crime\nDuring the first two hours, attorney Galen Cook wrapped up his D.B. Cooper investigation. He was joined by a man who says he is Cooper&amp;#039;s son. In the third hour, journalist Misha Glenny (book link) revealed the intricacies and pervasiveness of... \nHost: Ian Punnett\nGuest(s): Galen Cook, Misha Glenny\n\nSunday May 25th, 2008\nUK UFO Files\nFormer leader of the UK&amp;#039;s UFO Project, Nick Pope joined host George Knapp (email) to discuss recent disclosures from the British Ministry of Defense. This sweeping release of UFO information by the UK government allows for researchers to &quot;go to the raw... \nHost: George Knapp\nGuest(s): Nick Pope, Ted Phillips\n\nMonday May 26th, 2008\nMysteries of Cosmology &amp; Space\nTheoretical physicist Dr. Richard Hammond discussed his new book The Unknown Universe, which explores mysterious aspects of cosmology and space. Cosmic acceleration, he explained, is the accepted concept that the universe is in a constant state of expansion,... \nHost: George Noory\nGuest(s): Richard Hammond, Richard C. Hoagland\n\nTuesday May 27th, 2008\nEnoch, Thoth &amp; the Pyramid\nAuthor and filmmaker Ken Klein presented his thesis that Egypt&amp;#039;s Great Pyramid was built by Enoch, and serves as an oracle to help humankind transcend to their higher nature. Klein contended that the Egyptian ruler known as Thoth, who wrote The Book... \nHost: George Noory\nGuest(s): Ken Klein, John Johnsen, M.K. Davis\n\nWednesday May 28th, 2008\nUFOs: Cases &amp; Confrontations\nIn a UFO Special, researcher &amp; filmmaker James Fox and author Richard Dolan appeared separately and together to discuss disclosure, notable UFO cases and confrontations. Appearing during the second hour, Fox was joined by Stephenville, Texas UFO witness... \nHost: George Noory\nGuest(s): James Fox, Richard Dolan, Joshua P. Warren\n\nThursday May 29th, 2008\nDrones, Spheres &amp; the Mars Lander\nInvestigative reporter Linda Moulton Howe presented reports on &amp;#039;dragonfly&amp;#039; drone sightings, a pearl-colored sphere retrieved in Alabama, the Mars Phoenix Lander, and a new cattle mutilation case. The new Mars mission isn&amp;#039;t intended to determine...\nHost: George Noory\nGuest(s): Linda Moulton Howe, Jeffrey L. Peckman, Stan Romanek\n\nFriday May 30th, 2008\nWeird Stories\nDuring Open Lines, George offered a &amp;#039;Weird Stories&amp;#039; hotline. He also asked for a few native Hawaiians to phone into the show and speak in the Pidgin language. A caller near Dallas, Texas recounted a strange experience she had while working as a nurse.... \nHost: George Noory\nGuest(s): Open Lines, Paola Harris\n\nSaturday May 31st, 2008\nIrrational Thinking\nLecturer Ori Brafman and his brother, psychologist Dr. Rom Brafman discussed their new book Sway, which looks at why people make irrational choices. &quot;The way that we defined it,&quot; Rom said about irrational thinking, &quot;is that it&amp;#039;s about doing something... \nHost: Ian Punnett\nGuest(s): Ori Brafman, Rom Brafman, Alejandro Rojas, James Chiles\n\nSunday June 1st, 2008\nShamanism &amp; Earth Changes\nFuturist John Jay Harper shared his investigation into native shamanism as it correlates with the near-death experience (NDE), earth changes, and a global shift in consciousness. The shamanic tradition dates back thousands of years. Shamans, often... \nHost: George Noory\nGuest(s): John Jay Harper, Loren Coleman","torrent":{"xt":"urn:btih:78ec35ff2379e732e9b07b1a0cc9ea39686cbc48","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+May+22nd+thru+Jun","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"78ec35ff2379e732e9b07b1a0cc9ea39686cbc48","infoHashBuffer":{"type":"Buffer","data":[120,236,53,255,35,121,231,50,233,176,123,26,12,201,234,57,104,108,188,72]},"announce":[],"urlList":[]}}