{"title":"The Dogz","uid":4118481,"size":33351680,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:79396c19c0f405b0a60a91d75d85b5cc9a819b60&amp;dn=The+Dogz&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"andreasbente","files":4,"time":1207428145,"description":"Born from run-away dog and street smart mother Olga, Phat Phuck Pharao and A.B grew up with their retard and blind aunt who had promised Olga to take care of them if she died which she did, run over by a truck, while strutting around the backstreets, selling her holes to strange male dogs. Scared by their mothers death when they were only two years, the brothers lived in the attic over their aunts garage, depressed and with no social-life what so ever, sipping contaminated water from the rainy sky, they had nothing to live for. In the early months of 2004 the two brothers in THE DAOWGZ joined forces with one common goal: World Dominans. A goal they are well on their way to fulfill. Found by the chimney-sweeper, while the brothers were away on a alcohol-fueld trip trying to find the superstar Lassie, we are now proud to present this legendary ep! Rumours had been around the streets since Ãƒ?Ã‚Â´04 about these songs, filled with Phat Phuck Pharaos furious guitars and thundering drums. This complemented by A.Bs kindergarten lyrics and howling voice. THE DAOWGZ is a phenomenon in itself. Girls want to fuck them - men wants to be like them. Sure to be an instant classic - put on this ep, change the water in your bowl to beer and start humping strangers on the streets!\n\n- Phat Phuck Pharao - Guitar, Drums, Bass, Back-up vocals \n\n- A.B - Lead Vocals, Harmonica, Demon Producer\n\nRecorded and Produced 2005","torrent":{"xt":"urn:btih:79396c19c0f405b0a60a91d75d85b5cc9a819b60","amp;dn":"The+Dogz","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79396c19c0f405b0a60a91d75d85b5cc9a819b60","infoHashBuffer":{"type":"Buffer","data":[121,57,108,25,192,244,5,176,166,10,145,215,93,133,181,204,154,129,155,96]},"announce":[],"urlList":[]}}