{"title":"The Inside 1x02 [HDTV Spanish][seriesani.]","uid":4240556,"size":365291520,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:79835ce4097c8252a490d9d44b7390e409fa83d3&amp;dn=The+Inside+1x02+%5BHDTV+Spanish%5D%5Bseriesani.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seriesani","files":1,"time":1213520627,"description":"T?tulo original: The inside\nPa?s: Estados Unidos\nA?o inicio:\nA?o finalizaci?n:\nG?nero: Drama - Misterio - Acci?n\nDirigida por: Tim Minear y Howard Gordon (creadores)\nGui?n: Tim Minear y Howard Gordon\nProducida por: Brian Grazer, Ron Howard, Tim Minear y David Nevins\nM?sica original por: Robert J. Kral\n\nResumen del argumento:\nViolencia? perversi?n? asesinatos en serie. Para resolver los casos m?s dif?ciles del fbi, lo mejor es ponerse en el lugar del otro.\nRachel Nichols, Peter Coyote, Jay Harrington y Adam Baldwin protagonizan esta serie que narra el d?a a d?a de la Unidad de Cr?menes Violentos del FBI. La serie es un drama policial de la factor?a FOX centrado en las investigaciones de la Unidad de Cr?menes Violentos del FBI.\n?The Inside? narra la historia de la Agente Especial Rebecca Locke, que despu?s de dos a?os confinada a un puesto de analista de estad?sticas en Washington, D.C., est? decidida a acabar con su rutinario trabajo de despacho y aventurarse a trabajar en misiones de acci?n haci?ndose cargo de los casos m?s peligrosos del FBI. La joven se une al grupo cuando una de sus integrantes fallece en circunstancias extra?as.\nJunto a Rachel Nichols (?Oto?o en Nueva York?), que da vida a la protagonista, completan el reparto Peter Coyote (?Los 4400?), Jay Harrington y Adam Baldwin.\nLos integrantes de la Unidad\nRachel Nicholson es la joven agente Rebecca Locke, Peter Coyote es Virgil ?Web? Webster, Jay Harrington interpreta al Agente Especial Paul Fattore y Adam Baldwin es el Agente Especial Danny Love.\nExcepcionalmente buena en su nuevo trabajo, las habilidades de Rebecca no proceden tan s?lo de su entrenamiento, sino tambi?n de un secreto que ella trata de ocultar.\nEl Agente Paul Fattore act?a como ?conciencia? del departamento, conoce el secreto de Rebecca y est? decidido a protegerla de ?Web?, un hombre que cree que para atrapar a los criminales, vale cualquier cosa, incluso poner a sus propios agentes en peligro.... Por ?ltimo, el agente Danny Love es un imponente ex-marine, jefe t?ctico del equipo y con un car?cter un tanto exaltado.\n?The Inside? explora las intrigas y complicaciones de un trabajo de investigaci?n sumamente intenso, as? como los sacrificios personales que deben hacer Rebecca y el resto de los agentes de la Unidad de Cr?menes Violentos.\nEl misterio de qui?nes son estos agentes y por qu? ?Web? los ha escogido a ellos, es un secreto que se ir? desvelando en cada nuevo episodio.\n","torrent":{"xt":"urn:btih:79835ce4097c8252a490d9d44b7390e409fa83d3","amp;dn":"The+Inside+1x02+%5BHDTV+Spanish%5D%5Bseriesani.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"79835ce4097c8252a490d9d44b7390e409fa83d3","infoHashBuffer":{"type":"Buffer","data":[121,131,92,228,9,124,130,82,164,144,217,212,75,115,144,228,9,250,131,211]},"announce":[],"urlList":[]}}