{"title":"DE KEURINGSDIENST VAN WAARDE [KVW BOX 6/7]","uid":4187636,"size":1773866558,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7ad3fe570f93a0e24a1d0c4f308d65da4ed31898&amp;dn=DE+KEURINGSDIENST+VAN+WAARDE+%5BKVW+BOX+6%2F7%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rud-gr","files":6,"time":1210770836,"description":"DE KEURINGSDIENST VAN WAARDE [KVW BOX 6/7]\n\n42 afleveringen, verzameld op 7 dvds, in een verzamelbox. Bijna 17 uur kijkplezier! Van Kip en Kalkoen tot Dons, Bruine boon en natuurlijk Ot &amp; Sien; de varkens van de KvW.Per dvd staan er 6 afleveringen op.\n\nOmdat 30Gig een beetje onhandig is, hier in Divx formaat van ca. 280Mb per aflevering van 25 minuten.\n\nDVD 6 \n\nVARKEN\nHoe komt een burger aan een varkentje? Dat zal niet meevallen dachten de makers van het programma Keuringsdienst van Waarde. Je kunt niet zomaar ergens een varkentje kopen en meenemen op de achterbank. Maar dat kan wel. \n\nSOJA deel 1\nHet gebruik van ?genetically modified organisms? oftewel GMO?s, moet netjes op etiketten worden vermeld, dacht de Keuringsdienst. Fout. Op de ham, het kippenboutje en de speklap wordt nooit gemeld dat het beest is vetgemest met GMO?s. \n\nSOJA deel 2\nEen Argentijnse Indianenstam maakt kennis met de varkens van de Keuringsdienst van Waarde. Aangenaam. Maar jammer dat de Indianen binnenkort verhuizen moeten. Om plaats te maken voor soja, het voer voor Europese varkens. \n\nHAM\nDe Keuringsdienst van Waarde volgt een spoedcursus op een voedsel technologisch instituut waar men leert van water ham te maken. Schouderham of achterham. En wat is het verschil? Dat weet de klantenservice van de supermarkt de nieuwsgierige consument haarfijn uit te leggen: ?Achterham is achterham en schouderham is schouderham.? \n\nDAG OT, DAG SIEN 1 \nFriet met aardbeien hebben ze gegeten. Spaghetti met slagroom. Gerookte zalm met appeltaart en hele koude buffetten. De varkens van de Keuringsdienst van Waarde hebben het geweldig goed gehad. Dat blijkt ook als ze worden gewogen. Verrassend zware jongens (m/v) zijn het geworden. \n\nDAG OT, DAG SIEN 2\nDe Keuringsdienst schuift aan tafel bij een varkenseconoom en bekijkt 80 kilo varkensvlees. Ot &amp; Sien gaan naar de slager. Maar hoe? En welke slager wil ze slachten en hoe weet de Keuringsdienst zeker dat de geliefde beesten er geen seconde onder lijden? Dag Ot, dag Sien. tot later, op tafel.\n","torrent":{"xt":"urn:btih:7ad3fe570f93a0e24a1d0c4f308d65da4ed31898","amp;dn":"DE+KEURINGSDIENST+VAN+WAARDE+%5BKVW+BOX+6%2F7%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ad3fe570f93a0e24a1d0c4f308d65da4ed31898","infoHashBuffer":{"type":"Buffer","data":[122,211,254,87,15,147,160,226,74,29,12,79,48,141,101,218,78,211,24,152]},"announce":[],"urlList":[]}}