{"title":"The Atomic Cafe 1982 [USA propaganda documentary]","uid":4187869,"size":728145436,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7af66baa380da340a350d99b5724a020cbc44f31&amp;dn=The+Atomic+Cafe+1982+%5BUSA+propaganda+documentary%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"videoclub2000","files":7,"time":1210779566,"description":"Title:\t\tThe Atomic Cafe\nYear:\t\t1982\nRuntime:\t86 min\n\nDirector:\tJayne Loader, Kevin Rafferty, Pierce Rafferty\t \t\nvideo:\t\tXvid, 720x480 29.97\naudio:\t\tAC3 \n\nsubtitles:\tFRENCH, SPANICH, PORTUGESE, SLOVENIAN, GALACIAN\n\nWikipedia:\thttp://en.wikipedia.org/wiki/The_Atomic_Cafe\n\n---------------------------------------------------------------------------------------------------\n\nPropaganda -- Ideas, facts, or allegations spread deliberately to further one&amp;#039;s cause or to damage an opposing cause. \n\nA compilation of films about what to do in case of a Nuclear attack and the effects of radiation, also footage of troop tests of the exposure to an atomic bomb.  \n\nAtomic Cafe is a review of the atomic age and the beliefs held by Americans at the time. Many things such as Burt the Turtle who was the figurehead the &quot;Duck and Cover&quot; campaign are featured. Along with these film clips are portions of Army training films and demonstration films concerning atomic testing. All of these clips are combined to show how little the experts knew about atomics at the time. And even more to the heart, the point is to show the extent propaganda was used to mollify the fears of the American public, and her soldiers.\n\n\n*********************************** FREAKYFLICKS ************************************\n\nFreakyflicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe Freakyflicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n\n&amp;#039;If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE&amp;#039;","torrent":{"xt":"urn:btih:7af66baa380da340a350d99b5724a020cbc44f31","amp;dn":"The+Atomic+Cafe+1982+%5BUSA+propaganda+documentary%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7af66baa380da340a350d99b5724a020cbc44f31","infoHashBuffer":{"type":"Buffer","data":[122,246,107,170,56,13,163,64,163,80,217,155,87,36,160,32,203,196,79,49]},"announce":[],"urlList":[]}}