{"title":"Catacomb Kids v0.0.12","uid":12818879,"size":75098866,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:7b22355804bf88bf833ba6d4e5ef4c3d4a49d93a&amp;dn=Catacomb+Kids+v0.0.12+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"monosoul","files":1,"time":1448269885,"description":"Title: Catacomb Kids\r\nGenre: Action, Indie, RPG, Early Access\r\nDeveloper: FourbitFriday \r\nPublisher: FourbitFriday\t\r\nRelease Date: 20 Feb, 2015\r\nCrack:3DM\r\n\r\nDescription:\r\nThe Origin Of Dungeons\r\n500 Years ago the demon sorceress Abys was sealed away beneath her fortress by 4 legendary heroes and a 5th forgotten one. Over time, no longer held stable by Abys' magic, the fortress sank into the earth, becoming a haven for foul creatures, dark magicks, and the refuse of the Over-World. The fortress, now deep beneath the earth, became known as The Catacombs, and kids from all over found themselves drawn into its shadows - seeking riches, power, knowledge, and escape. Now, coming-of-age ceremonies and criminal sentences alike all revolve around plumbing the depths of The Catacombs, and the legend of Abys has been all but forgotten. Some say she yet sleeps in the dark below, the seals that keep her contained growing ever-weaker.\r\nWhat Lies Beneath\r\nCatacomb Kids is a procedurally generated platformer, with an equal emphasis on quick reactions, tactical engagement, and strategic character growth. Wield swords, spears, axes, and daggers -- unleash powerful magicks to burn, freeze and poison foes with -- overcome traps and beasts both deadly and unrelenting. \r\n\r\nThe game is streamlined but not &quot;simple&quot;, featuring a system where basic elements interact to create complex outcomes and stories. Lure monsters into combat with one another or take advantage of environmental hazards to trick your foes into their own bloody demise. The world is your crafting space, allowing you to create new items and tools from within the game-space itself, never needing to farm materials or navigate a menu to demonstrate your cleverness.\r\n\r\nBuild 0.0.12 time! Woo! \r\n\r\nGolly this one took a while, and then a while again. In case you ever needed confirmation, implementing pathfinding for very mobile platformer characters through procedurally generated levels is tough. But I did it! Mostly! There are still some quirks and hiccups here and there, but I think this new AI, much like the level generation itself, will be the sort of thing that's constantly getting tweaked and improved as development continues. \r\n\r\nHowever, this AI update now marks the last &quot;Large Feature&quot; I needed to get done before the Anticropolis + Co-op build. Does that mean the big chunky Anticroppy update is gonna be next? Well, unfortunately not. As I'm sure you've noticed this last one took way longer than I was anticipating and so I'm a fair bit behind schedule. As such, the next few updates will probably be -- if more timely -- a bit lighter on new features, as I'll be focusing almost entirely on Anticropolis and Co-op stuff. Stevie and I have also been making progress on the leaderboards, so expect those before long as well. \r\n\r\nThe 'smaller features' that I'll be working on in the meantime will be things like; more meals and food items, further additions and improvements to the new AI, more transitional stages, changes to the way traits are obtained and improved, and, as always, fixing crashes and improving performance","torrent":{"xt":"urn:btih:7b22355804bf88bf833ba6d4e5ef4c3d4a49d93a","amp;dn":"Catacomb+Kids+v0.0.12+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b22355804bf88bf833ba6d4e5ef4c3d4a49d93a","infoHashBuffer":{"type":"Buffer","data":[123,34,53,88,4,191,136,191,131,59,166,212,229,239,76,61,74,73,217,58]},"announce":[],"urlList":[]}}