{"title":"D-Day 6.6.1944","uid":4170884,"size":4682307584,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:7b24f11f968b5be36e50a73d1144fff40407a0c6&amp;dn=D-Day+6.6.1944&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MasterEye","files":21,"time":1209855869,"description":"Nederlands\n\nD-day vertelt het aangrijpende verhaal van de invasie in Normandie, hoe de landing werd gepland en uitgevoerd, gezien door de ogen van mensen die erbij waren. Het vertelt over de moed en opoffering van gewone mensen die ongelofelijke prestaties leverden.\n\nHet is januari 1944 en de oorlog verkeert in een kritiek stadium. De troepen van Hitler vechten aan het Russische front en de geallieerden hebben de overhand in de lucht en op zee. Het moment is aangebroken om een Tweede Front te vormen. De invasie in Frankrijk staat op het punt te beginnen.\n\nTerwijl Rommel en Hitler discussieren over de te volgen strategie, worden Eisenshowers plannen bedreigd door een rampzalige oefening waarbij 700 manschappen in het water van het Kanaal verdrinken.\n\nTerwijl Britse parachutisten een belangrijke batterij kanonnen proberen in te nemen, beraamt geheim agent Garbo een misleidingsplan om de Duitsers in de war te brengen.\n\nOp de ochtend van D-Day landt Robert Capa, met als enige wapen zijn camera, met de eerste aanvalsgolf op het stand van Omaha.\n\n\nEnglish\n\nThe story of the D-Day landings by combining documentary interviews with veterans of the conflict and dramatized reconstructions of events surrounding the Normandy landings. The script emphasizes the petty bureaucracy which frustrated the efforts of front-line Germans, all of whom anticipated a large-scale invasion but were unable to equip themselves against such an eventuality because of Hitlers obsession with the ongoing conflict in Russia. Much is also made of a clever subterfuge in which the Allies managed to convince German authorities that the initial D-Day landings were little more than a diversion, the precursor of a much larger invasion.\n\n\n                            Please seed\n","torrent":{"xt":"urn:btih:7b24f11f968b5be36e50a73d1144fff40407a0c6","amp;dn":"D-Day+6.6.1944","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b24f11f968b5be36e50a73d1144fff40407a0c6","infoHashBuffer":{"type":"Buffer","data":[123,36,241,31,150,139,91,227,110,80,167,61,17,68,255,244,4,7,160,198]},"announce":[],"urlList":[]}}