{"title":"The Life (LGBT Web Browser ver 8.0.2 PRIDE 2008 Edition)","uid":4241566,"size":29791747,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7b3e165043cd593df4eb7be30abbf833171f2862&amp;dn=The+Life+%28LGBT+Web+Browser+ver+8.0.2+PRIDE+2008+Edition%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ToreNY","files":2,"time":1213568547,"description":"The Life is a web browser with many online channels for people who identify as LGBT (Lesbian Gay Bi Trans). Channels include PEOPLE, EVENTS, BARS, EATERIES, HOTELS, etc, and each channel has many topics or listings. There are thousands of people, bars, eateries in over 50 cities. If it&amp;#039;s LGBT and has a web presence, you can probably find it pretty easily in The Life. Every topic has an automatic video search for anything that might be related to the topic.\n\nGoogle provides access to Google video, Youtube and many more video sites in one screen. The content is always changing. There are chat rooms for each city and an amazing HISTORY channel that includes full LGBT Studies coursework, books, videos. If you see yourself in the LGBT category, this is a great resource, and to be honest, it&amp;#039;s pretty mesmerizing and addictive. There are a few horoscope resources, up-to-the-minute LGBT news, weather for your selected city, local calendar, and just about every personals site that is LGBT. Politics has its own place in the HOME channel under NEWS and you can find LGBT welcoming churches where you live or where you are visiting.\n\nThe software contains no content. You must be online to use this web browser. Think of it as a very complete directory of all available LGBT web sites about anything LGBT. If you have an LGBT web site, you&amp;#039;re probably already in The Life, but if not, there&amp;#039;s a way to sign up and be included in the Independence Day release. If you identify as LGBT, this is probably something you want. If you don&amp;#039;t know what LGBT is, then it&amp;#039;s probably not of much interest to you.\n\nThe more of your own preferences you set for each city, the more options are available to you in The Life. Note that you don&amp;#039;t have to provide any information for most of the features to be fully available to you. Any information that you provide is stored locally in your copy of The Life. When you are logged into your myGLN Website or email, or your myGLN Locker, any information that you provide there is stored online and not locally in your copy of The Life.\n\nFor a fun random interactive experience, go to any main channel (top buttons, black with gold letters) and then click the highlighted channel again at the top for a random topic in that channel. Get to know The Gay &amp; Lesbian Nation. It&amp;#039;s bigger and better than you ever imagined.\n\nWhat&amp;#039;s new:\n\nThe Life web browser replaces all content from the website of The Gay &amp; Lesbian Nation and uses only content provided directly from the official web sites of various people, places, events and businesses in The Gay &amp; Lesbian Nation.\n\nFree websites and email addresses for members (ME channel... myGLN tab)\n\nInteractive site polling (members only)\n\nThe Life is now both MEcentric and CITYcentric. Once you have set your preferences for a city, the settings remain in your browser for that city and the next time you virtually (or really) visit that city, your preferred hotel, eatery, bars, LGBT Center, etc, will be easily available to you. It&amp;#039;s all about YOU and your CURRENT CITY.\n\nNew chat rooms for over 50 cities plus a general chat lounge.\n\nLogo now can indicate other nationalities other than the original &quot;Gay American&amp;#039; flag that has been the trademark of The Gay &amp; Lesbian Nation, Inc since 1997. Members are now able to choose their own nationality, eg: &quot;Gay Italian&quot; has the Italian flag, &quot;Gay Canadian&quot; has the Canadian flag, etc. State and City flags will be available for the Labor Day Edition.\n\nWhen logged into myGLN Locker, members can:\n\nSkype other members\n\nPost notes or vote in polls on the corkboard for a given topic.\n\nRegister a complaint about sites that popup, popout, or popunder, or the site owners have changed the content to something that is no longer LGBT themed.\n\nAll websites are constantly monitored. Sites with popups, popouts, popunders or which are otherwise bothersome to the user are weeded out before every edition.\n\n\nWindows XP sp2 and higher\n\nThe Life (c) The Gay &amp; Lesbian Nation, Inc. 1997-2008","torrent":{"xt":"urn:btih:7b3e165043cd593df4eb7be30abbf833171f2862","amp;dn":"The+Life+%28LGBT+Web+Browser+ver+8.0.2+PRIDE+2008+Edition%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b3e165043cd593df4eb7be30abbf833171f2862","infoHashBuffer":{"type":"Buffer","data":[123,62,22,80,67,205,89,61,244,235,123,227,10,187,248,51,23,31,40,98]},"announce":[],"urlList":[]}}