{"title":"C.J. Box - Blue Heaven","uid":4202890,"size":665753448,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:7b83f7c363594a7fd9dec095b599c94a7a49ccd7&amp;dn=C.J.+Box+-+Blue+Heaven&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"mountain-pa","files":144,"time":1211601433,"description":"John Bedford Lloyd&amp;#039;s rich, distinctive voice brings a strong sense of power to his reading of Box&amp;#039;s first stand-alone thriller. In the rural Idaho town of Kootenai Bay, 12-year-old Annie Taylor and her younger brother, William, witness a brutal murder. Immediately the two find themselves being hunted by killers who will stop at nothing to ensure the children&amp;#039;s silence. The two find refuge with an old rancher, Jess Rawlins, and recently retired police detective Eduardo Villatoro. Together, the two men make a desperate stand against the murderers despite being outnumbered and outgunned. Lloyd&amp;#039;s crisp, laconic delivery easily handles a multitude of characters, accents and shifting points of view, creating just the right tone for the material and drawing the listener deep into the action of the story. He portrays his villains (a band of dirty ex-cops) with just the right amount of ruthless menace without going overboard, and he perfectly captures the essence of the aging rancher, imbuing him with the quiet strength and dignity of an iconic western hero.","torrent":{"xt":"urn:btih:7b83f7c363594a7fd9dec095b599c94a7a49ccd7","amp;dn":"C.J.+Box+-+Blue+Heaven","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7b83f7c363594a7fd9dec095b599c94a7a49ccd7","infoHashBuffer":{"type":"Buffer","data":[123,131,247,195,99,89,74,127,217,222,192,149,181,153,201,74,122,73,204,215]},"announce":[],"urlList":[]}}