{"title":"An American Girl Saige Paints The Sky 2013 NTSC DVDR.mkv","uid":12860694,"size":4489474197,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7bf8157090f6d1dbd849bbea72243cdf613834a7&amp;dn=An+American+Girl+Saige+Paints+The+Sky+2013+NTSC+DVDR.mkv&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lasse333","files":1,"time":1448734011,"description":"Showing all 2 plot summaries\r\nMeet nine-year old Saige, a talented artist with a passion for horses, in this modern-day story about finding your voice! Saige is excited about the new school year, until she discovers that art-her favorite class-has been cut. On top of that, her best friend, Tessa, seems to be spending more and more time with another girl. For help, Saige turns to her grandma Mimi, a well-known artist and horse-woman, who inspires her to take action. Can Saige find the courage to overcome her fears and save the art program-and her friendship with Tessa? Heart-warming, empowering, and fun, it's a movie for every girl who has ever dreamed big.\r\n- Written by Anonymous\r\nSaige Copeland is a talented artist who loves horses. She`s pumped up about the new school year and seeing her best friend Tessa. But that changes when Tessa seems to be hanging out with another girl and when art class is cut. Saige now trapped goes to her grandmother for help and takes action. Saige now must face her fear and overcome her stage fright. Can Saige let go of her fears and her jealousy to shine bright and regain her friendship with Tessa?\r\nSynopsis\r\nIt looks like we don't have any Synopsis for this title yet.\r\nBe the first to contribute! Just click the &quot;Edit page&quot; button at the bottom of the page or learn more in the Synopsis submission guide","torrent":{"xt":"urn:btih:7bf8157090f6d1dbd849bbea72243cdf613834a7","amp;dn":"An+American+Girl+Saige+Paints+The+Sky+2013+NTSC+DVDR.mkv","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7bf8157090f6d1dbd849bbea72243cdf613834a7","infoHashBuffer":{"type":"Buffer","data":[123,248,21,112,144,246,209,219,216,73,187,234,114,36,60,223,97,56,52,167]},"announce":[],"urlList":[]}}