{"title":"Digsby","uid":4129503,"size":18308653,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c3b4ec85de0fe156613474c1803c9e37d0d02c0&amp;dn=Digsby&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Tejh","files":1,"time":1207960695,"description":"Digsby!\n\nDigsby is a multiprotocol instant messaging application developed by dotSyntax, LLC. It currently supports e-mail notifications and alerts from MySpace, Facebook and Twitter.\n\nFeatures - \n\n    * Email\n          o POP3 and IMAP support for almost any email service available\n          o Pre-configured email services such as Yahoo, AOL Mail, or Hotmail&amp;#039;s webmail, emulating a POP3 or IMAP client\n          o Email alerts which pop up a small window in the corner of your screen, alerting you of new mail\n          o Built-in email composition, which can automatically acquire email addresses from IM profiles.\n\n    * Social Networking\n          o Support for MySpace alerts, keeping you informed of updates to your friends&amp;#039; profiles, status, and private messages. Provides instant access to various parts of your MySpace account, such as your profile, home page, blog, etc.\n          o Support for Facebook, alerting you of updates in your friend feeds.\n          o Support for Twitter, allowing you to easily submit new &quot;tweets&quot;, and view your friends&amp;#039; tweets, as well.\n          o Future support for additional social networks are currently being developed.\n\n    * Buddy List\n          o Supports metacontacts, much like Trillian&amp;#039;s metacontacts by a simple drag-and-drop system.\n          o Instant status updates.\n          o Customizable ordering of all aspects of the buddy list.\n          o Email and social network alerts.\n          o Skinnable buddy list for a personalized look and feel.\n          o Custom notifications for various actions such as contacts signing in/out, messages sent/received, etc\n          o Buddy list, IM accounts, widgets, and application settings are synchronized on Digsby&amp;#039;s server, so all your settings are transferred between installations on other computers.\n","torrent":{"xt":"urn:btih:7c3b4ec85de0fe156613474c1803c9e37d0d02c0","amp;dn":"Digsby","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c3b4ec85de0fe156613474c1803c9e37d0d02c0","infoHashBuffer":{"type":"Buffer","data":[124,59,78,200,93,224,254,21,102,19,71,76,24,3,201,227,125,13,2,192]},"announce":[],"urlList":[]}}