{"title":"The Pallisers - Volume III-11 and 12 - BBC 1970","uid":4096360,"size":1853867938,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:7c47bcaf26476fa365ba8c19e8933d0d36c3e64c&amp;dn=The+Pallisers+-+Volume+III-11+and+12+-+BBC+1970&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"anca13","files":5,"time":1206340237,"description":"Please seed after download ? At least 1:1. Thanks ;) \n\n\nReviewer: A viewer\nThe third and last set of The Pallisers, based on Anthony Trollope&amp;#039;s series of Parliamentary novels, is finally here and everyone who loves a good soap opera, memorable characters and several touches of intrigue should rejoice. Life among the upper, upper political classes of 19th century England was never so much fun. I loved The Pallisers when I first saw it on TV 25 years ago, and I still think it&amp;#039;s wonderful, even though its flaws (a bit too stately at times) are more obvious when seen in big gulps of 3-4 hours at a time. These last episodes, taking place some 20 years after the opening sequences, still have many of the original characters in place, which is fortunate, because few of the new figures are as compelling as the original protagonists. Happily, they don&amp;#039;t last long, and what we end up with is a satisfying coda to the lives of Planty Pal and his incomparable wife, Lady Glencora, aka the Duke and Duchess of Omnium. Look for very young Anthony Andrews and Jeremy Irons, one callow and one &amp;#039;serious,&amp;#039; stretching their acting chops, and terrific costumes and scenery throughout. You&amp;#039;ll find yourself going back to view the first episodes again, and searching out the Anthony Trollope novels on which the whole amazing series is based.\n\nThese are the last 2 parts of 3 Volumes and 26 Episodes\n\nI will upload next ?The Fall of Eagles? 1970 Release about the European Kingdom countries during the early 1900 Era.\n","torrent":{"xt":"urn:btih:7c47bcaf26476fa365ba8c19e8933d0d36c3e64c","amp;dn":"The+Pallisers+-+Volume+III-11+and+12+-+BBC+1970","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c47bcaf26476fa365ba8c19e8933d0d36c3e64c","infoHashBuffer":{"type":"Buffer","data":[124,71,188,175,38,71,111,163,101,186,140,25,232,147,61,13,54,195,230,76]},"announce":[],"urlList":[]}}