{"title":"Norton_Internet_Security_2008 + Crack.rar","uid":4227206,"size":67117275,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7c8507227ca2db7b989f2eae0f8d44f5c182e83b&amp;dn=Norton_Internet_Security_2008+%2B+Crack.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"WFGKi","files":1,"time":1212884738,"description":"Norton Internet Security 2008 15.0.0.58\nStay protected from the latest online threats. Norton Internet Security 2008 runs quietly in the background to detect and block today?s complex threats and to protect your identity when you buy, bank, or browse online. The friendly and efficient product design helps minimize confusing security alerts and system slowdowns that can get in the way of your online experience.\nNorton Internet Security 2008 provides essential protection from viruses, hackers, spyware, spam and other privacy threats. A comprehensive set of security tools, Norton Internet Security helps keep you safe online as you surf and email, swap files, download programs, and chat. In addition to protecting against viruses and unwelcome intrusions from the Internet, NIS also allows you to automatically block annoying banner ads and pop-up windows, set up parental site blocking options for restricting access to specific Web sites, and selectively determine which, if any, Java applets and ActiveX controls should be allowed to download and execute on your computer. Enjoy the Internet with award-winning protection!","torrent":{"xt":"urn:btih:7c8507227ca2db7b989f2eae0f8d44f5c182e83b","amp;dn":"Norton_Internet_Security_2008+%2B+Crack.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7c8507227ca2db7b989f2eae0f8d44f5c182e83b","infoHashBuffer":{"type":"Buffer","data":[124,133,7,34,124,162,219,123,152,159,46,174,15,141,68,245,193,130,232,59]},"announce":[],"urlList":[]}}