{"title":"Elvis Presley - Fort Baxter - Lean, Mean and Kickin' Butt","uid":4071635,"size":109459374,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7ce49455bc436794ddef876eda0745e4b342aaed&amp;dn=Elvis+Presley+-+Fort+Baxter+-+Lean%2C+Mean+and+Kickin%5C%27+Butt&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pacone","files":25,"time":1205081282,"description":"I hope you&amp;#039;ve enjoyed my torrents: &quot;Girls, girls, girls FTD&quot;, &quot;24 Karat Hits&quot;, &quot;The king for dessert&quot;, &quot;The lost performances&quot; and &quot;Pot Luck FTD&quot;\n\nWhat we have here is one of those excellent 70&amp;#039;s concerts. This show is from a mastertape, recorded on the 28th of January 1971, two days after Elvis opened his 4th season in the International Hotel, Las Vegas. If indeed we already had a show recorded the day before on the CD &quot;All things are possible &quot;, these are 2 presentations that are somewhat different. \nThe show begins with a thrilling version of &quot; 2001 &quot;. Especially outstanding are a potent version of &quot; You have lost that lovin&amp;#039; feeling &quot;, I love it when Elvis strengthens his voice and emphasises parts of the song, almost screaming . &quot; Johnny B. Goode &quot; is not very long but just great, very powerful, with an electrifying guitar solo of James Burton. &quot; One night &quot; is also short but fantastic, I just love these live versions from the 70&amp;#039;s . Without having practiced it before, we also have a funny version of &quot;Teddy bear &quot; which somebody out of the crowd had asked for. And at the end, after a great version of &quot;Suspicious Minds&quot;, and before concluding with his last song, he lets the band play, while he takes a couple of minutes to grasp for air. To top it off the, Elvis says goodbye with &quot;The impossible dream&quot;, a true rarity. A great end to this marvelous concert !*\n\n*Taken from Elvis CD Collector Onnly webpage\n\nEnjoy and please seed.\n\n\n\nPlease visit my country Peru, Cusco, Pastoruri, Chanchamayo and my hometown Lima.\n","torrent":{"xt":"urn:btih:7ce49455bc436794ddef876eda0745e4b342aaed","amp;dn":"Elvis+Presley+-+Fort+Baxter+-+Lean%2C+Mean+and+Kickin%5C%27+Butt","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7ce49455bc436794ddef876eda0745e4b342aaed","infoHashBuffer":{"type":"Buffer","data":[124,228,148,85,188,67,103,148,221,239,135,110,218,7,69,228,179,66,170,237]},"announce":[],"urlList":[]}}