{"title":"Lisa Stansfield - Lisa Stansfield - (1997)[FLAC-EAC-CUE]","uid":4187922,"size":556287476,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:7e0f5f7d96926c131d05da45e24d89ed86ff0663&amp;dn=Lisa+Stansfield+-+Lisa+Stansfield+-+%281997%29%5BFLAC-EAC-CUE%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seanprince","files":26,"time":1210781365,"description":"Lisa Stansfield - Lisa Stansfield - (1997)[FLAC-EAC-CUE]\n\nTrack list.\n\nLisa Stansfield - Lisa Stansfield\n\n01.\tNever Gonna Fall\t\t05:16\n02.\tThe Real Thing\t\t\t04:20\n03.\tI&amp;#039;m Leavin&amp;#039;\t\t\t04:38\n04.\tSuzanne\t\t\t\t04:59\n05.\tNever, Never Gonna Give You Up\t05:01\n06.\tDon&amp;#039;t Cry For Me\t\t05:03\n07.\tThe Line\t\t\t04:26\n08.\tThe Very Thought Of You\t\t05:23\n09.\tYou Know How To Love Me\t\t05:30\n10.\tI Cried My Last Tear Last Night\t04:13\n11.\tHonest\t\t\t\t04:54\n12.\tSomewhere In Time\t\t04:44\n13.\tGot Me Missing You\t\t04:42\n14.\tFootsteps\t\t\t04:10\n15.\tThe Real Thing (Touch Mix)\t05:37\n16.\tPeople Hold On (Bootleg Mix)\t03:42\n\nBiography From Ask men.com\n\nLisa Jane Stansfield was born April 11, 1966, in Manchester, England, but was raised in Rochdale after she moved with her family at age 11.\nLike most pop/soul/R&amp;B singers, Lisa was introduced to music thanks to her mom&amp;#039;s Diana Ross and the Supremes records (she later fell in love with Marvin Gaye and Barry White, as is evident in her later recordings). Although she had no voice lessons, Lisa entered talent shows to practice singing, and thanks to her innate gift, she won some competitions.\nNot only a powerful voice, but also an electrifying beauty, Lisa was discovered by a television producer, who cast her as a presenter in the &amp;#039;80s Granada television children&amp;#039;s program, Razzamatazz. She soon realized that TV was not the path she was aiming for, and in 1983, she joined forces with her former schoolmates, Andy Morris and Ian Devaney (Lisa&amp;#039;s future husband), to form the group Blue Zone (known as Blue Zone UK in the US).\nholding on to a hit\nSigned on Rockin&amp;#039; Horse Records and ultimately Artista, Blue Zone saw success in the nightclub scene, with their album Big Thing and the single &quot;Jackie&quot;. Morris and Devaney had previously worked with the DJ mixers otherwise known as Coldcuts, which is how Lisa was brought to the production team; Lisa&amp;#039;s group members spoke highly of the blue-eyed songstress, which led to her collaboration on Coldcut&amp;#039;s 1989 single, &quot;People Hold On&quot;.\n&quot;People Hold On&quot; held on to the top of the UK charts, and Lisa was offered a solo record contract with Arista Records, with fellow songwriters Morris and Devaney on board as composers, musicians and producers.\nLisa was ready to take on the UK and the world. Her debut album, Affection, was released in 1990, and spawned the first single, &quot;This Is the Right Time&quot;. The latter cracked the top 20 by reaching number 13 on the charts, but that was nothing compared to the international hit, &quot;All Around the World&quot;, which became a worldwide number one hit.\nshowing lots of affection\nAffection went on to sell 5 million copies worldwide, underlining the commercial success of the critically acclaimed British singer/songwriter. Lisa took home the BRIT Award for Best British Newcomer in 1990, as well as the DMC Award for Best Artist and Best Album, the Silver Clef Award for Best New Artist, the Ivor Novello Award for Best Contemporary Song (&quot;All Around the World&quot;), and the Billboard Award for Best Newcomer -- creating the perfect platform on which to continue recording.\nThe year that &quot;Lisa fever&quot; was still burning, Lisa recorded Cole Porter&amp;#039;s &quot;Down in the Depths&quot; on Red Hot &amp; Blue, an AIDS research fundraiser, and performed at 1991&amp;#039;s Rock In Rio Festival.\nLisa released Real Love in 1991, which spawned the hit singles &quot;Change&quot;, &quot;All Woman&quot;, &quot;Time To Make You Mine&quot;, and &quot;Set Your Loving Free&quot;. That year she won another BRIT Award for Best British Female Artist, while Real Love brought a 1991 Best Album DMC Award to Lisa.\nnatural woman\nShe returned yet again in 1993 with So Natural, and then took a 4-year hiatus before releasing her self-titled album in 1997. Lisa Stansfield spawned a remake of her idol, Barry White&amp;#039;s tune, &quot;Never Never Gonna Give You Up&quot;.\nDespite the fact that Lisa&amp;#039;s more recent releases didn&amp;#039;t make as large an impact as her earlier releases, Arista Records released Lisa Stansfield: #1 Remixes in 1998.\nShe took her talent to the big screen with a role in the 1999 film, Swing, and contributed to the film soundtracks of The Bodyguard (aside from Whitney Houston) and The Wedding Planner.\nAfter having been around the world, Lisa will hopefully return with another hit smash.\n\nReview From Amazon.com\n\nAfter a hiatus of several years, Lisa Stansfield released her self-titled CD, a collection of soulful musings and R&amp;B rumblings. Heralded by many as the white queen of soul, Stansfield rises to the occasion with songs like &quot;Never Gonna Fall,&quot; &quot;The Real Thing,&quot; and &quot;Never, Never Gonna Give You Up.&quot; Her smooth voice effortlessly coaxes every drop of emotion out of each song with an admirable and classy restraint. Nowhere is this more evident than in the neo-torch numbers, &quot;I&amp;#039;m Leavin&amp;#039;&quot; and &quot;I Cried My Last Tear, Last Night.&quot; The album ends with the bootleg mix of her earlier hit, &quot;People Hold On.&quot; A juggernaut of a bass line rumbles underneath, also approximated in Tori Amos&amp;#039;s dance mix of &quot;Professional Widow.&quot; Stansfield&amp;#039;s voice glides over the infectious house groove, making the cut a dance floor staple. --Steve Gdula\n\nReview From Amazon.com\n\nLisa Stansfield self title album is a pure example of sensual tracks mix up in slow and uptempo beats. The voice of miss Stansfield has always distinguised for being soulful and misty. Her fourth release showcases a well produced album that hit stand without any expection, and that&amp;#039;s what made it great, because it packed one of the most soulful loving records ever. The Highlights of this albums are: &quot;Never Gonna Fall In Love Again&quot;, &quot;The Real Thing&quot;, &quot;Never Gonna Give You Up&quot;, &quot;I&amp;#039;m Leavin&amp;#039;&quot;, &quot;You Know How To Love Me&quot;, and &quot;The Line&quot;. The Real Thing the first single release overseas is a nice example on how some british music is always ahead of time. Great album to have to those chill out nights,\n\nEnjoy.","torrent":{"xt":"urn:btih:7e0f5f7d96926c131d05da45e24d89ed86ff0663","amp;dn":"Lisa+Stansfield+-+Lisa+Stansfield+-+%281997%29%5BFLAC-EAC-CUE%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7e0f5f7d96926c131d05da45e24d89ed86ff0663","infoHashBuffer":{"type":"Buffer","data":[126,15,95,125,150,146,108,19,29,5,218,69,226,77,137,237,134,255,6,99]},"announce":[],"urlList":[]}}