{"title":"Stossel.2015.11.06.The.Elites.720p.WEBrip","uid":12860248,"size":793747646,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:7f2f06f42863fa8cf60d38bf71c189426ef886dd&amp;dn=Stossel.2015.11.06.The.Elites.720p.WEBrip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BBreach","files":1,"time":1448728693,"description":"_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nTHE ELITES\r\n\r\nFriday at 8PM ET on Fox Business\r\n\r\nTHE MEDIA ELITE: &quot;All the news that's fit to print&quot; is the slogan at The New York Times, but they should really change it to &quot;elites sneering at entrepreneurs.&quot; After one of their writers did a big &quot;expose&quot; of &quot;injustices&quot; in the nail salon industry, Reason TV reporter Jim Epstein uncovered error after error in their reporting. Now, the manicurists are pushing back.\r\n\r\nCOMBATING GOVERNMENT ELITES: Rand Paul explains how, if he were President, he will keep us safe but stay out of our lives as much as possible.\r\n\r\nPAMPERED ELITES: People look up to Hollywood elites. I assumed most earned their success, but &quot;Primetime Propaganda&quot; author Ben Shapiro says that's not true. Hollywood is full of pampered hypocrites who complain about environmental degradation while squandering resources. They call for higher taxes, but move out of state to avoid paying taxes.\r\n\r\nCAMPUS ELITES: It's no secret colleges lean way left. From the top 50 liberal arts schools, only one undergraduate professor donated to a Republican presidential candidate this season. You can't get a well-rounded education if all your professors only think one way.\r\n\r\nELITES DON'T RULE: &quot;The Evolution of Everything&quot; author Matt Ridley argues that good, new ideas emerge, not top down, but the bottom up. He says, &quot;we give too much credit to the clever person.&quot; I challenge Ridley, a member of the British House of Lords, on his elite status.\r\n\r\nMY TAKE: Ridley is correct. Bill O'Reilly and others are wrong to talk about politicians &quot;running the country.&quot; Politicians don't &quot;run America,&quot; free people do. The best of life happens in spite of politics.\r\n\r\nFriday at 8PM ET on FBN\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2","torrent":{"xt":"urn:btih:7f2f06f42863fa8cf60d38bf71c189426ef886dd","amp;dn":"Stossel.2015.11.06.The.Elites.720p.WEBrip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f2f06f42863fa8cf60d38bf71c189426ef886dd","infoHashBuffer":{"type":"Buffer","data":[127,47,6,244,40,99,250,140,246,13,56,191,113,193,137,66,110,248,134,221]},"announce":[],"urlList":[]}}