{"title":"Passafire - Discography","uid":4069281,"size":96136350,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7f51212a53c54eb43d928daad6d35bc021bb8bf0&amp;dn=Passafire+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RubbaDub9202","files":1,"time":1204965836,"description":"\nPassafire - Discography\n\n2 Albums:\nSelf Titled\nSubmersible\n\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\nSeeded &amp; Created by RuBBaDuB\n//////////////////////////////////////////\n\nPassafire has recently toured with Pepper and The Expendables, who are also signed to &quot;LAW Records&quot;.\n\nTHESE GUYS NEED PUBLICITY.\nTHEY WILL SOON BE HUGE\n\n\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\n\n Four years and multiple tours since their inception in the Spring of 2003, the Savannah, Georgia based reggae-rock outfit Passafire has enjoyed national recognition. Their 2006 self-titled debut and energetic live performances have created a noteworthy buzz across the country and beyond.\n\n\nCombining roots reggae, progressive rock, and experimental dub, Passafire has crafted a recognizable sound all their own. Nick Kubley&amp;#039;s tight and versatile drumming paired with his brother Will&amp;#039;s innovative, effects-heavy bass work creates a textured rhythmic backdrop. Ted Bowne&amp;#039;s soulful, dubbed-out vocals and solid guitar riffs mesh seamlessly with Adam Willis&amp;#039; vintage keys and colorful synths.\n\n\nThey attribute their success to a truly independent business model and a strong grassroots connection to their fanbase.\n\n\nTed Bowne, lead singer and guitarist, comments, &quot;We are thankful to have fans who love the music and have supported us wholeheartedly from the beginning.&quot;\n\n\nPassafire is also the newest addition to California&amp;#039;s LAW Records, the independent label run by nationally acclaimed act Pepper. Combining forces with an established team is bringing the group to new heights. LAW released Passafire&amp;#039;s breakthrough sophomore album &quot;Submersible&quot; in October of 2007. The record has pushed boundaries within the reggae world and has received an overwhelmingly positive response.\n\n\n&quot;We were looking to create something wholly fresh and unconstrained by the genre-- and we ended up with an album that is progressive, but still accessible.&quot; The band is no stranger to touring, now averaging over 150 shows a year. Maintaining a strong presence on the road and reaching new fans is their main priority. The band is confident about their direction: &quot;Passafire has a momentum that has been with us since day one. Slowing down is not in our scope.&quot;\t\t\n\n","torrent":{"xt":"urn:btih:7f51212a53c54eb43d928daad6d35bc021bb8bf0","amp;dn":"Passafire+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f51212a53c54eb43d928daad6d35bc021bb8bf0","infoHashBuffer":{"type":"Buffer","data":[127,81,33,42,83,197,78,180,61,146,141,170,214,211,91,192,33,187,139,240]},"announce":[],"urlList":[]}}