{"title":"ConvertXtoDVD.v3.0.0.15.BRD","uid":4195210,"size":15589597,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:7f81215b44005d984f88991a997799a629ce1131&amp;dn=ConvertXtoDVD.v3.0.0.15.BRD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"slugger00001","files":3,"time":1211178141,"description":"[IMG]http://aycu28.webshots.com/image/44187/2000755182593100879_rs.jpg[/IMG]\n\n VSO ConvertXtoDVD 3.0.0.15\n VSO ConvertXtoDVD  programi ile bilgisayarinizdaki cesitli formatlardaki (DivX, Xvid, MPEG4, MOV, AVI, WMV, WMV HD, DV) videolarinizi DVD haline donusturebilirsiniz. Program oldukca basit ve kullanisli bir program. Ayrica resimlerinizi goruntuleyebilir, ses dosyalariyla calisabilir, dvd filmlerinize alt yazilar olusturabilirsiniz.\n ConvertXtoDVD (formerly DivXtoDVD) is a software to convert and burn your videos to DVD. With ConvertXtoDVD and in a few clicks you can backup your movies to DVD playable on any home DVD player. ConvertXtoDVD supports most popular format such Xvid, MOV, VOB, Mpeg, Mpeg4, MP4, AVI, WMV, DV and stream formats. It converts your files into a compliant DVD Video set of files and burns it on a DVD media. The aspect ratio can be automatically selected or forced to a specific format. The program works for NTSC and PAL video formats and creates chapters automatically. Multiple audio tracks are supported. Version 2 uses a completely rewritten interface with subtitles support and a lot of new settings.\n\nFEATURES:\n* Video formats supported: avi, divx, xvid, mov, mkv, flv, mpeg-1, mpeg2-, mpeg-4, nsv, dvr-ms, tivo, ts, ifo, vob, asf, wmv, realmedia, rm, rmvb, ogm, existing files from digital camcorders, TV/Sat, capture cards, etc. No external codecs needed like avi codec download\n* Create DVD menus with different templates available, possibility to add background video, image or audio, have chapter and audio/subtitle menus\n* Conversion advisor wizard, control of the conversion speed vs. quality\n* Fast and quality encoder, typically less than 1 hour for converting 1 movie, and supports Multi-Core processors!\n* Included burning engine with burn speed control choice of SAO or packet writing methods, supports all DVD formats\n* Custom and or automatic chapter creation with markers and preview window\n* Advanced file merging possibilities\n* Audio formats supported internal and external: AC3, DTS, PCM, OGG, MP3, WMA and more...\n* Subtitles files supported internal and external: SRT, .SUB/IDX, .SSA with color and font selection, and supports tags like italic, bold\n* Video output for video standard (NTSC, PAL), TV Screen (Widescreen 16:9, Fullscreen 4:3) and DVD Resolution (Full D1, Boradcast D1, Half D1, SIF), or choose automatic for all choices listed above. Also convert video from NTSC to PAL or PAL to NTSC\n* Video post processing settings like video resize-pad/cropping and de-interlacing options\n* Multilingual support\n* Optimized for Windows 2000 / XP / Vista\n\nChanges in ConvertXtoDVD - 3.0.0.15:\n===========================\nminor bugs and regression fixes\n- 0001725: [Bug] view blocked by displayed template/infobox (wesson)\n- 0001781: [Bug] template &amp;#039;classic&amp;#039; top menu text considered as too big (wesson)\n- 0001787: [Feature Request] preview dialog and hint don&amp;#039;t match. (wesson)\n- 0001799: [Suggestion] clear default settings of sound event sounds (wesson)\n- 0001786: [Bug] close the text style editor (wesson)\n- 0001789: [Bug] lost keyboard funtions/ characters appeared instead (wesson)\n- 0001685: [Bug] One specific .MKV will not load in v3.0.0.2 (Please analyse .MKV file) (wesson)\n- 0001785: [Bug] can&amp;#039;t see hint in main dialog (wesson)\n- 0001788: [Bug] Multiple display of lines in menu parameters after language change (wesson)\n- 0001792: [Bug] bad wording for norwegian language (wesson)\n\n* Options changes synced with currently loaded project\n* Cancelling conversion now return immediately\n* Temp folder can be cleaned up after cancellation\n* Templates fixes\n* Minor fixes\n\n- 0001780: [Feature Request] When the conversion is cancelled, erase the working folder (wesson)\n- 0001759: [Bug] Subtitles are black on converted video when input is mp4 with subtitles streams (wesson)\n- 0001778: [Feature Request] Apply settings immediately to the loaded project (wesson)\n- 0001779: [Feature Request] Fast Cancel path (wesson)\n- 0001729: [Bug] Template Thriller : bad buttons order navigation on settings sub menu (wesson)\n- 0001730: [Bug] Main window height grows with each closing (wesson)\n- 0001719: [Suggestion] Better visibility/understanding of a attention/warning to user when greyed out (wesson)\n- 0001721: [Suggestion] Better visibility/understanding of a attention/warning to user when text to long. (wesson)\n- 0001720: [Suggestion] Better visibility/understanding of a attention/warning to user when greyed out. (wesson)\n- 0001775: [Bug] Menu Preview displays wrong menu page (wesson)\n- 0001633: [Suggestion] Change the Pause Button text to RESUME when you are pausing (wesson)\n- 0001707: [Crash] Strange behaviour during &amp; after conversion process : Application stops responding (wesson)\n\n[CENTER][B]Homepage[/B] - http://www.vso-software.fr/products/convert_x_to_dvd/\n\n[B]Size: 14.6 MB[/B]","torrent":{"xt":"urn:btih:7f81215b44005d984f88991a997799a629ce1131","amp;dn":"ConvertXtoDVD.v3.0.0.15.BRD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7f81215b44005d984f88991a997799a629ce1131","infoHashBuffer":{"type":"Buffer","data":[127,129,33,91,68,0,93,152,79,136,153,26,153,119,153,166,41,206,17,49]},"announce":[],"urlList":[]}}