{"title":"Morgion - Cloaked By Ages, Crowned In Earth (2004) *American Doo","uid":4184856,"size":105365465,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:7faf5a38f510d66f28fa89a5e528b2edfc3ebac4&amp;dn=Morgion+-+Cloaked+By+Ages%2C+Crowned+In+Earth+%282004%29+%2AAmerican+Doo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"VoltaXebec1968","files":11,"time":1210615128,"description":"1. Cloaked By Ages 01:21\n2. A Slow Succumbing 09:47\n3. Ebb Tide (Parts I &amp; II) 13:04\n4. Trillium Rune 03:37\n5. The Mourner`s Oak 06:05\n6. Cairn 06:46\n7. She, The Master Covets 05:22\n8. Crowned In Earth 15:24\nTotal playing time 01:01:26\n\n\nchroniclesofchaos.com review (8.5/10)\n\nThings are not all sunshine, flowers and brutal death metal in So-Cal. There&amp;#039;s plenty of room to mourn apparently, and who better to sing the blues with than Morgion? When you listen to a Morgion album, the closest thing you get to Californian opulence is the fog enshrouded Sierra Nevada -- the sports cars and shopping malls of OC seem about the furthest thing away from these fantasy obsessed mountain men. Once a perfect example of heaviness put to effective use, Morgion have, with their latest (and unfortunately last) release, learned the fine art of employing sparse, subtle guitar atmosphere. Their previous album _Solinari_ had its share of delicate moments, but nothing approaching the drifting, solemn beauty of the acoustic arpeggios featured here, especially in the album&amp;#039;s pensive second half.\n\nThe band does convey a genuine sense of the epic and the world historical, even if their obscure fantasy theme is never quite inspiring or even all that interesting -- eight minutes of laid back ethereal bliss tends to nullify petty concerns like lyrics. The band have often spoken of the earth, literal and metaphorical, as a primary musical influence, and it shows in their washed out, earthy music: the songs fairly reek of soil and sediment, the odor of rain and pine needles. Some of the riffs are so rustic, they&amp;#039;re only a slide guitar and a twang away from alt-country, and the growls of old are largely supplanted by folksy singing provided by Dwayne Boardman and Gary Griffith. The average Morgion song is like a walk through the woods under the stars: dark, eerie, and intermittently inspiring.\n\nAs doom records go, _Cloaked by Ages, Crowned in Earth_ does not follow the genre rules to the point of tedium. The riffs are muddy and predictably repetitious, but they&amp;#039;re not out of the old European doom or US stoner rock play books; they pack the epic European flavor, but present it with the dour earth tones of classic Americana. Depressing certainly, but not suicidal so much as reflective, and teeming with atmosphere, this is a damn good album. Unfortunately, we&amp;#039;ll never see a follow-up. One can only imagine where they may have gone from here.\n\n(article submitted 20/1/2005)\n\nEAC Lame 3.97 v0 VBR","torrent":{"xt":"urn:btih:7faf5a38f510d66f28fa89a5e528b2edfc3ebac4","amp;dn":"Morgion+-+Cloaked+By+Ages%2C+Crowned+In+Earth+%282004%29+%2AAmerican+Doo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"7faf5a38f510d66f28fa89a5e528b2edfc3ebac4","infoHashBuffer":{"type":"Buffer","data":[127,175,90,56,245,16,214,111,40,250,137,165,229,40,178,237,252,62,186,196]},"announce":[],"urlList":[]}}