{"title":"The Thirty Years War: A Documentary History - Tryntje Helfferich","uid":12833484,"size":1397088,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:81482b379d62ddd0049732db991cf8efbec84751&amp;dn=The+Thirty+Years+War%3A+A+Documentary+History+-+Tryntje+Helfferich&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"heliiaruy","files":1,"time":1448415297,"description":"Print Length: 356 pages\r\nPublisher: Hackett Publishing Company, Inc. (March 15, 2009)\r\n\r\nThe Thirty Years War: A Documentary History fills a gap in recent studies of the great pan-European conflict, providing fresh translations of thirty-eight primary documents for the student and general reader. The selections are drawn from the standard political documents, from the Apology of the Bohemian Estates for the Defenestration of Prague to the text of the Treaty of Westphalia, as well as from imperial edicts, trial records, letters, diary entries, and satirical broadsheets, all directly translated from the Early New High German, French, Swedish, and Latin. The volume contains some ten illustrations and one map . . . and on the whole is well organized and well presented with a judicious amount of footnotes and a slim For Further Reading section. A succinct introduction introduces the four sections, each with its own substantial introduction: (1) Outbreak of the Thirty Years War (1618-1623), (2) The Intervention of Denmark and Sweden (1623-1635), and (3) The Long War (1635-1648). The concluding section (4) Two Wartime Lives (1618-1648), interestingly juxtaposes the journals of a wandering mercenary and a settled townsman. The first is the diary of Peter Hagendorf, kept between the years 1624 and 1649 and only rediscovered in 1993. Hagendorf experienced the war as a common mercenary from the Baltic to Italy, from France to Pomerania. His counterpart is Hans Heberle, a shoemaker from a small town in the territory of the free imperial city of Ulm whose Zeytregister chronicled happenings both in the neighborhood and further afield. The engrossing accounts of their shifting fortunes over the three decades of the war really help to give this collection of texts, and the troublesome period itself, a human face. They are the stuff from which Grimmelshausen would craft his great novel of the war, The Adventuresome Simplicissimus (1668). Tryntje Helfferich is to be applauded for this consistently interesting and eminently useful volume. --Martin W. Walsh, University of Michigan, in Sixteenth Century Journal\r\n\r\n\r\nazw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy","torrent":{"xt":"urn:btih:81482b379d62ddd0049732db991cf8efbec84751","amp;dn":"The+Thirty+Years+War%3A+A+Documentary+History+-+Tryntje+Helfferich","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81482b379d62ddd0049732db991cf8efbec84751","infoHashBuffer":{"type":"Buffer","data":[129,72,43,55,157,98,221,208,4,151,50,219,153,28,248,239,190,200,71,81]},"announce":[],"urlList":[]}}