{"title":"Bluf Seizoen 1 NL HDTV By Jeffrey","uid":12760529,"size":9743181777,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8149f802ca9d571c1d0681f0cb3af935c16b1d92&amp;dn=Bluf+Seizoen+1+NL+HDTV+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gljeffrey45","files":10,"time":1447525350,"description":"Bluf Seizoen 1 NL HDTV By Jeffrey\r\n\r\nHet decor van ‘Bluf’ wordt gevormd door de intrigerende pokerwereld, geld, liefde en bedrog. Het leven van de vier jeugdvrienden Philip, Tjé, Hein en Mark verandert volledig wanneer Philip een uitzonderlijk pokertalent blijkt te zijn en een grote som geld wint. Vanaf dat moment speelt geld geen enkele rol meer en belanden de vrienden in een rollercoaster waarin niets te gek is en hun stoutste dromen werkelijkheid worden. De vrienden hebben de tijd van hun leven, maar hoe lang kunnen ze blijven omgaan met deze nieuwe lifestyle die draait om geld, roem en vrouwen? Is de hechte vriendschapsband wel bestand tegen de spanning die het nieuwe leven met zich meebrengt?\r\n\r\nYolanthe Sneijder-Cabau is één van de hoofdrolspelers in de nieuwe Nederlandse dramaserie Bluf. Dit najaar is de eerste aflevering van de door NL Film geproduceerde serie op RTL 5 te zien.\r\nNaast Yolanthe Sneijder-Cabau bestaat de cast van Bluf uit nog meer bekende gezichten onder wie Achmed Akkabi, Geza Weisz, Javier Guzman en Jan Kooijman. De definitieve cast van Bluf wordt binnenkort door RTL 5 bekendgemaakt. De tiendelige reeks draait om een hechte vriendengroep die terechtkomt in de opwindende pokerwereld en hiermee een flink geldbedrag verdient. Vanaf dat moment speelt geld geen enkele rol meer en belanden ze in een rollercoaster waarin niets te gek is en hun stoutste dromen werkelijkheid worden.\r\n\r\n[URL=http://s1194.photobucket.com/user/sans2epxhc1gljeffrey45/media/bluf1_zpswzcjikkg.jpg.html][IMG]http://i1194.photobucket.com/albums/aa361/sans2epxhc1gljeffrey45/bluf1_zpswzcjikkg.jpg[/IMG][/URL]","torrent":{"xt":"urn:btih:8149f802ca9d571c1d0681f0cb3af935c16b1d92","amp;dn":"Bluf+Seizoen+1+NL+HDTV+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8149f802ca9d571c1d0681f0cb3af935c16b1d92","infoHashBuffer":{"type":"Buffer","data":[129,73,248,2,202,157,87,28,29,6,129,240,203,58,249,53,193,107,29,146]},"announce":[],"urlList":[]}}