{"title":"Southland.Tales.DVDRip.ENG-LGLuX.mp4","uid":4066181,"size":734041519,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:81a44bb103cacef21595a1f322e63a20277739ea&amp;dn=Southland.Tales.DVDRip.ENG-LGLuX.mp4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"LGLuX","files":1,"time":1204815461,"description":"Title:       Southland Tales\nDirector:    Richard Kelly\nActors:      Dwayne Johnson,Justin Timberlake,Sean William Scott\nLength:      144 min\nIMDB:       &lt;a href=&quot; http://imdb.com/title/tt0405336/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://imdb.com/title/tt0405336/&lt;/a&gt;\nCodec:       H.264\nFiletype:    MP4\n\n\n\n\n\nIt&amp;#039;s not often I bother with reviews on here, but this film is worth it. It&amp;#039;s had a lot of bad press after the Cannes debacle last year and has major difficulties with classification (what &amp;#039;genre&amp;#039; it belongs to will certainly provoke continued debate for years to come), but at the end of it all it&amp;#039;s a treat for the eyes and mind, providing your prepared to open that mind and let your preconceptions fade away. A few (admittedly the type who looked like they would) walked out during the screening tonight amongst about 20 people, not a huge deal but then what do you (and they) expect? The key to this film is to go in with zero expectations and just allow anything and everything to be absorbed. Pay VERY close attention, particularly to the news tickers that appear throughout, which, unlike the usual gimmickry, actually paint a picture of the surrounding situation. Oddly, the satirical nature of the piece made me think of &amp;#039;Brazil&amp;#039; whilst the odd humour and tone was very reminiscent of, bizarrely, &amp;#039;Hudson Hawk&amp;#039;, yet neither of these films can even begin to compare to the unique spectacle this film is. Even the casting, which, whilst may at first appear strange, is actually, by and large, inspired, with Gellar, Timberlake and, in probably his best movie role to date, Dwayne Johnson (AKA, wrestler, &amp;#039;The Rock&amp;#039;) giving terrifically crafted performances, perfectly suited to the weirdly tongue in cheek tone of the film.\n\nOverall then, I&amp;#039;d say this film is a success and a definite step in the right direction for Kelly. It&amp;#039;s ambitious and hideously complex but also thought provoking and observant, a timely entry into film history during a period of humanities history when the world really could end at any time.\n\n\nEnjoy\n\nLGLuX","torrent":{"xt":"urn:btih:81a44bb103cacef21595a1f322e63a20277739ea","amp;dn":"Southland.Tales.DVDRip.ENG-LGLuX.mp4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81a44bb103cacef21595a1f322e63a20277739ea","infoHashBuffer":{"type":"Buffer","data":[129,164,75,177,3,202,206,242,21,149,161,243,34,230,58,32,39,119,57,234]},"announce":[],"urlList":[]}}