{"title":"Belaseshe (2015)DVD.Upscale-720p-HEVC-x265.AC3.6Ch-4.35 GB-[DDR]","uid":12753309,"size":3709587771,"categoryP":"video","categoryS":"hd___movies","magnet":"?xt=urn:btih:81c622623e35f89984a1d989f38a1bec102da7fd&amp;dn=Belaseshe+%282015%29DVD.Upscale-720p-HEVC-x265.AC3.6Ch-4.35+GB-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":1,"time":1447413934,"description":"DDR Presents\r\n\r\n\r\nBelaseshe(2015)- In the Autumn of Life\r\n(A film by Nandita Roy &amp; Shiboprosad Mukherjee)\r\n\r\nBengali - DVD Upscale - HEVC - 720p - 1280x544p (2.35:1)- 3.45 GB- x265.AC3 (5.1 Ch, Untouched) - 2 Hrs:21 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/eHN \nhttp://extraimago.com/image/eH2 \nhttp://extraimago.com/image/eHw \nhttp://extraimago.com/image/eHa \nhttp://extraimago.com/image/eH8 \nhttp://extraimago.com/image/eFf \nhttp://extraimago.com/image/eFW \nhttp://extraimago.com/image/eFA \nhttp://extraimago.com/image/eFv\r\n\r\niNFO\r\n \nhttp://extraimago.com/image/eFu\r\n\r\nSynopsis:\r\n75 year old Biswanath Majumdar (Soumitra Chatterjee) suddenly announces that he will divorce Arati (Swatilekha Sengupta), his wife of 49 years. The announcement puts his four children, their spouses, and everyone in the family in a tizzy, for the two have been a devoted couple, almost the ideal for everyone else. Only Arati accepts her husband's decision with equanimity, as she has aleays done throughout their married lives. What prompts Biswanath to take this extreme step? As his children try to find out, the truth slowly emerges..\r\n\r\nComments:\r\nThis is a story of love - a love that calls for doing what one thinks is the best for the other. Of quiet acceptance and faith. Of marriage and relationships. It is a story that is tenderly told and one that will touch your heart, irrespective of your age. And if you are among the elderly, this film will touch an extra chord, for it is your quiet worries that have been articulated.\r\n\r\nThe scrrenplay is the strongest part of this film followed by the acting of Soumitra and Swatilekha. Complementing them is some fine cinematography by Gopi Bhagat. Not for nothing did this film get rave reviews. It is a sensitive piece of direction by Nandita Roy and Shiboprosad Mukherjee. They specialise in depicting interpersonal relations, and in this film they have done a little better than they have done in the past. If you want to quibble, you can say that some of the scenes are very obvious. Some emotional respoonses are perhaps a bit exaggerated. But these are for the habitual naysayers. Even they will accept that the subject has been treated with sensitivity and empathy.\r\n\r\nThis is a film that will stay with you long after you have finished watching it.\r\n\r\nUploader's Notes:\r\nThis is a rip that is optimised for a 720p frame size. The sharpening is just right, The details are fully preserved and the color correction is just to the extent required. I have deliberately used a size of 3.45 GB in order to preserve detail and allow you to watch this on a large screen if you so wish.\r\n\r\nThe sound is the original 5.1 Channel AC3 sound (untouched). There is a slight distortion at 2 hrs:04 min. but this is almost not noticeable.\r\n\r\nTo get an idea of the quality of the rip, please check the screenshots which are evenly spaced across the film and do check the 2 minutes sample, which is from the last few frames of the film.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link:\r\n \nhttp://www.imdb.com/title/tt4658770/","torrent":{"xt":"urn:btih:81c622623e35f89984a1d989f38a1bec102da7fd","amp;dn":"Belaseshe+%282015%29DVD.Upscale-720p-HEVC-x265.AC3.6Ch-4.35+GB-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81c622623e35f89984a1d989f38a1bec102da7fd","infoHashBuffer":{"type":"Buffer","data":[129,198,34,98,62,53,248,153,132,161,217,137,243,138,27,236,16,45,167,253]},"announce":[],"urlList":[]}}