{"title":"Troy Interviews Illuminati Grandmaster Leo Zagami 2008-04-30","uid":4179671,"size":75021369,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:81e45bcb82343b4b5e71e24af606be06be93fa1f&amp;dn=Troy+Interviews+Illuminati+Grandmaster+Leo+Zagami+2008-04-30&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"grinreaper_CCE","files":2,"time":1210292927,"description":"\n&quot;\n2008 04 30: TROY INTERVIEWS LEO LYON ZAGAMI #1 - 215 MINS.\n\nPLEASE CLICK THE FOLLOWING U.R.L. TO DOWNLOAD OR STREAM THIS NEW &amp; INDEPTH TRANSATLANTIC INTERVIEW WITH LEO, IN A RELATIVELY INFORMAL, RADIO-FREE PHONE CALL RECORDING:\n &lt;a href=&quot;\nhttp://www.mediafire.com/?ksgmxvgjvwj&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.mediafire.com/?ksgmxvgjvwj&lt;/a&gt;\n\nDear friends,\n\nI have recorded a three &amp; a half hour phone call interview with Leo Zagami in the early hours of the morning (GMT).\n\nThe level of detail regarding the Illuminati structure, particularly in regards to the Monte Carlo Masonic Executive Committee, goes into specifics that I?ve not come across before. Obscure but influential Orders, such as the Fratelli Obscuri &amp; Superieur Inconnu &amp; their connection with the Priory of Zion &amp; Neoplatonism are mentioned by Leo for the first time that I am aware of.\n\nWe discuss matters such as uneasy feelings among the research network as to his intentions &amp; Leo reveals some stunning information. We go over matters that Leo had discussed in a previous &amp; only phone conversation, which lasted about 5 hours I believe, as well as explore some of those matters with more depth this time. That was in the middle of the day &amp; was a lot more fiery. This one was less so, but no less fascinating in terms of the information presented.\n\nI wish to make it clear that I have not passed on any emails to Leo that have come my way, as I respect the privacy of the individuals who have posted concerns regarding Leo, although I have raised concerns voiced in recent email, as I wished to have his statement recorded in the context of a fairly relaxed, non-live on-air environment. This has proved beneficial I feel in having Leo speak as candidly as possible, which will hopefully provide a lot more information on which to base conclusions. Hopefully more recordings will be possible &amp; made available. I feel that it is better to maintain an openness of communications with Leo, one way or the other.\n\nMy only motivation for recording this interview is to have as much information as possible on which to form my own understanding of what?s going on &amp; to allow for others to be in a position to form theirs. It is not to subvert, infiltrate or propagandise. I have no radio ratings or listenership to worry about, no funding or any other related matters that are of concern in this regards.\n\nI?ll also take this opportunity to state that even though we discuss matters of his personal belief &amp; understanding that aren?t my own, I wanted Leo to be able to make statements that were as clear as possible on these matters.\n\nIn truth &amp; awareness -\n\nTroy\n&quot;\n\n\n\nAbout Leo Lyon Zagami:\n\n&quot;\nZagami, as of April 2008, states that he is now the leader of a breakaway faction of Knights Templar &amp; high-level Freemasons centred around the elite of the Monte Carlo Lodge.\n\nThis Monaco-based Illuminati Lodge has three levels: the level comprised of the elite of the esoteric elite is the Ordo Illuminatorum Universalis. This oversees the Masonic Executive Committee, which in turn oversees the P2 (Propaganda Due) Lodge &amp; Universal Unity.\n\nLeo Zagami states that at present he has onside certain Masonic &amp; Templar factions with him, in Europe &amp; the U.S.A. The Rome-based Vatican/Jesuits/Knights of Malta nexus/cabal are, according to Leo, their declared enemies, as are the Satanic elements within the occult network, including the high-level occultists of the various Ordo Templi Orientis (O.T.O.) and Gnostic Catholic Church factions.\n\nHe has also stated that the U.K. based Templar factions are not onside with his anti-Vatican Templar Esoteric Christian agenda yet, nor is the Skull and Bones of Yale University.\n\nIt is not the intention of this researcher to endorse or refute the statements made by Leo regarding his present and future intentions in this blog. Let the material presented stand or fall on its own merits.\n\nOne matter that I will make a clear statement on, is that after much research based upon studying Zagami?s revelations &amp; following further communication with him, it is my firm conclusion that in no way is he a fantasist regarding his having an Illuminati bloodline background &amp; has more knowledge on the true inner workings of the many different aspects of the Illuminati than any ?researcher? out there is capable of.\n\nI will post and reply to any constructive comments, whether positive or negative, as time permits. In no way do I speak on Leo Zagami?s behalf. Leo is of course welcome to post comments.\n\nFor more research on the true inner workings of the Illuminati &amp; the New World Order, including aspects which may or may not be at odds with each other, see my main blog:\n\n&quot;\n\n &lt;a href=&quot;\nhttp://www.leozagami.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.leozagami.com/&lt;/a&gt;\n----------------------------------\nTech specs:\n\nMPEG-1 layer 3 (mp3)\n46kbit (VBR)\n44100Hz Joint Stereo\n215:37 (3h35m)\n\n===============================================================================\nOur leaders lie, cheat, steal and kill with virtual impunity. Find out why @ &lt;a href=&quot;\nhttp://conspiracycentral.net:6969/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.net:6969/index.html&lt;/a&gt;  &lt;a href=&quot;\nhttp://conspiracycentral.info/index.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://conspiracycentral.info/index.php&lt;/a&gt;\n===============================================================================","torrent":{"xt":"urn:btih:81e45bcb82343b4b5e71e24af606be06be93fa1f","amp;dn":"Troy+Interviews+Illuminati+Grandmaster+Leo+Zagami+2008-04-30","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"81e45bcb82343b4b5e71e24af606be06be93fa1f","infoHashBuffer":{"type":"Buffer","data":[129,228,91,203,130,52,59,75,94,113,226,74,246,6,190,6,190,147,250,31]},"announce":[],"urlList":[]}}