{"title":"Ubuntu 8.04 LTS - Desktop","uid":4225361,"size":733079552,"categoryP":"applications","categoryS":"unix","magnet":"?xt=urn:btih:820f6b2a801affaeb45593d8678971f418b70a80&amp;dn=Ubuntu+8.04+LTS+-+Desktop&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tht1guy","files":1,"time":1212791715,"description":"Ubuntu Version: 8.04LTS (Desktop version)\n\n\nUbuntu is a community developed operating system that is perfect for laptops, desktops and servers. Whether you use it at home, at school or at work Ubuntu contains all the applications you&amp;#039;ll ever need, from word processing and email applications, to web server software and programming tools.\n\nUbuntu is and always will be free of charge. You do not pay any licensing fees. You can download, use and share Ubuntu with your friends, family, school or business for absolutely nothing.\n\nWe issue a new desktop and server release every six months. That means you&amp;#039;ll always have the the latest and greatest applications that the open source world has to offer.\n\nUbuntu is designed with security in mind. You get free security updates for at least 18 months on the desktop and server. With the Long Term Support (LTS) version you get three years support on the desktop, and five years on the server. There is no extra fee for the LTS version, we make our very best work available to everyone on the same free terms. Upgrades to new versions of Ubuntu are and always will be free of charge.","torrent":{"xt":"urn:btih:820f6b2a801affaeb45593d8678971f418b70a80","amp;dn":"Ubuntu+8.04+LTS+-+Desktop","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"820f6b2a801affaeb45593d8678971f418b70a80","infoHashBuffer":{"type":"Buffer","data":[130,15,107,42,128,26,255,174,180,85,147,216,103,137,113,244,24,183,10,128]},"announce":[],"urlList":[]}}