{"title":"Adventure Workshop 1st 3rd Grade 9th Edition","uid":4223294,"size":1301932073,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:826d8b29fcd11a66af30a92e8ade848214008191&amp;dn=Adventure+Workshop+1st+3rd+Grade+9th+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"mikl0","files":5,"time":1212697408,"description":"Adventure Workshop 1st-3rd Grade 9th Edition - Windows\n\nRelease Date\n    4/23/2008\nPublisher\n    Encore\nPlatform\n    Windows\nCategory\n    Educational Software\nFormat\n    CD-ROM (4) \n\nSynopsis\nChildren will enjoy out-of-this-world adventures while reinforcing important skills in Adventure Workshop 1st-3rd Grade. Colorful characters, interactive settings and tricky puzzles keep kids engaged through four exciting games that impart lessons in math, reading, critical thinking and more. From outer space to a volcanic island to a playhouse unlike any you&amp;#039;ve seen before, this is a journey kids won&amp;#039;t want to miss.\n\nChildren can practice listening, reading, drawing and more as they help Reader Rabbit save the musical variety show in Reader Rabbit 1st Grade. In Star Flyers Royal Jewel Rescue, kids will rocket into outer space and use their problem-solving skills to track down missing jewels. Trudy&amp;#039;s Time &amp; Place House is an interactive adventure that teaches all about place and time, including geography and maps. Children will experience an explosive adventure in Numbers Up! Volcanic Panic as they rely on crazy gadgets and their own math skills to escape an imminent volcanic eruption. With Adventure Workshop 1st-3rd Grade, education becomes a thrilling adventure.\n\nFeatures\n\n    * Makes learning fun with four exciting games suitable for children ages five to eight years old\n    * Reader Rabbit 1st Grade teaches math, listening, reading, spelling and drawing skills as kids help Reader Rabbit and his friends save the musical variety show\n    * Star Flyers Royal Jewel Rescue features memorization, sequences, critical thinking, spatial reasoning and problem solving\n    * Trudy&amp;#039;s Time &amp; Place House offers an interactive playhouse where children will learn about foreign countries, oceans &amp; continents, telling time, reading maps and following directions\n    * To escape the exploding island in Numbers Up! Volcanic Panic, children will rely on strategy, quirky gadgets and their best math skills, including fractions, decimals, percentages and ratios\n","torrent":{"xt":"urn:btih:826d8b29fcd11a66af30a92e8ade848214008191","amp;dn":"Adventure+Workshop+1st+3rd+Grade+9th+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"826d8b29fcd11a66af30a92e8ade848214008191","infoHashBuffer":{"type":"Buffer","data":[130,109,139,41,252,209,26,102,175,48,169,46,138,222,132,130,20,0,129,145]},"announce":[],"urlList":[]}}