{"title":"The Bears (Adrian Belew) - Eureka! [2007/MP3/V0 (VBR)]","uid":4074575,"size":71480008,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:83924abd3a6f5b962107035208407b67f880de27&amp;dn=The+Bears+%28Adrian+Belew%29+-+Eureka%21+%5B2007%2FMP3%2FV0+%28VBR%29%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"matchless_man","files":12,"time":1205195139,"description":"Track list:\n01. Zelda Fitzgerald\n02. Veneer\n03. On\n04. Troubled Beauty\n05. Normal\n06. We Never Close\n07. Think\n08. Keep Your Own Counsel\n09. Idiot in the Sky\n10. Doodle\n11. Comin&amp;#039; Round the Mountain\n\n\nThe Bear&amp;#039;s music is infused with pop sensibilities inspired by the heady and adventurous music that ruled the radio in the late 1960s - when the Beatles, Dylan and Hendrix all happily co-existed in one format called &quot;rock&quot; and the sky was the limit. The core creative mission of the Bears has always been to combine strong, focused songwriting with instrumental chops both huge and effortless.\n\nThe Bears were founded in 1985 when Bob Nyswonger, Chris Arduser, and Rob Fetters - members of the Cincinnati group &quot;The Raisins&quot; - joined forces with their famous producer, Adrian Belew, to forge a powerful, guitar-based pop group that etched new boundaries in modern rock music.\n\nUsing a broad sonic palette stretching from Pete Townsend-ish power chords to exotic Middle Eastern tonalities and coupled with elegant, world-class vocal harmonies, the band developed a blistering live show and toured relentlessly.\n\nThey recorded two studio albums - &quot;The Bears&quot; and &quot;Rise and Shine&quot; - gaining a core cult following that has lasted for decades. They toured internationally and scored a hit with &quot;Fear is Never Boring,&quot; a rollicking ode to endorphin release through sado-masochistic fun times on the edge of consciousness, and gained MTV airplay with a follow up, &quot;Aches and Pains.&quot;\n\nIn 1988 the group split. Adrian moved on to solo success and as a member of King Crimson, recording and touring with mega-stars David Bowie and Nine Inch Nails. Rob, Bob and Chris, friends and bandmates since childhood, played and recorded their stunning power pop trio, &quot;psychodots,&quot; and found fortune, if not fame, in session work and commercial music composing.\n\nBehind the scenes circa 1998, the Bears regrouped in sporadic studio sessions at Adrian&amp;#039;s Tennessee home, bringing digital audio tapes and files from their personal studios. The sessions culminated with the release of &quot;Car Caught Fire&quot; in 2001. The 13-track album charted top 30 AAA radio, and led the band to tour in 2002. The results: sold out clubs in the U.S., a live DVD and a live album, a track of which was used for ABC-TV promos.\n\nAn epiphany for the band was the realization that they could achieve a satisfying degree of Internet success without a traditional label or distribution method. This rekindled their desire to make music together for the &quot;right reasons;&quot; a passion for a cultural medium - the pop song - which each member deeply believes has the potential to change individuals and the world in a positive way.\n\nIn 2007, the Bears are at it again with their self-released &quot;Eureka!&quot;, an electrifying collection of 11 tunes. Belew&amp;#039;s transparent production keeps the integrity of the music intact and showcases the band&amp;#039;s ability and wide creative range. It&amp;#039;s a fantastic album that is simultaneously challenging and accessible.\n\nFans are thrilled that the Bears will be touring in support of &quot;Eureka!&quot; Don&amp;#039;t miss their new album, and don&amp;#039;t miss their live performances!","torrent":{"xt":"urn:btih:83924abd3a6f5b962107035208407b67f880de27","amp;dn":"The+Bears+%28Adrian+Belew%29+-+Eureka%21+%5B2007%2FMP3%2FV0+%28VBR%29%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"83924abd3a6f5b962107035208407b67f880de27","infoHashBuffer":{"type":"Buffer","data":[131,146,74,189,58,111,91,150,33,7,3,82,8,64,123,103,248,128,222,39]},"announce":[],"urlList":[]}}