{"title":"Maureen O'Hara - Love Letters","uid":4176311,"size":61704515,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:840d274ef656922a471d2705377e9a7006961017&amp;dn=Maureen+O%5C%27Hara+-+Love+Letters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"glum22","files":14,"time":1210149113,"description":"\nMaureen FitzSimons came from a theatrical family. She auditioned and was accepted into the prestigious Abbey Theatre in Dublin at the age of 14. Her dream then was to become an opera singer. Maureen&amp;#039;s mother was an accomplished operatic contralto and later became a successful woman&amp;#039;s clothier.\n\nMaureen also attended the Ena Mary Burke School of Elocution in Dublin and at age 14 auditioned and was accepted into the famed performing arts school at the Abbey Theater. She was offered a screen test in London. The test proved to be a huge disappointment for Maureen. The studio adorned her in a gold lamÃƒÂ© gown and heavy make-up with an ornate hair style. Her thoughts were, &quot;If this is the movies, I want nothing to do with them!&quot; In short, the screen test was awful. Famed actor Charles Laughton later saw the test, and despite the overdone makeup and costume, he was haunted by her beautiful eyes.\n\nLaughton believed the young woman had &quot;something special&quot; and subsequently told his business partner Erich Pommer. Pommer saw the film, and he agreed wholeheartedly with Laughton. As a result, O&amp;#039;Hara was offered an initial seven-year contract with their new company Mayflower Pictures. Her first major film was Jamaica Inn (1939), directed by Alfred Hitchcock.\n\nLaughton was so pleased with her performance in Jamaica Inn, that he cast O&amp;#039;Hara in the role of Esmeralda opposite him in The Hunchback of Notre Dame, which was to be filmed at RKO Studios in Hollywood that same year. Just hours before boarding the Queen Mary to sail to America, a young man from the studio, George Brown, convinced her to marry him. O&amp;#039;Hara&amp;#039;s mother and Laughton found out about it, and she was whisked away from the altar to the boat. The marriage was never consummated and later annulled.\n\nAfter successful completion of Hunchback, World War II began, and Laughton, realizing their studio could no longer film in London, sold her contract to RKO. That studio cast her in low-budget films until she was rescued by famed director John Ford, who cast her as Angharad in How Green Was My Valley.\n\nIn 1946, she became a naturalized citizen of the United States.\n\nMaureen O&amp;#039;Hara had a beautiful soprano voice and her first love was always singing. Unfortunately, the studio heads never capitalized on her musical talent because she was already big box office in other genres of film. However, she was able to channel her love of singing to TV. In the late &amp;#039;50s and early &amp;#039;60s she was a guest on musical variety shows with Perry Como, Andy Williams, Betty Grable and Tennessee Ernie Ford. In 1960, she starred on Broadway in the musical Christine and later released two successful recordings, Love Letters from Maureen O&amp;#039;Hara and Maureen O&amp;#039;Hara Sings her Favorite Irish Songs.\n\nOne of her most popular film roles came along in 1961 in The Parent Trap, with young co-star Hayley Mills.\n\nAn icon of Hollywood&amp;#039;s Golden Age, the actress at the height of her career was considered one of the world&amp;#039;s most beautiful women. She is best remembered for her chemistry with legendary John Wayne. They made five films together - Rio Grande, The Quiet Man, The Wings of Eagles, McLintock! and Big Jake. O&amp;#039;Hara&amp;#039;s radiant face and thick red hair, blowing in the wind as she waves from a gate in John Ford&amp;#039;s Academy Award-winning How Green Was My Valley, remain among the most vivid images preserved on film.\n\n\n1 My Romance (03:09) \n2 You&amp;#039;d Be So Nice to Come Home To (02:45) \n3 Nearness of You (02:25) \n4 Yours Sincerely (02:41) \n5 Dearly Beloved (02:35) \n6 More I See You (02:28) \n7 I Only Have Eyes for You (03:01) \n8 Whispering (02:48) \n9 My Shining Hour (02:29) \n10 Love Letters (02:21) \n11 All Through the Day (02:30) \n12 My Love Is Forever (02:49) ","torrent":{"xt":"urn:btih:840d274ef656922a471d2705377e9a7006961017","amp;dn":"Maureen+O%5C%27Hara+-+Love+Letters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"840d274ef656922a471d2705377e9a7006961017","infoHashBuffer":{"type":"Buffer","data":[132,13,39,78,246,86,146,42,71,29,39,5,55,126,154,112,6,150,16,23]},"announce":[],"urlList":[]}}