{"title":"Seasons of War - Amy Myers","uid":12833728,"size":2158915,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:8674fdf6e5ea13c10febcc8cafd7394b9660d919&amp;dn=Seasons+of+War+-+Amy+Myers&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":6,"time":1448416688,"description":"01. Summer's End [Seasons of War, #01] - Amy Myers\r\n\r\n\r\n\r\n'The end of the old world' people said about the long hot summer of 1914. It was the last season of optimism, of certainty about the future as the sun set on the Edwardian age.That summer Aunt Tilly comes to stay with her brother the Rector and his four lively daughters in the sleepy Sussex village of Ashden. Aunt Tilly's visit sparks off a chain of events which threatens to split Ashden apart, in which Agnes Pilbeam, the Rectory palourmaid, and her sweetheart Jamie find themselves bewilderingly caught up. Then in August the lamps go out all over Europe and war bursts open the straitjacket of rural village life. The war will bring tragedy, change and love as private torments and struggles are subjected to the greater need. The challenge will prove too much for some and the making of others.\r\n\r\n02. Dark Harvest [Season of War, #02] - Amy Myers\r\n\r\n\r\nMarch 1915. Caroline Lilley’s fiancé, Reggie, is away at the Front and Caroline gives up her job and returns home at his request. Frustrated in her desire to help the war effort, she throws herself into saving the harvest by organising the village women – and runs up against Reggie’s mother, the formidable Lady Hunney. Caroline’s sister Felicia departs to become an ambulance driver on the Western Front and Phoebe and George eagerly await their chance to leave the Village. The mood in Ashden changes as it becomes apparent that this is going to be a war unlike any other","torrent":{"xt":"urn:btih:8674fdf6e5ea13c10febcc8cafd7394b9660d919","amp;dn":"Seasons+of+War+-+Amy+Myers","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8674fdf6e5ea13c10febcc8cafd7394b9660d919","infoHashBuffer":{"type":"Buffer","data":[134,116,253,246,229,234,19,193,15,235,204,140,175,215,57,75,150,96,217,25]},"announce":[],"urlList":[]}}