{"title":"Ms Office 2003 Proofing Tools SP3 (covers 50 languages) ","uid":4065904,"size":561843145,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8675f6cde81c73b755bb72b48047b0543df88d5e&amp;dn=Ms+Office+2003+Proofing+Tools+SP3+%28covers+50+languages%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"z247","files":2,"time":1204801595,"description":"Info from the Web page of Microsoft:\n\nProofing tools for Office 2003 Editions are a collection of editing technologies that enable users to proof Office 2003 Editions files in more than 50 different languages. The tools include spelling and grammar checkers, AutoCorrect lists, AutoSummarize capabilities for Microsoft Word, Input Method Editors (IMEs) for East Asian languages, and other tools. Proofing tools for Office 2003 Editions are contained on a single CD, and you can add them to any Office 2003 Edition or Microsoft Office program.\n\n50 languages on one CD:\n\nArabic, Basque, Bulgarian, Catalan, Chinese (Simplified and Traditional), Croatian, Czech, Danish, Dutch, English, Estonian, Finnish, French, Gaelic, Galician, German, Greek, Gujarati, Hebrew, Hindi, Hungarian, Iberian, Icelandic, Indonesian, Italian, Japanese, Kannada, Korean, Latvian, Lithuanian, Marathi, Norwegian, Polish, Portuguese (Brazilian), Portuguese (Iberian), Punjabi, Romanian, Russian, Serbian, Slovakian, Slovenian, Spanish, Swedish, Tamil, Telugu, Thai, Turkish, Ukrainian, and Welsh. (some features vary with language)\n\n\nRequirements: \n\t- Windows 2000 Service Pack 3; Windows Server 2003 Service Pack 1; Windows Vista; Windows XP Service Pack 2\n\t- Compatible with Microsoft Office 2003 only\n\n\n\n\nMy remarks:\n - I integrated all the security packages available. SP3 is available only for Dutch, English, French, German, Italian, Portuguese (Brazil), Spanish and Swedish. Security issues are fixed independently from the language version so you should not worry much.\n- the package is packed with 7-Zip (WinRAR, IZArc will extract too). The size after extraction is over one gigabyte, so you will need a DVD if you want to burn it. Alternatively you can install it directly from the folder.\n\n\nEnjoy!\n\n\n\n********\n\n\nKontynuacja mojego poprzedniego torrenta - zawiera 50 sÃ…?ownikow dla Office 2003 ze zintegrowanym Service packiem 3. Niestety ten Service Pack nie istnieje dla jezyka polskiego wiec w sensie slownikowym nic sie nie zmienilo. Niemniej jednak dowolny service pack naprawia wszelkiego rodzaju bledy calej paczki wiec chocby z tego powodu warto go zainstalowac, bo poprawia to bezpieczenstwo korzystania z calosci. Po zainstalowaniu przeze mnie wszelkich mozliwych poprawek bezpieczenstwa pakiet sie rozrosl i po wypakowaniu potrzebuje ponad gigabajt miejsca, wiec jesli ktos chcego wypalic bedzie potrzebowal plytki DVD, bo na CD sie nie zmiesci. Mozna tez wszystko odpalic bezposrednio z folderu. Pakiet skompresowany 7-Zipem.","torrent":{"xt":"urn:btih:8675f6cde81c73b755bb72b48047b0543df88d5e","amp;dn":"Ms+Office+2003+Proofing+Tools+SP3+%28covers+50+languages%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8675f6cde81c73b755bb72b48047b0543df88d5e","infoHashBuffer":{"type":"Buffer","data":[134,117,246,205,232,28,115,183,85,187,114,180,128,71,176,84,61,248,141,94]},"announce":[],"urlList":[]}}