{"title":"(Emo-core) Fire Divine - It's all a blur","uid":4117240,"size":15389791,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:86bc846ae266ce496598d674aee2751b239246ec&amp;dn=%28Emo-core%29+Fire+Divine+-+It%5C%27s+all+a+blur&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Falleen_Fan_No_1","files":4,"time":1207368567,"description":"Okay, so emo-core doesn&amp;#039;t do Fire Divine justice. This is one of my favorite CD&amp;#039;s of all time, no joke. It&amp;#039;s small and free, check it out.\n\n01. Clark And Rightwood \n02. Reputation Outlives Application \n03. We Ride On Sunbeams\n04. Smoke And Mirrors \n\n(from deepelm.com)\n\nFIRE DIVINE (featuring members of The June Spirit and A Life Once Lost) has achieved the rare feat of bringing that blustery, guttural sound normally confined to smoky bars and dank clubs to compact disc, sans sheen. This debut, IT&amp;#039;S ALL A BLUR, features roaring guitars teeming with an array of songful textures and drums with hammer, stomp and bite to spare. There&amp;#039;s something to be said for a vocalist like Ian Musgrove, a singer who can instill incalculable passion into a song with absolutely no pretense. Opener &amp;#039;Clark And Rightwood&amp;#039; leaves no questions unanswered with its guitar revs straight out of Hell&amp;#039;s Angels and Ian Musgrove&amp;#039;s visceral, emotional vocals. &amp;#039;Reputation Outlives Application&amp;#039; could rightly be described as melodic mayhem, amalgamating bullet-train rhythms, low-key strumming and mid-tempo fireworks. Fire Divine embodies the spirit and intensity that made rock and roll the vast cultural movement it was at its outset. Sure, it&amp;#039;s easy enough to hear the music. But how often do you actually feel it like this? \n\n&quot;It&amp;#039;s All A Blur from Fire Divine is another winner on Deep Elm Records. With their debut, the band has nailed the art of recording a sound that is raw yet tight. Listening to the CD with your eyes closed almost makes it seem as if you&amp;#039;re standing in a packed venue seeing them live. Their sound is composed of grinding guitar riffs, quick and sharp drumming, passionately raw vocals and harmonious peaks and dips in melody. It&amp;#039;s All A Blur will surely win many fans. I know I&amp;#039;ve been won over.&quot; - Skratch \n\n&quot;There is a strangely organic feeling to Fire Divine that gives the songs on It&amp;#039;s All A Blur a hefty dose of character. The band bubbles with talent from just about every direction, and it&amp;#039;s not hard to find a blueprint for huge potential from what&amp;#039;s on display. If you dig quirky, energetic post-punk with well-sung vocals, Fire Divine has got it going on.&quot; - Paste Punk\n\nfor lyrics, go here: http://www.deepelm.com/sum/434_sum.html\n\n\nIf you like this, please check out my other torrents! I only upload quality stuff!\n","torrent":{"xt":"urn:btih:86bc846ae266ce496598d674aee2751b239246ec","amp;dn":"%28Emo-core%29+Fire+Divine+-+It%5C%27s+all+a+blur","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"86bc846ae266ce496598d674aee2751b239246ec","infoHashBuffer":{"type":"Buffer","data":[134,188,132,106,226,102,206,73,101,152,214,116,174,226,117,27,35,146,70,236]},"announce":[],"urlList":[]}}