{"title":"Van Morrison-Keep it Simple (2008-VBR)","uid":4085177,"size":66300838,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8773174aa6b3687a3b25ead4910adcf590a49e7b&amp;dn=Van+Morrison-Keep+it+Simple+%282008-VBR%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Cheng","files":15,"time":1205772812,"description":" &lt;a href=&quot;\nhttp://ecx.images-amazon.com/images/I/513mjhQNbzL._SS500_.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://ecx.images-amazon.com/images/I/513mjhQNbzL._SS500_.jpg&lt;/a&gt;\n\n-=About the Artist=-\n\nVan Morrison was born in Belfast in 1945, the son of a shipyard worker who collected American blues and jazz records. Van grew up listening to the music of Muddy Waters, Mahalia Jackson, Lightnin&amp;#039; Hopkins and John Lee Hooker. Surrounded by every kind of musical influence - country, blues, jazz, and folk - from 13 he was playing guitar, sax and harmonica with a series of local Irish showbands, skiffle and rock&amp;#039;n&amp;#039;roll groups. By the time he rose to the fore of Britain&amp;#039;s nascent blues-rock scene as leader of Them, Morrison had already pulled years in the trenches, singing and playing with some of Belfast&amp;#039;s cagiest combos. His music has always incorporated the widely-varied influences he heard and absorbed since his childhood days on the streets of Belfast - long before the bands of his youth and his initial 1964 breakthrough with the band he formed, Them. \nIn recognition of his unique position as one of the most important songwriters of the past century, Van Morrison was inducted into the Songwriters Hall of Fame at an awards ceremony in New York City in June 2003. \n\nVan Morrison was honoured at the US-Ireland Alliance Awards in early 2007 for his contribution to the film world. Presented by Al Pacino, the award highlighted the depth and breadth of Van&amp;#039;s compositions as used by directors Scorsese, Hackford, Landis, Stone and more. \n\n2008 sees the release of Keep It Simple, the 35th album which Van Morrison has produced himself. Morrison&amp;#039;s first new album of new material since 2005, and the first in several years in which he penned all 11 songs specifically for one album. On this new record, Morrison honours all his varied influences - jazz, folk, blues, Ulster Scots, country, soul and gospel (even making uniquely innovative use of the mighty ukulele) - at times melding them all together at once in his own signature sound. \n\nKeep It Simple does not boast the big horns or string arrangements of some of Morrison&amp;#039;s previous work. What it does feature are gorgeous songs rich with emotion, depth and beauty. Van has journeyed far and wide since his early days in Belfast but inevitably, the man Bob Geldof called &quot;the one true genius in Irish music&quot; has invariably come back to the philosophy summed up in the title of his new record. \n\nAs Keep It Simple is released, its creator continues a busy schedule of concerts across the globe, averaging over 100 gigs a year. \n\n-=Product Description=-\n\nOn April 1st, Lost Highway will proudly release Keep It Simple, the new album from Van Morrison. Keep It Simple is Morrison&amp;#039;s first album of new material since 2005, and the first in several years in which he penned all 11 songs specifically for one album. In the interim the legendary artist had a year that may be unprecedented for any living artist, having released three separate collections of his hits, with the latest, Still On Top entering the UK charts at #2 and selling platinum, proving the ongoing appetite for his unrivaled work. His music has always incorporated the widely varied influences he heard and absorbed since his childhood days on the streets of Belfast- long before the bands of his youth and his initial breakthrough with Them. On Keep It Simple, Morrison honors all those varied influences - jazz, folk, blues, Celtic, country, soul and gospel - at times melding them all together at once in his own signature sound. &quot;I felt I had something to say with these songs...&quot; explains Morrison. There is a definite theme that recurs throughout the album, especially in the title track. \n\nIn keeping with that idea, Keep It Simple does not boast the big horns or string arrangements of some of Morrison&amp;#039;s previous work. What it does feature are gorgeous songs rich with emotion, depth and beauty.\n\n\n\n Van Morrison - Keep it Simple\n Retail CD, as released by Universal 2008\n\n .------------------------------------------------------------------------- -\n |\n | 01. how can a poor boy                                           [05:43]\n | 02. school of hard knocks                                        [03:44]\n | 03. that is entrainment                                          [04:32]\n | 04. dont go to nightclubs anymore                                [04:31]\n | 05. lover come back                                              [05:16]\n | 06. keep it simple                                               [03:34]\n | 07. end of the land                                              [03:16]\n | 08. song of home                                                 [04:13]\n | 09. no thing                                                     [04:31]\n | 10. soul                                                         [03:37]\n | 11. behind the ritual                                            [06:59]\n |\n |                                                               .. [49:56]\n |\n |                                                           &gt;&gt;    63,2MB\n |\n |\n |\n .------------------------------------------------------------------------- +\n\n Please, if you like the music, buy the CD.\n","torrent":{"xt":"urn:btih:8773174aa6b3687a3b25ead4910adcf590a49e7b","amp;dn":"Van+Morrison-Keep+it+Simple+%282008-VBR%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8773174aa6b3687a3b25ead4910adcf590a49e7b","infoHashBuffer":{"type":"Buffer","data":[135,115,23,74,166,179,104,122,59,37,234,212,145,10,220,245,144,164,158,123]},"announce":[],"urlList":[]}}