{"title":"The Great Green Fuel Gamble? ? Biofuels  2008 03 14(BBC 2)","uid":4085876,"size":241885184,"categoryP":"video","categoryS":"movie_clips","magnet":"?xt=urn:btih:87c4d09f71412dbddf8b05265bc21ef23330800d&amp;dn=The+Great+Green+Fuel+Gamble%3F+%3F+Biofuels++2008+03+14%28BBC+2%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"shunster07","files":1,"time":1205798781,"description":"\nThe Great Green Fuel Gamble? ? Biofuels  2008 03 14(BBC 2)\n\nThe Money Programme\n \n29:04 mins\n230 mgs\n &lt;a href=&quot;\nhttp://news.bbc.co.uk/2/hi/business/7294516.stm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://news.bbc.co.uk/2/hi/business/7294516.stm&lt;/a&gt;\n\n\nWith 620 million cars worldwide and fossil fuels running out, are biofuels the green solution to our energy needs. Now there&amp;#039;s a revolution going on in the garages of the UK as individuals and companies switch to biofuels.\n\nRetired teacher Dick Jones makes his own biofuel, to power his people carrier from the local pub&amp;#039;s converted chip fat. Although the chemicals involved are potentially dangerous, the rewards can be worth it.  Jones says he likes &quot;the idea of using a waste product to make oil, and I like the idea of being energy independent, but it also saves a lot of money&quot;.\n\nIt costs him some Â£21 for a tank of home-made bio-diesel, compared with Â£80 at the garage. Businesses including McDonalds and Stagecoach are starting to experiment with biofuels. They are both trialling fuels made from used cooking oil.\n\nBut unfortunately there is not enough used chip fat to power our entire economy, which is why biofuels made from food crops like maize, wheat, palm oil and rapeseed, are seen by some as the answer. The justification is when the plant-derived biofuel is burned in an engine, the CO2 released is offset by the amount of the gas that the plants absorbed as they grew.\n\nPreviously, only Brazil (and at one point Zimbabwe) made fuel from sugar cane, but now the US and Europe see biofuels as the way forward. The UK Government has said that by 2010 5% all UK fuel should come from biofuels. The EU has gone even further, setting a target of 10% by 2020.\n\nFood or fuel\n\nBut how are we going to reach those targets? Critics argue it will mean diverting crops from food to fuels. Will the knock-on effect be a hike in the prices of cereal and grains which hit those already living in poverty hardest?\n\nGreenpeace&amp;#039;s John Sauven says that &quot;when it comes down to it, you can put food in someone&amp;#039;s stomach or you can put fuel in the tank of the car and it&amp;#039;s that kind of black and white&quot;. And the criticisms don&amp;#039;t stop there. Mr Sauven says the demand for biofuels has piled even greater pressure on the world&amp;#039;s already fragile rainforests.\n\n&quot;It&amp;#039;s a disaster to see the rainforests being cleared whole-sale and massive monoculture palm oil plantations put in their place,&quot; he says. Both the UK and the EU have issued guidelines on sourcing biofuels from sustainable sources, but it is hard to enforce.\n\nFuel giant Shell says it could not guarantee its biofuels do not come from palm oil.\nShell&amp;#039;s head of Future Fuels, Graeme Sweeney, says &quot;traceability will improve over time&quot;. &quot;It won&amp;#039;t be possible in the beginning to trace everything, but that doesn&amp;#039;t mean to say that we shouldn&amp;#039;t do all that we can,&quot; he continues. But the bio-fuel industry is not the only one to place demands on palm oil resources.\n\n\nAndrew Owens, of biofuel manufacturer Greenergy, believes the biofuel industry has been unfairly blamed. Fiona Leggate with an E85 Ford Focus Specially modified cars can run on 85% bioethanol.  Although it does not use palm oil, Mr Owens says &quot;you have to look at all the consumers of palm oil, and not just biofuels&quot;.  &quot;The lion share is the food industry.&quot;\n\nThe car industry has embraced biofuels, investing in designing the so called &amp;#039;flex-fuel&amp;#039; car, which can run on either unleaded petrol or biofuel.\n\nThe market leaders are the Ford Focus and the Saab bio-power., but if you do want to run them on the maximum biofuel efficiency, there there&amp;#039;s a hitch: the cars take 85% biofuel, known as E85 and it is only available at a handful of UK forecourts.\n\nThere is a country where things are different: Sweden. There are more than 1,000 biofuel stations there and this contributed to Saab selling 17,000 bio-power cars in Sweden last year.\n\nAlso significant were the Swedish government&amp;#039;s financial incentives - starting with a 10,000 SEK (Â£800) rebate on the cost of a E85-powered cars. The vehicles are also exempt from the Stockholm&amp;#039;s congestion charge, and qualify for free residential parking.\n\n\nThe big question is, do biofuels really contribute to reducing greenhouse gas emissions?\n\nResearch suggests that once the greenhouse gases produced by the the process of growing the crops for biofuel are factored in - from ploughing the fields, making the fertiliser, harvesting the crops, processing them, to transporting the finished fuel - the environmental benefits are seriously compromised.\n\nOne recent study investigated the impact of fertiliser on biofuel production. Using sugar cane, according to the research, does offer greenhouse gas savings of between 10% and 50%.\n\nBut using rapeseed and corn for biofuel manufacture can actually produce between 50% and 70% more greenhouse gases than using fossil fuels. Professor Keith Smith, one of the team of scientists who worked on the research, says he is &quot;concerned that the adoption of biofuels so enthusiastically means we&amp;#039;re running ahead of the science&quot;.\n\nIn February, transport secretary Ruth Kelly announced an enquiry into biofuels before committing the UK to any higher targets than those already set.\n\nThe fuels&amp;#039; future seems uncertain, yet in a step that even green campaigners support, the industry is now investing to develop &quot;second generation&quot; biofuels from non-food crops like straw, woodchips and even algae.\n\nThis is still some years off. Until then, the quest to find an alternative to petrol and diesel will continue to fuel debate, even if it does not fuel all our cars.\n\nRetrack-shunster\nThebox.bz\n","torrent":{"xt":"urn:btih:87c4d09f71412dbddf8b05265bc21ef23330800d","amp;dn":"The+Great+Green+Fuel+Gamble%3F+%3F+Biofuels++2008+03+14%28BBC+2%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87c4d09f71412dbddf8b05265bc21ef23330800d","infoHashBuffer":{"type":"Buffer","data":[135,196,208,159,113,65,45,189,223,139,5,38,91,194,30,242,51,48,128,13]},"announce":[],"urlList":[]}}