{"title":"You're Never Weird on the Internet (Almost) (Unabridged)","uid":12763885,"size":362158833,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:87cab7d3e37a4512c4b68bf26a7308b4c7c33b45&amp;dn=You%27re+Never+Weird+on+the+Internet+%28Almost%29+%28Unabridged%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"inZeroSec","files":1,"time":1447569902,"description":"From online entertainment pioneer, actress, and &quot;queen of the geeks&quot; Felicia Day, You're Never Weird on the Internet (Almost) is a &quot;relentlessly funny and surprisingly inspirational&quot;; (Forbes.com), memoir about her unusual upbringing, her rise to internet stardom, and embracing her weirdness to find her place in the world.\r\n\r\nWhen Felicia Day was a girl, all she wanted was to connect with other kids (desperately). Growing up in the Deep South, where she was &quot;home-schooled for hippie reasons,&quot; she looked online to find her tribe. The internet was in its infancy and she became an early adopter at every stage of its growth—finding joy and unlikely friendships in the emerging digital world. Her relative isolation meant that she could pursue passions like gaming, calculus, and 1930's detective novels without shame. Because she had no idea how &quot;uncool&quot; she really was. \r\n\r\nBut if it hadn't been for her strange background— the awkwardness continued when she started college at sixteen, with Mom driving her to campus every day—she might never have had the naive confidence to forge her own path. Like when she graduated as valedictorian with a math degree and then headed to Hollywood to pursue a career in acting despite having zero contacts. Or when she tired of being typecast as the crazy cat-lady secretary and decided to create her own web series before people in show business understood that online video could be more than just cats chasing laser pointers. \r\n\r\nFelicia's rags-to-riches rise to internet fame launched her career as one of the most influential creators in new media. Ever candid, she opens up about the rough patches along the way, recounting battles with writer’s block, a full-blown gaming addiction, severe anxiety and depression—and how she reinvented herself when overachieving became overwhelming. \r\n\r\nShowcasing Felicia's &quot;engaging and often hilarious voice&quot; (USA TODAY), You’re Never Weird on the Internet (Almost) is proof that everyone should celebrate what makes them different and be brave enough to share it with the world, because anything is possible now—even for a digital misfit.\r\n\r\n\r\n\r\n*Remember guys, seed if you enjoy it helps the family, and buy the book if you like it and are able, it's definitely worth it. *\r\n\r\n- Z","torrent":{"xt":"urn:btih:87cab7d3e37a4512c4b68bf26a7308b4c7c33b45","amp;dn":"You%27re+Never+Weird+on+the+Internet+%28Almost%29+%28Unabridged%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87cab7d3e37a4512c4b68bf26a7308b4c7c33b45","infoHashBuffer":{"type":"Buffer","data":[135,202,183,211,227,122,69,18,196,182,139,242,106,115,8,180,199,195,59,69]},"announce":[],"urlList":[]}}