{"title":"Zone Stad Seizoen 1en2 HDTV NL By Jeffrey","uid":12825951,"size":8857350144,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:87d3ca1af29b191db1f180259335a16400d20ede&amp;dn=Zone+Stad+Seizoen+1en2+HDTV+NL+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gljeffrey45","files":26,"time":1448343020,"description":"ZoneStad Seizoen 1 HDTV NL Collected By Jeffrey\r\n\r\nHet eerste seizoen van de VTM politieserie Zone Stad was meteen goed voor een nominatie voor de Pierre Plateau prijs. Zone stad speelt zich af in hartje Antwerpen. In elke aflevering staan de beroepsactiviteiten van de politie-inspecteurs, hun privé-leven en hun relatie met andere personages centraal. Actie, spanning, intriges, humor, emotie en romantiek lopen dan ook als een rode draad doorheen de serie. De politierechercheurs van Zone Stad pakken de misdaad aan van het centrum van Antwerpen tot in de haven. Elke nieuwe zaak confronteert hen met een ander milieu en met andere drijfveren. Ze krijgen met het volledige gamma van de criminaliteit te maken, gaande van zakkenrollerij, familiedrama's, burenruzies over verkrachting, safpersing, moord en de georganiseerde Oost-Europese maffia. Alle verhalen leunen dicht aan bij de werkelijkheid. Voor de makers is het een bewuste keuze geweest om fictie met feiten te vermengen. De inspecteurs zullen dan ook eerder bemiddelen in plaats van te verbaliseren wanneer ze geconfronteerd worden met burenruzie of partnergeweld. Maar de zogenaamde grote misdrijven worden niet in een handomdraai opgelost en misdadigers niet altijd geklist. Kortom de inspecteurs zijn ook mensen zoals u en ik, kwetsbaar, ambitieus zonder sterallures, moedig maar niet helfhaftig. In elke aflevering wordt de spanning zorgvuldig opgebouwd en komen de verschillende verhaallijnen uiteindelijk samen tot een verrassende ontknoping.\r\n\r\n\r\nAfleveringen:\r\n\t\r\n1\tRosse John.\t\r\n2\tHoedrecht.\t\r\n3\tDe Ramkraak.\t\r\n4\tVluchtmisdrijf.\t\r\n5\tDe Antieke Kast.\t\r\n6\tDe Huisjesmelker.\t\r\n7\tMoord in de Haven.\t\r\n8\tDe Roemeen. \r\n9\tDe Pedofiel. \r\n10\tBescherming.\t\r\n11\tDe Carjacking.\t\r\n12\tDiamanten.\t\r\n13\tWraak.\r\n\r\nNL Gesproken\r\nAVI\r\n\r\nZoneStad Seizoen 2 HDTV NL Collected By Jeffrey\r\n\r\nZone Stad speelt zich af in het hartje van Antwerpen. In elke aflevering staan de beroepsactiviteiten van de politie-inspecteurs, hun privé-leven en hun relatie tot de andere personages centraal. Actie, spanning, intriges, humor, emotie en romantiek lopen dan ook als een rode draad doorheen deze serie. De politierechercheurs van Zone Stad pakken de misdaad aan van het centrum van Antwerpen tot in de haven. Elke nieuwe zaak confronteert hen met een ander milieu en met andere drijfveren. Ze krijgen met het volledige gamma van de criminaliteit te maken. Zone Stad is een weldoordachte reeks, waarvoor de acteurs en actrices door het politiekorps van Antwerpen met raad en daad werden bijgestaan. De cast leerde omgaan met wapens, leerde hoe ze misdadigers moest arresteren en leerde eveneens hoe bepaalde situaties psychologisch moesten worden ingeschat. Zone Stad vaart resoluut een eigen koers en serveert een spannende cocktail van actie en misdaad, met boeiende plots die snel in elkaar vloeien en even dynamisch verfilmd worden. Deze aanpak resulteerde reeds in een trouwe aanhang in de Vlaamse huiskamer en bij de critici in een nominatie voor de Plateau prijs.\r\n\r\n\r\nAfleveringen: \r\n\r\n14 De Wijkagent. \r\n15 Pikkepik. \r\n16 Moord in het Park. \r\n17 De Ingenieur. \r\n18 Verkracht. \r\n19 De Ammoniakaanslag. \r\n20 De Perfecte Moord. \r\n21 Het Biechtgeheim. \r\n22 De Ontsnapte Gevangene. \r\n23 Heroïne. \r\n24 De Engel des Doods. \r\n25 Tess Vermist. \r\n26 Het Huwelijk.\r\n\r\nNL Gesproken\r\nAVI","torrent":{"xt":"urn:btih:87d3ca1af29b191db1f180259335a16400d20ede","amp;dn":"Zone+Stad+Seizoen+1en2+HDTV+NL+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"87d3ca1af29b191db1f180259335a16400d20ede","infoHashBuffer":{"type":"Buffer","data":[135,211,202,26,242,155,25,29,177,241,128,37,147,53,161,100,0,210,14,222]},"announce":[],"urlList":[]}}