{"title":"Mrs Mills - Piano Favourites","uid":4171423,"size":92603728,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:88d67eadcd682f5f4f19dde07531e2d8e553561d&amp;dn=Mrs+Mills+-+Piano+Favourites&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"glum22","files":33,"time":1209896614,"description":"Gladys Mills (1918- 1978), better known as Mrs Mills, was a pianist who was popular in the 1960s and released many records.\n\nShe shot to fame during the same period as her stable-mates The Beatles, with whom she shared space at Abbey Road Studios (as mentioned in the Beatles Anthology DVD bonus materials). After previously working as the superintendent of the typing pool in the Paymaster General&amp;#039;s office in London in December 1961, she would become a household name by the end of January 1962, having been spotted by a talent scout at a Woodford Golf Club dance near her home in Loughton, Essex. Glad Mills was signed to a management contract by Eric Easton who later went on to manage the Dave Clark Five and the Rolling Stones among others. After signing to Parlophone Records, her very first release - the Mrs Mills Medley single - entered the Top Twenty, and her career as an entertainer began - a career that would last well into the 1970s. She toured the UK, made many appearances on TV and radio throughout this period. Mrs Mills was also a successful recording artist overseas in territories where there were large numbers of ex-pats from the U.K. including Australia, Canada and Hong Kong.\n\nHer oeuvre consisted of standards (British and international), plus versions of contemporary hits. A 2003 release (The Very Best Of Mrs Mills, on EMI Gold) includes such hits as &quot;Diamonds Are a Girl&amp;#039;s Best Friend&quot;, &quot;Hello, Dolly!&quot;, &quot;I&amp;#039;m Forever Blowing Bubbles&quot;, &quot;Yellow Submarine&quot;, and many others in a similar vein.\n\nHer albums are still frequently available in charity shops. Singles are far rarer, and possibly of lesser aesthetic value being sold in generic Parlophone sleeves, akin to those of the UK-issued Beatles singles. They displayed none of her glorious grandeur, as seen on LP covers for Look Mum, no Hands! (1967) (Glad on horseback), or I&amp;#039;m Mighty Glad&amp;#039; (1966) (Glad as a sailor), Your One And Only Mrs Mills (1967) (Glad as a housemaid complete with feather duster) and the hallucinatory post-Sgt Pepper cover of Party Sing Along(1970) (with a kaleidoscopic image not far removed from the contemporary debut of fellow EMI artists Pink Floyd - Piper At The Gates Of Dawn).\n\nApart from album covers, little has been seen on television of Mrs Mills since her heyday. One rare example - albeit a recreation - of Mrs Mills&amp;#039; style of performance came in an edition of the BBC&amp;#039;s The Two Ronnies. The sketch (Family Entertainment - John &amp; Mrs Mills) occupied the end-of-the-show musical slot, with Ronnie Barker as the silk-laden Mrs Mills at piano, and Ronnie Corbett as a uniformed Sir John Mills (who was no relation). They performed a medley of Mills-style classics (on the theme of Mills&amp;#039; character in the 1969 film Oh! What A Lovely War). (NB: The show (series 4; episode 4) was originally broadcast on BBC2, 23/01/75.\n\nMrs Mills died in February 1978.\n\n\n\n01 Put your arms around me honey\n02 I&amp;#039;m in the mood for love\n03 Yes sir, that&amp;#039;s my baby\n04 Moonlight and roses\n05 Oh, Johnny! Oh Johnny! Oh!\n06 Give me the moonlight, Give me the girl\n07 Winchester Cathederal\n08 Gree green grass of home\n09 I&amp;#039;m nobody&amp;#039;s baby\n10 The the good old summertime\n11 Tiptoe through the tulips\n12 You are my sunshine\n13 April showers\n14 Down at the old Bull and Bush\n15 Cruising down the river\n16 Shine on harvest moon\n17 I do like to be beside the seaside\n18 Out of town\n19 Let&amp;#039;s all sing like the birdies sing\n20 Good morning\n21 Me and my shadow\n22 My melancholy baby\n23 Second hand rose\n24 There&amp;#039;s a bridge round my heart, Virginia\n25 Let him go, let him tarry\n26 I belong to Glasgow\n27 Over the rainbow\n28 Get out and get under the moon\n","torrent":{"xt":"urn:btih:88d67eadcd682f5f4f19dde07531e2d8e553561d","amp;dn":"Mrs+Mills+-+Piano+Favourites","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"88d67eadcd682f5f4f19dde07531e2d8e553561d","infoHashBuffer":{"type":"Buffer","data":[136,214,126,173,205,104,47,95,79,25,221,224,117,49,226,216,229,83,86,29]},"announce":[],"urlList":[]}}