{"title":"Windows Firewall Controll 4.5.5.0 + Serial Keygen","uid":12754916,"size":366499,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8b061cab2df91053d39d73305178d07501705a2e&amp;dn=Windows+Firewall+Controll+4.5.5.0+%2B+Serial+Keygen&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rubberboy37","files":1,"time":1447434189,"description":"Windows Firewall Control 4.5.5.0 is a tool that provides fast access to the Windows Firewall settings and enhances functionality by letting you manage networking rules for each application. It mainly caters to experienced users, such as Network Administrators.\r\n\r\n\r\n\r\nQuick access from the tray icon\r\n\r\nOnce initialized, the app creates an icon in the system stray (right behind your clock) area and allows you to select the security profile, ranging from no filtering (turns off Winsdows Firewall) to high filtering mode (blocks all inbound and outbound connections).\r\n\r\n\r\n\r\nThorough management of application connections\r\n\r\nWhen it comes to rules management, you can allow or deny access to any application, disable, delete it from the list or create a duplicate. The list shows &quot;names, groups, programs, locations, statuses, actions, directions, locate and remote ports, remote addresses, protocols and services&quot;.\r\n\r\n\r\n\r\nPopulate permission lists with custom apps\r\n\r\nIt is possible to sort items by status or direction (inbound, outbound, all, user-created), use a search function, view recently blocked programs, as well as switch to a simplified viewing mode for enabling and disabling program access, as well as for adding a new app to the list.\r\n\r\n\r\n\r\nRich settings to work with\r\n\r\nWindows Firewall Control features a control panel where you can make additional tweaks. You can integrade the tool into the Explorer Context Menu, set it to Autorun at Startup, disable other programs from adding Firewall rules, activate Global Hotkeys for the Control Panel  and rules management area, adjust the frame's hue, import and export rules, as well as access some Windows Tools (Firewall with Advanced Security, Command Prompt, Event Viewer, Resource Monitor, Windiows Registry).\r\n\r\n\r\n\r\nTo end with\r\n\r\nTested and works like a charm on the latest Windows 10 Version 1115 Build 10585, that I uploaded yesterday on TPB. \r\n\r\nAll in all, the application has a fair reaction speed and works smoothly, without causing any problems to the OS. It quickly applies rule changes. Windows Firewall Control is an exellent utility for a better control over Windows Firewall options, especially when it coms to setting up rules for each program.\r\n\r\n\r\n\r\nWhat's new in version 4.5.5.0 (Update: 12-11-2015)\r\n\r\n- Improved: the visual theme of the program was updated to use system themes colors. With the previous versions, the program was unusable when high contrast themes were used because of the custom styles.\r\n\r\n- BUG FIX: notifications are not displayed even if the advanced notification setting &quot;Use allow rules when searching for matching rules&quot; is disabled. The checkbox does not trigger the corresponding setting in the service.\r\n\r\n \nhttp://imgbay.mobi/di/Knipsel-vabqf.jpg","torrent":{"xt":"urn:btih:8b061cab2df91053d39d73305178d07501705a2e","amp;dn":"Windows+Firewall+Controll+4.5.5.0+%2B+Serial+Keygen","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b061cab2df91053d39d73305178d07501705a2e","infoHashBuffer":{"type":"Buffer","data":[139,6,28,171,45,249,16,83,211,157,115,48,81,120,208,117,1,112,90,46]},"announce":[],"urlList":[]}}