{"title":"Microsoft Office 2007 Enterprise edition","uid":4214435,"size":585253032,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:8b104fb026aa5a012230c4dbce00b0b158329632&amp;dn=Microsoft+Office+2007+Enterprise+edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Martin_CH","files":251,"time":1212256053,"description":"It&amp;#039;s been four years in development, but it looks like Microsoft&amp;#039;s Office developers have used their time well. Office 2007, in any of its eight editions, is quite a new broom and the almost-top-of-the-line Enterprise edition includes all five main applications - Word, Excel, PowerPoint, Outlook and Access - as well as some very useful extras.\n\nThe fundamental change in the new Office is the way you interact with the main programs: this is down to the Ribbon. Gone are the standard menu bar with toolbar beneath and instead you have a series of tabs, each showing panels of icons with the most commonly-used tools and functions on them. Switching between tabs gives new sets of icons and the Ribbon is bolstered by the mini toolbar, which fades in near your mouse pointer for making format changes.\n\nAfter a few minutes you start to get the idea of the Ribbon and for most functions it proves a lot quicker to use than the old interface. There are some idiosyncrasies, though. Why has the file menu become an Office button in the top left-hand corner of the screen and why is the default Ribbon tab labelled Home? These seem to be changes for change&amp;#039;s sake.\n\nOffice now uses the XML file format for consistency across all the main applications, though it still differentiates them with .docx, .xlsx and .pptx filetypes. Files are automatically compressed with Zip compression.\n\nWith all the work concentrated on the interface, the feature sets of the main applications haven&amp;#039;t changed as much. Word, Excel and PowerPoint all offer themes, like super styles, covering colours and design elements as well as typography. Switch themes and the look of the entire document changes.\n\nMany formatting and layout alterations you make in the big three apps can be previewed by hovering your mouse pointer over the style, font, colour or whatever selectors. New fonts are supplied with Office and widely used in Word, along with a new default line spacing of 1.15 lines. These give documents a modern, open feel.\n\nExcel looks a lot different in Office 2007, not just because of the Ribbon, but also because of improvements in its formatting options. It&amp;#039;s much easier to apply useful visual aids, such as row colour banding, and effects like percentage tints to colours. The charting module is much easier to use, too, and resulting charts have a more contemporary look.\n\nAs with Word and Excel, formatting is designed to be much simpler in PowerPoint. Great use is made of styles and themes to quickly change the look of one, many or all slides in a presentation and features like SmartArt make it very easy to create attractive lists, bullet points and business graphics. Imported photos can be given frames with drop-shadows or reflections.\n\nOutlook has had a partial overhaul, with the ribbon appearing in the e-mail editing pane but menus and toolbars appearing in the main program. Message editing is more comprehensive and there&amp;#039;s a new To Do mini-pane that enables you to display brief reminders of things in your calendar and messages that need replies. Outlook has a faster search, courtesy of Windows Desktop Search 3, and a more flexible calendar function.\n\nAccess isn&amp;#039;t available in all editions of Office 2007, but then it&amp;#039;s a specialist tool. The database module has been updated and uses the Ribbon, but in a rather half-hearted way, with a lot of blank space. It also discourages you from using Visual Basic for Applications to tailor Access databases, preferring the more secure - and less versatile - Access Macro Language. Wouldn&amp;#039;t it be better to tighten the security in VBA?\n\nOther applications included in the Enterprise Edition are Groove, InfoPath, OneNote and Publisher. Of these, Publisher has least in the way of operational improvements, though it&amp;#039;s now easier to incorporate templates and house styles into documents.\n\nGroove is a tool which lets remote groups of people work together and share common documents and resources. It&amp;#039;s the first incarnation of a product Microsoft bought a couple of years back and hasn&amp;#039;t yet been fully integrated into the Office fold, even cosmetically.\n\nInfoPath is the Office forms tool and enables you to create and complete forms either on paper or electronically. It now handles e-mail forms and can publish to a server, so they can be completed by anybody with a Web browser.\n\nOneNote, which started life as a Tablet PC tool, can be used on regular PCs too and is a versatile note-taking and management application. You can share notes across a network and include pictures and handwriting.\n","torrent":{"xt":"urn:btih:8b104fb026aa5a012230c4dbce00b0b158329632","amp;dn":"Microsoft+Office+2007+Enterprise+edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b104fb026aa5a012230c4dbce00b0b158329632","infoHashBuffer":{"type":"Buffer","data":[139,16,79,176,38,170,90,1,34,48,196,219,206,0,176,177,88,50,150,50]},"announce":[],"urlList":[]}}