{"title":"Tullycraft","uid":4074579,"size":383923827,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8b467a879fc7edb8f2de97259d9a6871b8ad0e6b&amp;dn=Tullycraft&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"synthpopper","files":82,"time":1205195207,"description":"Artist Description \n\nTullycraft was born out of the ashes of two harriet records cult bands: Crayon and Wimp Factor 14. Sean Tollefson, Jeff Fell (both of Crayon), and Gary Miklusek (Wimp Factor 14) hooked up in 1995.\nSoon after, they recorded a batch of songs with Pat Maley at YoYo Studios in olympia, wa. Out of that first session came the debut single on Harriet Records and an instant indie pop classic - &quot;Pop Songs Your New Boyfriend&amp;#039;s Too Stupid to Know About&quot;. In 1996 they released their full length debut &quot;Old Traditions, New Standards [album artist=Tullycraft][/album]&quot; on Harriet Records. They followed up their first album with singles on labels from Japan, England, Germany, and the USA. They then cemented their cult status by endless touring all over the United States, playing everywhere from house shows to universities, nightclubs to supermarket grand openings.\nAfter a couple guest appearances with the band, Chris Munford (Incredible Force of Junior) joined Tullycraft in 1998. Chris contributed keyboards, 2nd guitar and recording engineering to the 2nd full length album &quot;City of Subarus&quot; on cher doll records. The entire record was recorded at Chris and Jeff&amp;#039;s house across the street from a Subaru dealership. After City of Subarus, Tullycraft toured the U.S. one and a half more times and then took an extended break from playing live and recording. The time that followed saw the band mostly on hiatus - only playing festivals, Popfests, and the occasional YoYo-a-GoGo. Gary Miklusek (a founding member) left the band in 1999. At this point Tullycraft&amp;#039;s fate was up in the air.\nIn 2001 Jeff, Chris, and Sean started playing together again and soon began working on new songs.\n\n------------------------------------------\n\nAlbums:\n\n-- Disenchanted Hearts Unite\n\n-- Beat Surf Fun\n\n-- City Of Subarus\n\n-- Old Traditions, New Standards\n\n-- The Singles\n\n-- Every Scene Needs a Center\n\n\nHappy Listening\n\n/synthpopper","torrent":{"xt":"urn:btih:8b467a879fc7edb8f2de97259d9a6871b8ad0e6b","amp;dn":"Tullycraft","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b467a879fc7edb8f2de97259d9a6871b8ad0e6b","infoHashBuffer":{"type":"Buffer","data":[139,70,122,135,159,199,237,184,242,222,151,37,157,154,104,113,184,173,14,107]},"announce":[],"urlList":[]}}