{"title":"Radio dept Live Blekingska Nationen Lund 2008","uid":4235218,"size":81525255,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8b60b68769a0446758e23c9a24e831f6933f95a9&amp;dn=Radio+dept+Live+Blekingska+Nationen+Lund+2008&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"indieinside","files":15,"time":1213229850,"description":"There is a new album from Radio Dept which will be released in september on www.labrador.se. This is a pretty strange show, very organic. They played some of the new upcoming songs and some classic songs like 1995. \n\n256 KB/S MP3.\n\nwww.blekingska.se - the best nation !\n----------------------------------------------------------------------------------\nThe Radio Dept. was formed by Elin Almered and Johan Duncanson in 1995 who were in the school together in their early teenage. The name was taken from a gas station/radio repairer in Lund {Sweden} which had a large sign with the name Ã‚Â»RadioavdelningenÃ‚Â« {The Radio Department in Swedish...} hanging outside their shop. Just like today Elin and Johan hung out with people who, if they didn&amp;#039;t play music, were into photo, film, art and the likes. The Radio Deptartment was a suiting name as it became a department of it&amp;#039;s own among their friends&amp;#039; activities.\n\nSince 1995 members has been coming and going and at some points there has never really been a Radio Department at all. Martin Larsson and Johan Duncanson started playing together in 1998 and decided to use the name The Radio Dept. Since then the band has done lots of gigs and lots recordings. The Radio Dept. has recorded on 4-tracks in friends&amp;#039; living rooms or at home, in smelly wharehouse, in demo studios with blinking fluorecent lightning and at schools.\n\nIn the autumn of 2001 Lisa Carlberg, bass player and the love of Martin, and Per Blomgren, drums, joined the band and they started rehearsing in the way bands so often do. The latest recordings were sent to the music magazine Sonic and got a nice review. They were also on the free CD sampler that comes with the magazine. That&amp;#039;s where Labrador Records discovered and learned to love the band. Now they&amp;#039;re a part of Sweden&amp;#039;s finest indie label.\n\n\n-----------------------------------------------------------------------------------\nThe band was conceived in 1995 by schoolmates Elin Almered and Johan Duncanson, who named the group after a gas-station-turned-radio-repair-shop called &quot;Radioavdelningen&quot; (The Radio Department in Swedish). However, Almered and Duncanson soon stopped playing music together, putting the band on hiatus. The group was reborn three years later, in 1998, when Duncanson starting making music with Martin Larsson. In 2001, Larsson&amp;#039;s then girlfriend Lisa Carlberg joined the group on bass, followed by Per Blomgren on drums and Daniel Tjader on keyboards.[1][2]\n\nLater in 2001, the band sent recordings to music magazine Sonic, receiving a positive review and being featured on the free CD sampler that came with the magazine. Labrador Records heard them on the disc and signed them to their label. Per Blomgren left the group prior to the release of their album Lesser Matters and Lisa Carlberg departed after the release of This Past Week EP. According to their website, the band decided to use digital drum tracks and stated that for their second album they were &quot;taking a new direction ... which wouldn&amp;#039;t require a member that played bass guitar.&quot;[3]\n\nThe group enjoyed more widespread recognition after three tracks (&quot;Pulling Our Weight&quot; from the Pulling Our Weight EP, &quot;I Don&amp;#039;t Like It Like This&quot; from the This Past Week EP, and &quot;Keen on Boys&quot; from Lesser Matters) were included on the soundtrack for Sofia Coppola&amp;#039;s film Marie Antoinette.\n\nEarly 2006 saw the release of their second album Pet Grief. The distorted buzz that adorned most of their debut was now replaced by synthesizer. The album didn&amp;#039;t reach the rest of Europe, including the UK until later in 2006. Unfortunately, with little touring support there was no real buzz behind Pet Grief. Reviews were mixed. NME rated Pet Grief with a 7 out of 10, but other magazines were not quite so kind. However, Pet Grief did find popularity amongst a growing fan base throughout the world, thanks to the Internet. The album is available in the US through Darla and through their US distribution deal with Labrador.\n\nBy the end of 2006, a brand new track &quot;We Made the Team&quot; was released as the 100th release on the Labrador. It was also the final track on the Labrador&amp;#039;s labels Compilation of 100 tracks released at the beginning of 2007. Although all UK tour dates but one in London were recently canceled, the band is said to be working on a new album.[4]\n\n[edit] Sound\n\nThe Radio Dept. are related to such genres as Indie Pop, Shoegazer and Twee Pop, with reviews comparing them to Pet Shop Boys, My Bloody Valentine and the Cocteau Twins.[5]\n\nOn their website, they cite influences such as Charles Aznavour, Saint Etienne (band), Broadcast, Frank Sinatra, Joy Division, Pet Shop Boys, Chet Baker, Fennesz, Nick Drake, Kevin Rowland, Prefab Sprout, Paddy McAloon, Junior Boys, Orange Juice, Kraftwerk, Neu!, Jonathan Richman, The Avalanches and The Pale Fountains.[3]\n\n\n[edit] Accolades\n\nTheir album Lesser Matters was ranked No. 9 on NME&amp;#039;s list of the 50 Best Albums of 2004.[6] The album received an 84/100 (Universal acclaim) on Metacritic from a total of five reviews.[7]\n\n[edit] Discography\n\n[edit] Albums\n\n    * Lesser Matters, CD 2003, Labrador (LAB035); Shelflife (LIFE049)\n    * Pet Grief, CD 2006, Labrador (LAB095)\n\n[edit] EPs and singles\n\n    * Against the Tide 7&quot;, Slottet 2002\n    * Annie Laurie EP, Slottet 2002\n    * Liebling 7&quot;, Slottet 2002\n    * Where Damage Isn&amp;#039;t Already Done, CDEP, Labrador 2002 (LAB033)\n    * Pulling Our Weight, CDEP, Labrador 2003 (LAB058)\n    * Why Don&amp;#039;t You Talk About It?, CDEP, XL 2004 (REKD41CD)\n    * This Past Week, CDEP, Labrador 2005 (LAB068)\n    * The Worst Taste in Music, CDEP, Labrador 2006\n    * We Made the Team, MP3/Single, Labrador 2006 (DLAB0002)\n    * Freddie and the Trojan Horse, CDEP, Labrador 2008 (LAB111)\n\n[edit] Featured on\n\n    * Marie Antoinette Soundtrack, Verve Forecast 2006\n","torrent":{"xt":"urn:btih:8b60b68769a0446758e23c9a24e831f6933f95a9","amp;dn":"Radio+dept+Live+Blekingska+Nationen+Lund+2008","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b60b68769a0446758e23c9a24e831f6933f95a9","infoHashBuffer":{"type":"Buffer","data":[139,96,182,135,105,160,68,103,88,226,60,154,36,232,49,246,147,63,149,169]},"announce":[],"urlList":[]}}