{"title":"Coast to Coast AM Mar 10 2008 FiL-UK","uid":4078773,"size":55264385,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:8b92c16314703f66b46371516ee5bc26321c59ba&amp;dn=Coast+to+Coast+AM+Mar+10+2008+FiL-UK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"FiL-UK","files":6,"time":1205452362,"description":"Canadian UFO Sightings\nWriter and pilot Don Ledger discussed Canadian UFO sightings including the Shag Harbour Incident of 1967. In his book Maritime UFO Files, he documents 135 of the best UFO cases from the east coast of Canada dating as far back as 1796. The 1796 episode took place in Nova Scotia where three witnesses reported seeing 15 ships in a line traveling across the sky.\n\nIn the Bell Isle Incident which took place in Newfoundland in 1978, Ledger said that a flash of blue light hit a farm, burning through the electrical circuitry of the farm house. Whether it was caused by a UFO or some type of military weapons testing remained undetermined. The Shag Harbour Incident which took place in Nova Scotia, involved a craft crashing into the waters of the Harbour. Divers later described &quot;creatures&quot; moving between two oval-shaped objects underwater, he detailed.\n\nLedger spoke about his work with NARCAP (National Aviation Reporting Center for Anomalous Phenomena) and how pilots and air traffic controllers are often reluctant to go on record with what they&amp;#039;ve seen as it could hurt their careers. He also commented on the recent sightings in Stephenville, Texas-- he has an article on that subject in the current issue of FATE Magazine.","torrent":{"xt":"urn:btih:8b92c16314703f66b46371516ee5bc26321c59ba","amp;dn":"Coast+to+Coast+AM+Mar+10+2008+FiL-UK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8b92c16314703f66b46371516ee5bc26321c59ba","infoHashBuffer":{"type":"Buffer","data":[139,146,193,99,20,112,63,102,180,99,113,81,110,229,188,38,50,28,89,186]},"announce":[],"urlList":[]}}