{"title":"Richard Diamond OTR Set 2 Crime","uid":4128814,"size":508831638,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8ba6458699406dcbff8cb119692d9f32f788d503&amp;dn=Richard+Diamond+OTR+Set+2+Crime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"mrgreyer","files":19,"time":1207934061,"description":"I have a terrible slow upload rate, so please be patient and make sure to seed, if there is interest more will go up, but i will have to have a couple people with this one before i can stop it and get a second going.   Also my router overheats often, so if it stops dling please be patient, it should start going again shortly.\n\n\nAlso i messed up on part one, which is why i am starting with part 2 :P\n\n\n\n\n\n\n\\&quot;Richard Diamond\\&quot; was one of the all-time great private eye television shows from the late 1950\\&amp;#039;s. The series starred the raspy-voiced David Janssen as the title character driving around in his Ford convertibles trading innuendos with Sam, the female operator for the Hi-Fi Answering Service, via his car phone as he solves all manner of cases. Janssen is tough and sexy and one can only wonder if he and Sam ever connected in real time. Sam is only shown in profile from the shoulders down seated in front of a switch board, in tight fitting dresses, legs crossed and usually dangling a stiletto-heeled shoe from her toe as she delivers Richard\\&amp;#039;s messages in a breathy low husky voice. The show is fast, well acted, entertaining and shot in \\&quot;glorious\\&quot; black and white with a great jazz score. An original soundtrack album was released by Mercury records during the shows run on network television. It\\&amp;#039;s great fun and well worth a look.","torrent":{"xt":"urn:btih:8ba6458699406dcbff8cb119692d9f32f788d503","amp;dn":"Richard+Diamond+OTR+Set+2+Crime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8ba6458699406dcbff8cb119692d9f32f788d503","infoHashBuffer":{"type":"Buffer","data":[139,166,69,134,153,64,109,203,255,140,177,25,105,45,159,50,247,136,213,3]},"announce":[],"urlList":[]}}