{"title":"LeÃƒÂµes e Cordeiros (Lions for Lambs) 2008 DVDRip Dual Audio By B","uid":4093191,"size":1465159431,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:8be50eae84b149770724a1ce4ab6ac5f6f472a01&amp;dn=Le%C3%83%C2%B5es+e+Cordeiros+%28Lions+for+Lambs%29+2008+DVDRip+Dual+Audio+By+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"bozano","files":3,"time":1206177212,"description":"O senador Jasper Irving (Tom Cruise) pretende lancar sua nova &quot;estrategia completa&quot; para a guerra dos Estados Unidos no Afeganistao e, para divulga-la, precisa convencer a jornalista Janine Roth (Meryl Streep). Simultaneamente o dr. Stephen Malley (Robert Redford), um professor idealista, tenta convencer Todd (Andrew Garfield), um de seus alunos mais promissores, a mudar o curso de sua vida. Ao mesmo tempo Ernest (Michael Pena) e Arian (Derek Luke) sao soldados que estÃƒÂ£o lutando nas montanhas geladas do Afeganistao, buscando se lembrar do porque de terem se alistado no exercito americano.\n\n\nLions for Lambs begins after two determined students at a West Coast University, Arian and Ernest, follow the inspiration of their idealistic professor, Dr. Malley, and attempt to do something important with their lives. But when the two make the bold decision to join the battle in Afghanistan, Malley is both moved and distraught. Now, as Arian and Ernest fight for survival in the field, they become the string that binds together two disparate stories on opposite sides of America. In California, an anguished Dr. Malley attempts to reach a privileged but disaffected student who is the very opposite of Arian and Ernest. Meanwhile, in Washington D.C. the charismatic Presidential hopeful, Senator Jasper Irving, is about to give a bombshell story to a probing TV journalist that may affect Arian and Ernest&amp;#039;s fates.\n\n\nEnjoy...:)","torrent":{"xt":"urn:btih:8be50eae84b149770724a1ce4ab6ac5f6f472a01","amp;dn":"Le%C3%83%C2%B5es+e+Cordeiros+%28Lions+for+Lambs%29+2008+DVDRip+Dual+Audio+By+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8be50eae84b149770724a1ce4ab6ac5f6f472a01","infoHashBuffer":{"type":"Buffer","data":[139,229,14,174,132,177,73,119,7,36,161,206,74,182,172,95,111,71,42,1]},"announce":[],"urlList":[]}}