{"title":"Anthrax - Spreading The Disease (1985) [EAC-FLAC]","uid":4197191,"size":307700994,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:8c0f158dd83c629e98916d12004ec7488b8c4978&amp;dn=Anthrax+-+Spreading+The+Disease+%281985%29+%5BEAC-FLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sworduigi","files":6,"time":1211297183,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD\nArtwork: Front, Back, Inside and CD (Web Found).\n\nGeneral Info:\n\nTracklist:\n   1. &quot;A.I.R.&quot; (Joey Belladonna, Dan Spitz, Scott Ian, Frank Bello, Charlie Benante) ? 5:45\n   2. &quot;Lone Justice&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 4:36\n   3. &quot;Madhouse&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 4:19\n   4. &quot;S.S.C./Stand or Fall&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 4:08\n   5. &quot;The Enemy&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 5:25\n   6. &quot;Aftershock&quot; (Belladonna, Spitz, Ian, Bello, Benante) ? 4:28\n   7. &quot;Armed and Dangerous&quot; (Neil Turbin) ? 5:43\n   8. &quot;Medusa&quot; (Johny Zazula) ? 4:44\n   9. &quot;Gung-Ho&quot; (Turbin) ? 4:34\n\n\n              LINE UP:\n    * Joey Belladonna ? Vocals\n    * Dan Spitz ? Lead Guitar\n    * Scott Ian ? Rhythm Guitar\n    * Frank Bello ? Bass Guitar\n    * Charlie Benante ? Drums\n\n\nReview taken from sputnikmusic.com:\n It seems as though New York thrashers and Big Four member Anthrax always gets over shadowed by their contemporaries. Metallica was, well, Metallica. Slayer had the evil image and their mind shockingly fast thrash assault. Megadeth had their crushing, technical guitar riffs. Today I always hear those three bands mentioned as the essential groups of the genre. But what about Anthrax? After all, they had something the other three bands didn&amp;#039;t have. They had Joey Belladonna. As opposed to having a singer/guitarist or singer/bassist like Megadeth, Slayer, and Metallica did, they had a fulltime vocalist, which helps in a big way. How, you ask? Well I&amp;#039;ll get into that in a bit. 1985 was the year Anthrax released their second full length offering, Spreading the Disease. And as while perhaps it isn&amp;#039;t as great a record as Peace Sells or Ride the Lightning, it is still an excellent album.\nMuch like their cross country genre-mates, Anthrax plays a standard thrash metal song. This is of course is why they&amp;#039;re part of the Big Four, no questions asked. The lead/rhythm guitar tandem of Scott Ian and Dan Spitz is incredibly tight. Any song on the album can show you that. The pair&amp;#039;s performance is superb, and helps define the album&amp;#039;s sound. Each song contains several pedal to the metal riffs which do not cease to amaze me. As any excellent thrash metal record does, they contain excesses of energy and aggression. One of the band&amp;#039;s more popular songs, Madhouse is an excellent example of the attitudes of Anthrax, and the effort they put into their music. The excellent musicianship that is present in the recording is also very evident, as Anthrax does not have a member that is significantly weaker than another. Fans will definitely get their money&amp;#039;s worth in this area.\nYep, I promised to go more into the situation regarding vocalist Joey Belladonna earlier, so now I will. As I said, Anthrax was improved by the fact that each member had only one job to do on stage. Scott Ian only has to play rhythm guitar, as does Dan Spitz. Joey Belladonna only has to worry about singing. As a result, everyone performs his role as good as he ever will. In Joey&amp;#039;s case, not only Anthrax wins, but so do the fans. By far the greatest singer of the Big Four, Joey sings in a falsetto, a technique usually identified as a trait of power metal. Though his voice lacks the grittiness and aggression of the Mustaines, the Hetfields, and the Arayas of the world, it still fits the music very well. Belladonna&amp;#039;s voice is exceptionally well done in the likes of Madhouse and The Enemy, where often times it serves as another instrument in the mix. At times he reminds me of both Bruce Dickinson and Rob Halford, without sounding like a direct rip off. Though some thrash purists may be put off by Joey&amp;#039;s singing, I like it, quite a bit. They&amp;#039;re very polished, and though they are not as rough as some of the other thrash bands they are very effective.\nAside from their talented vocalist, Anthrax also edged out competitors with a very important element in the music. This of course being production. Spreading the Disease has a very, very nice sound. Especially noticeable between Anthrax and other thrash bands is the quality of sound on the vocals. As much as I like Megadeth and Metallica, their earliest albums had terrible outings from their singers. Spreading the Disease does not have this problem. Belladonna does not have that annoying buzz on his vocals, nor does his performance sometimes mix into the music. The clear sound is definitely a plus on an already great album, and helps give a positive first impression.\nAlong with Among the Living, 1985&amp;#039;s Spreading the Disease is one of the band&amp;#039;s essential albums. Containing several of thrash&amp;#039;s greatest moments, it creates a likeable atmosphere that will impress even the toughest of fans. Songs like Armed and Dangerous, S.S.C. / Stand or Fall, and A.I.R., showcase excellent musicianship and excellent riffs. The high flying screams and wails of Joey Belladonna are also worth hearing. Despite not always being the first to come to mind when one thinks of the Big Four of Thrash Metal, Spreading the Disease is definitely a good record to look into for fans of the genre. It&amp;#039;s also pretty (read, really) cheap, so pick it up if you get the chance.","torrent":{"xt":"urn:btih:8c0f158dd83c629e98916d12004ec7488b8c4978","amp;dn":"Anthrax+-+Spreading+The+Disease+%281985%29+%5BEAC-FLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c0f158dd83c629e98916d12004ec7488b8c4978","infoHashBuffer":{"type":"Buffer","data":[140,15,21,141,216,60,98,158,152,145,109,18,0,78,199,72,139,140,73,120]},"announce":[],"urlList":[]}}