{"title":"Doctor Who - BF106 - The Dark Husband - iPod Audiobook","uid":4097850,"size":115574070,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:8c46cb0e67abafc177719994a6e0b39a9f7f9b30&amp;dn=Doctor+Who+-+BF106+-+The+Dark+Husband+-+iPod+Audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TheDoctor05","files":7,"time":1206411767,"description":"Doctor Who - BF106 - The Dark Husband - iPod Audiobook\n\nStarring Sylvester McCoy and Sophie Aldred \nwith Philip Olivier as Hex\nFeaturing Danny Webb as Ori\n\n(Duration: 120&amp;#039; Approx)\n\nCAST: \n\nSylvester McCoy (The Doctor); Sophie Aldred (Ace); Philip Olivier (Hex); Danny Webb (Ori); Andy B Newb (Irit); Benny Dawb (Tuin); Katarina Olsson &amp; Sean Connolly (The Bards)\n\nSYNOPSIS:\n\nA new adventure in time and space for the Seventh Doctor and his companions Ace and Hex.\n\n&quot;This whole wedding is like making a nuclear bomb with half the instructions missing!&quot;\n\nA week-long respite from a prolonged and bloody war, the Festival of the Twin Moons of Tuin makes Glastonbury look like a church fete... or so the brochure says. The Doctor and Ace are looking for rest and recreation. Hex is looking for the beer tent. But eternal enemies the ginger-haired Ri and the coot-bald Ir are plotting to turn their Festival truce to their own advantage. Only the Dark Husband might stop the celebrations turning to horror... but who is the Dark Husband? And what terror awaits him on his wedding night?\n\nIf anyone knows any just cause or impediment... speak now. The lives of billions depend on it. \nAUTHOR:  David Quantick\n DIRECTOR:\n Nicholas Briggs\n \nSOUND DESIGN:\n Steve Foxon\n MUSIC:\n Steve Foxon\n \nCOVER ART:\n Grant Kempster\n NUMBER OF DISCS:\n 2 CDs\n \nRECORDED DATE:\n 18 &amp; 21 December 2007\n RELEASE DATE:\n 31 March 2008\n \nPRODUCTION CODE:\n 7W/G  ISBN:\n 978-1-84435-315-6  \n\nCHRONOLOGICAL PLACEMENT:\n\nThis story takes place after the television adventure, Survival and after the Big Finish audio adventure, Nocturne.\n\n\n--------------\n\nThis story also includes a letter to Nick Briggs, kindly forward it to him via E-Mail;\n\nLetter to Nick Briggs, Big Finish Productions\n\nMarch 24th 2008\n\nDear Nick,  \n\nWhile listening to the Big Finish Podcast 07 dated 03-24-2008, I\nfound it quite interesting to listen to you read a &quot;letter&quot; from a \n&quot;listener&quot; whom was supposedly &quot;concerned&quot; about &quot;piracy&quot; on the Internet.\n\nHere&amp;#039;s a group of questions for your next podcast.  \n\nDid you not in fact violate and ignore the copyrights of BBC&amp;#039;s Doctor Who \nwhen you produced the &quot;Audio Visuals&quot; series of audios?  Didn&amp;#039;t you in \nfact play The Doctor himself in the original 1989 release of Cuddlesome, \nrecently redone and re-released by Big Finish?   \n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Nicholas_Briggs&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Nicholas_Briggs&lt;/a&gt;\n\nWould you consider your current success, and even the immortally famous\nrole of providing the voices of the Daleks in todays incarnations of Who, \nto be directly contributed to your past?   \n\nCan you go into more detail about what you really think about file \nsharing?    While it is obvious that Big Finish has realized that people \nno longer collect archaic media formats (such as disks), and started to \nprovide downloads, is there any true harm in people sharing them on the \nInternet?   (Note, I say &quot;share&quot; not &quot;pirate&quot;)  \n\nThe lady from whom&amp;#039;s E-Mail you quoted stated that she was concerned about\n&quot;pirates&quot; (more aptly put, sharers) in some obscure way denegrating or reducing\nthe future availabily of &quot;quality&quot; Doctor Who audio adventures.   Now granted, \nthis lady did not have access to your bank rolls to see how much money you are\nmaking, but.....   Can you address all of the rest of us out here?  Those of us \nthat buy everything you produce?   Those of us that can not afford them, but still\nmust collect and listen, and watch, as fans of the best sci-fi saga in history? \n\nDoes file sharing in fact pose any threat to the future of Big Finish&amp;#039;s Doctor \nProductions?    Or does it in fact help spread your popularity (as I suspect)\nin the same manner as your unauthorized productions? \n\nAnd finally, do you have any plans on coming up to speed and officially \noffering iPod formats?\n\nThe Doctor 05","torrent":{"xt":"urn:btih:8c46cb0e67abafc177719994a6e0b39a9f7f9b30","amp;dn":"Doctor+Who+-+BF106+-+The+Dark+Husband+-+iPod+Audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8c46cb0e67abafc177719994a6e0b39a9f7f9b30","infoHashBuffer":{"type":"Buffer","data":[140,70,203,14,103,171,175,193,119,113,153,148,166,224,179,154,159,127,155,48]},"announce":[],"urlList":[]}}