{"title":"ZORRO 224-226 Joe Crane stories [retr?tv]","uid":4237114,"size":766954835,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:8dfa2569ac181d646d0a1928ea57e1338e266463&amp;dn=ZORRO+224-226+Joe+Crane+stories+%5Bretr%3Ftv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flixer","files":4,"time":1213353937,"description":"ZORRO (1957) starring Guy Williams (Don Diego de la Vega / El Zorro), Gene Sheldon (Bernardo), Henry Calvin (Sgt. Garcia), George J. Lewis (Don Alejandro de la Vega)\nGuest star: Jeff York (Joe Crane), Jonathan Harris (Don Carlos), Jean Willes (Carlotta), Paul Richards (Hernando)\n\n2x24. Zorro and the Mountain Man   3/19/1959 \nWhen a jovial mountain man, Joe Crane, arrives in the pueblo, he is threatened with arrest for traveling in Spanish territory without official permission. When he kisses a passing barmaid, he angers Don Carlos Fernandez so greatly that the landowner attacks the visitor and forces Garcia to arrest him. Zorro frees Crane and allows him to escape into the hills.\n\n2x25. The Hound of the Sierras    3/26/1959 \nThought to be hiding safely in the hills, fugitive Joe Crane instead has sneaked back into the pueblo hoping to recover his hunting rifle and the load of furs he gathered during the trapping season. He also wants to see Carlotta, the barmaid who accidentally started the fight between him and Don Carlos Fernandez. Determined to kill Crane, Fernandez and his servant Hernando are using a bloodhound named Lobo to track down the mountain man.\n\n2x26. Manhunt    4/2/1959 \nDon Carlos Fernandez decides to draw Joe Crane into the open by laying claim to the mountain man&amp;#039;s furs and burro. Diego tries to end the feud by offering to buy the goods, but Fernandez refuses. Only Crane&amp;#039;s death will satisfy him now. When Crane hears that Fernandez has his furs, he reacts predictably and goes to the man&amp;#039;s hacienda to fight for his possessions.\n\nProduction Notes: Guy Williams and Jonathan Harris later co-starred in the television series Lost in Space. Williams played Professor John Robinson, leader of a doomed space expedition, and Harris was cast as Dr. Zachary Smith, an evil scientist who sent the spacecraft careening through space.  Jeff York originated the part of &quot;Joe Crane&quot; in the Saga of Andy Burnett mini-series.\n\nTV&gt;XviD/352x256/1.2Mbps/23.97fps\nmp3/62Mbps/44KHz/Stereo/25min\n\nLeave a comment if you&amp;#039;d like to see more!","torrent":{"xt":"urn:btih:8dfa2569ac181d646d0a1928ea57e1338e266463","amp;dn":"ZORRO+224-226+Joe+Crane+stories+%5Bretr%3Ftv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8dfa2569ac181d646d0a1928ea57e1338e266463","infoHashBuffer":{"type":"Buffer","data":[141,250,37,105,172,24,29,100,109,10,25,40,234,87,225,51,142,38,100,99]},"announce":[],"urlList":[]}}