{"title":"Lux Occulta (1996) - Forever Alone, Immortal (V0) *Polish BM*","uid":4211024,"size":110639195,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:8e42a773b11de187177f36bd6c4075f9f27cf6ec&amp;dn=Lux+Occulta+%281996%29+-+Forever+Alone%2C+Immortal+%28V0%29+%2APolish+BM%2A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"VoltaXebec1968","files":10,"time":1212072787,"description":"Polish Black Metal\n\n2002 remaster\n\n1.\tThe Kingdom Is Mine (I Saw The Beginning)\t06:49\t\n2.\tHomodeus (Throne Of Fire)\t11:39\t\n3.\tSweetest Stench Of The Dead (The Battlefield)\t11:53\t\n4.\tThe Third Eye (Illuminatio)\t09:37\t\n5.\tApokathastasis (Out Of Chaos)\t07:26\t\n6.\tBitter Taste Of Victory\t08:43\t\n7. Burn 05:11\nTotal playing time\t61:23\n\nReview from chroniclesofchaos.com by: Pedro Azevedo (9 out of 10)\n\nFirst thing that caught my attention was the brilliant cover layout: the band&amp;#039;s name (&quot;lux&quot; meaning light), the album title, and the way the picture itself fit the rest. And, as a matter of fact, so does the music... fit the rest, I mean. If I had to describe this album (er, actually, I do have to describe it) I&amp;#039;d precisely use the name Lux Occulta and the title _Forver Alone. Immortal._. Throughout the 55 minutes of this very well-produced album, Lux Occulta show an impressive array of creativity, songwriting skills, and musicianship. All this mixed with the interesting look I already mentioned makes one hell of an album. Lux Occulta are essentially a melodic black metal band, showing some classical music influences and often using a very doomy atmosphere (hence the appropriate title). About the classical influences, well, this six-piece band knows how to use their keyboards for diversity, and they sometimes include an acoustic guitar, a flute (which is once used during a fast black metal part - which are always melodic and well played - besides some other flute solos) and a cello (which performs particularly well in the excellent third track). These instruments, as well as all the keyboard orchestral effects, blend in extremely well, giving an overall feel that, again, fits the title. But what would this be without the talent? Besides being great musicians in what concerns playing (tight guitars and bass, technical and powerful drumming, well used keyboards), they also come up with constantly remarkable melodies (the classical influences I mentioned being important here) that team up with the good black metal and doom parts to create a great album. I must mention the third track, the one with lots of cello, which is great, as well as the last one (the sixth), which is probably the doomiest: the vocals in that track are like a combination of a regular black metal voice with Aaron&amp;#039;s (My Dying Bride) weeping voice, and the song is the very essence of the album&amp;#039;s title (there I go again). So this was undoubtedly the album which surprised me the most in 1996, and one I won&amp;#039;t hesitate in recommending to any metal fan. &quot;The awakening has begun...&quot; (article submitted 16/3/1997)","torrent":{"xt":"urn:btih:8e42a773b11de187177f36bd6c4075f9f27cf6ec","amp;dn":"Lux+Occulta+%281996%29+-+Forever+Alone%2C+Immortal+%28V0%29+%2APolish+BM%2A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8e42a773b11de187177f36bd6c4075f9f27cf6ec","infoHashBuffer":{"type":"Buffer","data":[142,66,167,115,177,29,225,135,23,127,54,189,108,64,117,249,242,124,246,236]},"announce":[],"urlList":[]}}