{"title":"MARX BOTHERS 1929 - 1935 .iso","uid":4179020,"size":3258032128,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:8f98cd96f57d27fe941ebc75a28a5a4f1c81e2fd&amp;dn=MARX+BOTHERS+1929+-+1935+.iso&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"choempi","files":1,"time":1210296992,"description":"1929 - 1935 marx brothers. all custom avi. and excellent quality, iso.\n\n\n\nThe Cocoanuts (1929)\nadvertisement  photos   board   trailer   details  \n\nRegister or login to rate this title User Rating: 6.9/10 (1,724 votes) \nmore Photos (see all 16 | slideshow)  \n           \n\n--------------------------------------------------------------------------------\n\nOverview\nDirectors:Robert Florey\nJoseph Santley\n\nWriters:George S. Kaufman (play)\nMorrie Ryskind (adaptation)\n\nRelease Date:3 August 1929 (USA) more \nGenre:Comedy | Musical more \nTagline:Paramount&amp;#039;s All Talking-Singing Musical Comedy Hit! more \nPlot:During the Florida land boom, the Marx brothers run a hotel, auction off some land, thwart a jewel robbery, and generally act like themselves. full summary | add synopsis \nPlot Keywords:Beach | Florida | Hotel | Jewel Theft | Marx Brothers more \nUser Comments:I liked it. It was nice. more \n\n--------------------------------------------------------------------------------\n\nCast (Complete credited cast)\n Zeppo Marx ...  Jamison \n\n Groucho Marx ...  Hammer \n\n Harpo Marx ...  Harpo \n\n Chico Marx ...  Chico \n Oscar Shaw ...  Bob Adams \n Mary Eaton ...  Polly Potter \n Cyril Ring ...  Harvey Yates \n\n Kay Francis ...  Penelope \n Margaret Dumont ...  Mrs. Potter \n Basil Ruysdael ...  Detective Hennessey \n Gamby-Hale Ballet Girls ...  Themselves (as Gamby-Hale Girls) \n Allan K. Foster Girls ...  Themselves \nmore\nCreate a character page for: JamisonHarpoChicoBob AdamsPolly PotterHarvey YatesPenelopeMrs. PotterDetective Hennessey-----------more...  \n\n--------------------------------------------------------------------------------\n\nAdditional Details\nParents Guide:Add content advisory for parents \nRuntime:96 min | USA:140 min (preview) \nCountry:USA \nLanguage:English \nColor:Black and White \nAspect Ratio:1.20 : 1 more \nSound Mix:Mono (Western Electric System) \nCertification:USA:Approved (certificate not issued at release) | UK:U | Finland:K-8 | USA:Passed \nFilming Locations:Kaufman Astoria Studios - 3412 36th Street, Astoria, Queens, New York City, New York, USA more \nMOVIEmeter:  16% since last week why? \nCompany:Paramount Pictures more \n\n--------------------------------------------------------------------------------\n\nFun Stuff\nTrivia:During the day, the Marx Brothers worked on this movie. At night, they were starring in &quot;Animal Crackers&quot; on the stage. more \nQuotes:Hammer: Believe me, you gotta get up early if you want to get out of bed. more \nMovie Connections:Referenced in Chacun son cinÃƒÂ©ma ou Ce petit coup au coeur quand la lumiÃƒÂ¨re s&amp;#039;ÃƒÂ©teint et que le film commence (2007) more \nSoundtrack:BALLET MUSIC more \n\n--------------------------------------------------------------------------------\n\nFAQ\nThis FAQ is empty. Add the first question. \n--------------------------------------------------------------------------------\n\nUser Comments   (Comment on this title) \n12 out of 12 people found the following comment useful:- \nI liked it. It was nice., 6 December 1999\n\n\nAuthor: Jon Brian Waugh (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;ef988e9a8887af9c9b8e8189809d8bc18a8b9a&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) from Stanford, CA \n\nThe Marx Brothers first motion picture and Paramount&amp;#039;s first &quot;all talking, all singing, all dancing&quot; musical will delight fans of the Marx Brothers, musicals and early cinema alike. While dated and somewhat stagey, after all it *was* basically a filmed version of their hit Broadway show, it holds up better than many films of its day. Kaufman and Ryskind, who also wrote the stage show, wrote the screenplay with an eye to making the Marx Brothers wit appear spontaneous and natural. I remember how shocked I was when I first realized the boys were using a script!\n\nThe movie is laced with classics of Marxian comedy. The famous &quot;Why a duck?&quot; scene with Groucho and Chico (remember - it&amp;#039;s pronounced Chick-o, not Cheek-o, because he was such a womanizer), Groucho answering the telephone at the hotel&amp;#039;s front desk (Ice water? Ice water? Peel some onions. That&amp;#039;ll make your eyes water.) and Harpo shaking hands with the house detective while all of the hotel silverware falls out of his coat pockets.\n\nMargaret Dumont is priceless as the clueless matron. She claimed in later years it wasn&amp;#039;t an act; she really had no idea what the brothers were doing. Regardless, she is the ideal foil for the boys as they tear into &quot;polite&quot; society.\n\nTake a look at The Cocoanuts. You&amp;#039;ll see the wellspring from which all that Marx madness flows.\n\n\n\n\n\n\n\nAnimal Crackers (1930)\nadvertisement  photos   board   trailer   details  \n\nRegister or login to rate this title User Rating: 7.6/10 (4,087 votes) \nmore Photos (see all 24 | slideshow)  \n           \n\n--------------------------------------------------------------------------------\n\nOverview\nDirector:Victor Heerman\n\nWriters:George S. Kaufman (play) &amp;\nMorrie Ryskind (play) ...\nmore \nRelease Date:28 August 1930 (USA) more \nGenre:Comedy | Musical more \nTagline:The maddest comics of them all! \nPlot:Mayhem and zaniness ensue when a valuable painting goes missing during a party in honor of famed African explorer Captain Spaulding. full summary | add synopsis \nPlot Keywords:Art Theft | Marx Brothers | Party | Painting | Artist more \nUser Comments:Hooray for Captain Spaulding! more \n\n--------------------------------------------------------------------------------\n\nCast (Complete credited cast)\n\n Groucho Marx ...  Captain Jeffrey T. Spaulding \n\n Harpo Marx ...  The Professor \n\n Chico Marx ...  Signor Emanuel Ravelli \n Zeppo Marx ...  Horatio Jamison \n Lillian Roth ...  Arabella Rittenhouse \n Margaret Dumont ...  Mrs. Rittenhouse \n Louis Sorin ...  Roscoe W. Chandler \n Hal Thompson ...  John Parker \n Margaret Irving ...  Mrs. Whitehead \n Kathryn Reece ...  Grace Carpenter \n Robert Greig ...  Hives, the Butler \n Edward Metcalf ...  Inspector Hennessy \nmore\nCreate a character page for: Arabella RittenhouseRoscoe W. ChandlerJohn ParkerGrace CarpenterHives, the ButlerInspector Hennessy-----------more...  \n\n--------------------------------------------------------------------------------\n\nAdditional Details\nParents Guide:Add content advisory for parents \nRuntime:97 min | Argentina:98 min \nCountry:USA \nLanguage:English \nColor:Black and White \nAspect Ratio:1.20 : 1 more \nSound Mix:Mono \nCertification:Portugal:M/6 | Argentina:Atp | South Korea:All | Spain:T | Australia:G | Germany:o.Al. | UK:U | USA:G (1974 re-release) \nFilming Locations:Paramount Studios - 5555 Melrose Ave., Hollywood, Los Angeles, California, USA \nMOVIEmeter:  1% since last week why? \nCompany:Paramount Pictures more \n\n--------------------------------------------------------------------------------\n\nFun Stuff\nTrivia:Several of Groucho Marx&amp;#039; lines were cut on demand of the Hays office, including &quot;I think I&amp;#039;ll try to make her&quot;. more \nGoofs:Continuity: In the final scene of the movie, just as Harpo is about to drop all the cutlery from his sleeve, the camera cuts to a close up of Chico. For an instant his hat is pulled down very low, covering his eyes. However, in the scenes before and immediately after, his hat rests normally on his head. more \nQuotes:Capt. Spaulding: I was outside the cabin smoking some meat. There wasn&amp;#039;t a cigar store in the neighborhood! more \nMovie Connections:Featured in The Unknown Marx Brothers (1993) (TV) more \nSoundtrack:Silver Threads Among the Gold more \n\n--------------------------------------------------------------------------------\n\nFAQ\nThis FAQ is empty. Add the first question. \n--------------------------------------------------------------------------------\n\nUser Comments   (Comment on this title) \n16 out of 17 people found the following comment useful:- \nHooray for Captain Spaulding!, 12 August 2002\n\n\nAuthor: George Litman from Marietta, OH USA \n\nIs it a surprise that &quot;Animal Crackers&quot; takes a simple plot and turns it on its ear in a matter of minutes as a launching pad for the insanity of the Marx Brothers? \n\nNo, but it makes sense.\n\nThe characters in &quot;Animal Crackers&quot; celebrate the return of world traveler Captain Spaulding (Groucho) while also dealing with the theft of a rare work of art at the home of the wealthy Mrs. Rittenhouse (Dumont), where the soiree takes place. But once the good captain arrives, along with Spaulding&amp;#039;s stenographer Jamison (Zeppo), Signore Ravelli (Chico) and the Professor (Harpo), nothing sane or expected takes place afterwards. But really, what did you expect?\n\nPerfect foils are the likes of Dumont and art patron Mr. Chandler (Sorin), the latter of which is revealed to be Abie the Fish Peddler from Czechoslovakia by fellow Czech Chico. in fact, here&amp;#039;s a FAVORITE LINE: Chandler - (to Chico) &quot;Hey! How did you get to be Italian?&quot; Chico - &quot;Never you a-mind; who&amp;#039;s-a confession is-a this?&quot;. What&amp;#039;s not to love?\n\nAnyway, there&amp;#039;s loads of quotable dialogue, sight gags galore, a great running gag with a picture of a horse and a finale that must be seen to be believed. Of course, this whole MOVIE must be seen to be believed!\n\nTen stars and a pair of elephant pajamas for &quot;Animal Crackers&quot; - the perfect side dish for four hams.\n\nTIDBIT - The song &quot;Hooray for Captain Spaulding&quot; was later re-used by Groucho for his game show &quot;You Bet Your Life&quot;. Can&amp;#039;t say that I blame him. \n\n\n\n\nMonkey Business (1931)\nadvertisement  photos   board   trailer   details  \n\nRegister or login to rate this title User Rating: 7.6/10 (3,318 votes) \nmore Photos (see all 15 | slideshow)  \n           \n\n--------------------------------------------------------------------------------\n\nOverview\nDirector:Norman Z. McLeod\n\nWriters:S.J. Perelman (screenplay) and\nWill B. Johnstone (screenplay) ...\nmore \nRelease Date:19 September 1931 (USA) more \nGenre:Comedy more \nPlot:On a transatlantic crossing, the Marx brothers get up to their usual antics and manage to annoy just about everyone on board the ship. full summary | add synopsis \nPlot Keywords:Beautiful Woman | Marx Brothers | Barn | Kidnapping | Party more \nUser Comments:The Original Ship of Fools more \n\n--------------------------------------------------------------------------------\n\nCast (Complete credited cast)\n\n Groucho Marx ...  Groucho \n\n Harpo Marx ...  Harpo \n\n Chico Marx ...  Chico \n Zeppo Marx ...  Zeppo \n Rockliffe Fellowes ...  J.J. &amp;#039;Big Joe&amp;#039; Helton \n Harry Woods ...  Alky Briggs \n Thelma Todd ...  Lucille Briggs \n Ruth Hall ...  Mary Helton \n Tom Kennedy ...  First Mate Gibson \nmore\nCreate a character page for: GrouchoHarpoChicoZeppoJ.J. &amp;#039;Big Joe&amp;#039; HeltonAlky BriggsLucille BriggsMary HeltonFirst Mate Gibson-----------more...  \n\n--------------------------------------------------------------------------------\n\nAdditional Details\nParents Guide:View content advisory for parents \nRuntime:77 min \nCountry:USA \nLanguage:English \nColor:Black and White \nAspect Ratio:1.20 : 1 more \nSound Mix:Mono (Western Electric Noiseless Recording) \nCertification:Spain:T | Finland:S (1976) | USA:Unrated | USA:Approved (re-release) \nFilming Locations:Paramount Studios - 5555 Melrose Ave., Hollywood, Los Angeles, California, USA \nMOVIEmeter:  4% since last week why? \nCompany:Paramount Pictures more \n\n--------------------------------------------------------------------------------\n\nFun Stuff\nTrivia:Except in the credits, the Brothers&amp;#039; characters have no names in this movie. They are referred to only as &quot;the stowaways&quot;. more \nGoofs:Continuity: During the Passport scene, when the brothers try to get off the boat by impersonating Maurice Chevalier, neither Zeppo (the first brother to try) nor Groucho (the third to try), get Chevaliers passport back from the officer in charge, yet Chico and Harpo each have it as they approach the front of the line. more \nQuotes:Groucho: Oh no, you&amp;#039;re not gonna get me off this bed. \nLucille: I didn&amp;#039;t know you were a lawyer. You&amp;#039;re awfully shy for a lawyer. \nGroucho: You bet I&amp;#039;m shy. I&amp;#039;m a shyster lawyer.\nmore \nMovie Connections:Featured in The Pervert&amp;#039;s Guide to Cinema (2006) more \nSoundtrack:Sweet Adeline more \n\n--------------------------------------------------------------------------------\n\nFAQ\nThis FAQ is empty. Add the first question. \n--------------------------------------------------------------------------------\n\nUser Comments   (Comment on this title) \n11 out of 11 people found the following comment useful:- \nThe Original Ship of Fools, 9 January 2004\n\nAuthor: lugonian from Kissimmee, Florida \n\nMONKEY BUSINESS (Paramount, 1931), directed by Norman McLeod, and written by S.J. Perelman, presents those four zany Marx Brothers in their third feature comedy. Following their previous efforts in THE COCOANUTS (1929) and ANIMAL CRACKERS (1930), each based on their 1920s stage works which were both filmed at Paramount&amp;#039;s Astoria studios in Long Island, NY, MONKEY BUSINESS, produced in Hollywood, became the team&amp;#039;s first original comedy and one of their most funnier outings. While no relation to the 20th Century-Fox 1952 comedy starring Cary Grant and Ginger Rogers, except in title only, and having nothing to do with monkeys, this presentation does get right down to business, however, when comedy is concerned.\n\nHere Groucho, Harpo, Chico and Zeppo play four stowaways aboard ship bound for the states who, after being discovered hiding in barrels and singing &quot;Sweet Adeline,&quot; they are pursued by First Officer Gibson (Tom Kennedy) and his crew, which finds the foursome running wild all over the ship, eluding authorities and driving practically everybody out of their minds. Eventually the four stowaways separate, with Chico and Harpo disguising themselves as barbers; Groucho posing as the captain and invade the sanctity of the captain&amp;#039;s quarters where he and Chico makes themselves at home by eating his meals; Harpo later chasing the young ladies as well as entertaining the little children during a puppet show while at the same time making a fool out of Gibson. Harpo even finds time to make friends with a frog, which he keeps under his hat. As for Zeppo, in between being chased, he finds time to escort a young lady named Mary (Ruth Hall) around the deck. Afterwards, they all encounter rival gangsters, such as Alkie Briggs (Harry Woods), who finds Groucho flirting with his wife, Lucille (Thelma Todd). Briggs, however, takes a liking to Groucho for proving his bravery by standing up to him, and offers him a job, along with Zeppo, as his personal bodyguards, while Chico and Harpo encounter another noted hood, Joe Helton (Rockcliffe Fellows), Mary&amp;#039;s father and Zeppo&amp;#039;s new love interest, and become his bodyguards as well. After the ship docks New York, the Marx Brothers find they must get past custom officials in order to get off, so after obtaining the passport belonging to the popular French entertainer, Maurice Chevalier (who does not appear), they pass themselves off as Chevalier by singing one of his current hit songs, &quot;You Brought a New Kind of Love to Me,&quot; but to no avail. How the silent Harpo gets by with this must be seen to be believed. While the story is not set entirely on board ship, the final 25 minutes or so shifts over to a swank party given by Kelton to introduce his daughter, Mary, to high society. The Marx Brothers join in the function with disfunctional tendencies, ranging from Groucho insulting the guests, Chico and Harpo entertaining with their traditional piano and harp interludes, as well as Briggs having his gang sneaking in, posing as musicians, and carring out his orders by kidnapping Kelton&amp;#039;s daughter, Mary, and holding her hostage in the barn in order to obtain ransom money for her release from her father, thus, leading Zeppo to act as hero and come to her rescue, while his fellow stowaway passengers Groucho, Chico and Harpo create havoc of their own.\n\nVirtually plotless in a sense, MONKEY BUSINESSS plays like an extended comedy short that would have worked equally well had it starred the Three Stooges. MONKEY BUSINESS is pure Marx Brothers nonsense that appears to be every bit as funny today as it possibly was way back in 1931. Anything goes with this film, including many memorable shipboard moments such as Groucho&amp;#039;s comedic dance with Thelma Todd; Groucho doing his bit by posing as a reporter interviewing and insulting the cultured Madame Pucchi (Cecil Cunningham, in a manner somewhat similar to Margaret Dumont, Groucho&amp;#039;s frequent foil and straightwoman). GROUCHO: &quot;Is it true you&amp;#039;re getting a divorce as soon as your husband recovers his eyesight? Is it true you wash your hair in clam broth? Is is true you used to dance in a flea circus?&quot; MADAME PUCCHI: &quot;This is outrageous! I don&amp;#039;t like this innuendo.&quot; GROUCHO: &quot;That&amp;#039;s what I always say. Love flies out the door when money comes innuendo.&quot;; the Chico and Groucho exchange regarding Christopher Columbus: GROUCHO: &quot;Columbus sailed from Spain to India looking for a short cut,&quot; CHICO: &quot;Oh, you mean a strawberry short cut?;&quot; Harpo coming out from a barrel of hay in the barn and seen kissing a calf, and much more.\n\nAs with most of the Marx Brothers films produced at the Paramount studio, MONKEY BUSINESS is pure comedy at best. Had this been done over at MGM, where the Marx Brothers would eventually themselves with their annually released comedies from 1935 to 1941, MONKEY BUSINESS would have been toned down some in comedy antics with extended romantic subplots and straight-forward and lengthy musical numbers. MONKEY BUSINESS has none of that. Unlike most Marx Brothers comedies, their characters in MONKEY BUSINESS have no background, no professions and no spoken character names (the closing cast credits them with their first names only). They are just unusual stowaways trying to keep themselves from being caught and taken to the brig. However, in this case, MONKEY BUSINESS has its full quota of belly-laughs. Nothing really drags and no scenes are unnecessary. And whatever scenes may not be of importance or interest to the viewers, it passes by very quickly.\n\nMONKEY BUSINESS, hailed as one of the top 100 comedies by the American Film Institute, has become a perennial favorite to many Marx Brothers enthusiasts. After many years being presented on commercial television on the afternoon or evening to after midnight hours, it became available on video cassette through MCA Home Video in the 1980s, and to cable television on several channels, from the Comedy Channel shortly prior to 1990, then to American Movie Classics from 1991 to 1992, and, ten years later, on Turner Classic Movies from December 2001 to November 2002. In spite of its age, MONKEY BUSINESS, for all its silliness, continues to bring laughter to a new generation of movie lovers whenever shown, thanks to those funny men billed as The Marx Brothers. Because of them, no ocean voyage would ever be the same again, which is why no self respecting ship should ever set sail without them either. Bon Voyage.\n\n\n\n\nHorse Feathers (1932)\n\n \n \n\nadvertisement  photos   board   trailer   details  \n\nRegister or login to rate this title User Rating: 7.7/10 (3,905 votes) \nmore Photos (see all 24 | slideshow)  \n           \n\n--------------------------------------------------------------------------------\n\nOverview\nDirector:Norman Z. McLeod\n\nWriters:Bert Kalmar (screenplay) and\nHarry Ruby (screenplay) ...\nmore \nRelease Date:19 August 1932 (USA) more \nGenre:Comedy more \nTagline:The Maddest Comics of the Screen! \nPlot:Quincy Adams Wagstaff, the new president of Huxley U, hires bumblers Baravelli and Pinky to help his school win the big football game against rival Darwin U. full summary | add synopsis \nPlot Keywords:Beautiful Woman | Educational | College | Marx Brothers | American Football more \nUser Comments:classic more \n\n--------------------------------------------------------------------------------\n\nCast (Complete credited cast)\n\n Groucho Marx ...  Prof. Quincy Adams Wagstaff \n\n Harpo Marx ...  Pinky \n\n Chico Marx ...  Baravelli \n Zeppo Marx ...  Frank Wagstaff \n Thelma Todd ...  Connie Bailey \n David Landau ...  Jennings \nmore\n\n--------------------------------------------------------------------------------\n\nAdditional Details\nParents Guide:Add content advisory for parents \nRuntime:68 min \nCountry:USA \nLanguage:English \nColor:Black and White \nAspect Ratio:1.37 : 1 more \nSound Mix:Mono (Western Electric Noiseless Recording) \nCertification:South Korea:All | Portugal:M/6 | Spain:T | Australia:G | Finland:S | Germany:o.Al. | UK:U | USA:Approved \nFilming Locations:Occidental College -1600 Campus Road, Eagle Rock, Los Angeles, California, USA more \nMOVIEmeter:  17% since last week why? \nCompany:Paramount Pictures more \n\n--------------------------------------------------------------------------------\n\nFun Stuff\nTrivia:All four Marx Brothers perform their own version of the song &quot;Everyone Says I Love You&quot;. In fact, Harpo Marx performs it twice: whistling it once to his horse, and playing it on his trademark harp. Woody Allen later used the song within his musical of the same name, which movie had a scene of Woody and others dressed as Groucho for a costume party. more \nGoofs:Revealing mistakes: Just before Prof. Wagstaff throws his guitar in the water after playing it for Connie it changes to a cheap guitar that could easily get wet. more \nQuotes:Professor: The trustees have a few suggestions they would like to submit to you. \nProfessor Wagstaff: I think you know what the trustees can do with their suggestions.\nmore \nMovie Connections:Referenced in &quot;Mystery Science Theater 3000: The Unearthly (#4.20)&quot; (1991) more \nSoundtrack:Wedding March more \n\n--------------------------------------------------------------------------------\n\nFAQ\nThis FAQ is empty. Add the first question. \n--------------------------------------------------------------------------------\n\nUser Comments   (Comment on this title) \n8 out of 9 people found the following comment useful:- \nclassic, 20 May 2005\n\n\nAuthor: Lee Eisenberg (&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;60050913050e020512074e0c050520070d01090c4e030f0d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;) from Portland, Oregon, USA \n\nOh come on! You know the Marx brothers! Groucho, with his cigar, says something that sounds serious, but then makes it into a joke; Chico, with his Italian accent, mangles certain phrases, among other things; Harpo doesn&amp;#039;t speak but (literally) has all sorts of tricks up his sleeve; Zeppo actually is serious...to an extent. In this case, Quincy Wagstaff (Groucho) becomes dean of Huxley College and hopes to defeat rival college Darwin in a football game. He hires two goof-balls, Baravelli (Chico) and Pinky (Harpo), while the other college gets the real players.\n\nThe truth is that you don&amp;#039;t even have to understand the plot to have a good time. The movie is all about the Marx brothers&amp;#039; anarchic humor, particularly when Harpo causes a traffic jam and then plays a trick on a cop. The football game at the end is not like any game that you&amp;#039;ve ever seen. You&amp;#039;re sure to love the whole movie. And just remember: swordfish. \n\n\n\n\n\n\nDuck Soup (1933)\nadvertisement  photos   board   trailer   details  \n\nRegister or login to rate this title User Rating: 8.1/10 (18,460 votes) \nTop 250: #179 more Photos (see all 21 | slideshow)  Videos  \n             \n\n--------------------------------------------------------------------------------\n\nOverview\nDirector:Leo McCarey\n\nWriters:Bert Kalmar (story) and\nHarry Ruby (story) ...\nmore \nRelease Date:17 November 1933 (USA) more view trailer \nGenre:Comedy | Musical more \nPlot:Rufus T. Firefly is named president/dictator of bankrupt Freedonia and declares war on neighboring Sylvania over the love of wealthy Mrs. Teasdale. full summary | add synopsis \nPlot Keywords:Imitation | Spy | Dictator | Marx Brothers | Mythical Kingdom more \nAwards:1 win more \nUser Comments:I Wouldn&amp;#039;t Join Any Country that Would Have Me. more \n\n--------------------------------------------------------------------------------\n\nCast (Complete credited cast)\n\n Groucho Marx ...  Rufus T. Firefly \n\n Harpo Marx ...  Pinky \n\n Chico Marx ...  Chicolini \n Zeppo Marx ...  Lt. Bob Roland \n Margaret Dumont ...  Mrs. Gloria Teasdale \n Raquel Torres ...  Vera Marcal \n Louis Calhern ...  Ambassador Trentino of Sylvania \n Edmund Breese ...  Zander \n Leonid Kinskey ...  Sylvanian Agitator (as Leonid Kinsky) \n Charles Middleton ...  Prosecutor (as Charles B. Middleton) \n Edgar Kennedy ...  Lemonade Vendor \nmore\nCreate a character page for: Vera MarcalZanderSylvanian AgitatorProsecutorLemonade Vendor-----------more...  \n\n--------------------------------------------------------------------------------\n\nAdditional Details\nAlso Known As:Cracked Ice (USA) (working title) \nFirecrackers (USA) (working title) \nmore \nParents Guide:Add content advisory for parents \nRuntime:68 min \nCountry:USA \nLanguage:English \nColor:Black and White \nAspect Ratio:1.37 : 1 more \nSound Mix:Mono (Western Electric Noiseless Recording) \nCertification:UK:U | France:U | Ireland:G | South Korea:All | Australia:G | Germany:6 | Sweden:Btl | USA:Passed \nFilming Locations:Arbor Mansion, Pasadena, California, USA more \nMOVIEmeter:  1% since last week why? \nCompany:Paramount Pictures more \n\n--------------------------------------------------------------------------------\n\nFun Stuff\nTrivia:Vera was Trentino&amp;#039;s niece in early drafts. more \nGoofs:Continuity: After Firefly plays the flute, it disappears and a bugle appears in his hand, though the guard behind him keeps his bugle. more \nQuotes:[Firefly and Mrs. Teasdale hear music coming from downstairs] \nMrs. Teasdale: What&amp;#039;s that? \nRufus T. Firefly: Sounds to me like mice. \nMrs. Teasdale: Mice? Mice don&amp;#039;t play music \nRufus T. Firefly: No? How about the old maestro?\nmore \nMovie Connections:Referenced in An American Tail (1986) more \nSoundtrack:These Are the Laws of My Administration more \n\n--------------------------------------------------------------------------------\n\nFAQ\nList: The mirror gag \nmore \n--------------------------------------------------------------------------------\n\nUser Comments   (Comment on this title) \n34 out of 39 people found the following comment useful:- \nI Wouldn&amp;#039;t Join Any Country that Would Have Me., 28 November 2004\n\n\nAuthor: jcohen1 from LI \n\nI&amp;#039;m shocked, shocked at all the negative comments covering this comedy classic. The puns, the insults, are all now comedy classics. The Lemonade Stand &amp; the Mirror Scenes also memorable. I hadn&amp;#039;t seen the movie in around 15 years but bought the DVD so my 15 year old son could experience the Marxes. He loved it too.\n\nWhat I noticed for the first time was the satire of society, manners, government, the military, the bureaucracy (including Roberts Rules of Order). I can&amp;#039;t recall any other comedy I&amp;#039;ve seen that satirizes on such a grand scale.\n\nFor Marx Brothers fans this is a must see. It&amp;#039;s the boys with no love story or musical interludes in the way.\n\nOne word for those who disagree- &quot;Upstart&quot;. :-) \n\n\n\n\n\nA Night at the Opera (1935)\nadvertisement  photos   board   trailer   details  \n\nRegister or login to rate this title User Rating: 8.0/10 (10,590 votes) \nmore Photos (see all 20 | slideshow)  \n           \n\n--------------------------------------------------------------------------------\n\nOverview\nDirector:Sam Wood\nmore \nWriters:James Kevin McGuinness (story)\nGeorge S. Kaufman (screenplay) ...\nmore \nRelease Date:15 November 1935 (USA) more \nGenre:Comedy | Romance | Musical more \nTagline:Don&amp;#039;t miss it! The funniest picture ever made! \nPlot:A sly business manager and two wacky friends of two opera singers help them achieve success while humiliating their stuffy and snobbish enemies. full summary | add synopsis \nPlot Keywords:Port Hole | Steamer Trunk | Farce | Marx Brothers | Opera more \nAwards:1 win more \nUser Comments:Great Marx Brothers Entertainment more \n\n--------------------------------------------------------------------------------\n\nCast (Complete credited cast)\n\n Groucho Marx ...  Otis B. Driftwood \n\n Chico Marx ...  Fiorello \n\n Harpo Marx ...  Tomasso \n\n Kitty Carlisle ...  Rosa Castaldi \n Allan Jones ...  Ricardo Baroni \n Walter Woolf King ...  Rodolfo Lassparri (as Walter King) \n Sig Ruman ...  Herbert Gottlieb (as Siegfried Rumann) \n Margaret Dumont ...  Mrs. Claypool \n Edward Keane ...  Captain \n Robert Emmett O&amp;#039;Connor ...  Henderson (as Robert Emmet O&amp;#039;Connor) \nmore\nCreate a character page for: TomassoCaptain-----------more...  \n\n--------------------------------------------------------------------------------\n\nAdditional Details\nParents Guide:Add content advisory for parents \nRuntime:96 min | USA:91 min (1948 re-release) \nCountry:USA \nLanguage:English | Italian \nColor:Black and White \nAspect Ratio:1.37 : 1 more \nSound Mix:Mono (Western Electric Sound System) \nCertification:USA:Approved (certificate #1613) | South Korea:12 (2004) | Argentina:Atp | Australia:G | Finland:S | UK:U \nFilming Locations:Los Angeles, California, USA more \nMOVIEmeter:  2% since last week why? \nCompany:Metro-Goldwyn-Mayer (MGM) more \n\n--------------------------------------------------------------------------------\n\nFun Stuff\nTrivia:Sam Wood, freshman Marx Brothers director in this film, was a perfectionist. The scene in which Harpo Marx hangs from the rope was filmed so many times that Harpo&amp;#039;s hands became cut and swollen from the rope. more \nGoofs:Revealing mistakes: The elevator operator uses the old movie trick of rising from a squatting position to make it appear that the car is rising from the ground floor. Unfortunately, the white elevator certificate over his left shoulder remains motionless the entire time. more \nQuotes:Ship Captain: I cannot let the evening pass without paying a little tribute to our distinguished guests of honor - the three greatest aviators in the world. \nOtis B. Driftwood: Three greatest aviators, but you notice they&amp;#039;re traveling by boat.\nmore \nMovie Connections:Featured in Brother, Can You Spare a Dime? (1975) more \nSoundtrack:Anvil Chorus more \n\n--------------------------------------------------------------------------------\n\nFAQ\nThis FAQ is empty. Add the first question. \n--------------------------------------------------------------------------------\n\nUser Comments   (Comment on this title) \n10 out of 11 people found the following comment useful:- \nGreat Marx Brothers Entertainment, 18 June 2001\n\nAuthor: Snow Leopard from Ohio \n\n&quot;A Night at the Opera&quot; is great Marx Brothers entertainment. It has comedy, music, and a good cast - everything except Zeppo, who by this time had left the act. It fully deserves its reputation as one of the two best Marx Brothers films, along with &quot;Duck Soup&quot;.\n\n&quot;A Night at the Opera&quot; is probably slightly less funny than &quot;Duck Soup&quot; (it is no criticism to say that of any film), but it has more of a story to connect the great comic bits. There is a good supporting cast in both films - here Sig Ruman is especially funny, in addition to the perennial Margaret Dumont. It also has several fairly long musical interludes - some are operatic, but the most entertaining is Chico and Harpo&amp;#039;s impromptu shipboard entertainment.\n\nOf course, the real attraction in any of these films is the comedy, and there are some memorable bits in this one. The contract negotiations between Chico and Groucho, and the scene in Groucho&amp;#039;s stateroom, are especially hilarious, and you have to see the stateroom scene more than once to catch everything. And for sustained zany humor, the climactic sequence at the opera might be the funniest part of all.\n\nThis is certainly a must for Marx Brothers fans. \n\n","torrent":{"xt":"urn:btih:8f98cd96f57d27fe941ebc75a28a5a4f1c81e2fd","amp;dn":"MARX+BOTHERS+1929+-+1935+.iso","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"8f98cd96f57d27fe941ebc75a28a5a4f1c81e2fd","infoHashBuffer":{"type":"Buffer","data":[143,152,205,150,245,125,39,254,148,30,188,117,162,138,90,79,28,129,226,253]},"announce":[],"urlList":[]}}