{"title":"Handbook for Bloggers and Cyber-Dissidents","uid":4080097,"size":2406077,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:90259acd39b44043df2f98000f364e3718029d16&amp;dn=Handbook+for+Bloggers+and+Cyber-Dissidents&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rz2342","files":1,"time":1205520733,"description":"New version of Handbook for Bloggers and Cyber-Dissidents\n\nReporters Without Borders is making a new version of its Handbook for Bloggers and Cyber-Dissidents available to bloggers today to mark Online Free Expression Day.\n\nThe handbook offers practical advice and techniques on how to create a blog, make entries and get the blog to show up in search engine results. It gives clear explanations about blogging for all those whose online freedom of expression is subject to restrictions, and it shows how to sidestep the censorship measures imposed by certain governments, with a practical example that demonstrates the use of the censorship circumvention software Tor.\n\nThe leaders of authoritarian countries are becoming more and suspicious of bloggers, these men and women who, although not journalists, publish news and information online and who, worse still, often tackle subjects the so-called traditional media dare not cover. In some countries, blogs have become an important new source of news. It is to protect this source that Reporters Without Borders has updated its handbook.\n\nDownload the Handbook\t\t","torrent":{"xt":"urn:btih:90259acd39b44043df2f98000f364e3718029d16","amp;dn":"Handbook+for+Bloggers+and+Cyber-Dissidents","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"90259acd39b44043df2f98000f364e3718029d16","infoHashBuffer":{"type":"Buffer","data":[144,37,154,205,57,180,64,67,223,47,152,0,15,54,78,55,24,2,157,22]},"announce":[],"urlList":[]}}