{"title":"Advanced Pulverized Coal Injection Technology and Blast Furnace","uid":12754356,"size":13722921,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:906a85825b4d035046f3ecfbdd2bf55dd8641fce&amp;dn=Advanced+Pulverized+Coal+Injection+Technology+and+Blast+Furnace&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1447424145,"description":"Advanced Pulverized Coal Injection Technology and Blast Furnace Operation - Kuniyoshi Ishii (Pergamon, Elsevier, 2000).pdf\r\n\r\nIn order to reduce the cost of running blast furnaces (BFs), injected pulverized coal is used rather than coke to fire BFs. As a result of this, unburned fine materials are blown with the gas into the bosh and dead man areas with possible detrimental effects on gas flow and permeability of the coke column. The capacity of the furnace to consume these particles by solution loss is probably one of the limitations to coal injection. It is, therefore, important to understand the physicochemical and aerodynamic behaviour of fines including the change of in-furnace phenomena. \r\nThe Committee of Pulverized Coal Combustion and In-Furnace Reaction in BF was set up in 1993 as a cooperative research of the Japan Society for the Promotion of Science (JSPS) and the Iron and Steel Institute (ISIJ) to evaluate research initiative into this problem. \r\nThis book reports on the JSPS/ISIJ Committee's activities and describes the interpretation of findings drawn from combustion experiments and the results of live furnace applications, and furnace performance","torrent":{"xt":"urn:btih:906a85825b4d035046f3ecfbdd2bf55dd8641fce","amp;dn":"Advanced+Pulverized+Coal+Injection+Technology+and+Blast+Furnace","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"906a85825b4d035046f3ecfbdd2bf55dd8641fce","infoHashBuffer":{"type":"Buffer","data":[144,106,133,130,91,77,3,80,70,243,236,251,221,43,245,93,216,100,31,206]},"announce":[],"urlList":[]}}