{"title":"The Bible Series 2 - Visual Bible - Mathew &amp; John","uid":12767444,"size":4071834006,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:91653890c4de5bd4412c04af07d6cff1076a5e3c&amp;dn=The+Bible+Series+2+-+Visual+Bible+-+Mathew+%26amp%3B+John&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"POtHS11","files":4,"time":1447617442,"description":"Matthew\r\n\r\n15:1 - 28:20 - The year is about 62 A.D., and the aging apostle Matthew recalls the remarkable events he witnessed as a young man. As his story unfolds, the centuries melt away and we are intimately involved in the life of Jesus. We share the mystery and the wonder of His birth. We witness His baptism and temptation in the wilderness. We experience the compassion and hope of the Sermon on the Mount. Walk with Jesus through Galilee as He calls His disciples, performs the first miracles, and begins teaching His world-changing message of love and redemption. This deeply moving presentation of the most beloved of stories stars luminary Richard Kiley as Matthew and the passionate Bruce Marchiano as Jesus. This unique word-for-word presentation in the NIV brings to the screen a divine yet warmly human Jesus. &quot;I've been a Christian for 25 years, but I never knew who Jesus truly was until I saw Matthew... He loves me!&quot; \r\n\r\nJohn\r\n\r\n There are four gospels in the New Testament. Matthew, Mark and Luke are referred to as the `synoptic' gospels. They see Jesus `with the same eye'. Their `eyewitness accounts' are remarkably alike. John is startlingly different in its details, style and tone -- so much so, that this gospel almost didn't make it into the accepted canon of New Testament books.\r\n\r\n`The Gospel of John' purports to be a faithful retelling of the fourth gospel. It employs every single word of the text, as rendered by the Good News Bible translation. The film combines dialogue with narration by veteran actor Christopher Plummer. The result is an understandably wordy script. One of my friends used the term `verbose'.\r\n\r\nWas it wise or foolish to adopt this approach? That depends on your point of view. It means that the actor playing Jesus must deliver lengthy speeches, especially Jesus' farewell after the Last Supper. This runs the risk of being a deadly bore in cinematic terms. I must confess, I kept nodding off during this segment of the film. To his credit, the director tries to compensate by cutting away to a montage of black-and-white flashback images suggested by Jesus' words. This gives the audience a much-needed visual breather.\r\n\r\nOn the other hand, and this is a good thing, using the integral text of John's gospel obliges us truly to listen -- to hear the Word. I lost track of how often Jesus said, `I am telling you the truth.' Some might find this annoyingly repetitive. But it certainly hammers home the theme of John's gospel. As if in counterpoint to Pilate's cynical barb, `What is truth?' we have Jesus' ringing declaration, `I am the Truth!' (This is often obscured by older translations, such as `Amen, amen, I say to you'.)\r\n\r\nI found `The Gospel of John' highly instructive, not just for what it says, but what is does not say. I realized, for the first time, why John recounts events absent from Matthew, Mark and Luke, while ignoring those familiar to us from their accounts. It struck me that the author of the fourth gospel assumes we are already conversant with all this material. For instance, John does not describe the institution of the Eucharist at the Last Supper, yet abounds in references to bread and wine. Again, John does not tell us what became of John the Baptist (he was beheaded by Herod) or Judas the traitor (he hanged himself). John takes it for granted that we know.\r\n\r\nI also realized how often Jesus says, `I am who I am' (three times) and finally, `Before Abraham was, I am.' Jesus applies to Himself the phrase used by Yahweh in the Old Testament as His name. In other words, in John's gospel, Jesus clearly equates Himself with God (`The Father and I are one')","torrent":{"xt":"urn:btih:91653890c4de5bd4412c04af07d6cff1076a5e3c","amp;dn":"The+Bible+Series+2+-+Visual+Bible+-+Mathew+%26amp%3B+John","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91653890c4de5bd4412c04af07d6cff1076a5e3c","infoHashBuffer":{"type":"Buffer","data":[145,101,56,144,196,222,91,212,65,44,4,175,7,214,207,241,7,106,94,60]},"announce":[],"urlList":[]}}