{"title":"Ground Control USA Final - Fairlight (2000)","uid":4233107,"size":724233050,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:919a57de75dd8d6190597d791f220a97e92a19c7&amp;dn=Ground+Control+USA+Final+-+Fairlight+%282000%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ElectronicEgress","files":50,"time":1213159324,"description":"   Two political factions have gone to war over a distant world and the secrets it holds in Ground Control, a visually stunning and frenetically paced action/real-time strategy game from Sierra Studios and Massive Entertainment. At its core, Ground Control is a frenetically paced RTS played out in a visually stunning 3D world.  During the course of the game, players will be challenged in an intense arena of battle- effectively managing tactical squads of foot soldiers, mobile units, air craft and support units as they vie for control of a distant planet. In addition to the epic single-player game, Ground Control&amp;#039;s extensive multiplayer component will feature several unique multiplayer modes including deathmatch-style drop-in games - a first for RTS.\n\nA note from FairLight:\n\n   Here is the Usa Final, our release before was the European version, and the usa Version has a different version number.  There is no way we can be for sure that The European version is truly a Final until it hits the stores there. There have been Many cases before were the European version of a game has had a different version number to the Usa one (Need for speed 5 etc.) Note we could not notice any different at all between the two, and the readme files have the same dates, so it could be us just being paranoid. We will always be the first admit our mistakes.  So in the name of Quality we bring you the Usa version.","torrent":{"xt":"urn:btih:919a57de75dd8d6190597d791f220a97e92a19c7","amp;dn":"Ground+Control+USA+Final+-+Fairlight+%282000%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"919a57de75dd8d6190597d791f220a97e92a19c7","infoHashBuffer":{"type":"Buffer","data":[145,154,87,222,117,221,141,97,144,89,125,121,31,34,10,151,233,42,25,199]},"announce":[],"urlList":[]}}