{"title":"BBC Timothy Spall All at Sea 1of4 Message in a Bottle 720p x264","uid":12841671,"size":750885372,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:91c014f39d6629f586d5ae884bea682c98401197&amp;dn=BBC+Timothy+Spall+All+at+Sea+1of4+Message+in+a+Bottle+720p+x264+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"MVGroup","files":1,"time":1448504821,"description":"All at Sea (BBC)\r\n\r\nTravel Documentary hosted by Timothy Spall, published by BBC in 2012 - English narration. \nhttp://docuwiki.net/images/d/d8/All-at-Sea-BBC-Cover.jpg\r\n\r\nInformation\r\n------------------------------\r\nTimothy Spall and his wife Shane are back on board their beloved barge the Princess Matilda as they conclude their trip around the British coast.\r\n\r\n1)  Message in a Bottle \r\nTimothy Spall and his wife Shane are back on board their beloved barge the Princess Matilda as they conclude their trip around the British coast. Tim takes on Rattray Head in the face of a huge storm. This is the equivalent of Land's End for Scotland and the point where they head south for the first time. The North Sea soon becomes the new enemy as he and Shane struggle to cope with this unrelenting force of nature. On land they find wonderful Scottish towns - Peterhead, Eyemouth and Stonehaven - but it's the town of Banff that resonates most. They fall in love with it and are sad to leave it behind as they pursue their odyssey of circumnavigating Britain. At the end of this episode they eventually reach the English sea border where they launch a message in a bottle.\r\n\r\n2)  Stags by the Sea \r\nTimothy Spall and his wife Shane continue their trip around the British coast by barge. Starting in Amble and the neighbouring town of Warkworth, Tim and Shane are in awe of this historic part of England as they visit the Church of St Lawrence and Warkworth Castle. In Amble, Tim meets a young sailor circumnavigating Britain in the opposite direction who, like Tim, was inspired to take to the sea after surviving leukemia. In Newcastle-upon-Tyne, a place he is truly fond of as he has been welcomed there ever since he played Barry in Auf Wiedershen, Pet, Tim meets actress Melanie Hill, who played Barry's first wife Hazel, and takes us on a tour of his favourite places in the city. After Newcastle it's on to Hartlepool, which Tim discovers translates to Stags by the Sea. Tim and Shane soon find themselves trapped there after dramatically aborting a journey to Whitby whilst at sea. The North Sea once again reminds us that it's not to be messed with.\r\n\r\n3)  Gods Own Coast \r\nTimothy Spall and his wife Shane continue their trip around the British coast by barge. In Whitby, an engineer is called to assess an engine problem. Tim is keen to see the town where Bram Stoker based the opening of his novel, Dracula. He finds the hotel where Stoker stayed and looks for the part of the coastline featured in the novel. Next is Scarborough where Tim filmed The Damned United. It's high summer and Britain's first seaside resort is crammed with holidaymakers. Arriving at Spurn Head they are now completely alone - there's no harbour or marina here. They moor to a buoy owned by the local lifeboat crew and wait for the perfect sea conditions to take them towards the south of England. They have to watch out for heavy sea traffic, the turbulence of the Wash and dangerous sandbanks. Arriving on the north Norfolk coast at night, a pilot boat guides them into the port of Wells-next-the-Sea. They soon discover it's a trip worth making as they explore this stunning coastline.\r\n\r\n4)  The Last Splash \r\nAfter six years, Timothy Spall and his wife Shane conclude their trip around the British coast by barge. In Suffolk, they moor in Shotley marina, the site of the former naval training camp HMS Ganges. From here they venture into the Walton backwaters and then out into the North Sea for a trip to Brightlingsea, Essex. Chatham in Kent is the port were the Spalls spent months learning the art of navigation before venturing out into the sea for the first time all those years ago. Tim hadn't realised how much the waters of the Medway would change in the blackness of night - after hours at sea they are close to land, but become lost. After much fretting, Tim reluctantly calls the coastguard. The lifeboat crew take them to the nearest port, Queenborough in Sheppey. The next day they safely make it to Chatham, where both Tim and Shane are drained and relieved. The final journey up the Thames into London is where he eventually realises why he did this adventure in the first place.\r\n\r\nScreenshots\r\n------------------------------ \nhttp://docuwiki.net/images/b/ba/All-at-Sea-BBC-Screen0.jpg \nhttp://docuwiki.net/images/7/7a/All-at-Sea-BBC-Screen1.jpg \nhttp://docuwiki.net/images/a/ac/All-at-Sea-BBC-Screen2.jpg \nhttp://docuwiki.net/images/3/32/All-at-Sea-BBC-Screen3.jpg \nhttp://docuwiki.net/images/f/f0/All-at-Sea-BBC-Screen4.jpg \nhttp://docuwiki.net/images/a/a1/All-at-Sea-BBC-Screen5.jpg \nhttp://docuwiki.net/images/0/0b/All-at-Sea-BBC-Screen6.jpg \nhttp://docuwiki.net/images/f/fd/All-at-Sea-BBC-Screen7.jpg \nhttp://docuwiki.net/images/1/15/All-at-Sea-BBC-Screen8.jpg \nhttp://docuwiki.net/images/8/81/All-at-Sea-BBC-Screen9.jpg \nhttp://docuwiki.net/images/3/3c/All-at-Sea-BBC-Screen10.jpg \nhttp://docuwiki.net/images/e/ea/All-at-Sea-BBC-Screen11.jpg \r\n\r\nTechnical Specs\r\n------------------------------\r\n * Video Codec: x264 CABAC   \r\n * Video Bitrate: CRF 20 (~3178Kbps)\r\n * Video Resolution: 1280x720\r\n * Video Aspect Ratio: 16:9\r\n * Frames Rate: 25 FPS\r\n * Audio Codec: AAC-LC\r\n * Audio Bitrate: Q=0.50 VBR 48KHz (~128Kbps)\r\n * Audio Channels: 2\r\n * Run-Time: 29 mins\r\n * Number Of Parts: 4\r\n * Part Size: ~700 MB (average)\r\n * Source: HDTV (upscaled)\r\n * Subtitles: Merged\r\n\r\nLinks\r\n------------------------------ \nhttp://www.bbc.co.uk/programmes/b01cmbc8","torrent":{"xt":"urn:btih:91c014f39d6629f586d5ae884bea682c98401197","amp;dn":"BBC+Timothy+Spall+All+at+Sea+1of4+Message+in+a+Bottle+720p+x264+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"91c014f39d6629f586d5ae884bea682c98401197","infoHashBuffer":{"type":"Buffer","data":[145,192,20,243,157,102,41,245,134,213,174,136,75,234,104,44,152,64,17,151]},"announce":[],"urlList":[]}}