{"title":"Never Get Raided - Barry Cooper Volume 2 [marijuana never get bu","uid":4215803,"size":3586981935,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:92015974ffa238ed72eb2cb159af5824510dc44a&amp;dn=Never+Get+Raided+-+Barry+Cooper+Volume+2+%5Bmarijuana+never+get+bu&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"toetag","files":2,"time":1212333053,"description":"If anyone can figure out how to shrink this video and share it onto other torrent sites or eMule I&amp;#039;d sure appreciate it! Handbrake didn&amp;#039;t like it. \n\nNever Get Raided - Barry Cooper Volume 2\n\nThis newly released film is the second in Barry&amp;#039;s series of controversial NeverGetBusted videos. The title, &quot;NeverGetRaided,&quot; describes the DVD perfectly. Part documentary and all instruction, NeverGetRaided promises to reveal all the latest drug enforcement tactics giving the viewer confidence in maintaining a cannabis culture lifestyle without ever being raided! Alongside the cannabis friendly citizens, the non-smoker will enjoy the film as well because it interestingly catalogs secret police tactics and gives the audience an insider&amp;#039;s view into what caused one of America&amp;#039;s top drug cops to &quot;switch sides.&quot;\n\nChapter 1: Guerrilla Growing Undetected\n\nBarry teaches from the DEA training he received on how to spot marijuana fields from the air. He takes you on a helicopter ride over a genuine clandestine marijuana patch and then &quot;creeps&quot; you into the field while pointing out the grower&amp;#039;s mistakes.\n\nChapter 2: Spotting Undercovers and Informants\n\nUndercover officers and informants are perhaps the strongest and most dangerous tool used against American Citizens in the unjust War on Drugs. Barry points out only 28 officers have lost their lives in the War on Drugs in a ten year period (1996-2005) compared to millions of non-violent citizens who have lost their lives or have been placed in prisons to be raped or stabbed. Barry uses his experience as an undercover officer and interviews a seasoned drug dealer to teach you exactly how to detect these secret government agents.\n\nChapter 3: Selling Marijuana Safely (Cops are more dangerous than Dealers)\n\nDiscover a GUARANTEED method to sell marijuana and NeverGetRaided. The alcohol dealers do not have police invading their homes in the middle of the night and neither should pot dealers. Barry explains a method to use that even he could not bust! It really works.\n\nChapter 4: Growing Indoor Plants That Are Invisible To Law Enforcement\n\nAre you currently growing your medicine indoors? Do you want to grow indoors but haven&amp;#039;t because you don&amp;#039;t want to get raided? Heat from lights are the grower&amp;#039;s worst enemy so Barry teaches how to beat the heat by explaining FLIR (Forward Looking Infra-Red Radar.) Walk into an actual grow room and witness real police FLIR footage of an indoor grow operation. Not only does Barry teach how to confuse these heat imaging video cams but he also explains how to obtain grow equipment undetected. You will also learn how to spot police surveillance, tails and stakeouts and learn how to counter these efforts.\n\nChapter 5: Knock and Talks and K-9 Proofing.\n\nLearn tips that GUARANTEE how to win 100% of the time when facing a police encounter at your door. Learn how to fool the dogs in case you didn&amp;#039;t listen to Barry&amp;#039;s advice and you get raided.\n\nChapter 6: A Message To DEA.\n\nBarry pulls no punches when outlining an effective way to conduct search warrants without the violence. The DEA and other drug enforcement agencies will owe an answer after Barry exposes this non-violent method to seizing persons and property.\n\nChapter 7: Those Are Your Kids! Drugs Are Not Harming Them...The Police Are.\n\nThis &quot;no holds bar&quot; chapter challenges government propaganda programs such as D.A.R.E and encourages parents to take charge of their families by teaching the truth about drugs. In this chapter, Barry says what the &quot;closet smoking parents&quot; can&amp;#039;t say...highly charged and controversial. Note: We currently have 1.5 million children missing one or both parents because of the Drug War.\n\n","torrent":{"xt":"urn:btih:92015974ffa238ed72eb2cb159af5824510dc44a","amp;dn":"Never+Get+Raided+-+Barry+Cooper+Volume+2+%5Bmarijuana+never+get+bu","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"92015974ffa238ed72eb2cb159af5824510dc44a","infoHashBuffer":{"type":"Buffer","data":[146,1,89,116,255,162,56,237,114,235,44,177,89,175,88,36,81,13,196,74]},"announce":[],"urlList":[]}}