{"title":"Winmend Software Collection Nov 9, 2015 (Install + Portable)","uid":12725856,"size":47237111,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9238e5c5370bb458ca546839a56eea20a8fa6c43&amp;dn=Winmend+Software+Collection+Nov+9%2C+2015+%28Install+%2B+Portable%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jovo_bih","files":1,"time":1447058534,"description":"*************************************************************************\r\nWinmend Software Collection Nov 9, 2015 (Local install + Portable) - CORE\r\n*************************************************************************\r\n\r\nIncludes\r\n\r\nWinMend System Doctor 1.7.2\r\n---------------------------\r\n\r\nWinMend System Doctor is a Windows-based security improvement. With its innovative and intelligent detection engine, WinMend System Doctor can effectively detect and fix security vulnerabilities in the system, fix software vulnerabilities in third-party applications, and prevent the running of malicious startup programs, Trojans, BHOs, processes and system services to significantly improve system security.\r\n\r\nWinMend Data Recovery 1.6.0\r\n---------------------------\r\n\r\nWinMend Data Recovery is a Windows-based data recovery application. It recovers data on FAT12/ FAT16/FAT32/NTFS/NTFS5 partitions in Windows operating systems. It can be used to scan partitions in various hard drives, removable drives and even in data cards, and to search and recover deleted or missing files, files lost during formatting or due to partition exceptions.\r\n\r\nWinMend Registry Cleaner 1.8.1\r\n------------------------------\r\n\r\nWinMend Registry Cleaner is a powerful and secure registry cleaning and optimization application. It has four main function modules: Registry Cleaner, Registry Optimizer, Registry Backup and Scheduler. The application can efficiently and comprehensively analyze system, accurately locate errors and obsolete data, safely fix or delete them, thus effectively reducing the workload in your computer and improving the speed and performance of your system.\r\n\r\nWinMend History Cleaner 1.5.8\r\n-----------------------------\r\n\r\nWinMend History Cleaner is a utility that can comprehensively clean histories produced by various programs in the system. It can effectively scan and clean histories generated by more than 100 programs. These histories include cookies, browsing histories and cache files by browsers such as Internet Explorer, Firefox and histories by a great number of other applications such as Microsoft Office, WinRAR, Windows Media Player and RealPlayer.\r\n\r\nWinMend Disk Cleaner 1.6.1\r\n--------------------------\r\n\r\nWinMend Disk Cleaner is a quick and safe junk file cleaner. With a powerful scan engine, it safely and quickly locates junk files in your system. By deleting junk files, it increases available disk space and improves system performance.\r\n\r\nNote: block apps with firewall for both local and portable versions !\r\n\r\nHomepage http://www.winmend.com/","torrent":{"xt":"urn:btih:9238e5c5370bb458ca546839a56eea20a8fa6c43","amp;dn":"Winmend+Software+Collection+Nov+9%2C+2015+%28Install+%2B+Portable%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9238e5c5370bb458ca546839a56eea20a8fa6c43","infoHashBuffer":{"type":"Buffer","data":[146,56,229,197,55,11,180,88,202,84,104,57,165,110,234,32,168,250,108,67]},"announce":[],"urlList":[]}}