{"title":"Alvin e os Esquilos (Alvin and the Chipmunks) 2008 DVDRip Dual A","uid":4071059,"size":733772650,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:9382ae8cb4c5b700eeb6afb334d03f01efb5634e&amp;dn=Alvin+e+os+Esquilos+%28Alvin+and+the+Chipmunks%29+2008+DVDRip+Dual+A&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bozano","files":3,"time":1205057749,"description":"Alvin, Simon e Theodore sao tres esquilos especiais, que decidem morar na casa de Dave Seville (Jason Lee), um compositor em busca do sucesso. Logo eles percebem que, para que Dave permita que eles morem em sua casa, o trio precisara demonstrar que tem talento. Assim Alvin, Simon e Theodore mostram que sabem cantar, tornando-se um grande sucesso. Isto faz com que Dave torne-se nao apenas seu compositor, mas tambem um verdadeiro pai. So que o estrelato sobe a cabeca do trio, gerando problemas no relacionamento deles com Dave.\n\nIn a tree farm, three musically inclined chipmunks, Alvin, Simon and Theodore, find their tree cut down and sent to Los Angeles. Once there, they meet the frustrated songwriter David Seville, and despite a poor house wrecking first impression, they impress him with their singing talent. Seeing the opportunity for success, both human and chipmunks make a pact for them to sing his songs. While that ambition proves a frustrating struggle with the difficult trio, the dream does come true after all. However, that success presents its own trials as their unscrupulous record executive, Ian Hawke, plans to break up this family to exploit the boys. Can Dave and the Chipmunks discover what they really value amid the superficial glamor around them?\n\n\n\nEnjoy... :)","torrent":{"xt":"urn:btih:9382ae8cb4c5b700eeb6afb334d03f01efb5634e","amp;dn":"Alvin+e+os+Esquilos+%28Alvin+and+the+Chipmunks%29+2008+DVDRip+Dual+A","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9382ae8cb4c5b700eeb6afb334d03f01efb5634e","infoHashBuffer":{"type":"Buffer","data":[147,130,174,140,180,197,183,0,238,182,175,179,52,208,63,1,239,181,99,78]},"announce":[],"urlList":[]}}