{"title":"Anders Jallai - Landsförrädaren (Svensk Retail EPUB)","uid":12757784,"size":553373,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:93de137137373c0dc9fcd8d3d9c0f8f58a8f53c6&amp;dn=Anders+Jallai+-+Landsf%26ouml%3Brr%26auml%3Bdaren+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1447472612,"description":"Författare: Anders Jallai\r\n       Titel: Landsförrädaren (Anton Modin #2)\r\nUtgivningsår: 2011\r\n       Språk: Svenska\r\n        ISBN: 9789174610222\r\n\r\nI uppföljaren till den uppmärksammade debuten Spionen på FRA borrar sig Anders Jallai ännu djupare ner i Sveriges mörka efterkrigshistoria. Han gör det i en rafflande thriller som tar sin början när förre spionen och stridsflygaren Anton Modin får tillåtelse att under en natt läsa dokument i Säkerhetspolisens hemliga arkiv. Modin upptäcker en mapp över mordet på statsminister Paul Olofson och inser snabbt att mycket inte framkommit i mordutredningen. Samtidigt som han börjar läsa den hemliga akten dör Säpochefen Klas Berg i en hjärtattack, och strax därpå blir Modin avbruten i sin läsning och tvingas ut ur arkivet. Han förstår att han fått se något som inte var ämnat för hans ögon och när Modin samma natt blir utsatt för ett mordförsök står det klart att han är något mycket stort på spåren. Trådar löper till dolda vapenaffärer på 80-talet, mordet på en tv-journalist, den hemliga organisationen Arla Gryning och det kalla krigets alla ljusskygga element och oheliga allianser. . I sin jakt på sanningen får Modin hjälp av bland andra Julia Steerback, som har ett förflutet inom både Försvarets radioanstalt, FRA, och dess amerikanska motsvarighet NSA. Tillsammans utmanar de starka krafter, däribland Modins förre chef Chris Loklinth, som leder den militära underrättelseorganisationen SSI. Landsförrädaren är inte bara den spännande fortsättningen på Spionen på FRA, utan också en thriller som säger något om Sveriges dolda förflutna och den makt som än idag utövas bortom demokratisk kontroll. Utifrån sin djupa förtrogenhet med svenskt underrättelseväsen har Jallai skrivit en spänningsroman som känns skrämmande förankrad i svensk nutidshistoria.\r\n\r\nANDERS JALLAI är dykare och före detta stridspilot. Han fann den sovjetiska ubåten S7 på svenskt vatten 1998 och det försvunna Catalinaplanet 2003. Landsförrädaren är hans andra roman. Läs Anders blogg på www.jallai.se","torrent":{"xt":"urn:btih:93de137137373c0dc9fcd8d3d9c0f8f58a8f53c6","amp;dn":"Anders+Jallai+-+Landsf%26ouml%3Brr%26auml%3Bdaren+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"93de137137373c0dc9fcd8d3d9c0f8f58a8f53c6","infoHashBuffer":{"type":"Buffer","data":[147,222,19,113,55,55,60,13,201,252,216,211,217,192,248,245,138,143,83,198]},"announce":[],"urlList":[]}}