{"title":"Hitman  Extenden Edition","uid":4066794,"size":4600369152,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:9435bbcf02a79e9539500452861b2344ca756bb3&amp;dn=Hitman++Extenden+Edition&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zape","files":27,"time":1204837384,"description":".. \n\nHitman Extenden Edition \n\nTimothy Olyphant, Dougray Scott, Olga Kurylenko, Robert Knepper, Ulrich Thomsen, Michael Offei \n\nProduce: Twentyeth Century Fox, Daybreak Productions, Europa Corp., Prime Universe Productions \n\nIt?s hard not to feel like one has entered a certain dimension of video-game logic while watching Hitman, a lightly enjoyable action-suspense movie indeed based on a popular and bloody game about a mysterious hired gun with a bar-code tattoo on his bald head and a number (47) in lieu of a name. Living like a chaste monk while slipping past borders to kill his targets, 47 (Timothy Olyphant of Deadwood) moves like a determined shark and speaks softly to his contact at the enigmatic &quot;the Organization,&quot; which raises cast-off children to become well-paid assassins. Fruitlessly pursued by an Interpol cop (Dougray Scott) who can never get sovereign governments to cooperate, 47 has no trouble slipping in and out of countries to ply his trade. Until, that is, he?s set up to take a fall in Russia by shooting a national leader who is promptly replaced by a lookalike double. Suddenly on the run, 47 has to retrace his steps and formulate a lethal plan for extricating himself from a trap. Caught in the chaos is the lovely Nika (Olga Kurylenko), forced into sex slavery by 47?s new enemies and the one person who seems uniquely qualified to break through 47?s many personal barriers. Directed by France?s Xavier Gens, Hitman features loads of bloody mayhem and unabashed moments of pulp absurdity, such as a scene in which 47 and three other Organization killers agree to fight one another respectfully, then proceed to pulverize each other with swords and fists. As fodder for gamers, however, Hitman is packed with visuals and dramatic moments that seem so odd on the big screen until one realizes they are basically placemarkers for the video-game edition. \n\nPal \nVideo........................ WS (2.35:1) \nBitrate...................... Unrouched \nSource....................... DVD9 \nAudio........................ DD5.1 Eng, DD5.1 Esp, DD5.1 Fre, DD5.1 Deu, DD5.1 Ita \nSubtitles.................... Swe,Fin,Nor,Eng,Ger,Esp,Ita,Nl \nStripped..................... Eng audio for heering,Warnings, \n\n\nDVD5 \n\n\nSaludos \n\n.. \n","torrent":{"xt":"urn:btih:9435bbcf02a79e9539500452861b2344ca756bb3","amp;dn":"Hitman++Extenden+Edition","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9435bbcf02a79e9539500452861b2344ca756bb3","infoHashBuffer":{"type":"Buffer","data":[148,53,187,207,2,167,158,149,57,80,4,82,134,27,35,68,202,117,107,179]},"announce":[],"urlList":[]}}