{"title":"WoW-2.4.1.8125-to-2.4.2.8278-enGB-patch.exe","uid":4186279,"size":12373672,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:948a45579137a9f0b8560255513807d195949664&amp;dn=WoW-2.4.1.8125-to-2.4.2.8278-enGB-patch.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"GreyRaven","files":1,"time":1210694342,"description":"World of Warcraft PTR Patch 2.4.2\n\nThe latest patch notes can always be found at http://www.worldofwarcraft.com/patchnotes/\n\nThe latest test realm patch notes can always be found at http://www.worldofwarcraft.com/patchnotes/test-realm-patchnotes.html\n\nDruids\n\n    * Talent: Primal Fury (Rank 2) will now be properly unlearned when it is untalented.\n    * Talent: (Restoration)- Natural Perfection will no longer proc by normal melee attacks. \n\nHunters\n\n    * Aspect of the Viper: This ability now grants an additional amount of mana each 5 seconds equal to 35% of the hunter?s level.\n    * Boar Charge: This ability will no longer make Growl cast immediately after it generates excessive threat.\n    * The pet ability Growl will no longer scale with pet Attack Power.\n    * Dire Ravens in Blade?s Edge Mountains now tameable.\n    * Scare Beast: The range on this spell has been increased to 30 yards and it is now instant cast.\n    * Tamed Drywallow Snappers now will know Bite 5 (instead of Claw 5.) \n\nMages\n\n    * Talent: Improved Blink (Arcane) now reduces chance to be hit by 13/25% and the duration of Rank 1 has been increased to 4 seconds.\n    * Completing the quest ?Arcane Refreshment? will now properly teach the spell Conjure Water (Rank 7).\n    * Polymorph: Mounted creatures will no longer remain mounted while polymorphed.\n    * Mage Armor no longer reduces the duration of beneficial magic buffs.\n    * Molten Armor will now do damage while a damage absorption shield is active. \n\nPaladins\n\n    * Flash of Light and Holy Light will now work properly with castsequence macros.\n    * Seal of the Crusader: This ability now increases the damage dealt by Crusader Strike by 40%.\n    * Crusader Strike (Retribution) will now properly receive a damage increase from Seal of The Crusader.\n    * Talent: Precision (Ranks 1-3) will no longer improperly display daggers and staves as a weapon class in the tooltip.\n    * Paladins that already have Apprentice Riding skill can now properly learn Summon Warhorse from the trainer. \n\nPriests\n\n    * Fear Ward will no longer be consumed while under the effects of cyclone.\n    * Mana Burn: This spell can no longer trigger effects that require the target to be struck with a critical hit.\n    * Power Word:Shield now has the correct sound associated with it and can no longer be heard from large distances.\n    * Talent: Power Infusion will now consume the correct amount of mana when cast on yourself. \n\nRogues\n\n    * Ability: Blade Flurry: This ability can no longer hit critters as its secondary targets and will now use a proper range calculation for all secondary targets.\n    * Talent: Mutilate (Assassination) will no longer incorrectly appear multiple times in the combat log when used. \n\nShaman\n\n    * Ability: Frostbrand Weapon: Rank 6 damage has been increased very slightly. \n\nWarlocks\n\n    * Drain Soul: Channeling of this spell will now always stop when a player target dies.\n    * Pets: Using a sacrifice effect to kill your own pet will no longer trigger effects that should only occur when killing an enemy. \n\nWarrior\n\n    * Sweeping Strikes: This ability can no longer hit critters as its secondary targets and will now use a proper range calculation for all secondary targets. \n\nPvP\n\n    * Arenas\n          o If a character?s personal rating is more than 150 points below the team rating, they will earn points based on their personal rating instead of the team rating.\n          o If the average personal rating of the players queuing for a game is more than 150 points below the team?s rating, the team will be queued against an opponent matching or similar to the average personal rating. \n\nProfessions\n\n    * All 23-hour profession cooldowns are now 20-hour cooldowns.\n    * All 4-day cooldowns are now 3 days, 20 hours.\n    * Enchanting\n          o Removed the cooldown from Void Shatter.\n          o Void Shatter recipe now correctly requires 375 enchanting. \n    * Engineering\n          o The Engineering supply item Delicate Copper Wire will now properly fit into engineering bags. \n    * Jewelcrafting\n          o Brilliant Glass no longer requires a forge.\n          o Brilliant Glass now has a small chance to make an epic gem.\n          o Quick Dawnstone, Reckless Noble Topaz, Forceful Talasite are now all available at the Quel?danas gem vendor. \n    * Leatherworking\n          o Completing the quest ?The Journey Has Just Begun? will now properly teach how to make an Onyxia Scale Cloak.\n          o Greatly reduced the reagent cost for Glove Reinforcements. Also reduced the skill gain range slightly. \n\nQuests\n\n    * The categories for the quests ?Wanted: Sisters of Torment? and ?Wanted: The Signet Ring of Prince Kael?thas? have been fixed to now properly read as Magister?s Terrace.\n    * The Shadowy Disguise will no longer be applied to druids while they are in Moonkin or Tree of Life form for the quests ?Who Are They??\n    * Jailor Eston and Jailor Marlgen for the quest ?The Rescue? should now respawn more frequently. \n\nDungeons and Raids\n\n    * Black Temple\n          o Illidan will no longer despawn if a raid group wipes during his death speech. \n    * Karazhan\n          o Nightbane?s Charred Earth ability will now properly deal Fire damage. \n    * Magister?s Terrace\n          o Vexallus is no longer immune to taunt on Normal difficulty.\n          o Kael?thas is no longer immune to taunt on Normal difficulty.\n          o Wretched Skulkers, Wretched Husks, and Wretched Bruisers will now reset properly.\n          o Sunblade Imps will now reset properly.\n          o The doors in Heroic Magister?s Terrace will no longer respawn after a soft reset if a boss has already been killed. \n    * Sunwell Plateau\n          o Hellfire will no longer remove Dark Touched in the Eredar Twins encounter. \n    * Tempest Keep: The Eye\n          o Void Reaver?s Arcane orbs now generate combat log entries. \n\nItems\n\n    * Arcane Charges now deal arcane damage.\n    * Abilities and trinkets that trigger after killing an opponent that gives experience or honor will no longer activate after killing mobs during bombing quests.\n    * Battlecast?s Garb should now properly grant pushback resistance in addition to interrupt resistance.\n    * Borderland Fortress Grips have had their stats updated.\n    * Botanist?s Gloves of Growth have had their texture corrected.\n    * Bow of Searing Arrows and Red Whelp Gloves will no longer break crowd control effects.\n    * Brann Bronzebeard?s Lost Letter: This item will no lonber display a damage range in its tooltip.\n    * The Cloak of Swift Mending now has a level requirement (70).\n    * Crusader?s Scaled Battlegear: Tooltip spelling corrected.\n    * Elixir of Demonslaying: This elixir now grants ranged attack power against demons as intended.\n    * Goblin Jumper Cables are no longer a trinket item.\n    * Hazza?rah?s Charm of Healing Haste rating reduced.\n    * Items that enchant other items no longer have tradeskill requirements (Mithril Spurs, Shield Spikes, Weapon Chains, etc.).\n    * The Helm of Fire has had its casting range reduced.\n    * The Magic Candle has had its casting range reduced.\n    * Many items sold by Consortium vendors are now bind on pick up: Formula: Enchant Weapon- Major Striking, Design: Delicate Blood Garnet, Design: Shifting Shadow Draenite, Design: Lustrous Azure Moonstone, Design: Thick Golden Draenite.\n    * Many items sold by Aldor reputation vendors are now bind on pick up: Design: Gleaming Golden Draenite, Design: Royal Shadow Draenite.\n    * Many items sold by the Shattered Sun quartermaster are now bind on pick up: Naaru Ration, Design: Ember Skyfire Diamond.\n    * The Lower City reputation item, Recipe: Flask of Chromatic Resistance, is now bind on pick up.\n    * Most Main-Hand weapons are now One-Hand weapons.\n    * Naturalist?s Preserving Cinch have had their stats updated.\n    * Nightfall now has a chance to fail on targets over level 60.\n    * Ravager: Judgements will no longer auto-refresh and break the effect from this item while its effect is active.\n    * Reins of the Black War Elekk spell and buff now correspond to the item name.\n    * Renataki?s Charm of Trickery has had its energy reduced.\n    * Rocket Boots Xtreme and Rocket Boots Xtreme Lite now properly share the same cooldown.\n    * The Romantic Picnic Basket will now display the blanket properly.\n    * Shard of Azzinoth no longer shares any cooldown with Shaman elemental totems.\n    * The socket bonus modifiers of some items will now properly display the bonus healing.\n    * The reduced cooldown of Shaman Nature?s Swiftness provided by the 4 piece set bonus from the Seer?s Ringmail Battlegear PvP armor will now apply properly.\n    * Shattered Sun Pendant of Might: The triggered effect from this item will no longer break Scattershot or other crowd-controlling affects. The visual on the Scryer version has been updated.\n    * Shifting Naaru Silver: Using this item no longer puts players into combat.\n    * Silithyst Dust: The bonus from turning this item in no longer works for players above level 63.\n    * The Skyshatter Helmet?s gem socket bonus will now properly reflect the plus damage in the tooltip.\n    * Shadowsong Panther will no longer prematurely despawn.\n    * Talasite Owl: This trinket will now properly restore full mana as described.\n    * Ten Storms Set: The Chain Heal bonus from this set has been reduced by 5%.\n    * Troll Male off-hand items are now the same size as the main hand item.\n    * Tauren weapons while sheathed have had their graphic readjusted to their pre-patch (2.4.0) state.\n    * The Winterfall Firewater buff is no longer dispellable.\n    * Wushoolay?s Charm of Nature Haste rating has been reduced. \n\nUser Interface\n\n    * Black Lotus will now show up under the Herb subcategory in the auction house.\n    * Primal Nethers will now show up under the Materials subcategory in the auction house.\n    * Mailboxes can now be tracked on the minimap.\n    * For additional notes on Lua and XML changes please visit the UI &amp; Macros Forum. \n\nWorld Environment\n\n    * Creature versions of the Polymorph spell no longer heal the affected target.\n    * The dragons in Blade?s Edge Mountains will no longer instantly knock you off your mount. \n\nMac\n\n    * Fixed a bug causing ATI kernel panics; all spell effects should now be visible.\n    * Weather effects are again visible on systems with ATI 2x00 graphics such as aluminum iMac.\n    * Fixed a bug that precluded use of the FireWire iSight microphone with voice chat.\n    * Symlinks can be used again for Interface and WTF folders and subfolders.\n    * Cinematics playback is working again. \n\nBug Fixes\n\n    * Fixed an issue where secondary sound effects would not work with the Use Hardware option enabled in the Sound options of the User Interface.\n    * Fixed an issue where attempting to use some instant cast spells with Auto-Dismount in Flight checked in the interface would fail.\n    * Items that have multiple charges will now properly display the amount of charges.\n    * Fixed an issue where chain damage spells were chaining to critters.\n    * Female Draenei horns will now correctly protrude through certain plate helms.\n    * The Vengeful Gladiator?s Rifle will now play the proper sound when used.\n    * The Cursed Vision of Sargeras now gives the buff, ?Sense Demons? which can be canceled normally. Additionally hunters and druids are able to track two things at once while using the item.\n    * It is no longer possible for pets to get stuck in place after exiting the Spectral Realm in the Kalecgos encounter.\n    * Blood Elf Priest: Consume Magic will now require the buff to be active in order to work properly.\n    * Undead and Blood Elf Priest: Touch of Weakness will now properly reduce the melee damage of the attacker.\n    * Fixed an issue where some spells had extraneous Floating Combat Text messages when using the Auras option.\n    * Fixed an issue where sometimes debuff icons on a target did not scale properly to indicate the spells had been cast by you.\n    * Ritual of Souls (Warlock) and Ritual of Refreshment (Mage) will no longer be placed on cooldown without having completed the summon.\n    * Looting a boss while a player is outside of the instance will no longer cause the corpse to despawn in 2 minutes if the player still has loot on the corpse.\n    * Whirlwind now has the correct sound associated with it. ","torrent":{"xt":"urn:btih:948a45579137a9f0b8560255513807d195949664","amp;dn":"WoW-2.4.1.8125-to-2.4.2.8278-enGB-patch.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"948a45579137a9f0b8560255513807d195949664","infoHashBuffer":{"type":"Buffer","data":[148,138,69,87,145,55,169,240,184,86,2,85,81,56,7,209,149,148,150,100]},"announce":[],"urlList":[]}}