{"title":"Seal - Seal (1991) (MP3-EAC-320 kBs)","uid":4216130,"size":125447248,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:949e3ed4e85ca7d0cfaf55985b3e064711820728&amp;dn=Seal+-+Seal+%281991%29+%28MP3-EAC-320+kBs%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigsimon","files":14,"time":1212349045,"description":"Music : Pop : MP3/Over 256Kbps\n\n\n\n\n\n\nSeal - Seal (1991) (MP3-EAC-320 kBs)\n\n\n\n\n\n\nSeal Biography From allmusic.com\n\n\nBiography by Stephen Thomas Erlewine\n\nSeal emerged from England&amp;#039;s house music scene in the early &amp;#039;90s to become the most popular British soul vocalist of the decade. Although his earliest material still showed signs of acid house, by the mid-&amp;#039;90s he had created a distinctive fusion of soul, folk, pop, dance, and rock that brought him success on both sides of the Atlantic.\n\nThe son of Nigerian and Brazilian parents, Seal was raised in England. After graduating with an architectural degree, he took various jobs around London, including electrical engineering and designing leather clothing. After a while, he began singing in local clubs and bars. He joined an English funk band called Push, touring Japan with the band in the mid-&amp;#039;80s. When he was in Asia, he joined a Thailand-based blues band. After a short time with that group, he traveled throughout India on his own.\n\nUpon returning to England, Seal met Adamski, a house and techno producer who had yet to make much of an impression within the U.K. Seal provided the lyrics and vocals for Adamski&amp;#039;s &quot;Killer,&quot; which became a number one hit in 1990. After &quot;Killer&quot; became a hit, Seal signed a solo record contract. He recorded his eponymous debut album with Trevor Horn, who had previously worked with ABC, Frankie Goes to Hollywood, and the Buggles. The first single pulled from the album, &quot;Crazy,&quot; became a number 15 hit in the U.K. and reached number seven in America upon its release in 1991. Seal was also a success, reaching number 24 in America and selling over three million copies around the world.\n\nAfter the success of his debut, Seal took three years to complete his second album. In between the two records, he appeared on the Jimi Hendrix tribute album Stone Free, singing on Jeff Beck&amp;#039;s version of &quot;Manic Depression.&quot; In the summer of 1994, he released his second album, which was also titled Seal. Preceded by the American Top 40 hit &quot;Prayer for the Dying,&quot; the album did well upon its release, peaking at number 20 and selling a million copies by the spring of 1995, but it didn&amp;#039;t really take off until a year after its release, when &quot;Kiss from a Rose&quot; was featured on the soundtrack to Batman Forever. &quot;Kiss from a Rose&quot; became a number one pop single in America and spent a total of 12 weeks at the top of the adult contemporary charts; the single spent a total of 45 weeks on the adult contemporary charts.\n\nThe success of &quot;Kiss from a Rose&quot; sent its parent album, Seal, into multi-platinum status; two years after its original release, the album had sold over four million copies in the U.S. alone. Human Being hit the shelves in 1998, with Seal IV following five years later. The career-spanning Best: 1991-2004 appeared in October 2004 with the live CD/DVD combo Live in Paris following a year later. In 2007, Seal returned with the studio full-length System, which featured a duet with his wife, Heidi Klum, whom he married in 2005.\n\n\n\n\n\n\nCD Pressing Information\n\n\n\nLabel: ZTT\nCatalog#: 9031-74557-2.2\nFormat: CD, Album\nCountry: Germany\nReleased: 1991\nGenre: Electronic\nStyle: Downtempo, Synth-pop\n\n\n\n\nCredits\n\n\n\nProducer - Trevor Horn\n\n\n\n\nNotes\n\n\nThis is the alternate version of the album with different versions of Wild and Violet and a longer version of Crazy. Released in Germany and USA, and later replacing the UK version.\n\n\n\n\nSeal album review from allmusic.com\n\n\n\nReview by MacKenzie Wilson\n\nLondon singer/songwriter Seal certainly made a name for himself with his eponymous debut despite the comparison to fellow London mate, the raspy soul Terence Trent D&amp;#039;Arby. But Seal is more relaxed, and his craftsmanship is delicate and well defined. Lyrical depictions are light, songwriting is personal, and production credits are most impressive. With star-studded work from both Trevor Horn (Tina Turner, the Art of Noise, Rod Stewart) and Trevor Rabin (Yes, John Miles), Seal is surely a critical hit. Becoming a mainstream radio mainstay for the summer of 1991, the single &quot;Crazy&quot; carried heavy notoriety for Seal and instantly made him a household name. His collaborative effort with Adamski for &quot;Killer&quot; was a massive club hit thanks to its Hi-NRG strength, but house elements are showcased other album tracks such as &quot;The Beginning.&quot; Seal is not necessarily a dance innovator, but he makes for a select crossover artist with impeccable talent worthy of heavy acclamation and critical recognition. The general mood captured on his debut album is refreshing for the early-&amp;#039;90s mediocrity of post-hair metal and manufactured synth bands. His music was a major force throughout the decade and well into the new millennium. With Trevor Horn at his side, it&amp;#039;s undeniable. Together they go for exactly what Seal is looking for: the beauty, desire, and simplicity in creating a new sound. Seal is the face and Horn is the face behind it all.\n\n\n\n\n\n\n\n\nTrack List\n\n\nSeal - Seal (1991)\n\n01. The Beginning 05:41\n02. Deep Water 05:57\n03. Crazy 05:57\n04. Killer 06:22\n05. Whirlpool 03:58\n06. Future Love Paradise 04:20\n07. Wild 05:28\n08. Show Me 05:59\n09. Violet 08:30\n\n\n\n\n\n\n\n\n\n\n\nENJOY ..........................................................................\n\n\n\n\n","torrent":{"xt":"urn:btih:949e3ed4e85ca7d0cfaf55985b3e064711820728","amp;dn":"Seal+-+Seal+%281991%29+%28MP3-EAC-320+kBs%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"949e3ed4e85ca7d0cfaf55985b3e064711820728","infoHashBuffer":{"type":"Buffer","data":[148,158,62,212,232,92,167,208,207,175,85,152,91,62,6,71,17,130,7,40]},"announce":[],"urlList":[]}}