{"title":"Don Gato y su pandilla","uid":12732636,"size":2400368535,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:94e68a73a7ec54456d4badf52d4d8f9bf812d171&amp;dn=Don+Gato+y+su+pandilla&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dieflut","files":30,"time":1447144463,"description":"Top Cat, conocido en español como Don Gato y su pandilla o simplemente como Don Gato, es una serie animada para la TV de apenas 30 episodios, ideada y producida por Hanna-Barbera en 1961 y emitida en el horario estelar en la cadena ABC de los Estados Unidos a partir del 27 de septiembre de 1961 hasta el 8 de abril de 1962.\r\nEl protagonista, Don Gato, es el líder de una pandilla de gatos callejeros en Manhattan: Panza (Fancy-Fancy), Espanto (Spook), Benito B. Bodoque y B. (Benny the Ball), Demóstenes (The Brain) y Cucho (Choo-Choo). Por su parte, el Oficial Carlos Matute (Officer Dibble), policía del barrio, trata infructuosamente de atraparlos y llevarlos a la cárcel. Uno de los motivos para el arresto era que Don Gato trataba de utilizar un teléfono como propio pero que era propiedad de la policía.\r\n\r\n\r\nTop Cat, known in Spanish as Don Gato y su pandilla, or simply Don Gato, is an animated TV series only 30 episodes, designed and produced by Hanna-Barbera in 1961 and aired in prime time on ABC from the United States from September 27, 1961 until April 8, 1962.\r\nThe protagonist, Don Gato, is the leader of a gang of feral cats in Manhattan: Panza (Fancy-Fancy) Espanto (Spook), Benito B. Bodoque (Benny the Ball), Demosthenes (The Brain) and Cucho (Choo-Choo). Meanwhile, Officer Carlos Matute (Officer Dibble) neighborhood police unsuccessfully tries to catch them and take them to jail. One reason for the arrest was that Don Gato was to use a phone as his own but that was owned by the police. \r\n\r\n30 caps.\r\n\r\nMp4 540 X 360\r\n    320 X 240","torrent":{"xt":"urn:btih:94e68a73a7ec54456d4badf52d4d8f9bf812d171","amp;dn":"Don+Gato+y+su+pandilla","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"94e68a73a7ec54456d4badf52d4d8f9bf812d171","infoHashBuffer":{"type":"Buffer","data":[148,230,138,115,167,236,84,69,109,75,173,245,45,77,143,155,248,18,209,113]},"announce":[],"urlList":[]}}