{"title":"Episode Six - Love, Hate, Revenge (pre-Deep Purple) (2005) [mp3@","uid":4227422,"size":236332364,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:95038f15f9e2d7d0362f601b0c3de6ac31268d94&amp;dn=Episode+Six+-+Love%2C+Hate%2C+Revenge+%28pre-Deep+Purple%29+%282005%29+%5Bmp3%40&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"zibbik","files":47,"time":1212890695,"description":"Original Release Date: May 2, 2005 \nNumber of Discs: 2 \nNumber of Tracks: 44\nTT: 2:01:29\nSize: 222 MB\nLabel: Castle \n\n\n\nDisc 1 - THE SINGLES, A&amp;#039;s &amp; B&amp;#039;s: \n\n1. Put Yourself In My Place \n2. That&amp;#039;s All I Want \n3. I Hear Trumpets Blow \n4. True Love Is Funny That Way \n5. Here, There And Everywhere \n6. Mighty Morris Ten \n7. Love, Hate, Revenge \n8. Baby, Baby, Baby \n9. Morning Dew \n10. Sunshine Girl \n11. I Can See Through You \n12. When I Fall In Love \n13. Little Ones \n14. Wide Smiles \n15. Lucky Sunday \n16. Mr Universe \n17. Mozart Versus The Rest \n18. Jak D&amp;#039;or \n19. Sheila Carter &amp; Episode Six - I Will Warm Your Heart \n20. Sheila Carter &amp; Episode Six - Incense \n21. Neo Maya - I Won&amp;#039;t Hurt You \n22. Neo Maya - U.F.O. \n\nDisc 2 - STUDIO OUTTAKES, DEMO&amp;#039;S &amp; RARITIES: \n\n1. Love, Hate Revenge - US Single Version \n2. The Way You Look Tonight - Outtake \n3. My Little Red Book - Outtake \n4. Plastic Love - Outtake \n5. Time And Motion Man - Outtake \n6. Only Lonely People - Outtake \n7. Zip A Dee Doo Dah - Demo - Previously Unreleased \n8. Cottonfields - Demo - Previously Unreleased \n9. My Babe - Demo \n10. Love Is A Swinging Thing - Demo \n11. Steal Your Heart Away - Demo \n12. Walking To New Orleans - Demo - Previously Unreleased \n13. Let The Four Winds Blow - Demo - Previously Unreleased \n14. Mozart Versus The Rest - Live - Previously Unreleased \n15. Him Or Me - Live - Previously Unreleased \n16. A Hazy Shade Of Winter - Live - Previously Unreleased \n17. Monster In Paradise - Live - Previously Unreleased \n18. Orange Air - Live - Previously Unreleased \n19. The Castle - Live - Previously Unreleased \n20. Slow Down - Live - Previously Unreleased \n21. I Am The Boss - Live - Previously Unreleased \n22. Morning Dew - Live - Previously Unreleased \n\n\nDISC ONE : \n\nSanctuary&amp;#039;s new Episode Six double CD &amp;#039;Love, Hate, Revenge&amp;#039; is an upgraded and expanded reissue of Sequel&amp;#039;s excellent 1991 &amp;#039;The Complete Episode Six&amp;#039; collection. Disc one comprises the band&amp;#039;s singles, while disc two bulks up the original bonus tracks from six to twenty-two. \n\nFor those unfamiliar with Episode Six, they were Ian Gillan and Roger Glover&amp;#039;s pre-Deep Purple band, with whom they released nine singles between 1966 and 1969, all of which somehow fell short of chart success. It all ended when Ritchie Blackmore, Ian Paice and Jon Lord caught one of their London shows at the behest of drummer Mick Underwood, and poached both men for Deep Purple. Episode Six attempted to continue, but after Mick Underwood split away with new members John Gustafson and Pete Robinson to form Quatermass, the band sank into obscurity until their increasingly rare catalogue began to be snapped up by curious Deep Purple fans and collectors of Sixties pop music. What they found often hinted at Messrs Gillan &amp; Glover&amp;#039;s future successes, and baffled that the band had never broken into the big time. \n\n? However, it is easy to see why Episode Six&amp;#039;s first single &quot;Put Yourself In My Place&quot; (from January 1966) failed to set the charts alight. It&amp;#039;s a rather average Hollies song, played in lacklustre fashion by session musicians, with Episode Six only allowed to contribute the vocals. The B-side &quot;That&amp;#039;s All I Want&quot; is much better, rattling along very nicely, and as a bit of history it&amp;#039;s also Roger Glover&amp;#039;s first recorded composition. \n\n? &quot;I Hear Trumpets Blow&quot; followed in April 1966, and is a piece of pure adulterated pop. GIllan&amp;#039;s lead vocal is nice, but the whole thing is a bit too jaunty for it&amp;#039;s own good. The B-side &quot;True Love Is Funny That Way&quot;, written by the group&amp;#039;s drummer Harvey Shield, is superior. \n\n? &amp;#039;Here There &amp; Everywhere&quot; from August 1966 is a beautiful reproduction of the Paul McCartney classic, with Ian Gillan putting in a wonderful performance. Glover&amp;#039;s B-side &quot;Mighty Morris Ten&quot; is a lighthearted send-up of The Beach Boys &amp;#039;Shut Down&amp;#039; style car songs. Fun, but definitely a B-side. \n\n? &amp;#039;Love, Hate, Revenge&amp;#039; was released in January 1967. One year on from their first single Episode Six proved their versatility with this classy piece of psychedelic pop. The UK version had a chanted middle section, bizarrely replaced in the USA by an electronic drone. The US version is included on disc 2. Another string to Episode Six&amp;#039;s bow was an ability to perform strong r&amp;b, shown here by the enjoyable B-side &amp;#039;Baby, Baby, Baby&amp;#039;. \n\n? &amp;#039;Morning Dew&amp;#039; (June 1967) is a great version of the Tim Rose classic, with Gillan belting in superbly on the chorus. B-side &amp;#039;Sunshine Girl&amp;#039;, written and sung by Roger Glover, is frankly a bit crap but still fun! \n\n? &amp;#039;I Can See Through You&amp;#039; (October 1967) is one of Episode Six&amp;#039;s finest moments, and one of the best songs of the sixties. Roger Glover&amp;#039;s first A-side, it&amp;#039;s a progressive mini-masterpiece exploding with ideas, including elements of Sgt.Pepper and The Who&amp;#039;s &amp;#039;I Can See For Miles&amp;#039; . Many other bands would have folded under the disappointment of it failing to become a hit, but Episode Six continued. \n\nThe band&amp;#039;s management always seemed to prioritise their jack-of-all-trades cover band reputation to keep their busy gigging and BBC radio schedule ticking along. Any hope of a real push in any one direction rested on a single taking off in the charts. Their singles output emphasize the point. For me, it says it all that the B-side &amp;#039;I Can See Through You&amp;#039; was a schmaltzy cover of Nat King Cole&amp;#039;s &amp;#039;When I Fall In Love&amp;#039;. \n\n? &amp;#039;Little One&amp;#039; (February 1968) involved a halfhearted attempt at gaining the band some &amp;#039;cool&amp;#039;, with their name changed to the more underground sounding &amp;#039;The Episode&amp;#039;. However the A-side is a straight pop cover, aimed at no market in particular and consequently falling between a number of stools. B-side &amp;#039;Wide Smiles&amp;#039; is Gillan and Glover&amp;#039;s first joint composition to be recorded. It&amp;#039;s jaunty &amp;#039;doo-be-boop-de&amp;#039; style complete with flutes belies GIllan&amp;#039;s attack on people in the music industry. His disillusionment is understandable, but the band still had two more shots left at the charts. \n\n? Gillan &amp; Glover&amp;#039;s &amp;#039;Mr.Universe&amp;#039; (October 1968) was the belated follow-up to &amp;#039;I Can See Through You&amp;#039;, with great vocals (including Gillan&amp;#039;s first recorded scream), and marvelous lyrics, guitar, arrangement, everything... However, it was only a B-side for the big production pop treacle of &amp;#039;Lucky Sunday&amp;#039;. \n\n? And so to the last Episode Six single. Reacting to feedback from a BBC radio performance of guitarist Tony Leander&amp;#039;s tremendous &amp;#039;Mozart Vs The Rest&amp;#039; instrumental, the track was rushed out as a single in February 1969; though not fast enough. Despite steady sales the charts remained unmolested. A shame, as it&amp;#039;s a great little single, complete with the ultra-tight instrumental &amp;#039;Jak D&amp;#039;Or&amp;#039; on the flip-side. \n\nAnd that was that; a few months later, Gillan and Glover accepted an offer to join Deep Purple. \n\n? One of the halfhearted tactics tried towards the beginning of Episode Six&amp;#039;s recording career was to launch singles as solo efforts. Only two were completed. Sheila Carter&amp;#039;s &amp;#039;I Will Warm Your Heart&amp;#039; is a beautifully sung slowie, although ironically it sounds a bit hurried, while the B-side &amp;#039;Incense&amp;#039; is a ghastly sub-gospel item with Ian GIllan on organ. Graham Carter&amp;#039;s &amp;#039;I Won&amp;#039;t Hurt You&amp;#039;, issued as Neo Maya, is a lost classic, weird but compulsive. Its B-side &amp;#039;UFO&amp;#039; is just a list of UFO sightings read out over a drum pattern! \n\nDISC TWO : \n\nDisc two is given over to &amp;#039;rarities, demos and live recordings&amp;#039;. The sound quality is variable, the nine live tracks (grouped together at the end of the CD) could be a bit lo-fi for some ears. Of the 22, six studio demos were originally on the 1991 Sequel collection, 3 others are repeated from Purple Records&amp;#039; &amp;#039;Cornflakes &amp; Crazyfoam&amp;#039; double CD (1965 demos of &amp;#039;Love Is A Swinging Thing&amp;#039; , &amp;#039;Steal Your Heart Away&amp;#039;, and the US version of &amp;#039;Love, Hate, Revenge&amp;#039;), and the rest are previously unreleased. \n\n? There are five demo tracks from Episode Six&amp;#039;s first studio session in 1964, all of which show the band already a highly professional and practiced sounding outfit. &amp;#039;My Babe&amp;#039; (first released on the Sequel CD) is interesting in that it features Andy Ross, Ian Gillan&amp;#039;s predecessor in the group, busy doing an Elvis voice for all he&amp;#039;s worth. However he&amp;#039;s plainly not the lead singer, but just part of the ensemble. The other &amp;#039;64 demos are previously unreleased, including a harmony version of &amp;#039;Cottonfields&amp;#039; which precedes the Beach Boys version by four years, and a rocky take of &amp;#039;Zip-a-Dee-Doo-Dah&amp;#039; which really works (no, honestly!). \n\n? The five out-takes from 1966-67 originally appeared on the Sequel CD, but deserve a mention for being every bit as good as the band&amp;#039;s singles from the time. &amp;#039;The Way You Look Tonight&amp;#039; is a strong harmony-based rendition similar in style to &amp;#039;When I Fall In Love&amp;#039;, &amp;#039;Time And Motion Man&amp;#039; from 1967 is a strange listen, all off-centre harmonies and melody, the sort of thing that you&amp;#039;d either love or be irritated by. It&amp;#039;s intrinsically not catchy, but Episode Six manage to make it just that. Of Roger Glover&amp;#039;s two compositions &amp;#039;Plastic Love&amp;#039; is disappointing plastic psychedelia, while &amp;#039;Only Lonely People&amp;#039; is a very powerful, instant classic. Period. It simply has to be heard. \n\n? The live tracks, mostly from 1968, are all previously unreleased, and include the Gillan/Glover compositions &amp;#039;I Am The Boss&amp;#039; and &amp;#039;Monster In Paradise&amp;#039;, and strong covers of &amp;#039;Slow Down&amp;#039;, &amp;#039;Morning Dew&amp;#039;, &amp;#039;Orange Air&amp;#039;, &amp;#039;Hazy Shade Of Winter&amp;#039; (sounding like a proto &amp;#039;Into the Fire&amp;#039; on this occasion), &amp;#039;Him Or Me&amp;#039; and &amp;#039;The Castle&amp;#039;. \n\nThe only real absentee is the film soundtrack song &amp;#039;Gentleman Of The Park&amp;#039;, which is on &amp;#039;Cornflakes &amp; Crazyfoam&amp;#039;. So, for anyone wanting the essential Episode Six in one purchase, &amp;#039;Love, Hate, Revenge&amp;#039; is the one to go for. If you wish to explore further out-takes and live tracks by the band, I&amp;#039;d recommend &amp;#039;Cornflakes &amp; Crazyfoam&amp;#039;. Between them they are the last word on a great band. \n\nreview: Mark Ainsworth ","torrent":{"xt":"urn:btih:95038f15f9e2d7d0362f601b0c3de6ac31268d94","amp;dn":"Episode+Six+-+Love%2C+Hate%2C+Revenge+%28pre-Deep+Purple%29+%282005%29+%5Bmp3%40","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"95038f15f9e2d7d0362f601b0c3de6ac31268d94","infoHashBuffer":{"type":"Buffer","data":[149,3,143,21,249,226,215,208,54,47,96,27,12,61,230,172,49,38,141,148]},"announce":[],"urlList":[]}}