{"title":"The Deltas-Boogie Disease(1981)","uid":4173396,"size":34534687,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:96012b5b5bfc49699ab67138f50ea6d6438984f9&amp;dn=The+Deltas-Boogie+Disease%281981%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"crepesdrapes","files":17,"time":1209998072,"description":"The Deltas - Boogie disease\nThe Deltas - Boogie disease NERCD002The Deltas - wild rockabilly blues from London.\n \n1.Boogie disease 2.As you like it 3.Blues in the bottle 4.Honey babe 5.Victim of my love 6.London girls 7.Who 8.That ain&amp;#039;t your business 9.Raging sea 10.Heart attack 11.Temperature 12.Pie&amp;#039;n&amp;#039;mash 13.Moonshine 14.Nine below zero 15.Fashion train 16.Long black train\nThe Deltas\nThis band was one of the WILDEST acts in the early Eighties. The Deltas were a sort of &amp;#039;psycho-blues-rockabilly&amp;#039; outfit. Hear the passion on Steve Bongo&amp;#039;s vocals, thrill to the slap of Little John&amp;#039;s dog-house bass and tremble to the twang and boom of Captain Marvel&amp;#039;s guitar! This was recorded at the height of their powers....\n \n&quot;What we have here is raw, uncompromising home grown rockabilly, performed with an economy of style that borders, at times, on the inept ........ you begin to realise that a combination of enthusiasm and interesting material are at the nub of the matter, then appearance (real gone cats) and finally, on stage, unbridled frenzy, all combining to justify the whole. If you like it rough&amp;#039;n&amp;#039;ready, this is grist for your mill.&quot; Tony Martin 1981\n \n&quot;Rumored to be one of the wildest bands of the early 80&amp;#039;s, The Deltas play their own unique brand of Rockabilly with a hint of blues influence. &amp;#039;Boogie Disease&amp;#039; was recorded in the height and prime of The Deltas reign over the early 80&amp;#039;s Rockabilly Scene. The Deltas are still gigging and playing around. Rumor even has it some new studio stuff might be in the works. Let&amp;#039;s hope so! This is a definite classic and early release by one of the best Rockabilly bands to show its face in the 1980&amp;#039;s! 16 great tracks along with Nervous Records&amp;#039; great packaging make this a MUST addition to anyone&amp;#039;s collection!&quot; Reviewed by The Psycho Avenger 2002\n \n&quot;A very wild Rockabilly trio from the UK. Their first issue was a single with &amp;#039;Heart Attack&amp;#039; backed with &amp;#039;Spellbound&amp;#039;. This is the wildest, craziest, insanest Rockabilly that you&amp;#039;ve ever listened to!! Their raw energy in front of a live audience is hard to imagine by listening to an album. That&amp;#039;s why they included a live track (&amp;#039;Long Black Train&amp;#039;) in their CD &amp;#039;Boogie Disease&amp;#039; (NERCD002), still available from Nervous Records. This album was issued back in 1981, but it&amp;#039;s still one of the wildest records that I&amp;#039;ve got. If you&amp;#039;re lucky enough, you can still catch &amp;#039;em live somewhere. Go get this album!, you won&amp;#039;t regret it.&quot; The Neo-Rockabilly Hall Of Fame\n\t","torrent":{"xt":"urn:btih:96012b5b5bfc49699ab67138f50ea6d6438984f9","amp;dn":"The+Deltas-Boogie+Disease%281981%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96012b5b5bfc49699ab67138f50ea6d6438984f9","infoHashBuffer":{"type":"Buffer","data":[150,1,43,91,91,252,73,105,154,182,113,56,245,14,166,214,67,137,132,249]},"announce":[],"urlList":[]}}