{"title":"THE LIES THAT LED TO WAR THE 5TH ESTATE March 2008 Iraq","uid":4097828,"size":692045828,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:960bee892e9bccb90e87c73eaed059a7c4e1d47c&amp;dn=THE+LIES+THAT+LED+TO+WAR+THE+5TH+ESTATE+March+2008+Iraq&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nambi","files":1,"time":1206410716,"description":"GOOD DOC!!\n &lt;a href=&quot;\nhttp://www.cbc.ca/fifth/lies/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.cbc.ca/fifth/lies/&lt;/a&gt;\n\nTHE LIES THAT LED TO WAR\n\nSince the US-led invasion four years ago, the fifth estate has covered Iraq and the war on terror from virtually every angle--the military, media, intelligence, politics--revealing aspects of the story that you didn&amp;#039;t find anywhere else. Now, as the White House warns about the latest threat in the region, this time from Iran, it&amp;#039;s worthwhile looking back to examine the deception, suspect intelligence, even lies, that convinced the world of the rightness of targeting Saddam Hussein.\nThe political decisions behind the invasion\nThe Lies That Led To War is drawn from these stories: In 2003&amp;#039;s The Forgotten People, the fifth estate examined the human rights arguments used to make a case for war. We looked at the sale of technology by the US to Iraq during the 1980&amp;#039;s despite the fact that this equipment could be, and was used eventually, in military operations by Saddam Hussein against Kurdish civilians. After the gassing of the Kurds in 1988, American business with Iraq actually increased.\n\nIn Act of Faith which aired that same year, the fifth estate examined how George Bush and Tony Blair struck a deal that would lead to the invasion of Iraq. It was a deal struck while UN diplomats worked to avert conflict in the weeks and months leading up to March 19, 2003.\n\nIn the widely acclaimed Conspiracy Theories and the Unauthorized Biography of Dick Cheney, which aired in 2003 and 2004 respectively, we looked at intelligence failures leading up to 9/11, Dick Cheney&amp;#039;s power within the White House and his Halliburton connections, as well as the links between the Bush family, the Saudi Royal family and the Bin Ladens.\nSelling the war in Iraq\nIn 2005&amp;#039;s Sticks and Stones, we turned our attention to the American media and how they covered the ongoing war in Iraq, public dissent, as well as the increasingly hostile tone between left and right in American discourse.\n\nNow, The Lies That Led To War provides context to the events of the previous six years, showing how political, diplomatic, media spin ? which sometimes crossed the line into outright lies - have been used by the those in power to further their own agendas.","torrent":{"xt":"urn:btih:960bee892e9bccb90e87c73eaed059a7c4e1d47c","amp;dn":"THE+LIES+THAT+LED+TO+WAR+THE+5TH+ESTATE+March+2008+Iraq","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"960bee892e9bccb90e87c73eaed059a7c4e1d47c","infoHashBuffer":{"type":"Buffer","data":[150,11,238,137,46,155,204,185,14,135,199,62,174,208,89,167,196,225,212,124]},"announce":[],"urlList":[]}}