{"title":"12-Pigi y sus amigos.","uid":4193594,"size":209725440,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:96a8b11d5fda798f60e11896fc1bf18789e0d6ef&amp;dn=12-Pigi+y+sus+amigos.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"anikuni","files":1,"time":1211100054,"description":"\\&quot;Pigi y sus amigos\\&quot;, por su parte, pretende desarrollar valores como la amistad, resolver problemas de forma creativa o incrementar las habilidades de comunicaciÃƒ?Ã‚Â³n de los mÃƒ?Ã‚Â¡s pequeÃƒ?Ã‚Â±os, a travÃƒ?Ã‚Â©s de las aventuras del cerdito Pigi Winks y de sus amigos Dannan y Ferny. Dirigida a niÃƒ?Ã‚Â±os y niÃƒ?Ã‚Â±as de entre 4 y 7 aÃƒ?Ã‚Â±os, ha conseguido mÃƒ?Ã‚Âºltiples reconocimientos y premios a nivel internacional, como seis premios Emmy, un premio Humanitas y el galardÃƒ?Ã‚Â³n Parent\\&amp;#039;s Choice. \n\n01-El SalmÃƒ?Ã‚Â³n de la Sabiduria. \nPigi estÃƒ?Ã‚Â¡ a punto de afrontar un importante examen y le da rabia la sensaciÃƒ?Ã‚Â³n de perder una semana entera estudiando. Entonces decide atrapara al legendario \\&amp;#039;Salmon del conocimiento\\&amp;#039;, un archiconocido pez que puede ayudarle a aprobarlo. \n\n02-Los Raloo Rockers. \nLos Raloo Rackers quieren ir a Dublin a una audiciÃƒ?Ã‚Â³n para el espectÃƒ?Ã‚Â¡culo Uncle Buck\\&amp;#039;s Variety Express, pero primero deben trabajar muy duro y ganar dinero para pagarse el viaje y estar preparados para acutar. \n\n03-Amigos nuevos. \nPigi y sus mejores amigos Ferny y Danan se han marcado el reto de abrir sus mentes y sus corazones a nuevos amigos cuando el Sr. Hornsby les pide hacer un proyecto en equipo con compaÃƒ?Ã‚Â±eros de clase que no conocen muy bien. \n\n04-Una historia verdadera. \nLos niÃƒ?Ã‚Â±os se ponen a escribir historias periodÃƒ?Ã‚Â­sticas y Pigi y Ferny acaban inventando en su lugar excitantes aventuras; pero Dannan sabe que las noticas periodisticas son verdaderas y que puede influir en la forma de pensar de la gente. \n\n05-Una tarta deliciosa. \nPigi, Ferny, Dannan y Molly no pueden resistirse a comer uno de los pasteles reciÃƒ?Ã‚Â©n horneados de la Sra. Vinks... incluso aunque ella les haya avisado de que estÃƒ?Ã‚Â¡ bajo mÃƒ?Ã‚Â­nimos. \n\n06-Toda la noche. \nEl Sr. Winks va a ir a pescar y Pigi y sus amigs desean fervientemente irse con Ãƒ?Ã‚Â©l. Papa no piensa que esten preparados para el viaje, asÃƒ?Ã‚Â­ que los tres amigos se proponen demostrar que no solo estÃƒ?Ã‚Â¡n prearados sino deseosos. \n\n07-El gnomo rojo. \nPigi y sus colegas intentan atrapar a un Fir Darning, en elfo particularmente escurridizo. Mientras le persiguen, rompen una ventana e intentan echarle la culpa al duendecillo. \n\n08-Ãƒ?Ã‚Â¿Por quÃƒ?Ã‚Â© tronan las campanas? \nHÃƒ?Ã‚Â©ctor le gasta una proma a Pigi, Dannan y Ferny, pero a ellos no les hace ninguna gracia. Siguiendo la recomendaciÃƒ?Ã‚Â³n de Don Toro, deciden expliarle a Hector que las bromas no son divertidas cuando te las hacen a tÃƒ?Ã‚Â­. \n\n09-No se admiten chicas. \nCuando Pigi y Ferny se apuntan a un club de cuenta-cuentos exclusivo para chicos, Dannan se siente triste por haber sido excluida del grupo; pero pronto se dan cuenta de que la vida con ella es mÃƒ?Ã‚Â¡s divertida. \n\n10-El huevo de dragÃƒ?Ã‚Â³n. \nPigi, Ferny y Dannan rescatan un huevo desconocido. Ellos deciden que se trata del huevo de un dragÃƒ?Ã‚Â³n. Entonces, elaboran todo tipo de tretas para mantnerlo seguro; pero cuando la criatura sale del huevo, resulta no ser tan simpatica. \n\n11-Pigi es mayor. \nDespuÃƒ?Ã‚Â©s de quejarse de las normas que le imponen sus padres, Pigi desea ser mayor para hacer lo que quiera. Cuando su padre se tuerce el tobillo y Ãƒ?Ã‚Â©l se queda a cargo de la granja, se da cuenta de que no es tan divertido ser adulto. \n\n12-Dannan baila una giga. \nCuando la abuela de Dannan enseÃƒ?Ã‚Â±a a los alumnos de su clase a bailar ella demuestra ser una entusiasta estudiante de danza; pero pronto se da cuenta de que no tiene talento para el baile, Entonces dedice reunirse con sus amigos para no abandonarlos. \n\n13-Una oveja anda suelta. \nCuando Pigi se hace cargo de una oveja, su acercamiento demasiado entusiasta espanta al animalito. Pigi debe usar su astucia para conseguir que su ovejita vuelva a casa. \n\n14-El funeral de Thom. \nFerny se queda conternado cuando muere su pez Thom. Pigi y Dannan tratan de distraerle con juegos y actividades, pero Ferny no parace animarse. \n\n15-El burro corredor. \nCuando el Sr. Hornsby pide a su clase que medite sobre el significado de la vieja expresiÃƒ?Ã‚Â³n \\&amp;#039;no puedes convertir a un burro en un caballo de carreras\\&amp;#039; Pigi se lo toma como un reto. Se propone convertir a su burro Finnegan en un semental. \n\n16-Molly tenÃƒ?Ã‚Â­a un corderito. \nMolly estÃƒ?Ã‚Â¡ a punto de empezar a ir a la escuela y se siente una chica mayor. para demostrar que es asÃƒ?Ã‚Â­ pide a sus padres que la dejen cuidar de un corderito adorable. Molly no puede decir que no a tan dulce criatura.... ","torrent":{"xt":"urn:btih:96a8b11d5fda798f60e11896fc1bf18789e0d6ef","amp;dn":"12-Pigi+y+sus+amigos.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96a8b11d5fda798f60e11896fc1bf18789e0d6ef","infoHashBuffer":{"type":"Buffer","data":[150,168,177,29,95,218,121,143,96,225,24,150,252,27,241,135,137,224,214,239]},"announce":[],"urlList":[]}}