{"title":"Likvidatsiya","uid":4225423,"size":18738436240,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:96d9b656ccd4de958f569a1aeda4355de80d8c86&amp;dn=Likvidatsiya&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MpacHuk","files":13,"time":1212794987,"description":"Likvidaciia\n\n\n\nDurzhava: Rusiia\nGodina: 2007\nZHanr: Trilur, Vojna\nFormat: DVD5\nVideo: PAL 4:3 (720x576) VBR\nAudio: Ruski DD 5.1; Ruski DTS\nSubtitri: Bulgarski\nRazmer: 4xISO DVD, 17,4GB, 14 serii\nProdulzhitelnost: ~ 644 minuti\n\n\nRezhisior: Sergej Ursuliak\nScenarii: Zoia Kudria, Aleksandur Korenkov, Aleksej Poiarkov\nAktiori: Vladimir Mashkov, Mihail Porechenkov, Sergej Makoveckij, Vladimir Menshov, Konstantin Lavronenko, Kseniia Rappoport, Lika Nifontova, Svetlana Kriuchkova, Polina Agureeva\nPrevod i subtitri: Kastadiva\nRedakciia: Best Ripper\n\n\n\n\nReziume: Scenariiat na filma e osnovan na realni subitiia - likvidaciiata na opasni bandi, koito zavzemat sledvoenna Odesa. Snimkite na filma produlzhavat sedem meseca - na sushtite mesta, kudeto sa se razvili realnite subitiia.\nSledvoenna Odesa. Prestupnostta e v razcveta si. V gradut vursheiat bandi na bivshi diversanti, nachelo sus zagaduchniia Akademik, kato dori i samite banditi ne go poznavat. Banditite grabiat voennite skladove i prodavat obranoto prodovolstvie i oruzhie na banderovcite. V tova vreme Stalin naznachava ZHukov, kojto e v nemilost, za glavnokomandavasht na Odeskiiat voenen okrug. ZHukov s vsichki sili se opitva da vuvede red v grada.\nV borbata s banditite sa hvurleni vsichki sili, kato osobeno se starae nachalnika na Kriminalnata sluzhba David Gocman. V procesut na razsledvane, se ustanoviaa, che i v miliciiata, i v shtaba na komandvaneto banditite sa vnedrili kurtica, s priakor Akademika.\nVulnuvasht film, napraven s mnogo vkus i majstorstvo, naslednik na naj-dobrite tradicii v tozi zhanr na ruskoto kino. SHTe vi trogne i ocharova, razsmee i razplache i sus sigurnost shte ostavi trajna sleda v pametta vi.\n\n\n\n\nProizvodstvo: Rossiia\nGod vÃ‘?hoda filima: 2007\nZHanr: Triller, Vojna\nFormat: DVD5\nVideo: PAL 4:3 (720x576) VBR\nAudio: Russkij DD 5.1, Russkij DTS\nSubtitrÃ‘?: Bolgarskie\nRazmer fajla: 4xISO DVD 5, 17,4GB, 14 serij\nProdolzhitelinosti: ~ 644 minuti\n\n\nRezhissÃ‘?r: Sergej Ursuliak\nScenarij: Zoia Kudria i Aleksandr Korenikov, scenarnaia pererabotka Aleksej Poiarkov\nV roliah: Vladimir Mashkov, Mihail Porechenkov, Sergej Makoveckij, Vladimir Menishov, Konstantin Lavronenko, Kseniia Rappoport, Lika Nifontova, Svetlana Kriuchkova, Polina Agureeva.\n\n\nO filime: Scenarij kartinÃ‘? osnovan na realinÃ‘?h sobÃ‘?tiiah likvidacii opasnejshej bandÃ‘?, orudovavshej v poslevoennoj Odesse. Suemki kartinÃ‘? prohodili na tom zhe meste, gde proizoshla realinaia istoriia, i prodolzhalisi semi mesiacev.\nPoslevoennaia Odessa. Razgul prestupnosti. V gorode oruduet banda bÃ‘?vshih diversantov vo glave s zagadochnÃ‘?m Akademikom, kotorogo ne znaiut dazhe svoi. BanditÃ‘? grabiat voennÃ‘?e skladÃ‘? i pÃ‘?taiutsia perepraviti prodovolistvie, obmundirovanie i oruzhie benderovcam. V Ã‘?to vremia nedovolinÃ‘?j ZHukovÃ‘?m Stalin naznachaet ego komanduiushtim Odesskim okrugom. Marshal vsemi silami pÃ‘?taetsia navesti v gorode poriadok.\nNa boribu s banditami poslanÃ‘? vse silÃ‘?, osobenno staraetsia nachalinik ugolovnogo rozÃ‘?ska David Gocman. V hode rassledovaniia vÃ‘?iasniaetsia, chto i v milicii, i v shtabe komandovaniia u banditov svoi liudi, v chastnosti, sam Akademik. ZHukov i Gocman pribegaiut k raznÃ‘?m metodam, chtobÃ‘? vÃ‘?jti na bandu. V konce koncov Gocman osushtestvliaet ideiu vnedriti v riadÃ‘? banditov svoego cheloveka i primankoj vÃ‘?nuditi ih k reshitelinÃ‘?m dejstviiam, chtobÃ‘? vseh vziati i vÃ‘?jti na Akademika. To, chto odin iz banditov - chelovek Gocmana, zriteli uznaet lishi v finale. Banda razgromlena, Akademik pojman, ZHukovÃ‘?m snova nedovolinÃ‘? - ego otzÃ‘?vaiut v Moskvu.\n","torrent":{"xt":"urn:btih:96d9b656ccd4de958f569a1aeda4355de80d8c86","amp;dn":"Likvidatsiya","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"96d9b656ccd4de958f569a1aeda4355de80d8c86","infoHashBuffer":{"type":"Buffer","data":[150,217,182,86,204,212,222,149,143,86,154,26,237,164,53,93,232,13,140,134]},"announce":[],"urlList":[]}}