{"title":"The Cube 1969 Existential  Horror play basis of 3 movies. color","uid":4175704,"size":668619001,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:974ab95bde36fa2e2850ffc95cf0bd3b9ac92944&amp;dn=The+Cube+1969+Existential++Horror+play+basis+of+3+movies.+color+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"leahcim3360","files":58,"time":1210110893,"description":"\n\n\nTHE CUBE (1969) nOw in COLOR Existential Horror Play, basis of the 3 movies. avi\n\n\nMay 6, 2008\n\n\nThis is the ORIGINAL (1969) Television Play on which three theatrical film were later based [CUBE (1997); CUBE 2: Hypercube(2000); and CUBE ZERO (2004)].  While the theatrical films had more elaborate settings, this Original Play communicates  the human existential drama in a powerful minimalistic and sparse environment.\n\n\ntype\t.avi file \nsize\t637 MB\nrun time   \t1:02:23\n\nTHE CUBE.... Once you\\&amp;#039;ve seen it, you\\&amp;#039;ll never get out.... \nIt was a Sunday afternoon, February 23,1969, when the anthology show NBC EXPERIMENT IN TELEVISION aired a one-hour teleplay THE CUBE. It starred Richard Schaal as a man trapped in a white cubical room. He had no idea how he got there or where it was. And although anyone could enter, he couldn\\&amp;#039;t leave....\nA deceptively simple teleplay, THE CUBE worked its way into the memories of many who have seen it. Metaphysical play, philosophical allegory, dark comedy, psychological drama-- THE CUBE is as hard to categorize as it is to describe.\n\n\nRecovered &amp; archived by:\n\nh**p://tv.groups.yahoo.com/group/JImHensonTheCube/\n\n\n\nIf a master tape of this thing still exists, Henson Associates is out\nof their MINDS if they dont make it available. Sure, its not all cuddly and\nKermit the Frog-y... but neither is the new Star Wars. But if ever there was a\ntime for this brilliant, acid- tinged, surreal, existentialist MASTERPIECE to be\nseen again, its now. Its smart, its funny, and its scary. Michel Gondry, Spike\nJonze, and Charlie Kaufman have to see this. Unless they already have, which\nwould make sense, as it fits into their ouvre so magnificently. I think if\nenough folks urge them, they just have to put it out again. A little advertising\nand promotion and this thing would fly off the shelves.  \n                                                            --TheManInTheCUBE","torrent":{"xt":"urn:btih:974ab95bde36fa2e2850ffc95cf0bd3b9ac92944","amp;dn":"The+Cube+1969+Existential++Horror+play+basis+of+3+movies.+color+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"974ab95bde36fa2e2850ffc95cf0bd3b9ac92944","infoHashBuffer":{"type":"Buffer","data":[151,74,185,91,222,54,250,46,40,80,255,201,92,240,189,59,154,201,41,68]},"announce":[],"urlList":[]}}