{"title":"At Night She Cries, While He Rides His Steed","uid":12846514,"size":4021103,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:978fc0c502af8ff9364d859b9e7e15a245b11633&amp;dn=At+Night+She+Cries%2C+While+He+Rides+His+Steed&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TopShelfBook","files":3,"time":1448560187,"description":"At Night She Cries, While He Rides His Steed\r\n\r\n\r\nAt Night She Cries, While He Rides His Steed is a side-splitting satire that perfectly parodies romance novels and western dramas.\r\n\r\nOur hero, Saint James Street James is a tall, extremely muscular, 32-year-old man whose attributes and possessions include a mind stronger than Socrates on acid, a magnificent horse he loves more than anything in the world, a package so large that it requires a signature, a beautiful, passionate wife with a rack so perfect it belongs on a billiard table, a ton of children, and his own personal gold mine. His life, set in 1849 against the backdrop of the California Gold Rush, is one long parade of amazing sex, dynamite montages, whiskey, and explosive gunfights. The kinds of things men could do when men were actually men. He is the richest man in town—equal parts loved and feared by all. But when the Schläger Brothers come to town, so too comes the end of the good times. St. James is forced to defend everything that matters to him (including, but not limited to: prostitutes, his horse, money, and drugs. Oh, and his wife and children too, sort of). God help anyone who stands in his way.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:978fc0c502af8ff9364d859b9e7e15a245b11633","amp;dn":"At+Night+She+Cries%2C+While+He+Rides+His+Steed","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"978fc0c502af8ff9364d859b9e7e15a245b11633","infoHashBuffer":{"type":"Buffer","data":[151,143,192,197,2,175,143,249,54,77,133,155,158,126,21,162,69,177,22,51]},"announce":[],"urlList":[]}}