{"title":"Secret Diary of A Call Girl s01e01-08","uid":4080321,"size":1443807609,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9890d6b5c3191ba5a313c21662609e5121b406d0&amp;dn=Secret+Diary+of+A+Call+Girl+s01e01-08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":1,"time":1205531072,"description":"Secret Diary of a Call Girl is a British television show on ITV2, based on the blogs of London call girl Belle de Jour. The rights to the blog were bought by Silverapples Media (Avril MacRory and Paul Duane), who co-produced the show with Tiger Aspect Productions. The series was initially developed with Channel 4 and when they passed on the project, ITV took over.\n\nBillie Piper plays the lead role of Belle, the titular call girl. The series began on Thursday 27 September 2007 at 10pm, as part of ITV2&amp;#039;s XXL Thursday programming block.\n\nBillie Piper will return for the second season in 2008, which &quot;will see Belle&amp;#039;s life get more complicated.&quot;\n\n1. Meet Belle, a high-priced high-class prostitute that explains her life and her adventures. She meets with her clients and runs into some problems when she breaks her own rules.\n2. Belle is invited to the most prestigious adult party in the country, however her client doesn&amp;#039;t want to join the action. So she tries to get rid of him just to engage with a couple she just met - however her personal life gets in conflict with that.\n3. One of Belle&amp;#039;s favourite clients has booked her for the entire night. However she feels bored when her client falls asleep and searches for a new adventure for in between.\n4. When a client, who is also her accountant, asks her to experiment with S&amp;M, even Belle&amp;#039;s eyes are opened! Hannah&amp;#039;s best friend, Ben, suddenly springs on her the fact that he is getting married.\n5. Belle works for her favourite client together with another girl she selected. When he dumps her for the new girl she&amp;#039;s upset and calls Ben. He is still struggling from finding out about her secret identity.\n6. For once Belle might end up with a nice guy instead of a client. But will it work when Belle meets a guy and not Hannah?\n7. Belle is booked for a foursome with a married couple as a 15th Wedding Anniversary gift to each other. It means that she must find a partner in time for the booking.\n8. Belle is offered a once in a lifetime opportunity to become more than just a regular prostitute. However what effect will her career change have on her life?\n\nSoftsub ITA by ITASA","torrent":{"xt":"urn:btih:9890d6b5c3191ba5a313c21662609e5121b406d0","amp;dn":"Secret+Diary+of+A+Call+Girl+s01e01-08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9890d6b5c3191ba5a313c21662609e5121b406d0","infoHashBuffer":{"type":"Buffer","data":[152,144,214,181,195,25,27,165,163,19,194,22,98,96,158,81,33,180,6,208]},"announce":[],"urlList":[]}}