{"title":"Darkages","uid":4209445,"size":172083314,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:98946ed59ec982c4ea23380435e752517dee6a11&amp;dn=Darkages&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"MikeyMike144","files":2,"time":1211988628,"description":"Dark Ages is an online role-playing game set in a fantasy world of faeries and magic. Dark Ages allows you the player to create your own characters choosing their name, gender, hairstyle, hair color, and path. You can battle monsters as a mighty Warrior, protect and heal as a Priest, use powerful magic as a Wizard, use the devious skills of a Rogue, or discover virtue and power with martial arts as a Monk. Once immersed in the world of Dark Ages, you can partake on quests, discover new lands, defeat powerful monsters, collect rare items and much more. \nDark Ages has a deeply developed community with History, Lore, Philosophy, Literature, and Art all done by creative players like you. You can also become involved in the intricate political and religious system that allows players to interact at a level different from any other game. Players can be involved in one of the deepest online worlds ever created, with faires, markets, theatre, storytelling, contests, an online college and library, interactive politics, religions, rituals, ceremonies and more! \nAt its heart, Dark Ages offers an experience of adventure and fantasy with an evolving society and story. Your legend begins here! \n\nI personally love this game and i cannot stop playing, its so addicting and its really fun, we just need more players because its not that popular of a game and with more players, there would be a lot more going on, on darkages. My character that i am usually on is ZeTai, so yea, just give me a PM. \n\nThis game is somewhat Free to play but some events you need to register and when you get to 99 you will need to register =] \nMMORPG \n\nPlease Seed!!! \n\n\nYou can also download this game from www.darkages.com","torrent":{"xt":"urn:btih:98946ed59ec982c4ea23380435e752517dee6a11","amp;dn":"Darkages","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98946ed59ec982c4ea23380435e752517dee6a11","infoHashBuffer":{"type":"Buffer","data":[152,148,110,213,158,201,130,196,234,35,56,4,53,231,82,81,125,238,106,17]},"announce":[],"urlList":[]}}