{"title":"yourdailyporn.blogbugs.org - 20080615 - CuriousChristine Clips","uid":4241012,"size":327704664,"categoryP":"porn","categoryS":"other","magnet":"?xt=urn:btih:98970156faca518b061e0ee3ee768bbf0ef2e7a3&amp;dn=yourdailyporn.blogbugs.org+-+20080615+-+CuriousChristine+Clips&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"dailydoseofporn","files":1,"time":1213544930,"description":"Download: Torrent\n\nA few clips of CuriousChristine, first information of each clip, then screens!\nEnjoy!\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\n\n\n\n\nCurious Christine from Clips4Sale\n\n\nVarious fetishes; Cumeating Instruction, jerkoff encouragement, cuckold pov cumswap and a few roleplay videos\n\nDescriptions for each video from site:\n\nCover My Head, Then Cover My Face (high res)\nBy Request --- Tonight, I am your cheap dirty whore. Dressed with heavy eye makeup, velvet pants, an a tight fitting hooded zip up. I start by showing off how hot I look, I move on to more dirty things. Like, kneeling down for you and jerking your cock with oil. Then gagging on your dick when you push my head all the way to the base. Talking so filthy to you, you might need to wash my mouth out with some soap. Or how about your just wash my mouth out with your hot dripping load. Oooops I missed, it&amp;#039;s all over my face. You won&amp;#039;t believe how much of a slut I am in this clip.\n\nEat Cum Out Of Your Hand (high res)\nI am going to show you how I want you to jerk off but you have to do something for me. I love it when a guy masturbates just like I want him too but what is even hotter is when he orgasms then eats his own cum. That&amp;#039;s right, I want you to blow your wad in your hand and then you will lick up your own cum! And that&amp;#039;s the only way I will even let you blow your cum is if you eat it afterwards! You may not like the idea but trust me, once you have done it then you will want it all the time! So if you want me to show you how to stroke that hard cock and then let you cum, you had better be prepared to lick it up! It would make me so happy to see that. You do want to please me don&amp;#039;t you? I thought so. Now take your cock out and.... .\n\nCumming In Your Mouth Visual (high res)\nI have a super special treat for you today! I am going to show you how to do something REALLY special today. I am going to show you how to give yourself a cum facial and to eat your own cum! 1st I give you instructions on how I want you to get your cock hard and when I am ready I will have you lay back to take your own creamy load all over your own face. I know how much you love to see the porn girls take a shot to the face and how you wish it was you, so now it can be. This is a HOT masturbation instruction and cum eating instruction clip!\n\nSucking Off Someone Else (high res)\nMy poor little husband, an when I say little, i mean little. you see, he has a very small dick, an i am sick of pretending i love him and his penis. lately he has been thinking i been cheating on him. wow it took you long enough to catch on dumbass. lol, of course i am cheating on you! your dick is so small, it can&amp;#039;t even satisfy me anymore. so to prove how much of a loser you are, i want you to videotape this conversation. sit behind the videocamrea and listen to me rant and rave on how im using you for your money, and your dick is so itty bitty. now stay seated i want you to meet someone. here is my good friend anthony. say hi to him. he is my new lover, my italian stalion. now i am going to sit here and blow him in front of you, while he sits back enjoys it, and makes fun of you the whole time, that your wife is sucking him off. haha we cant stop laughing at you. and we have videoproof that im going to show all of your friends! to make matters worse when my love finishs in my mouth, im going to go spit it in your mouth! the ultimate humiltion. like i said my poor little husband. .\n\nMake Loving To Get Pregnant(high res)\nBy Request: Sit down I wanna have a serious talk with you. I love you, and since we are already married I feel like we should move to the next level. What do you feel about getting pregnant, and starting a family together? Really, you been thinking about it to? I have been eating healthy and excersizing to get ready for being pregnant. So hun, guess what? I am fertile right now, so if you cum inside me tonight, I will probably get pregnant. So come here, thats make love to each other. This love making is even more amazing, now that it is on a deeper level now, I feel so close to you, I am consumed by your body. Cum deep inside of me, with your hot sperm, so it can swim up inside me and get me pregnant. I hope you just busted a big hot sperm filled load. I feel my body getting ready, here let me prop my body up so it has a better chance of reaching my eggs. Thanks for that hot sperm load, filling my vagina.\n\nSucking Dick Sucks (high res)\nBy Request: I am sorry but I just hate giving head. I have only done it once before this, an I was gagging and choking the whole time, IT WAS GROSS! It&amp;#039;t not fair, that you are asking for a birthday blowjob, you know how much I hate to do this. But you know how nice of a person I am, and that I would do anything on your birthday to make you a happy man. Alright, here goes nothing. Uggghh, gross. I can only do it for a couple of mins, you keeo gagging me, I feel like I am going to throw up. I can&amp;#039;t do this anymore, put your dick away, I am all set. I am serious now. I am done, stop it, stop trying to stick your dick down my throat, I sad I am done. If you try to get me to suck your dick again, I am leaving. OH MY GOD, stop please, I hate sucking your dick, your so gross, leave me alone already...\n\n\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n----------------------------------------------------------------------------------\n\n\n\nScreens: \n &lt;a href=&quot;\nhttp://yourdailyporn.blogbugs.org/3066122/Curious-Christine-Clips.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://yourdailyporn.blogbugs.org/3066122/Curious-Christine-Clips.html&lt;/a&gt; \n(in the bottom of the page!) \n\n\n\n","torrent":{"xt":"urn:btih:98970156faca518b061e0ee3ee768bbf0ef2e7a3","amp;dn":"yourdailyporn.blogbugs.org+-+20080615+-+CuriousChristine+Clips","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98970156faca518b061e0ee3ee768bbf0ef2e7a3","infoHashBuffer":{"type":"Buffer","data":[152,151,1,86,250,202,81,139,6,30,14,227,238,118,139,191,14,242,231,163]},"announce":[],"urlList":[]}}