{"title":"Uninvested: How Wall Street Hijacks Your Money and How to Fight","uid":12836486,"size":5733854,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:98d3746bf844f750336a8d871073572c4ae751b9&amp;dn=Uninvested%3A+How+Wall+Street+Hijacks+Your+Money+and+How+to+Fight+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TopShelfBook","files":2,"time":1448461866,"description":"Uninvested: How Wall Street Hijacks Your Money and How to Fight Back | EPUB\r\n\r\nBobby Monks is blowing the whistle on Wall Street, giving middle class Americans the low down on how they’re being fleeced of their retirement money—and what they can do about it\r\n\r\nEvery month our financial statements arrive, and every month we glance at them, trying to understand, hoping that we’ll come out ahead. But most of us have no idea what’s really going on or the costs involved. According to Bobby Monks—who has been a banker and borrower, investor and entrepreneur—financial firms and money managers have complicated the investing process to keep us in the dark, profiting from our ignorance.\r\n\r\nHaving dealt with the financial sector throughout his career, Monks has seen it all. In Uninvested, he reveals how, when, and why the relationship between us and our money managers became corrupted—and what we can do to fix it. Monks shows how the system works not only against us as individuals but also against society at large. Without our knowledge or approval, our money is diverted into the pockets of CEOs and misappropriated, promoting business practices that contribute to economic inequality, political dysfunction, and environmental woe.\r\n\r\nMonks’ experiences give him a unique perspective on how we got to this point. Drawing on original research and interviews with key figures such as Vanguard founder Jack Bogle, legendary investor Carl Icahn, and former congressman Barney Frank of the Dodd-Frank Act, Monks teaches us how to take back ownership and control of our money. As he writes: \r\n\r\nEven in the decades preceding the most recent downturn, very few investors enjoyed financial success equal to that of their money managers. Given this, I have long wondered why investors don’t pull their money out of the system en masse.\r\n\r\nI suspect that it is because most feel powerless. Unaware of the implications of their investments and unable to penetrate the excruciating complexity of the system that facilitates them, many seem to seek refuge in their money managers’ aura of sophistication, pretense of competence, and projection of certainty. It seems to me that most investors are simply sleepwalking through the investing process. They have become uninvested.\r\n\r\nWhen we outsource our investing, we sacrifice control—but not responsibility. My goal in writing this book is to convince you that the best (and only) way to fix this broken system is to awaken a critical mass of engaged investors and recruit them to participate more fully in the investing process.\r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:98d3746bf844f750336a8d871073572c4ae751b9","amp;dn":"Uninvested%3A+How+Wall+Street+Hijacks+Your+Money+and+How+to+Fight+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98d3746bf844f750336a8d871073572c4ae751b9","infoHashBuffer":{"type":"Buffer","data":[152,211,116,107,248,68,247,80,51,106,141,135,16,115,87,44,74,231,81,185]},"announce":[],"urlList":[]}}