{"title":"Analyzing Online Piracy English Paper","uid":4231511,"size":80384,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:98f1a3d562305b239d113c2d37903ab6855c0530&amp;dn=Analyzing+Online+Piracy+English+Paper&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ghsfr33d0m","files":1,"time":1213075410,"description":"Name: Online Piracy\nType: Analytical English paper\nFormat: .doc (if you would like it in another format, just ask and I?ll make it happen)\nSize: 37.3kb\nCompression: None\nBy: ghsfr33d0m\n\nThis is a paper I wrote for my ENG101 class. The prompt was something like:\n\n&quot;Pick a controversial, actively debated topic. You should avoid overused topics such as abortion, the death penalty, the war in Iraq, immigration, or global warming. Be sure there is enough information on your topic before you start writing. You will analyze the topic from the three domains of academic inquiry we have studied: the humanities, social sciences and natural sciences. Your paper should include a brief introduction to the topic after your primary introduction. Although the structure is up to you, be sure you describe how the methods of inquiry are related and draw connections between them. Your conclusions should look to the future and address any further issues that you feel need to be investigated. Your paper should be no less than 1800 words and should be well supported (MLA format).&quot;\n\nI am told this paper does an excellent job of discussing the debate over online piracy. Although I tried to remain unbiased, I found that the overwhelming amount of facts and evidence supports piracy and condemns the media giants. As a result of this imbalance the paper did turn out fairly well weighted towards the pirates. I included some really interesting information, including some incredible economic figures and a few insightful thoughts. It is my hope that by putting this paper up on TPB I can begin to open a few eyes to the bigger picture. The idea is to give a heads up to some noobish pirates who only download stuff and don?t really get involved in the fight to revise the broken system we are currently stuck with. I strongly encourage all pirates to read my paper. It can begin to build an understanding of both the mechanisms behind piracy and the social struggle it has unleashed. Keep in mind it was written for an English professor. If anybody that knows more about this then me stumbles on this, please take a look and give me some feedback. I will be more than willing to revise the paper to take any criticisms into account. I&amp;#039;m an engineering student by the way, not an English major. ;)\n\nYou are free to copy, reproduce, edit, rewrite, distribute, etc. this work as long as you extend that right to all others and never charge anything, ever. It would be great if you would let me know about whatever you are doing with it, I may want to adopt your revision. I will never come after you for plagiarism or anything like that and I will tell anybody you like that you have the right to use this work. Starting in a few weeks I&amp;#039;ll be seeding this 24/7 on a godly fast connection, easy dl. Thanks for looking!\n\nghsfr33d0m","torrent":{"xt":"urn:btih:98f1a3d562305b239d113c2d37903ab6855c0530","amp;dn":"Analyzing+Online+Piracy+English+Paper","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"98f1a3d562305b239d113c2d37903ab6855c0530","infoHashBuffer":{"type":"Buffer","data":[152,241,163,213,98,48,91,35,157,17,60,45,55,144,58,182,133,92,5,48]},"announce":[],"urlList":[]}}