{"title":"Gabrielle - Gabrielle - (1996)[EAC-MP3@320KBPS]","uid":4183319,"size":167767479,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9a27e50d975b3c65d8ef4e2d561b12e4d1018d4e&amp;dn=Gabrielle+-+Gabrielle+-+%281996%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seanprince","files":26,"time":1210527649,"description":"Gabrielle - Gabrielle - (1996)[EAC-MP3@320KBPS]\n\nTrack list\n\nGabrielle - Gabrielle\n\n01.\tForget About The World (Version 1)\t04:18\n02.\tPeople May Come\t\t\t\t04:32\n03.\tI Live In Hope\t\t\t\t04:10\n04.\tBaby I&amp;#039;ve Changed\t\t\t04:41\n05.\tGive Me A Little More Time\t\t04:54\n06.\tIf You Really Cared\t\t\t04:54\n07.\tThere She Goes\t\t\t\t04:02\n08.\tOur Love Is Over\t\t\t05:14\n09.\tIf I Could\t\t\t\t04:47\n10.\tAlone\t\t\t\t\t03:12\n11.\tHave You Ever Wondered\t\t\t03:59\n12.\tSo Glad\t\t\t\t\t04:06\n13.\tMiracle\t\t\t\t\t04:39\n14.\tIf You Ever (With East 17)\t\t04:17\n15.\tWalk On By\t\t\t\t03:21\n16.\tForget About The World (Version 2)\t04:22\n\nBiography\tby Ed Nimmervoll\n\nBritish house/R&amp;B vocalist Gabrielle began her career singing for free in London West End clubs whilst temping in offices during the day. Her big break came when she recorded a demo, called &quot;Dreams,&quot; based around Tracy Chapman&amp;#039;s &quot;Fast Car,&quot; which subsequently fell into the hands of an A&amp;R man at London&amp;#039;s Go! Beat records. The track was re-recorded without the Chapman sample and ended up in the Guinness Book of Hit Singles as the highest U.K. chart entry for a debut female act, topping the charts for three weeks. With the hit came a head-turning image, complete with kiss curls and sequined eye patch as Gabrielle&amp;#039;s right eye has a drooped lid. Ignoring cosmetic surgery, she turned what might have been seen an image setback into a virtue that set her apart from the pack.\nHer debut album, Find Your Way, sold over a million copies worldwide, and paved the way for her sophomore, self-titled album, released in 1996 and produced by the Boilerhouse Boys. In three short years, those two albums and nine singles -- five of which were Top Ten -- established Gabrielle as the U.K.&amp;#039;s premiere soul vocalist, full of classic soul connotations (Marvin Gaye, Barry White, Bobby Womack) but also influenced by early-&amp;#039;80s British pop (Soul II Soul, Lisa Stansfield, Mantronix).\nIn 2000, Gabrielle followed up with her appropriately titled third album, Rise, which followed a difficult time for her personally and creatively. Widely publicized reports concerning her ex-partner&amp;#039;s criminal conviction threatened to overshadow her musical accomplishments, not to mention her creative potential. The songs on Rise spoke of optimism, romanticism, devotion, and a keen survival instinct. The lead single, &quot;Sunshine,&quot; was a spirited thank you to those friends you have on hand to boost your confidence when you&amp;#039;re low. The album&amp;#039;s title track samples Bob Dylan&amp;#039;s classic &quot;Knockin&amp;#039; on Heaven&amp;#039;s Door&quot; with his rare seal of approval. 2001&amp;#039;s world-wide hit &quot;Out of Reach&quot; was the feature track from the Bridget Jones&amp;#039;s Diary soundtrack.\n\nReview from Amozon\n\nGabrielle... The powerful opening of &amp;#039;Forget About The World&amp;#039; sets the scene for a very good album. The South-London pop/soul singer&amp;#039;s second album has a completely different focus to both its predecessor, Find Your Way, and the follow-up, Rise, which are both far more pop-orientated.\nOn her self-titled album, Gabrielle has the most mature sound of the three albums and on most tracks it pays off - &amp;#039;Give Me A Little More Time&amp;#039; and &amp;#039;If You Really Cared&amp;#039; both sound like they come from the 60s and this is no criticism... after the brilliant ballads of &amp;#039;People May Come&amp;#039; and &amp;#039;I Live In Hope&amp;#039;, they are a welcome move back in time.\nWe then are transported back to the modern day with &amp;#039;There She Goes&amp;#039; and &amp;#039;Have You Ever Wondered&amp;#039;, two of the catchiest pop songs I have ever heard. All these songs have a distinctly acoustic sound to them until we hear &amp;#039;If I Could&amp;#039; and &amp;#039;Miracle&amp;#039; - much more reminciscent of the sound of the other two albums and a welcome variation. Each of these songs is strong, catchy, yet not repetitive.\nHowever, there are songs that have not been mentioned: &amp;#039;Baby I&amp;#039;ve Changed&amp;#039; and &amp;#039;Our Love Is Over&amp;#039; are dull and relatively tuneless - and on &amp;#039;Alone&amp;#039;, Gabrielle strives for maturity just too much and the simplicity of the bass/guitar/voice structure does not fit the style of the album.\nThese are minor glitches. The album is generally good and minus those three tracks it is VERY good. If you have either &amp;#039;Find Your Way&amp;#039; or &amp;#039;Rise&amp;#039; and have enjoyed them, this might not be exactly what you expect, but if you want the voice, with slightly &amp;#039;older&amp;#039; influences on it, this album will be perfect for you.\n\nEnjoy.  ","torrent":{"xt":"urn:btih:9a27e50d975b3c65d8ef4e2d561b12e4d1018d4e","amp;dn":"Gabrielle+-+Gabrielle+-+%281996%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a27e50d975b3c65d8ef4e2d561b12e4d1018d4e","infoHashBuffer":{"type":"Buffer","data":[154,39,229,13,151,91,60,101,216,239,78,45,86,27,18,228,209,1,141,78]},"announce":[],"urlList":[]}}