{"title":"Chicago Transit Authority","uid":4081101,"size":185437644,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:9a3c18f76b060b5e6458d4b543f5456c48dfc490&amp;dn=Chicago+Transit+Authority&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gazzjazz","files":16,"time":1205576370,"description":"This is Chicago&amp;#039;s very first album and an absolute classic in terms of crossover styles that encompassed rock-jazz &amp; blues...sheer brilliance\n\nI&amp;#039;ve included scanned cover art &amp; an AMG bio plus this review:\n\nReview\tby Lindsay Planer\n\nFew debut albums can boast as consistently solid an effort as the self-titled Chicago Transit Authority (1969). Even fewer can claim to have enough material to fill out a double-disc affair. Although this long- player was ultimately the septet&amp;#039;s first national exposure, the group was far from the proverbial &quot;overnight sensation.&quot; Under the guise of the Big Thing, the group soon to be known as CTA had been honing its eclectic blend of jazz, classical, and straight-ahead rock &amp; roll in and around the Windy City for several years. Their initial non-musical meeting occurred during a mid-February 1967 confab between the original combo at Walter Parazaider&amp;#039;s apartment on the north side of Chi Town. Over a year later, Columbia Records staff producer James Guercio became a key supporter of the group, which he rechristened Chicago Transit Authority. In fairly short order the band relocated to the West Coast and began woodshedding the material that would comprise this title. In April of 1969, the dozen sides of Chicago Transit Authority unleashed a formidable and ultimately American musical experience. This included an unheralded synthesis of electric guitar wailin&amp;#039; rock &amp; roll to more deeply rooted jazz influences and arrangements. This approach economized the finest of what the band had to offer -- actually two highly stylized units that coexisted with remarkable singularity. On the one hand, listeners were presented with an incendiary rock &amp; roll quartet of Terry Kath (lead guitar/vocals), Robert Lamm (keyboards/vocals), Peter Cetera (bass/vocals), and Danny Seraphine (drums). They were augmented by the equally aggressive power brass trio that included Lee Loughnane (trumpet/vocals), James Pankow (trombone), and the aforementioned Parazaider (woodwind/vocals). This fusion of rock with jazz would also yield some memorable pop sides and enthusiasts&amp;#039; favorites as well. Most notably, a quarter of the material on the double album -- &quot;Does Anybody Really Know What Time It Is?,&quot; &quot;Beginnings,&quot; &quot;Questions 67 and 68,&quot; and the only cover on the project, Steve Winwood&amp;#039;s &quot;I&amp;#039;m a Man&quot; -- also scored as respective entries on the singles chart. The tight, infectious, and decidedly pop arrangements contrast with the piledriving blues-based rock of &quot;Introduction&quot; and &quot;South California Purples&quot; as well as the 15-plus minute extemporaneous free for all &quot;Liberation.&quot; Even farther left of center are the experimental avant-garde &quot;Free Form Guitar&quot; and the politically intoned and emotive &quot;Prologue, August 29, 1968&quot; and &quot;Someday (August 29, 1968).&quot; The 2003 remastered edition of Chicago Transit Authority offers a marked sonic improvement over all previous pressings -- including the pricey gold disc incarnation. ","torrent":{"xt":"urn:btih:9a3c18f76b060b5e6458d4b543f5456c48dfc490","amp;dn":"Chicago+Transit+Authority","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a3c18f76b060b5e6458d4b543f5456c48dfc490","infoHashBuffer":{"type":"Buffer","data":[154,60,24,247,107,6,11,94,100,88,212,181,67,245,69,108,72,223,196,144]},"announce":[],"urlList":[]}}