{"title":"How They Started: How 25 Good Ideas Became Great Companies","uid":12846497,"size":3992305,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:9a554a5a7591b182c34e8abc754d784684d4537d&amp;dn=How+They+Started%3A+How+25+Good+Ideas+Became+Great+Companies&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TopShelfBook","files":3,"time":1448560135,"description":"How They Started: How 25 Good Ideas Became Great Companies\r\n\r\n\r\nHow do you turn a good idea into a great business?   Lots of us have ideas we think would make great businesses. Most of us never do anything with those ideas. Maybe it’s because we’re really happy with our jobs, maybe it’s because we’re not confident that our idea would really work. Or maybe it’s simply because we don’t know where to start.   This book is about 25 like you. They had an idea, and went on to start a business. Those businesses are all extremely successful and most are now household names all across America.   With success stories ranging from retail and gaming to social media and the restaurant business, How They Started relives the humble beginnings of companies such as Coca-Cola and Disney, Google and Twitter, Zynga and Chipotle Grill. Through personal interviews with key sources – including founders, investors and past employees – each profile reveals how the company took its first tentative steps and subsequently became the famous name it is today.   Written by Carol Tice, regular writer for Entrepreneur Magazine, and David Lester, who set up a highly successful software company in Farmington, CT and now runs a company dedicated to supporting start-ups and entrepreneurs, How They Started is an enlightening and fascinating book that answers key questions for each business, such as:   • What happened first? • How did they choose their name? • How much did it cost to set up? • Where did they find suppliers? • How did they get their first customers? • What problems did they run into - and how did they overcome them?     Profiles include: Blackberry, Chipotle Grill, Coca-Cola, Disney, Dropbox, eBay, Electronic Arts, Etsy, Gatorade, Google, Groupon, IBM, Jamba Juice, KFC, LinkedIn, Microsoft, Nintendo, Pinkberry, Spanx, Trip Advisor, Twitter, Wholefoods, Zipcar, Zynga.  \r\n\r\n**PLEASE SEED**","torrent":{"xt":"urn:btih:9a554a5a7591b182c34e8abc754d784684d4537d","amp;dn":"How+They+Started%3A+How+25+Good+Ideas+Became+Great+Companies","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a554a5a7591b182c34e8abc754d784684d4537d","infoHashBuffer":{"type":"Buffer","data":[154,85,74,90,117,145,177,130,195,78,138,188,117,77,120,70,132,212,83,125]},"announce":[],"urlList":[]}}