{"title":"SmartBackup v3.0.0.271","uid":4172406,"size":3962060,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:9a8e3aa34ad26ecbd765a9e48c49f785a10cdf0a&amp;dn=SmartBackup+v3.0.0.271&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"captainelliotspencer","files":1,"time":1209939997,"description":"                          SmartBackup v3.0.0.271\n\nSmartBackup is an inexpensive, fast and easy to use backup software for Windows \n2000/XP/2003/Vista. On the one hand it helps you to select your important files \nfor backup, which results in a short time needed for a backup. On the other hand \nit automatically keeps your backups up to date and does copy only files which \nreally have changed since the last backup.\n\nAdditionally it allows you to synchronize your backup source and destination, \nwhich makes it easy to keep your data files and documents on your PC and your \nlaptop synchronized. SmartBackup offers detailed options to specify which files \nshould be copied. You can also specify an FTP Server or an ZIP File as backup \ndestination.\n\nMain Features:\n* The directory structure is preserved on the backup volume.\n* Files which are already present on the backup volume and did not change\n  will not be copied. This results in extremely short backup times if backups are   done regularly. An Explorer like interface makes SmartBackup easy to use.\n* You can mark any file for backup from the Explorer context menu. This allows \n  you to decide which files should be backup up while you are opening, saving or \n  copying them, without starting SmartBackup.\n* SmartBackup is able to refresh a backup automatically once a day or once a week, \n  either at a given time or on Windows startup.\n* You can use SmartBackup to replicate your documents and data files to a Notebook,\n  a second harddisk or another PC in your local network.\n* SmartBackup can write your backups to a CD or DVD without any additional burning \n  software.\n* An online help file and a user&amp;#039;s manual as PDF file are included.\n* A German version is available too.\n* A search function for your harddisks helps you to find your documents and  data \n  files.\n* SmartBackup can save your backup directly to an FTP server, which is in an      different geographical location.\n* Files or folders can be restored using drag &amp; drop in the Windows Explorer\n* Install &amp; Uninstall support\n\n---------------------------------------\nExtract with Winrar.\nInstall app.\nCopy patch to installation folder, run.\n---------------------------------------\n\nEnjoy!!","torrent":{"xt":"urn:btih:9a8e3aa34ad26ecbd765a9e48c49f785a10cdf0a","amp;dn":"SmartBackup+v3.0.0.271","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9a8e3aa34ad26ecbd765a9e48c49f785a10cdf0a","infoHashBuffer":{"type":"Buffer","data":[154,142,58,163,74,210,110,203,215,101,169,228,140,73,247,133,161,12,223,10]},"announce":[],"urlList":[]}}