{"title":"Captain Beefheart - The Dust Blows Forward (1999) [FLAC + Scans]","uid":12738230,"size":993857163,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9ae5adb26ac8baa0f5e5553fea6988a41d2d8014&amp;dn=Captain+Beefheart+-+The+Dust+Blows+Forward+%281999%29+%5BFLAC+%2B+Scans%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Earthling1","files":92,"time":1447206998,"description":"AllMusic Review by Richie Unterberger\r\n\r\nLeaving alone the obvious condition that Captain Beefheart's numerous experimental albums aren't as prime for a best-of treatment as the discographies of most artists are, this is a pretty good overview of career highlights. The two CDs span his 1966 &quot;Diddy Wah Diddy&quot; single to his final album (1982's Ice Cream for Crow), each disc weighing in at about 75 minutes. With so much material to draw from (not even counting that mammoth five-CD box set of unreleased stuff), there will be inevitable disagreements among fans as to which songs were selected; there are seven from Clear Spot, for instance, but only two from Safe as Milk. Every period is sampled, however, and his weakest albums (Unconditionally Guaranteed and Bluejeans &amp; Moonbeams) are judiciously represented by just one cut each. A few rarities do crop up, including a quite good and bluesy previously unreleased Clear Spot outtake (&quot;Little Scratch&quot;), &quot;Hard Workin' Man&quot; (from the soundtrack to Blue Collar), and the 1982 instrumental B-side &quot;Light Reflected off the Oceands [sic] of the Moon.&quot; There are also little detours from Beefheart's albums for two tracks from 1966 singles and two collaborations with Frank Zappa from Zappa's Bongo Fury. It's not for the collector, but it's a decent package for someone who wants to get familiar with the Captain or doesn't need more than a few of his regular albums. Comprehensive notes in a 60-page booklet offer a good straightforward cruise through his oft-confusing history and shifting Magic Band personnel","torrent":{"xt":"urn:btih:9ae5adb26ac8baa0f5e5553fea6988a41d2d8014","amp;dn":"Captain+Beefheart+-+The+Dust+Blows+Forward+%281999%29+%5BFLAC+%2B+Scans%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9ae5adb26ac8baa0f5e5553fea6988a41d2d8014","infoHashBuffer":{"type":"Buffer","data":[154,229,173,178,106,200,186,160,245,229,85,63,234,105,136,164,29,45,128,20]},"announce":[],"urlList":[]}}