{"title":"UFO.Hunters.S01E07.WS.DSRip.XviD-aAF","uid":4095131,"size":371335077,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9caecf118610f8bfbf57298b3e7957018cb9dbf0&amp;dn=UFO.Hunters.S01E07.WS.DSRip.XviD-aAF&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Fabiolas","files":30,"time":1206279291,"description":"--------------------------------------------------------\n      More about UFO Evidence at www.ufodbase.com\n--------------------------------------------------------\n\n\n\n         UFO.Hunters.S01E07.WS.DSRip.XviD-aAF  \n                           \n                Episode 07 - Reverse Engineering   \n\n\n           Release Date....: March 20th, 2008 \n           Source..........: DVB-S\n           Video...........: XviD\n           Video Bitrate...: 962 kbit/s 2pass VBR\n           Audio...........: kbps MP3 @ 48000 Hz          \n           Duration........: 44+ mins     \n           Resolution......: 624x352      \n           Frame Rate......: 29.97fps     \n           Size............: 25 x 15mb    \n           Genre...........: Docu\n\n\nDescription: \n\nTechnology thought to have come from UFO\\\\\\&amp;#039;s and used for U.S. military aircraft is investigated. The site of the Roswell crash is focused on.\n\n\n\n---------------------------------------------------------------------------------\n\nUFODBASE.COM is a net community dedicated to archiving and sharing information about UFOs, Aliens, and so much more. Our task is to simply archive and present information as best we can so informed opinions and discussions may take place. The range of our studies is vast. Though our members opinions, backgrounds, and locations may vary greatly, we travel together with a common purpose, keeping things light-hearted and positive as we go. We must put the pieces together and discard the irrelevant.\n\nOur archive data is entered directly into our forums for easy search functions and browsing by category. Each thread contains either videos, documents, photos, texts, or combinations there of. Members feely post their thoughts directly into the threads they are viewing, or post in the discussion board sections. We also have a live chat program that runs on Flash, so there is no downloading required. You will be able to automatically be logged into the chat program when clicking the, \\\\\\&quot;Chat\\\\\\&quot;, button if your registered and logged in.\n\nI created this site for the world, but also for myself. There are no advertisements or pop up ads and never will be. Everything here is free to copy and share elsewhere because we believe we can all, as a species, get to the bottom line about these phenomenon faster by not hoarding or using data to increase our ranks on search engines or make money from people who want to learn. We want to teach and learn from each other. Period.\n\nIf you have any questions just PM a moderator or administrator and we will do our very best to help you with whatever we can. We have some organizing to do but have a serious amount of content to keep you busy for months on end. The archive is ever growing so getting started as soon as you can is a good idea because new data is added daily.\n\n\nTake whatever you need and share it freely.\n\nAnd most important: Enjoy your visit or membership with us.\n\n\nRespectfully,\n\nYour friends at the UFO dbase!\n","torrent":{"xt":"urn:btih:9caecf118610f8bfbf57298b3e7957018cb9dbf0","amp;dn":"UFO.Hunters.S01E07.WS.DSRip.XviD-aAF","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9caecf118610f8bfbf57298b3e7957018cb9dbf0","infoHashBuffer":{"type":"Buffer","data":[156,174,207,17,134,16,248,191,191,87,41,139,62,121,87,1,140,185,219,240]},"announce":[],"urlList":[]}}