{"title":"Stossel.2015.11.10.GOP.Debate.Coverage.720p.WEBrip","uid":12860304,"size":780262631,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9d11da1153acfe522bc97323884cdaf653b2a1fb&amp;dn=Stossel.2015.11.10.GOP.Debate.Coverage.720p.WEBrip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BBreach","files":1,"time":1448728914,"description":"_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nJohn F. Stossel is an American consumer reporter, investigative journalist, author, libertarian columnist, and former co-anchor for the ABC News show 20/20. In this show he looks at consumer-focused topics, such as civil liberties, the business of health care, and free trade\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nAired on 11-14 but was slated to air 11-10 after the debates. The debates ran long and this was bumped.\r\n\r\nNOT WRITTEN BY STOSSEL\r\nPANEL PRESENT THROUGHOUT ENTIRE EPISODE.\r\n\r\nStossel is joined by an all student audience and 3 panel members. AUSTIN PETERSEN of &quot;The Libertarian Republic&quot;, HADLEY HEATH MANNING of the &quot;Independent Women's Forum&quot;, and DEROY MURDOCK of &quot;National Review Online&quot;. Tax plans, who is out, Rand Paul vs Marco Rubio, Syrian no file zone, foreign policy, ISIS, China, spending, Kasich, Rubio's support for sugar subsidy, social security, and disability.\r\n\r\nBREAK\r\n\r\nDid tonight's debate change your opinion on who is going to win? Trump and Carson, according to polls, are leading by a hefty margin. But Stossel says that polls are garbage. But when it comes to predicting election results they've got nothing on prediction markets. Marco Rubio is the big favorite. The panel briefly discusses.\r\n\r\nThe first comment from a candidate that made Stossel want to scream was when Donald Trump said, &quot;We don't win anymore.&quot; He says we're being beat economically, what does that even mean? The panel mirrors Stossel's distaste of Trump.\r\n\r\nBREAK\r\n\r\nRepublican candidates always want to strengthen the military. Stossel was happy to hear Rand Paul say that he wants a strong national defence - but he doesn't want us to be bankrupt. The panel discusses that sound bite.\r\n\r\nStossel was happy to hear some candidates views on minimum wage. Rubio said that if you raise the min. wage it'll make people more expensive than machines, and Carson said that if you raise it you'll create more unemployment.\r\n\r\nFiorina wants a free market for healthcare. Stossel probably does, too. (Can't tell - devil's advocate and all that.) But does the American public really want a free market for healthcare?\r\n\r\nBREAK\r\n\r\nIn the presidential debate most of the candidates supported legal immigration. But Kasich and Trump said we gotta build that wall! Also apparently Mexico will pay for it. Afterwards they move on to more tax plan talk.\r\n\r\nBREAK\r\n\r\nThe panel takes questions from the audience. 1. How big should the military be? 2. What would your tax plans be? 3. The cost of college tuition 4. In what ways is immigration messing with our economy? 5. Do you believe that all Republican tax programs be conservative?\r\n\r\nBREAK\r\n\r\nStossel's closing statements. How he'd respond to insulting questions from moderators.\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2","torrent":{"xt":"urn:btih:9d11da1153acfe522bc97323884cdaf653b2a1fb","amp;dn":"Stossel.2015.11.10.GOP.Debate.Coverage.720p.WEBrip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d11da1153acfe522bc97323884cdaf653b2a1fb","infoHashBuffer":{"type":"Buffer","data":[157,17,218,17,83,172,254,82,43,201,115,35,136,76,218,246,83,178,161,251]},"announce":[],"urlList":[]}}