{"title":"Nevermore - Dreaming Neon Black (1999) [EAC-FLAC]","uid":4205815,"size":465223422,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:9d270e261500729a32b4a0f1198e436454339768&amp;dn=Nevermore+-+Dreaming+Neon+Black+%281999%29+%5BEAC-FLAC%5D+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sworduigi","files":9,"time":1211795541,"description":"\n\nExtractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD (silver CD)\nArtwork: Back, Front, Inlay and CD (Web Found).\n\n\nGeneral Info:\n\n\n\n          Tracklist:\n   1. Ophidian ? 0:46\n   2. Beyond Within ? 5:11\n   3. The Death of Passion ? 4:10\n   4. I Am The Dog ? 4:13\n   5. Dreaming Neon Black ? 6:26\n   6. Deconstruction ? 6:39\n   7. The Fault of the Flesh ? 4:54\n   8. The Lotus Eaters ? 4:25\n   9. Poison Godmachine ? 4:33\n  10. All Play Dead ? 4:58\n  11. Cenotaph ? 4:39\n  12. No More Will ? 5:45\n  13. Forever ? 9:20\n\n\n\n              LINE UP:\n    * Warrel Dane - vocals\n    * Jim Sheppard - bass\n    * Jeff Loomis - guitars\n    * Tim Calvert - guitars\n    * Van Williams - drums\n\n\nReview taken from metal-observer.com:\n&quot;Dreaming Neon Black&quot; is NEVERMORE&amp;#039;s masterpiece. This is them becoming! This album is perhaps one of or dare I say the most outstanding concept album ever in all Metal? The concept is a semi-autobiographical story of vocalist Warrel Dane. He tells the emotional story of a man who&amp;#039;s loved one goes missing which ultimately leads to the breakdown and suicide of the main character.\nI call this Power Metal only because of the riffs and power chords and for lack of a more fitting genre?I don&amp;#039;t like classifying them this way because it just does not suit them. Truly, they should not be classified! They are dark, evil, moody and serious all at the same time. Power Metal is usually glorious and somewhat happy sounding and rarely deals with serious issues explored here.\nThe story starts with a short dark intro before blasting into &quot;Beyond Within&quot; - a great lead-off track that hooks the listener with its incredible riffing, double bass and amazing lyrics. As always, Warrel&amp;#039;s vocals are amazing. The story continues track after track with absolutely no filler. &quot;Dreaming Neon Black&quot; opens with nice acoustic guitar accompanied by both painful and whispered vocals by Dane. This song includes the soft beautiful vocals of Christine Rinehart who sang on &quot;Garden Of Gray&quot; from their self-titled debut.\nDeconstruction contains some of the most powerful and descriptive lyrics I have ever seen as well as a memorable riff and an acoustic passage in the middle that well?just needs to be heard. Aggression and speed pick up with &quot;The Fault Of The Flesh&quot; before &quot;The Lotus Eaters&quot; takes it back down a notch. No one can deny the pain and gloom in this track. &quot;Poison Godmachine&quot; has the rhythm and feel of their previous album &quot;The Politics Of Ecstasy&quot; - also outstanding. I will leave the other tracks for you to explore. If you want to feel the emotion and pain of this story, put on a good set of headphones, shut off the lights and listen to the final track &quot;Forever&quot;.\nIf you want an outstanding concept album with incredible lyrics and emotion that also is memorable for its outstanding riffs and incredible tempo changes, &quot;Dreaming Neon Black&quot; is king. Warrel Dane&amp;#039;s vocals are one of a kind that I think are up with the likes of Geoff Tate and Bruce Dickinson. His lyrics are second to none in all metal. This CD is well-produced by Neil Kernon and all musicians are top-notch. I challenge you to pick this up and give it the time it deserves. It should be top 20 for all Metalheads.","torrent":{"xt":"urn:btih:9d270e261500729a32b4a0f1198e436454339768","amp;dn":"Nevermore+-+Dreaming+Neon+Black+%281999%29+%5BEAC-FLAC%5D+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9d270e261500729a32b4a0f1198e436454339768","infoHashBuffer":{"type":"Buffer","data":[157,39,14,38,21,0,114,154,50,180,160,241,25,142,67,100,84,51,151,104]},"announce":[],"urlList":[]}}