{"title":"Dr Who Season 3","uid":4183162,"size":4764989440,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:9e41257805ef8d5c0eaa259857818653454e3d06&amp;dn=Dr+Who+Season+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Bagehi","files":13,"time":1210520890,"description":"The third series of British science fiction series Doctor Who began on 25 December 2006 with the Christmas special &quot;The Runaway Bride&quot;. Following the special, a regular series of thirteen episodes was broadcast, starting with &quot;Smith and Jones&quot; on 31 March 2007.\n\n\nFollowing the success of the first series, the BBC announced that Doctor Who had been recommissioned for a third series on 16 June 2005, only two months after the announcement of the second series. Filming for the Christmas special began on 4 July 2006, with production on the series itself beginning on 8 August and concluding on 19 March 2007.\n\nFirst-time writers for the show included Gareth Roberts, who previously wrote the interactive episode &quot;Attack of the Graske&quot; and the TARDISODEs, Helen Raynor, one of the show&amp;#039;s script editors, Chris Chibnall, the head writer and co-producer of spin-off series Torchwood, and Stephen Greenhorn. Previous writers Paul Cornell, Steven Moffat and Russell T Davies all contributed to the series, with Davies continuing to act as head writer and executive producer. Euros Lyn, Charles Palmer, Richard Clark, James Strong, Graeme Harper, Hettie MacDonald and Colin Teague directed episodes in the series.\n\nThe episodes in series three are arranged in a loose story arc: &quot;Mr Saxon&quot;, an alias for the Master. The character&amp;#039;s name was first mentioned in &quot;The Runaway Bride&quot;; the Ministry of Defence shot down an alien craft at Saxon&amp;#039;s request. Several elements from episodes in the series are contributory to the three-part finale: the events of &quot;The Lazarus Experiment&quot; and &quot;42&quot; were directly influenced by the Master; the Face of Boe&amp;#039;s prophecy is directly related to Master; and the fob-watch used by the Doctor to change his Time Lord biology into human was used by the Master to hide from the Time Lords.\n &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Doctor_Who_%28series_3%29&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Doctor_Who_%28series_3%29&lt;/a&gt;","torrent":{"xt":"urn:btih:9e41257805ef8d5c0eaa259857818653454e3d06","amp;dn":"Dr+Who+Season+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"9e41257805ef8d5c0eaa259857818653454e3d06","infoHashBuffer":{"type":"Buffer","data":[158,65,37,120,5,239,141,92,14,170,37,152,87,129,134,83,69,78,61,6]},"announce":[],"urlList":[]}}