{"title":"Owlet Caterpillars of Eastern North America - David L. Wagner","uid":12833576,"size":62198944,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:a0934d5af34d4858b982a0c399fd65e172705f70&amp;dn=Owlet+Caterpillars+of+Eastern+North+America+-+David+L.+Wagner+&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heliiaruy","files":1,"time":1448415815,"description":"Print Length: 576 pages\r\nPublisher: Princeton University Press (December 27, 2011)\r\n\r\nThis lavishly illustrated field guide features more than 800 species of the most common, interesting, beautiful, and important owlet (noctuid) caterpillars found in eastern North America. More than 2,100 color photographs include numerous stunning images, and the guide's introductory sections offer a wealth of information on noctuid natural history, morphology, larval diets, natural enemies, and classification; suggestions for finding and rearing owlet caterpillars; and much more. The 375 full-page species accounts treat similar species, range, phenology, and larval foodplants. A remarks section addresses behavior, life history, taxonomy, and a variety of other general interest topics. For full species accounts, two adult images are provided, one of a spread museum specimen and the other of a live adult: this is the first guide to comprehensively provide images of live adult moths in representative resting postures. An extensive glossary and foodplant index are also included.\r\n\r\n\r\n\r\nazw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy","torrent":{"xt":"urn:btih:a0934d5af34d4858b982a0c399fd65e172705f70","amp;dn":"Owlet+Caterpillars+of+Eastern+North+America+-+David+L.+Wagner+","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a0934d5af34d4858b982a0c399fd65e172705f70","infoHashBuffer":{"type":"Buffer","data":[160,147,77,90,243,77,72,88,185,130,160,195,153,253,101,225,114,112,95,112]},"announce":[],"urlList":[]}}