{"title":"The Lamb's War - Fr. Phil Berrigan - mp3 - MLK Calibre","uid":4202202,"size":202103555,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:a1132e88f78b6e2b39e799c05f423d55b75e8f36&amp;dn=The+Lamb%5C%27s+War+-+Fr.+Phil+Berrigan+-+mp3+-+MLK+Calibre&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"PeaceTorrent","files":24,"time":1211564834,"description":"Fr. Phil Berrigan in this book reveals his brilliant grasp of Non-Violent warfare; a grasp of the caliber of ML King and Gandhi.  Must read.\n\n-----------------------\n\nIn his own voice, still clear and strong, Philip Berrigan has written the story of how he and his brother became the two most infamous Catholic radicals of the Vietnam era and chronicles his ongoing resistance to war and injustice through the Ploughshares movement. Berrigan begins with moving descriptions of his family life. His mother, caught in a troubled and tumultuous marriage, was a constant source of love and a living example of kindness and commitment. His father, an unstable Irishman, socialist, labor organizer, and unsuccessful bard, was prone to settling disagreements with fisticuffs; readers do not wonder long where the Berrigan brothers&amp;#039; blend of righteous fierceness and principled courage comes from. The detailed stories of their paths toward the priesthood, their burning of draft cards at Catonsville, their underground cat-and-mouse games with Hoover&amp;#039;s FBI, and their courtroom and prison-yard challenges are recounted in crisp language with little sentimentality. --This text refers to an out of print or unavailable edition of this title.\n\nThe New York Times Book Review, J. Anthony Lukas\nWhatever reservations one may have about the Berrigans&amp;#039; style of dissent, one must admire their dogged persistence and fierce devotion to principle. Now 73, Phil not so long ago completed 10 months in a federal prison for raining hammer blows and pouring blood on an F-15 fighter bomber. . . . --This text refers to an out of print or unavailable edition of this title. ","torrent":{"xt":"urn:btih:a1132e88f78b6e2b39e799c05f423d55b75e8f36","amp;dn":"The+Lamb%5C%27s+War+-+Fr.+Phil+Berrigan+-+mp3+-+MLK+Calibre","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1132e88f78b6e2b39e799c05f423d55b75e8f36","infoHashBuffer":{"type":"Buffer","data":[161,19,46,136,247,139,110,43,57,231,153,192,95,66,61,85,183,94,143,54]},"announce":[],"urlList":[]}}