{"title":"Advanced Karaokeayer V3.7","uid":4237496,"size":67584614,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a1347690ba18d1143387d67034922d2fcf435561&amp;dn=Advanced+Karaokeayer+V3.7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"akplayer","files":8,"time":1213369277,"description":"You may have a lot of media contents like video, music files stored in your computer or CD&amp;#039;s, DVD&amp;#039;s scattered around your house. It is very frustrating for many users not being able to find the right file or disc for desired movies or music. The solution is here. Advanced Karaoke Player is the answer for management of your multimedia contents. It is the center of your family multimedia entertainments. Just let it does the heavy lifting. You can just sit back and enjoy.    \nThis software is designed specifically as the family entertainment center. It is used commercially in Karaoke bars and nightclubs. It is used to manage karaoke play lists and DVD/VCD movie contents. Please check the Help documents after installation for a more comprehensive list of features.\n\nUser interface is very professionally done with ability to change the skin for your own taste. It is very easy to use and stable. It supports all major format including DAT, MPG, AVI,MP4, WMV, ASF, VOB, RM, RMVB. More media formats support can be added later with no need to purchase expensive hardware.\n\nSong selection based on intelligent spelling matches or artists are the most convenient ways. You can save your favorites songs in a play list.\n\nThis software supports input devices including computer mice, keyboards, remote controls and touch screen.\n\nYou can preset the volume of your media file (0-100) to avoid uneven sound outputs during media playbacks. \n\nYou can preset Karaoke sound channels for non-standard tracks. (Default: 1. Non-Standard Tracks: 2)\n\nThe software now has great support for Karaoke DVD songs and DVD movie playbacks(DVD play PopupMenu)!\n\nSupport for two graphic cards (one of them must have S-Video output).","torrent":{"xt":"urn:btih:a1347690ba18d1143387d67034922d2fcf435561","amp;dn":"Advanced+Karaokeayer+V3.7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1347690ba18d1143387d67034922d2fcf435561","infoHashBuffer":{"type":"Buffer","data":[161,52,118,144,186,24,209,20,51,135,214,112,52,146,45,47,207,67,85,97]},"announce":[],"urlList":[]}}