{"title":"Bob Kincaid Show - June 13, 2008 (24kbs Audio).mp3","uid":4240574,"size":32354322,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:a1a72d01cb7f5eacf0e0e52dddcca12ce0adc6fc&amp;dn=Bob+Kincaid+Show+-+June+13%2C+2008+%2824kbs+Audio%29.mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DBaum23","files":1,"time":1213522176,"description":"Bob Kincaid learned he was inclined to the left at about the time chickens were invented. His age has never been documented exactly because when doctors peered up at the clock, the left-hand was missing and the only pen had been left in the adjoining room located on the left side of the hospital which was on the left side of the tracks in a small town that (ironically) sits in the left side of the state. He was even forgotten and left at the hospital with two left adult size shoes placed on his left side in the crib. As a result, dancing was never a career option.\n\nIn grade school, Bob?s school had corridors that cornered left into a classroom on the left side of the hall. Bob sat in a left desk and often left his books behind. Naturally, being left handed, left footed and slightly angling his cap bills to the left were just some of Bob?s signatures that brought him acclaim enough to be the first offered to author the Left Behind series. As you may know now, Bob declined the opportunity because he was more impressed with football, at least until his first game. On the first play of the game, he was knocked into left field by an opposing southpaw quarterback.\n\nEven in college Bob was at a disadvantage because of his left consistencies. As freshmen in college, Bob?s most difficult class was ROTC. He refused anything right and attracted negative attention while marching out of sequence and disrupting ranks with ?left..left..left..left..left?.\n\nBut now, Bob Kincaid is finally settling into what?s left for him in life. Bob Kincaid is right-on with Head-On and can now march on the air by doing what he believes to be right..the left.\n\nLike he says: ?You can be right and be wrong or be left and be right.?","torrent":{"xt":"urn:btih:a1a72d01cb7f5eacf0e0e52dddcca12ce0adc6fc","amp;dn":"Bob+Kincaid+Show+-+June+13%2C+2008+%2824kbs+Audio%29.mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1a72d01cb7f5eacf0e0e52dddcca12ce0adc6fc","infoHashBuffer":{"type":"Buffer","data":[161,167,45,1,203,127,94,172,240,224,229,45,221,204,161,44,224,173,198,252]},"announce":[],"urlList":[]}}