{"title":"MIND CONTROL (Orwell_plato_brainwashing_theylive_KGB_nwo)","uid":4069996,"size":229309667,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:a1c7c960e4094bb705b088d3ea51219fbe7b2e8b&amp;dn=MIND+CONTROL+%28Orwell_plato_brainwashing_theylive_KGB_nwo%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BakuninXL","files":31,"time":1205002461,"description":"Mind control is probably THE issue of the century! Do you believe it is by accident that the population has become a mass of lobotomized zombies focused on trivialities, lemmings totally apathic when it comes to anything that is important? To put it simple, in case that you neither have spent your life in some remote location without media access, nor know anything about mind control and related topics, than your mind is controlled! Its as simply as that! \n\nCollection of short videos, books, essays, and short stories, on the subject of mind control and related topics like compulsory schooling, the human mind, freedom, propaganda, censorship, and human domestication.\n\n\nIncludes:\n\n\n- Charlotte Iserbyt - Deliberate Dumbing Down of the World (Video clip)\n- John Taylor Gatto - State Controlled Consciousness (Video clip)\n- Mind control - Your thoughts are not your own (Video clip)\n- Plato&amp;#039;s Cave (Video clip)\n- TV Mind Control (Video clip)\n- Your Mind is Controlled (Video clip)\n- Yuri Bezmenov - The KGB and the brain washing of the West (Video clip)\n- Various books and articles on the subject of mind control\n\n\n\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Veritas vos Liberabit &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;\n\n\n\n\n\n&quot;..modern methods of propaganda. Of these the most influential is what is called &quot;education&quot; .. It may be hoped that in time anybody will be able to persuade anybody of anything if he can catch the patient young and is provided by the State with money and equipment. .. Where all children go to school, and all schools are controlled by the government, the authorities can close the minds of the young to everything contrary to official orthodoxy. .. The populace will not be allowed to know how its convictions were generated.&quot; -- Bertrand Russell, &quot;The Impact of Science on Society&quot;","torrent":{"xt":"urn:btih:a1c7c960e4094bb705b088d3ea51219fbe7b2e8b","amp;dn":"MIND+CONTROL+%28Orwell_plato_brainwashing_theylive_KGB_nwo%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a1c7c960e4094bb705b088d3ea51219fbe7b2e8b","infoHashBuffer":{"type":"Buffer","data":[161,199,201,96,228,9,75,183,5,176,136,211,234,81,33,159,190,123,46,139]},"announce":[],"urlList":[]}}