{"title":"Still Game Series4.rar","uid":4064922,"size":1448464181,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a39b713d2af69269431bd036d13012e11981027f&amp;dn=Still+Game+Series4.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"o0oliambeeo0o","files":1,"time":1204756433,"description":"Series 4 (2005)\n\n\n\n\n\n\nKill Wullie - Jack and Victor&amp;#039;s friend, Wullie, is dating a younger woman. Rumours abound in Craiglang that his mistress is trying to bump him off. Meanwhile Winston struggles with his new leg and a young hooligan is conning pensioners out of money.\n\nWireless - Jack and Victor take up the job of the local hospital&amp;#039;s radio station, from Tam who is away on holiday, gaining quite a fanbase in the process. Navid also ends up in hospital with a very personal problem.\n\nDial-A-Bus - Jack and Victor are set on a crazed bus journey driven by Davie (guest star Robbie Coltrane). Meanwhile Tam decides to tag along while Navid goes to get stock and Bobby decides to leave the clansman to do some cycling. Winston takes advantage of Bobby&amp;#039;s absensce by pretending to be the real owner of the clansman.\n\nRing - Tam decides to marry Frances, his sweetheart from the second series. As always in Craiglang, things never go to plan. Meanwhile Navid&amp;#039;s shop is part of a big business take-over.\n\nHatch - Jack has got Sky Digital TV, Victor hasn&amp;#039;t, they solve this problem by getting a &quot;hatch&quot; put in between their rooms so that they can both watch. But things go terribly wrong when Isa suspects them to be gay.\n\nWho&amp;#039;s The Daddy? - Jack, Victor and Winston fear they may have fathered a child in their teenage years, but they are unsure who it may be. The child in question is also part of the plan to pull down The Clansman.\n","torrent":{"xt":"urn:btih:a39b713d2af69269431bd036d13012e11981027f","amp;dn":"Still+Game+Series4.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a39b713d2af69269431bd036d13012e11981027f","infoHashBuffer":{"type":"Buffer","data":[163,155,113,61,42,246,146,105,67,27,208,54,209,48,18,225,25,129,2,127]},"announce":[],"urlList":[]}}