{"title":"Love, Actually (2003) [DVDRip, Xvid, 2.35 WS, Eng]-QuincyMKT","uid":4072321,"size":2097156096,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a4c6a377ae65fa13a8622f299b287309fede61e2&amp;dn=Love%2C+Actually+%282003%29+%5BDVDRip%2C+Xvid%2C+2.35+WS%2C+Eng%5D-QuincyMKT&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"media2007","files":1,"time":1205109483,"description":"Love, Actually (2003)\n\nFrom the makers of Notting Hill and Bridget Jones? Diary comes the ultimate romantic comedy. This blockbuster film includes a fantastic all-star cast and an outstanding soundtrack. The hilarious Love Actually explores the ups and downs of relationships in the weeks building up to Christmas. Boyfriends and girlfriends, husbands and wives, fathers and sons and rock stars and managers all combine to make Love Actually not just one story but ten very different ones.\n\nWith no fewer than eight couples vying for our attention, Love Actually is like the London Marathon of romantic comedies, and everybody wins. Having mastered the genre as the writer of Four Weddings and a Funeral, Notting Hill, and Bridget Jones's Diary, it appears that first-time director Richard Curtis is just like his screenplays: he just wants to be loved, and he'll go to absurdly appealing lengths to win our affection. With Love Actually, Curtis orchestrates a minor miracle of romantic choreography, guiding a brilliant cast of stars and newcomers as they careen toward love and holiday cheer in London, among them the Prime Minister (Hugh Grant) who's smitten with his caterer (Martine McCutcheon); a widower (Liam Neeson) whose young son nurses the ultimate schoolboy crush; a writer (Colin Firth) who falls for his Portuguese housekeeper; a devoted wife and mother (Emma Thompson) coping with her potentially unfaithful husband (Alan Rickman); and a lovelorn American (Laura Linney) who's desperately attracted to a colleague. There's more--too much more--as Curtis wraps his Christmas gift with enough happy endings to sweeten a dozen other movies. That he pulls it off so entertainingly is undeniably impressive; that he does it so shamelessly suggests that his writing fares better with other, less ingratiating directors. \n\nQuincyMKT","torrent":{"xt":"urn:btih:a4c6a377ae65fa13a8622f299b287309fede61e2","amp;dn":"Love%2C+Actually+%282003%29+%5BDVDRip%2C+Xvid%2C+2.35+WS%2C+Eng%5D-QuincyMKT","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4c6a377ae65fa13a8622f299b287309fede61e2","infoHashBuffer":{"type":"Buffer","data":[164,198,163,119,174,101,250,19,168,98,47,41,155,40,115,9,254,222,97,226]},"announce":[],"urlList":[]}}