{"title":"SIVI(2007)Terrifying Horror Movie~2 Disks Spl.~Edition~Brought t","uid":4225793,"size":1162862620,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a4f7e0990dac7648963fa1417ea07a5daedb8f48&amp;dn=SIVI%282007%29Terrifying+Horror+Movie%7E2+Disks+Spl.%7EEdition%7EBrought+t&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"superstar_87","files":48,"time":1212818378,"description":"A white face that stares at you eerily out of a photo, flashes of white that cut across friends and classmates, strange noises and crashing cars -- all the necessary pre-requisites of a horror movie greet you in B K S Cine Circuit\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s production, Sivi. \n\nYou learn that this is a ghost story, and prepare to yawn. Girl loves boy; is betrayed by boy; dies by some devious means; haunts him and his cronies until they mutilate themselves to a gory death -- end of story. So what\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s new?\n\nDirector K R Senthilnathan\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s Sivi\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s hero Krishna (Yogi) and heroine Sonu (Jeyashree Rao) prance to fast-paced duets all over the world and share beers with Krishna\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s friends Sara (Funky Shankar) and Co (who make a lot of lewd references).\n\nPredictably enough, mysterious and horrifying incidents begin to crop up. In a scene reminiscent of I Know What You Did Last Summer, Krishna and Sonu\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s car hit a girl crossing the road. Seized by panic, the duo make good their escape. Soon after, Sonu is wracked by guilt while Krishna tries to shrug it off. And then, mayhem proper begins. \n\nKrishna, a professional photographer (though he never goes out on assignments other than a friend\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s convocation ceremony, which is where problems crop up) develops photos taken at the said ceremony to find a horrifying face staring out among other students. \n\nAnother shot -- inspired by Omen -- follows, showing several classmates and friends with a knife-like white shaft cutting through their throats. One incongruity: Krishna has a dark room of his own, yet gives the negatives to be developed at a studio. \n\nMoving on, girlfriend Sonu, who also never attends her PG classes except one on photography, joins him on his suspense filled hunt to get to the bottom of these terrifying occurrences. \n\nFrom then on it is a roller-coaster ride. Krishna is tormented by past incidents and memories that, though seemingly disconnected, bind together the ghostly apparition -- and her presence in his life. \n\nClearly inspired by The Ring and The Grudge, the terror-inspiring spectre of Nandhini (Anuja), who shimmers terrifyingly at curious places, walks away with honours. The scene where Sonu first encounters the angry spirit is truly chilling. Not to mention the staircase chase -- that one deserves kudos for its shock-factor. \n\nIt\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s clearly the climax though, that packs a punch, and worth all the minutes of waiting, watching and wondering. An end that fits perfectly with the tone of the story, incidentally tying up with the title of the movie as well. A pat on the back to the editor for some slick work. \n\nDebutants Yogi and Jeyashree Rao (who looks like a cross between Bengali actress Debashree Roy and Hindi\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s Shilpa Shetty [Images]) have turned in some good work -- at least they can make their faces assume some of the expressions required, and do not resort to unnecessary screaming that seems such a staple of Tamil horror fare. \n\nThere isn\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t much of blood and gore either; clearly the director has let the horror factor speak for itself. A huge and welcome relief is the lack of fight scenes and songs that do not mar the tempo every five minutes.\n\nRegardless of the well-written screenplay, the treatment contains, doubtless, a few faults. Krishna and Sonu\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s dialogue delivery is pretty awful, the words rendered silly by the indeterminately long pauses, robbing their emoting -- such as it is -- of any power. \n\nThe half-baked comedy track, with Aarthi and City Babu could have been done away with altogether. \n\nDharan\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;s music, even if it has listeners tapping to its numbers such as O Nenje, blares out screeches and noise at every ghostly happening, jangling your nerves. Silence is after all golden, and would have increased the chilling factor. \n\nEven as the logical screenplay (in places) makes you marvel, you learn that the whole movie is a rip-off, scene by scene, of the 2004 Thai thriller, Shutter. Ah well. You can\\\\\\\\\\\\\\\\\\\\\\\\\\\\\\&amp;#039;t have everything, can you? \n\nNevertheless, hold onto your seats  because copy or not, it can still make you freeze in shock.\n\nScreenshots:\n\n &lt;a href=&quot;\nhttp://uploadingzone.com/out.php/i4326_vlcsnap522880.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uploadingzone.com/out.php/i4326_vlcsnap522880.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://uploadingzone.com/out.php/i4327_vlcsnap521919.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uploadingzone.com/out.php/i4327_vlcsnap521919.png&lt;/a&gt;\n &lt;a href=&quot;\nhttp://uploadingzone.com/out.php/i4328_vlcsnap522400.png&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uploadingzone.com/out.php/i4328_vlcsnap522400.png&lt;/a&gt;","torrent":{"xt":"urn:btih:a4f7e0990dac7648963fa1417ea07a5daedb8f48","amp;dn":"SIVI%282007%29Terrifying+Horror+Movie%7E2+Disks+Spl.%7EEdition%7EBrought+t","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a4f7e0990dac7648963fa1417ea07a5daedb8f48","infoHashBuffer":{"type":"Buffer","data":[164,247,224,153,13,172,118,72,150,63,161,65,126,160,122,93,174,219,143,72]},"announce":[],"urlList":[]}}