{"title":"WinRAR - Only.FULL.Activators (Working until v5.30)","uid":12856831,"size":101681,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:a6e4059136d20f44d3047df493eb5a85ccb638da&amp;dn=WinRAR+-+Only.FULL.Activators+%28Working+until+v5.30%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"edmacri","files":4,"time":1448678546,"description":"Activation Update: Active until the last version 5.30\r\n\r\n\r\nThis is just the &quot;License Creator&quot; and the &quot;Reg File Activator&quot; to activate the &quot;WinRAR&quot;.\r\nIf you already have &quot;Winrar&quot; and need only activate, this is your solution!\r\nIt tested and works 100% guaranteed.\r\nSome antivirus can give warning of virus, but that's just a &quot;false positive&quot;.\r\nBelow I leave the indications for the use of the activators of &quot;WinRAR&quot;\r\n\r\n\r\n---------------------------------\r\nInstrucciones:\r\n\r\n1.- Instala el programa de acuerdo a tu sistema: x32 o x64. Al terminar la instalación cierra el programa completamente.\r\n\r\n2.- Abre la carpeta &quot;Activation&quot; dentro encontraras dos archivos que te dan dos opciones diferentes de activación del producto:\r\n\r\n-&quot;keygen-CORE.(v3.91).exe&quot; este es un keygen que crea un archivo de registro (reg), en el espacio &quot;Name&quot; pones tu nombre, en &quot;Type&quot; escoges la opción &quot;Single PC usage license&quot; y das clic en &quot;Save License&quot; y lo guardas dentro del directorio donde se instaló el programa y lo ejecutas.\r\n\r\n-&quot;rarreg.key&quot; este es una archivo de registro, lo copias y lo pegas dentro del directorio donde se instaló el programa y lo ejecutas.\r\n\r\nCualquiera de las dos opciones es válida.\r\n--------------------------------------------\r\nInstructions:\r\n\r\n1.- Install the program according to your system: x32 or x64. When the installation is finished close the program completely.\r\n\r\n2.- Open the folder &quot;Activation&quot; inside you will find two files that give you two different options for activation of the product:\r\n\r\n- &quot;keygen-CORE.(v3.91).exe&quot;, this is a keygen it creates a log file (reg), in the option &quot;Name&quot; put your name, in the option &quot;Type&quot; choose the option &quot;Single PC usage license&quot;, and you click on &quot;Save License&quot; and save it in the directory where the program is installed and run it.\r\n\r\n- &quot;rarreg.key&quot; This is a log file, copy it and paste it into the directory where you installed the program and run it.\r\n\r\nEither of the two options are valid.\r\n\r\nxxxxxxxxxxxxxxxxxxxx\r\n\r\nYou can download the latest WinRAR (v5.30) from their official website:\r\n \nhttp://www.rarlab.com/\r\n\r\nOnly the following languages:\r\nArabic (32 bit, 64 bit), Armenian (32 bit, 64 bit), Bulgarian (32 bit, 64 bit), Chinese Traditional (32 bit, 64 bit), Danish (32 bit, 64 bit), Dutch (32 bit, 64 bit), English (32 bit, 64 bit), Estonian (32 bit, 64 bit), Finnish (32 bit, 64 bit), French (32 bit, 64 bit), German (32 bit, 64 bit), Hebrew (32 bit, 64 bit), Hungarian (32 bit, 64 bit), Indonesian (32 bit, 64 bit), Lithuanian (32 bit, 64 bit), Persian (32 bit, 64 bit), Portuguese Brazilian (32 bit, 64 bit), Russian (32 bit, 64 bit), Serbian Cyrillic (32 bit, 64 bit), Swedish (32 bit, 64 bit), Thai (32 bit, 64 bit), Ukrainian (32 bit, 64 bit), Vietnamese (32 bit, 64 bit).\r\n\r\n\r\nYou can check in this place if the file is trusted.\r\nAnalysis by &quot;Virus Total&quot;: \nhttps://www.virustotal.com/es/file/776303a0a9794f0abc8696c395892d84de37b050c5adb76e2f7fe64f594090e1/analysis/1448673658/","torrent":{"xt":"urn:btih:a6e4059136d20f44d3047df493eb5a85ccb638da","amp;dn":"WinRAR+-+Only.FULL.Activators+%28Working+until+v5.30%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a6e4059136d20f44d3047df493eb5a85ccb638da","infoHashBuffer":{"type":"Buffer","data":[166,228,5,145,54,210,15,68,211,4,125,244,147,235,90,133,204,182,56,218]},"announce":[],"urlList":[]}}