{"title":"Kid Nation - Season 01 - Complete","uid":4085840,"size":4960707448,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:a795af0c7d2e1de7b0fc94612f8e402fc49406ac&amp;dn=Kid+Nation+-+Season+01+-+Complete&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bkaludjer","files":13,"time":1205797004,"description":"In this youth-oriented variation on the familiar Survivor reality-competition format, a group of forty youngsters, ages eight through fifteen, took charge of the Bonanza Creek Ranch (aka Bonanza City), a deserted piece of property in Santa Fe, New Mexico. Cut off from their parents, and with no modern comforts or conveniences at their disposal, the youngsters were given the task to create their own self-governing community from the ground up, with all responsibilities and chores equitably distributed among them; the kids were also obliged to come up with their own recreational activities and entertainment. At the end of forty days, the youthful citizens of Kid Nation were expected to &quot;build a new world&quot; and put their ghost town back on its feet as a thriving tourist attraction. When CBS first announced plans for Kid Nation, the network came under fire for its &quot;exploitation&quot; of children by having the individual youngsters conform to certain stereotypical behavior (the smart one, the angry one, the pugnacious one etc.) and for its &quot;encouragement&quot; of child labor. However, the kids didn&amp;#039;t seem to mind being under the spotlight at all, and in fact thrived under the pressures brought to bear. Nor, contrary to expecations, were certain youngsters &quot;traumatized&quot; by being voted off the show at the end of each episode, a la Survivor; true, each installment ended with a &quot;town meeting&quot; in which there was an elimination process, but those who departed the show chose to leave on their own accord (despite foreknowledge that those who &quot;toughed it out&quot; earned special privileges and perks along the way). Kid Nation debuted September 19, 2007.","torrent":{"xt":"urn:btih:a795af0c7d2e1de7b0fc94612f8e402fc49406ac","amp;dn":"Kid+Nation+-+Season+01+-+Complete","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a795af0c7d2e1de7b0fc94612f8e402fc49406ac","infoHashBuffer":{"type":"Buffer","data":[167,149,175,12,125,46,29,231,176,252,148,97,47,142,64,47,196,148,6,172]},"announce":[],"urlList":[]}}