{"title":"Shi mian mai fu (2004) Xvid.","uid":4094855,"size":2207512048,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:a81925afd6ea2d48112f53400e42e743f3bd7558&amp;dn=Shi+mian+mai+fu+%282004%29+Xvid.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":3,"time":1206259612,"description":"Plot Outline:\nA romantic warrior breaks a beautiful member of a rebel army out of prison to help her rejoin her fellows, but things are not what they seem.\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0385004/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0385004/&lt;/a&gt;\n\n\nAwards: Nominated for Oscar. Another 16 wins &amp; 33 nominations \nRelease Date: 8 September 2006 (India)\n\nAlso Known As: House of Flying Daggers (Hong Kong: English title) (International: English title) (Singapore: English title) (USA) Attack from Ten Directions (International: English title) (literal title)\n\n\nThis was originally going to be Anita Mui&amp;#039;s final appearance in film and she had already accepted the role but, because she was battling cervical cancer, her part wasn&amp;#039;t going to be filmed until early 2004. After her death on 30 December 2003, director Yimou Zhang decided to alter the script rather than find a replacement. Anita&amp;#039;s name will still be listed in the credits. \n\n\n\nThe Colors of wind are the thoughts of the heart\n\nFrom Yimou Zhang, the director of Jet Li&amp;#039;s Hero and Raise the Red Lantern, comes a spectacular tale about honor, and love.\n\nHouse of Flying Daggers is the gripping, touching, and visually spectacular tale of two people, caught in a Romeo and Juliet story, and the nation at war they must fight together.\n\nIt is near the end of the Tang Dynasty era, and The Captain Jin (Kaneshiro) and Leo (Lau) tangle with Mei (Zhang), a dancer suspected of having ties to a revolutionary faction known as the House of Flying Daggers. Enraptured by her, the deputies concoct a plan to save her from capture, and Jin leads her north in what becomes a perilous journey into the unknown.\n\nThe dialogue, beautifully bright costumes, and landscapes will take you on a wonderful journey. A journey of dance, music, and beautiful words.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:a81925afd6ea2d48112f53400e42e743f3bd7558","amp;dn":"Shi+mian+mai+fu+%282004%29+Xvid.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a81925afd6ea2d48112f53400e42e743f3bd7558","infoHashBuffer":{"type":"Buffer","data":[168,25,37,175,214,234,45,72,17,47,83,64,14,66,231,67,243,189,117,88]},"announce":[],"urlList":[]}}