{"title":"Elvis Presley - Springtime 72! (Richmond VA 04-10-72)","uid":4083398,"size":79555604,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:a8d56a953537757187147d8f381490e667e0a32f&amp;dn=Elvis+Presley+-+Springtime+72%21+%28Richmond+VA+04-10-72%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pacone","files":43,"time":1205680230,"description":"\nGran sonido en este CD olvidemonos de la vieja version de Vicky Record, esta nueva remasterizacion es excelente. Como un bonus trae las grabaciones de Waco Texas en el 58 que tambien fueron entragadas en CD hace un tiempo pero un sonido bastante pobre. Asi que disfruten y como siempre sigan subiendolo despues de descargar.\n\nSpringtime 72! is a new CD release from a new label: Memphis. The CD contains a newly remastered soundboard recording of the Elvis Presley show, April 10, 1972 (from the original Elvis On Tour mastertapes) and Elvis recorded live at Eddie Fadal&amp;#039;s home in Waco, Texas, May 27, 1958. Both recordings are for the first time available in this quality! The cd release with the Texas homerecording recording was very poor.\n\nSONGS:\nSOUNDBOARD RECORDING - ELVIS RECORDED LIVE IN RICHMOND, APRIL 10, 1972\n1. See See Rider 2. Proud Mary 3. Never Been To Spain 4. You Gave Me A Mountain 5. Until It&amp;#039;s Time For You To Go 6. Polk Salad Annie 7. Love Me 8. All Shook Up 9. Bridge Over Troubled Water 10. Love Me Tender 11. It&amp;#039;s Over 12. Introductions of musicians and backup vocalists 13. For The Good Times 14. An American Trilogy 15. Elvis Walks &amp; Talks 16. Funny How Time Slips Away 17. Can&amp;#039;t Help Falling In Love 18. End Theme 19. Elvis has left the building / souvenir announcement\n\nHOME RECORDING - ELVIS RECORDED LIVE IN WACO, TEXAS, MAY 27, 1958: Elvis - Anita Wood - Eddie Fadal - Janice Fadal 20. I Understand Just How I Feel 21. Dialogue 22. Happy, Happy Birthday Baby 23. Dialogue 24. I Can&amp;#039;t Help It (If I&amp;#039;m Still In Love With You) 25. Dialogue 26. Who&amp;#039;s Sorry Now 27. Who&amp;#039;s Sorry NOw 28. Happy, Happy Birthday Baby 29. Happy, Happy Birthday Baby 30. Happy, Happy Birthday Baby 31. Happy, Happy Birthday Baby 32. Happy, Happy Birthday Baby 33. Dialogue 34. Tumblin&amp;#039; Tumbleweeds 35. Baby Don&amp;#039;t Ya Know 36. Tomorrow Night 37. Tomorrow Night (by Elvis) 38. Little Darlin&amp;#039; 39. Monologue 40. Just A Closer Walk With Thee \n\nEnjoy and help me seeding","torrent":{"xt":"urn:btih:a8d56a953537757187147d8f381490e667e0a32f","amp;dn":"Elvis+Presley+-+Springtime+72%21+%28Richmond+VA+04-10-72%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"a8d56a953537757187147d8f381490e667e0a32f","infoHashBuffer":{"type":"Buffer","data":[168,213,106,149,53,55,117,113,135,20,125,143,56,20,144,230,103,224,163,47]},"announce":[],"urlList":[]}}