{"title":"VueScan Professional Edition v8.4.73","uid":4208269,"size":5397916,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:aa1ff091b67bcae4d3fc919b6e2ffc2d33aa7190&amp;dn=VueScan+Professional+Edition+v8.4.73&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Black_Bilbo","files":3,"time":1211920681,"description":"\nVueScan is a powerful, easy to use program that: \nworks with 750 flatbed and film scanners \nruns on Mac OS X, Windows and Linux \nruns faster with multiple processors \nhas been downloaded more than 5 million times !!\n\n\nFeature Comparison\n\nVueScan and SilverFast are the two leading multi-vendor scanner programs. Some differences are:\n\nSupported scanners - VueScan supports 750 scanners and SilverFast supports 289 scanners.\n\nUniversal Binary - VueScan runs faster on Intel Macs because it is a universal binary. Silverfast is an older PowerPC program that runs slower on Intel Macs (it has a universal binary launcher, but the SilverFast plugin is PowerPC only).\n\nMulti-processor - VueScan runs faster on multi-processor systems (including multi-core systems) on Windows, Mac OS X and Linux. Silverfast doesn&amp;#039;t have multi-processor support and is slower.\n\nNumber of scanners - a single copy of VueScan can work with all supported scanners, but you need to purchase and install a separate copy of SilverFast for each scanner you use.\n\nUpgrades - VueScan Standard Edition includes one year of free upgrades and VueScan Professional Edition includes unlimited free upgrades. SilverFast upgrades can cost up to $304.\n\nFilm scanning - VueScan is widely acknowledged to produce superior scans of color negative film.\n\nInfrared cleaning - VueScan supports on all scanners with an infrared lamp, SilverFast doesn&amp;#039;t support on any Canon scanners and on some Epson scanners.\n\n2 GByte scans - VueScan can do high-resolution scans that produce more than 2 GBytes of scan data, SilverFast can&amp;#039;t. This is useful when scanning 4x5 or 8x10 film.\n\nEase of use - VueScan has a simpler, more consistent user interface than SilverFast, and is easier to learn, easier to use, and more productive for batch scanning.\n\nRelease Date:May 26, 2008\n\nEnjoy!!","torrent":{"xt":"urn:btih:aa1ff091b67bcae4d3fc919b6e2ffc2d33aa7190","amp;dn":"VueScan+Professional+Edition+v8.4.73","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa1ff091b67bcae4d3fc919b6e2ffc2d33aa7190","infoHashBuffer":{"type":"Buffer","data":[170,31,240,145,182,123,202,228,211,252,145,155,110,47,252,45,51,170,113,144]},"announce":[],"urlList":[]}}