{"title":"Danielson: a Family movie {or, Make a Joyful Noise HERE}XviD_DvD","uid":4067639,"size":732364800,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aa561dd9006458d18fc220cfc4d465276406c0e8&amp;dn=Danielson%3A+a+Family+movie+%7Bor%2C+Make+a+Joyful+Noise+HERE%7DXviD_DvD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Communi_Tea","files":1,"time":1204881419,"description":" \nDanielson: a Family Movie is a documentary about unbridled creativity vs. accessibility, Christian faith vs. popular culture, underground music vs. survival, and family vs. individuality. The film follows Daniel Smith, an eccentric musician and visual artist, as he leads his four siblings and best friend Chris to indie-rock stardom. Beginning in 1995 when the youngest band member was 11 years old, the Danielson Family performs in white, vintage nurse costumes to symbolize the healing power of the Good News, a recurring subject matter. Though tepidly received by the Christian music world, the South Jersey farmland-bred clan is widely embraced by the mainstream independent music community, written about in Rolling Stone, Spin, the New York Times and elsewhere as an outsider curiosity backed up by innovative, experimental music.\n\nBut as with other family acts, members of the band begin to seek out their own paths as they go through college and Daniel eventually faces the struggle to become viable as a solo act. Along the way he mentors an unknown singer-songwriter named Sufjan Stevens whose own subsequent success stands in stark contrast to the music world\\&amp;#039;s uneasy reception of Danielson just a few years prior. With production starting in 2002, at a high water mark for the band, all the drama is played out before the camera making Danielson: a Family Movie both engaging and entertaining. Collage, direct cinema, animation and memorable performances all contribute to this thoughtful and thought-provoking spectacle.\n\nThe film was made with no capital investment from the Danielson Famile, its record label or any other third party.\n\nLength: 105 minutes\nProduction and post-production: March 2002 thru May 2006\nShooting format: miniDV with some 16mm, super8, animation, &amp; DVcam\nProducer, Director, Camera, Editor: JL Aronson\nMusic Supervisor: Pete Tunney\nDistributed by HVE: now available for sale or rent at your local and/or online retailer (Amazon, for instance)\nStarring: Danielson Famile, Br. Danielson, Danielsonship, Sufjan Stevens\nCameos: Rick Moody, Steve Albini, Daniel Johnston, David Garland\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\n\n~The video quality of the DVD is not great so that is obviously reflected in this copy of the movie. This Film is not for the mainstream person in my opinion, but I am sure those of you who can appreciate it will do so very much. Its my intent to share torrents of files that are not available or ,if they are, are not practical for some reason. Its nice to be able to give back to the online sharing community...\n\nRun Time 1:45\n448X320\nAUDIO BIT RATE 160kbps\n29 fps\nDATA RATE 112kbps\nXviD\nEnglish\nNo Subs","torrent":{"xt":"urn:btih:aa561dd9006458d18fc220cfc4d465276406c0e8","amp;dn":"Danielson%3A+a+Family+movie+%7Bor%2C+Make+a+Joyful+Noise+HERE%7DXviD_DvD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa561dd9006458d18fc220cfc4d465276406c0e8","infoHashBuffer":{"type":"Buffer","data":[170,86,29,217,0,100,88,209,143,194,32,207,196,212,101,39,100,6,192,232]},"announce":[],"urlList":[]}}