{"title":"Search and Destroy (Scorcese)_DIVX","uid":4128481,"size":737881066,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:aa9caf9e91f5b504398c8d878a438a820b8dfab8&amp;dn=Search+and+Destroy+%28Scorcese%29_DIVX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"dilbertgeg","files":2,"time":1207919838,"description":"\n05-01-2009 - I've uploaded 12G so far, ratio 17x. Yet I'm the LONE seed?!!  Creeps.  Seed, quit being leeches.\n\nThis is the *other* Search and Destroy.  Dennis Hopper plays a self-help guru with TV infomercials, and his usual psycho mode. Christopher Walken, plain psycho, believes in Hopper's inspirational book.  Comedy plus murders and singing.  MUST SEE.\n\nMartin Mirkheim is bound for greatness - even if nobody else thinks so - in this fast and funny look at fame, fortune and the pursuit of the American Dream from executive producer Martin Scorsese. Griffin Dunne is Martin, a small-time guy with big-time schemes. \n\nInspired by a late-night cable TV philosopher (Dennis Hopper, author of an &quot;Iron John&quot;-like best-seller), Martin becomes convinced that his destiny involves producing an overblown screen epic on the book.  He's oblivious to the fact that his life is falling apart around him. Hounded by the IRS, hassled by his wife (Rosanna Arquette) and harassed by hangers-on (Ethan Hawke), Martin pursues his dream.  Martin heads for Manhattan with whacky screenwriter receptionist (Hopper's secretary Marie)(Illeana Douglas), and hooks up a karaoke-crazed New York businessman (Christopher Walken) and a mod-squad, speed-rapping street king (John Turturro).\n\nP.S. It's VHS -&gt; DIVX5.  Couldn't find this gem for sale anywhere except a used video store.\n","torrent":{"xt":"urn:btih:aa9caf9e91f5b504398c8d878a438a820b8dfab8","amp;dn":"Search+and+Destroy+%28Scorcese%29_DIVX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aa9caf9e91f5b504398c8d878a438a820b8dfab8","infoHashBuffer":{"type":"Buffer","data":[170,156,175,158,145,245,181,4,57,140,141,135,138,67,138,130,11,141,250,184]},"announce":[],"urlList":[]}}