{"title":"PST","uid":4090820,"size":1326022656,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:aaaa262637a908bd29d242b580fb29b7f6fd78cc&amp;dn=PST&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"IonMaiden","files":2,"time":1206055525,"description":"Planescape Torment\n\nThe overall goal of the game is to recover The Nameless One&amp;#039;s lost memory, and to discover both his identity and why and how he has become immortal. Ultimately, this leads to tracking down his lost mortality, separated from him and given a life of its own by the &quot;flawed&quot; ritual that made The Nameless One immortal. This is achieved by following clues and hints that the previous incarnations of The Nameless One have left. For instance, the tattoos on his back instruct him to read his journal and to find Pharod. Were the Nameless One to lose his memory again, he would be lost without a single guide to nudge him in the right direction and would probably never recover his mortality. Throughout the game the Nameless One receives memories of his previous lives helping him to uncover more clues. These memories range from remembering a long dead language, which a previous incarnation made sure was extinct by murdering the only other man that knew it, to remembering previous battles and events thus increasing certain skills. Also, through the various events that The Nameless One uncovers or remembers during the game, he is able to piece together what some of his previous incarnations were like, and how wildly different each life was. One was a brilliant but cold man, another was a crazed lunatic who sometimes used his own severed arm as a club. Three of these incarnations appear in the Fortress of Regrets at the end of the game; Chris Avellone commented that these were chosen because of Planescape&amp;#039;s Rule-of-Threes, and because they were the ones that had the most impact on the character&amp;#039;s life throughout the game.\n\nInstructions:\n\n1. Mount Disc 1 in Daemon Tools.\n2. Install.\n3. Play!\n\nNote: In order for the game to run properly on Windows XP, you may have to go to Display Properties and on the settings tab click advanced then troubleshoot and turn Hardware Acceleration down to &quot;Disable all direct draw and Direct3D accelerations, as well as all cursor and advanced drawing accelerations&quot;.\n\n","torrent":{"xt":"urn:btih:aaaa262637a908bd29d242b580fb29b7f6fd78cc","amp;dn":"PST","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aaaa262637a908bd29d242b580fb29b7f6fd78cc","infoHashBuffer":{"type":"Buffer","data":[170,170,38,38,55,169,8,189,41,210,66,181,128,251,41,183,246,253,120,204]},"announce":[],"urlList":[]}}