{"title":"ArtRage 2.5 OSX","uid":4186880,"size":13112921,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:aae43b453e4ce02b52e5dc3cc075bcaa50d204ad&amp;dn=ArtRage+2.5+OSX&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"RvDam","files":1,"time":1210721001,"description":"ArtRage v2.5.19 Full Edition\n----------------------------\n\nArtRage, the easy to use, stylish painting package that lets you get painting from the moment you open it up. You can paint with oils, sketch with pencils, sprinkle glitter, and more. You can paint with gold leaf, silver foil, and other metallic colors. You can even load in your photos as Tracing Images to help you recreate them as paintings. For the professional user, ArtRage also offers multiple Layers for painting, and layered PSD document import and export so you can easily use it alongside your existing tools.\n\nPainting Tools\nEach of the tools in ArtRage is designed to work like its real world counterpart (minus the smell of paint thinners, and that piece of glitter you just cant get out of the carpet).Thick paint smears and blends, pencils and chalks smudge, and markers work just like they do in the real world. Many of the tools can be adjusted to give different effects. You can paint with thinned oils, use wet or dry markers, soften your pencil and control the hardness of the crayon, and much more.\n\nStencils and Rulers\nStencils and rulers let you make precise shapes and lines while still painting freehand.Place down as many stencils as you like, then paint over them and the paint will only touch the canvas through the holes.Lay down rulers and have the brush stick to their edges to create straight lines or smooth curves with any of the ArtRage tools.\n\nMetallics\nBy turning on the Metallic Paint option, you can work with spreadable, blendable gold and silver oil paints, sparkling glitter, silver leaf sprays and more. Any of the ArtRage tools can be switched to Metallic mode for a wide range of different effects.Metallic paint still blends with normal paint, and smears and smudges just as easily. Thin metal coating can be applied to any texture using the airbrush, or you can build up thick metal lumps using the Tube tool and Oil Brush to add more depth to your metallic image.\n\nTracing Images and References\nArtRage makes it easy to recreate photos or other images using its paint tools. When you load a Tracing Image the original is projected on to your canvas so that you can use it as a guide while you sketch and paint.Better still, you can tell ArtRage to choose the correct colour for you, so that when you start to paint you know the colour youre getting is the right one for where youre painting in the image.For users who just want a reference while painting, you can pin an image to your canvas and scale, rotate and position it as required.\n &lt;a href=&quot;\nhttp://www.ambientdesign.com/artrage.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.ambientdesign.com/artrage.html&lt;/a&gt;\n","torrent":{"xt":"urn:btih:aae43b453e4ce02b52e5dc3cc075bcaa50d204ad","amp;dn":"ArtRage+2.5+OSX","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae43b453e4ce02b52e5dc3cc075bcaa50d204ad","infoHashBuffer":{"type":"Buffer","data":[170,228,59,69,62,76,224,43,82,229,220,60,192,117,188,170,80,210,4,173]},"announce":[],"urlList":[]}}