{"title":"Ethan Frome 128kbps","uid":4240353,"size":184746176,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:aae44d5b17d6a2b51fdc784c5f770e3b38c8e00a&amp;dn=Ethan+Frome+128kbps&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Poppa1956","files":10,"time":1213503682,"description":"Ethan Frome is a novel that was released in 1911 by the Pulitzer Prize-winning American author Edith Wharton. It is set in turn-of-the-century New England in the fictitious town of Starkfield, Massachusetts. The novel was adapted into a film in 1993.\nThe story is set in a fictional, wintry New England town named Starkfield, where an unnamed narrator tells the story of his encounter with Ethan Frome, a man with dreams and desires that end in an ironic turn of events. The narrator tells the story based on an account from observations at Frome&amp;#039;s house when he had to stay there during a winter storm. Ethan&amp;#039;s character is one that comes full circle, moving from silent desire to action to quiet submission, ordered by life&amp;#039;s circumstances.\n\nEthan Frome is described as &quot;the most striking figure in Starkfield;&quot; &quot;he was but the ruin of a man,&quot; with a &quot;careless powerful look&quot; &quot;in spite of a lameness checking each step like the jerk of a chain.&quot; Frome&amp;#039;s wife is the &quot;sickly, cantankerous&quot; Zeena. He is her sole caregiver until her young and beautiful cousin, Mattie Silver, arrives to help with housekeeping. Ethan is taken in by Mattie&amp;#039;s youthful beauty and good humor, but his interest in Mattie does not go unnoticed by Zeena. In fact, when she realizes Ethan and Mattie&amp;#039;s mutual attraction, she plans to hire someone less attractive and to have Mattie sent away.","torrent":{"xt":"urn:btih:aae44d5b17d6a2b51fdc784c5f770e3b38c8e00a","amp;dn":"Ethan+Frome+128kbps","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"aae44d5b17d6a2b51fdc784c5f770e3b38c8e00a","infoHashBuffer":{"type":"Buffer","data":[170,228,77,91,23,214,162,181,31,220,120,76,95,119,14,59,56,200,224,10]},"announce":[],"urlList":[]}}