{"title":"Kaspersky Internet Security 2009 v.8.0.0.357","uid":4195239,"size":35520239,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ab0510c56790c8b65234104a4a821ecc71b0f783&amp;dn=Kaspersky+Internet+Security+2009+v.8.0.0.357&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"slugger00001","files":7,"time":1211179347,"description":"Info:\n\nProduct contains 6 main subsystems, and each of those includes basic protection components:\n1) System watch. System watcher (all-in-one system for registering events).\n- HIPS (host intrusion prevention system - proactive defense, which is based on limiting application actions on a system)\n- PDM (system of proactive defense, which is based on application behavior analysis for malicious/suspicious activities)\n- Firewall (personal protection screen)\n2) Malware protection\n- Protection of files and memory (File-Antivirus)\n- Protection of email and IM (Mail-Antivirus)\n- Protection of WEB (Web-Antivirus)\n3) Online Security\n- Protection from Phishing (Anti-Phishing)\n- Protection against network attacks (IDS)\n- Protection from auto-dialers (Anti-Dialer)\n4) Content zxcing\n- Spam zxcing (Anti-Spam)\n- Banner zxcing (Anti-Banner)\n- Parental Control\n5) On Demand Scanning (Scan tasks)\n6) Updater\n\nThe main feature of the application is restricting the programs? rights to access the system resources. It helps prevent unwanted actions by suspicious and hazardous programs. The application?s capabilities in the protection of user?s confidential data have been considerably enhanced. The application now includes wizards and tools which substantially facilitate execution of specific computer protection tasks.\n\nLet?s take closer look at the new features in Kaspersky Internet Security 2009:\n\nNew Protection Features:\n:: Kaspersky Internet Security now includes Application Filtering component along with Proactive Defense and Firewall which implements a new universal approach to the system protection against any threats including existing threats and threats that are unknown at the moment. Kaspersky Internet Security now requires considerably less input from the user due to the use of lists of trusted applications (whitelisting).\n:: Scanning of operating system and software for vulnerabilities with their subsequent elimination maintains a high system security level and prevents sneaking of hazardous programs into your system.\n:: New wizards ? Security Analyzer and Browser Configuration facilitate the scanning for and elimination of security threats and vulnerabilities in the applications installed on your computer, operating system?s and browser settings.\n:: Kaspersky Lab now reacts faster to the new threats due to the use of Kaspersky Security Network technology that gathers data about infection of users? computers and sends it to Kaspersky Lab?s servers.\n:: New tools ? Network Monitoring and Network Packet Analysis - facilitate collection and analysis of information about network activities on your computer.\n:: New System Restore wizard helps fix system damages after malware attacks.\n\nNew confidential data protection features:\n:: A new component Activity Filtering effectively monitors access to confidential data, user?s file and folders by applications.\n:: Security of confidential data entered from the keyboard is ensured by a new tool Virtual keyboardVirtual keyboard.\n:: Kaspersky Internet Security structure includes Privacy Cleaner Wizard which deletes from the user?s computer all information about his or her actions which can present an interest to intruders (list of visited websites, opened files, cookies, etc.).\n\nNew anti-spam features:\n:: Efficiency of spam filtering by the Anti-Spam component has been increased due to the use of Recent Terms server technologies.\n:: The use of Microsoft Office Outlook, Microsoft Outlook Express, The Bat! and Thunderbird extension plug-ins simplifies the process of configuring the anti-spam settings.\n:: Revised Parental Control component allows effective restriction of undesirable access of some internet resources by children.\n\nNew protection features for internet use:\n:: Protection against internet intruders has been upgraded due to the extended databases of phishing sites.\n:: ICQ and MSN traffic scan has been added which ensures security while working with instant messengers.\n:: Security of the use of wireless networks is ensured through the scan of Wi-Fi connections.\n\nNew program?s interface features\n:: The new program?s interface reflects the comprehensive approach to information protection.\n:: High information capacity of dialog boxes helps user quickly make decisions.\n:: The functionality of reports and statistics information about the application?s operation has been extended. The possibility of using filters allowing flexible setup when working with reports makes this product irreplaceable for professionals.\n\nSystem Requirements: Windows 2000 Pro/XP/Vista\njust instal with serial number and enjoy\nit is untill 17-03-2009","torrent":{"xt":"urn:btih:ab0510c56790c8b65234104a4a821ecc71b0f783","amp;dn":"Kaspersky+Internet+Security+2009+v.8.0.0.357","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ab0510c56790c8b65234104a4a821ecc71b0f783","infoHashBuffer":{"type":"Buffer","data":[171,5,16,197,103,144,200,182,82,52,16,74,74,130,30,204,113,176,247,131]},"announce":[],"urlList":[]}}