{"title":"BBC The Cosmos - A Beginner's Guide (2007) 5of6","uid":4235431,"size":202840064,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ac27e544d50b3570bb7518e96bd8a8779a04b19d&amp;dn=BBC+The+Cosmos+-+A+Beginner%5C%27s+Guide+%282007%29+5of6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"circlensess","files":1,"time":1213283312,"description":"BBC - The Cosmos - A Beginner&amp;#039;s Guide (2007)\n\n\nBBC.The.Cosmos.-.A.Beginner&amp;#039;s.Guide.5of6.Violent.Universe.Xvid.MP3.UKNova.avi\n\n\nInformation\n\nIt&amp;#039;s the story of everything - from the first microseconds of our universe to the exciting future of first contact and homes beyond our Earth. Join Adam Hart-Davis, Janet Sumner and Maggie Aderin for a journey around the planet to discover the latest thinking about the Cosmos.\n\n1) Life in the Cosmos \nAre we alone or is there other life out there? In this programme we meet the alien hunters, who spend their time tracking down life in the Cosmos. Some of them are looking for incredibly primitive life really close at hand. And others are looking for something you could talk to???\n2) Building the Universe \nWe reveal all about the universe: how it, and everything in it, came into being and the huge new experiments currently being done to investigate it.\n\nAdam Hart-Davis presents this episode from the biggest and most daring experiment of all - the Large Hadron Collider.\n3) Seeing the Universe \nMost of what we know about the universe, from its age to its size to how it began in a Big Bang, has been found out through telescopes. But how far out into space and back into time is it possible to see?\n\nIn this episode Adam Hart-Davis travels to the Atacama Desert in Chile to visit the VLT - the Very Large Telescope. Perched on top of a flattened mountain some 2600 metres above sea level, the VLT is the best place on Earth from which to see the universe. Head of Science, Bruno Leibundgut, explains how this awesome telescope is helping astronomers see further than ever before, enabling them to tackle some of the ???big??? questions in astronomy.\n4) Space Exploration \nThe human race has harboured a deep fascination for the Cosmos for thousands of years. But the technology to escape the confines of our planet and explore the Solar System has only been with us for fifty years. In this great adventure we???ve sent probes to other worlds, inhabited space stations in Earth orbit and put men on the Moon. But what is happening at the cutting edge of space exploration now?\n\nIn this programme Adam Hart-Davis reports from the European Space Research and Technology Centre (ESTEC) in the Netherlands. It???s a hive of activity, with engineers working on all sorts of space hardware.\n5) Violent Universe \nUntil quite recently the night sky seemed cold and calm and never changing - but not any more. In this programme we???ll show you the dramatic events happening right now, from the edge of the universe to uncomfortably close to home.\n\nAdam Hart-Davis presents this episode from the University of Leicester where he meets a team tracking down the most violent events in the universe. Gamma Ray Bursts (GRBs) are the biggest bangs since the Big Bang and team leader Dr Julian Osborne explains how Leicester is at the centre of a worldwide network trying to detect them.\n6) Other Worlds \nFinding another Earth outside our solar system would be big news - but there are some surprising discoveries in our very own cosmic backyard. We catch up with some amazing findings in our solar system and beyond and unveil the chances of finding another earth and, possibly, life elsewhere in the Cosmos.\n\nAdam Hart-Davis presents this programme from a spectacular location - the summit of an extinct volcano at La Palma in the Canary Islands. It???s one of the world???s best places for star gazing and is home to some hugely impressive telescopes. But our story starts with an instrument that could fit in your shed at home. Although it???s small, it???s hugely powerful and holds the key to finding worlds outside our solar system.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTechnical Specs\nVideo Codec: XVID\nVideo Bitrate: 788 kbps\nVideo Resolution: 400x704 (height x width)\nVideo Aspect Ratio: 4x7 (1:1,76)\nAudio Codec: MPEG-1 layer 1, 2 &lt;0x0050&gt;\nAudio BitRate: 256 kbps\nAudio Streams: 1\nRunTime Per Part: 28 min 59,96 s (43499 Frames)\nPart Size: 218,11 MB\nCapped by: unknown UKNova capper\nRelated Documentaries\nCosmos [1] [2] \nWe are the Aliens\nThe Six Billion Dollar Experiment [1] [2] [3] \nAtom [1] [2] \nSpace Odyssey: Voyage to the Planets [1] [2] \nThe Planets [1] [2] [3] [4] [5]","torrent":{"xt":"urn:btih:ac27e544d50b3570bb7518e96bd8a8779a04b19d","amp;dn":"BBC+The+Cosmos+-+A+Beginner%5C%27s+Guide+%282007%29+5of6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac27e544d50b3570bb7518e96bd8a8779a04b19d","infoHashBuffer":{"type":"Buffer","data":[172,39,229,68,213,11,53,112,187,117,24,233,107,216,168,119,154,4,177,157]},"announce":[],"urlList":[]}}