{"title":"WRONG TURN(2003)UNRATED &amp; WRONG TURN2:THE DEAD END(UNRATED)","uid":4218701,"size":1469560832,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ac3eb8079538a16782ab62dd637dca10bda96f78&amp;dn=WRONG+TURN%282003%29UNRATED+%26+WRONG+TURN2%3ATHE+DEAD+END%28UNRATED%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"superstar_87","files":2,"time":1212485633,"description":"1.WRONG TURN(2003)\n\nMOVIE POSTER &lt;a href=&quot;\nhttp://www.horror-movies.ca/gallery/_files/photogallery/wrong_turn.jpg&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.horror-movies.ca/gallery/_files/photogallery/wrong_turn.jpg&lt;/a&gt;\n\nChris Flynn is driving his car for a job interview in another city. However, an accident with a trunk transporting chemical products blocks the highway and Chris looks for an alternative route through the mountains of West Virginia to accomplish his schedule. Due to a lack of attention, he crashes another car parked in the middle of the road with flat tires. Chris meets a group of five friends, who intended to camp in the forest, and they decide to leave the couple Francine and Evan on the place, while Chris, Jessie, Carly and her fiancÃƒ?Ã‚Â© Scott tries to find some help. They find a weird cabin in the middle of nowhere, where three violent cannibalistic mountain men with the appearance of monsters live. The two couples try to escape from the mountain men while chased by them.  Written by Claudio Carvalho, Rio de Janeiro, Brazil\n\nIn a throwback to 1970\\&amp;#039;s horror films such as \\&quot;The Texas Chainsaw Massacre\\&quot; and \\&quot;The Hills Have Eyes\\&quot;, \\&quot;Wrong Turn\\&quot; is an independently-made horror film about a group of five youths on a hiking trip in the Appalachains of West Virginia who become prey to a family of cannibalistic mountain men who have become horribly disfigured through generations of in-breeding. Written by Drew\n\nChris Finn (Desmond Harrington) is on his way to a job interview and is driving through the mountains of West Virginia. There is then a chemical spill on the road, so being short on time, he decides to take a different route, an abandoned dirt road in the middle of nowhere. He then by accident crashes into a car sitting in the middle of the road. He then meets a group of friends on a hiking trip who include Jessie (Eliza Dushku) whom where stranded on the road. Two people stay at the car, and another group goes for help, only to find a sinister cabin nesteled in the West Virgina woods, that is home to a trio of cannibalistic mountain men horribly disfigured from years of in-breeding. They then make a mad dash for their lives through out the woods, only hoping to make it out alive. Written by Scott\n\nA young med student takes his eyes off the road and hits a group of campers, They seem to be having car trouble to, so they go off and look for a phone and come across a cabin home to three cannibal brothers disfigured from generations of inbreeding.\n\nScreenshots\n &lt;a href=&quot;\nhttp://uploadingzone.com/out.php/i4295_thumbs20080603120710.bmp&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://uploadingzone.com/out.php/i4295_thumbs20080603120710.bmp&lt;/a&gt;\n\n==================================================================\n\n2. WRONG TURN2:THE DEAD END\n\nMOVIE POSTER: &lt;a href=&quot;\nhttp://media.monstersandcritics.com/articles/1332893/article_images/wrongturn2.jpg[/IMG][/CENTER]&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://media.monstersandcritics.com/articles/1332893/article_images/wrongturn2.jpg[/IMG][/CENTER]&lt;/a&gt;\n\n\nRetired military commander Colonel Dale Murphy hosts the simulated post-apocalyptic reality show where participants are challenged to survive a remote West Virginia wasteland. But the show turns into a nightmarish showdown when each realizes they are being hunted by an inbred family of cannibals determined to make them all dinner!  Written by Shaquille\n\nIn Greenbrier Back Country, West Virginia, the retired military Dale Murphy is hosting a tough survivor show where the winner takes US$ 100,000.00. The proposal of the reality show is to survive in the woods in the most adverse conditions, following predetermined rules. Soon the contestants find that they are really fighting to survive against a strong, sadistic and violent cannibalistic family with the appearance of monsters. Further, Colonel Dale discloses that many years ago, an abandoned pulp mill released chemical waste into the creek, killing the animals and transforming the descendants of a local family in deformed mutants. Without animals to hunt or fish to catch, the next generation chases travelers to feed themselves. Written by Claudio Carvalho, Rio de Janeiro, Brazil\n\nDale Murphy is hosting and producing his own reality T.V show called \\&quot;The Ultimate Survivalist: The Apocalypse\\&quot;, with six contestants led by Nina Papas, who\\&amp;#039;ll be thrown together for six days in a simulated post-apocalyptic wasteland, and the winner will walk away with $100,000. Located in a remote part of West Virginia, the contestants discover that what they are really fighting for is their survival - against a family of hideously deformed inbred cannibals who plan to ruthlessly butcher them all... Who will survive?\n","torrent":{"xt":"urn:btih:ac3eb8079538a16782ab62dd637dca10bda96f78","amp;dn":"WRONG+TURN%282003%29UNRATED+%26+WRONG+TURN2%3ATHE+DEAD+END%28UNRATED%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ac3eb8079538a16782ab62dd637dca10bda96f78","infoHashBuffer":{"type":"Buffer","data":[172,62,184,7,149,56,161,103,130,171,98,221,99,125,202,16,189,169,111,120]},"announce":[],"urlList":[]}}