{"title":"Caterpillars of Eastern North America: A Guide to Identification","uid":12833561,"size":58147516,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:acc84a2e0ba94ae3a9b4b9d0dc0b6569223d0dd6&amp;dn=Caterpillars+of+Eastern+North+America%3A+A+Guide+to+Identification&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"heliiaruy","files":1,"time":1448415716,"description":"Print Length: 513 pages\r\nPublisher: Princeton University Press (April 25, 2010)\r\n\r\nThis lavishly illustrated guide will enable you to identify the caterpillars of nearly 700 butterflies and moths found east of the Mississippi. The more than 1,200 color photographs and two dozen line drawings include numerous exceptionally striking images. The giant silk moths, tiger moths, and many other species covered include forest pests, common garden guests, economically important species, and of course, the Mescal Worm and Mexican Jumping Bean caterpillars. Full-page species accounts cover almost 400 species, with up to six images per species including an image of the adult plus succinct text with information on distribution, seasonal activity, foodplants, and life history. These accounts are generously complemented with additional images of earlier instars, closely related species, noteworthy behaviors, and other intriguing aspects of caterpillar biology.\r\n\r\nMany caterpillars are illustrated here for the first time. Dozens of new foodplant records are presented and erroneous records are corrected. The book provides considerable information on the distribution, biology, and taxonomy of caterpillars beyond that available in other popular works on Eastern butterflies and moths. The introductory chapter covers caterpillar structure, life cycles, rearing, natural enemies, photography, and conservation. The section titled &quot;Caterpillar Projects&quot; will be of special interest to educators.\r\n\r\nGiven the dearth of accessible guides on the identification and natural history of caterpillars, Caterpillars of Eastern North America is a must for entomologists and museum curators, forest managers, conservation biologists and others who seek a compact, easy-to-use guide to the caterpillars of this vast region.\r\n\r\n\r\n\r\nazw3 can be converted in Calibre to whichever format you prefer, or can be directly placed in a Kindle file directory. Having been told I was uploading &quot;useless&quot; azw3 files, I hope you take the time to read this, learn about Calibre, or shut the fuck up. Cheers. Enjoy","torrent":{"xt":"urn:btih:acc84a2e0ba94ae3a9b4b9d0dc0b6569223d0dd6","amp;dn":"Caterpillars+of+Eastern+North+America%3A+A+Guide+to+Identification","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"acc84a2e0ba94ae3a9b4b9d0dc0b6569223d0dd6","infoHashBuffer":{"type":"Buffer","data":[172,200,74,46,11,169,74,227,169,180,185,208,220,11,101,105,34,61,13,214]},"announce":[],"urlList":[]}}