{"title":"!# [PC WinAll]Reality Arcade Strategy Games Collection [www.real","uid":4235321,"size":259780732,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:ad071e7a25ea98b30c1b025467501d3a3301272d&amp;dn=%21%23+%5BPC+WinAll%5DReality+Arcade+Strategy+Games+Collection+%5Bwww.real&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"jdowner99","files":11,"time":1213278202,"description":"!# [PC WinAll]Reality Arcade Strategy Games Collection [www.realityarcade.com] #!\n\nThe Dark Legions\n\nPrepare yourself for a real time strategy game set in the dark medieval ages! With 18 unique units at your command, you can fight epic battles between large armies as you build your empire through immersive story driven missions in Campaign Mode. You can also prove your strength against computer players on randomly generated missions, as well! The choice is yours! Let The Dark Legions take you on the quest of a lifetime today!\n\n\t\nVirtual Villagers 2\n\nContinue the epic story of the castaways of Isola in Virtual Villagers 2: The Lost Children! Guide your tribe as they rescue a group of lost children and help them survive new adventures. Lead your villagers as they solve all new puzzles and the hidden mysteries of the western shores of the island. Raise children who resemble their parents and uncover new surprises every time you play! The next thrilling episode is about to begin! Will your tribe survive?\n\n\nEschalon: Book 1\n\nEschalon: Book I is a phenomenal role-playing experience that will take you across massive outdoor environments and deep into dozens of sprawling dungeons as you seek to uncover the mystery of who you are! Hundreds of items, hoardes of creatures and a multitude of menacing monsters await your discovery in this classically inspired turn-based role-playing adventure! The world of Eschalon is a dangerous place...do you accept the challenge?\n\n\nBuild-a-lot\n\nSend the housing market through the roof as you build, buy, and sell houses in the new strategy game, Build-a-lot! You can flip houses for quick cash or sit back and watch the rental income pile up. Become a real estate mogul as you visit scenic towns, earn huge profits and perform special favors for the colorful local mayors. Can you build a new cinema for the local movie star? Install a bowling alley in the Mayor&amp;#039;s Mansion? No problem! There&amp;#039;s plenty to do and lots of fun ahead in Build-a-lot!\n\n\nMaster of Defense\n\nDefend your village from invading monsters in this strategic thriller! In this real-time strategy game, you are tasked with building towers to defend your citizens. Choose up to five different defense towers, all with different strengths. As you progress through 6 detailed levels with hundreds of raids, you&amp;#039;ll be able to build new towers and add skills with the gold you&amp;#039;ve earned. Choose your defense carefully to keep your citizens protected! Even one monster could spell certain doom for your entire city!\n","torrent":{"xt":"urn:btih:ad071e7a25ea98b30c1b025467501d3a3301272d","amp;dn":"%21%23+%5BPC+WinAll%5DReality+Arcade+Strategy+Games+Collection+%5Bwww.real","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad071e7a25ea98b30c1b025467501d3a3301272d","infoHashBuffer":{"type":"Buffer","data":[173,7,30,122,37,234,152,179,12,27,2,84,103,80,29,58,51,1,39,45]},"announce":[],"urlList":[]}}