{"title":"Led Zeppelin 1973.05.14 - New Orleans - The Witch Queen","uid":4210374,"size":1844431529,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ad38de96b42b6b88f738ae1ab9df6711d4f4af94&amp;dn=Led+Zeppelin+1973.05.14+-+New+Orleans+-+The+Witch+Queen&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TimD54","files":45,"time":1212031287,"description":"Not feeling well, been busy.  Sorry so late - if anyone needs me to keep the show up past the usual Friday switch I will.  Here&amp;#039;s a show I don&amp;#039;t know much about but enjoy listening to, in dual formats.  Special thanks to Mr. Freezer (the taper) and Gerard Sparaco of Underground Uprising for the following review:\n\nLed Zeppelin - 5-14-73\n&quot;The Witch Queen&quot;\nNew Orleans, Louisiana, Municipal Auditorium\nAudience + Soundboard Recordings\nLineage: Silvers &gt; EAC &gt; Flac\nLabel: Tarantura 2000\nOriginal Tapers: Audience Recording: Freezer\n                         Soundboard Recording: N/A\n\nDiscs One through Three: Audience Recording With Soundboard Recording Patches\n\nDisc One:\n\n1) Rock And Roll ( Fades In)\n2) Celebration Day\n3) Black Dog\n4) Over The Hills And Far Away\n5) Misty Mountain Hop\n6) Since I&amp;#039;ve Been Loving You\n7) No Quarter\n8) The Song Remains The Same\n9) The Rain Song ( Fades Out)\n\nDisc Two:\n\n1) Dazed And Confused ( Fades In, Includes: &quot; San Francisco&quot;)\n2) Stairway To Heaven\n3) Moby Dick ( Fades Out)\n\nDisc Three:\n\n1) Heartbreaker ( Fades In)\n2) Whole Lotta Love ( Includes: &quot; Cold Sweat&quot;)\n3) Communication Breakdown ( Includes: &quot; Cold Sweat&quot;, Reprise)\n\nDiscs Four through Six - Soundboard Recording With Audience Recording Patches\n\nDisc Four:\n\n1) Rock And Roll ( Fades In)\n2) Celebration Day\n3) Black Dog\n4) Over The Hills And Far Away\n5) Misty Mountain Hop\n6) Since I&amp;#039;ve Been Loving You\n7) No Quarter\n8) The Song Remains The Same\n9) The Rain Song ( Fades Out)\n\nDisc Five:\n\n1) Dazed And Confused ( Fades In, Includes: &quot; San Francisco&quot;)\n2) Stairway To Heaven\n3) Moby Dick ( Fades Out)\n\nDisc Six:\n\n1) Heartbreaker ( Fades In)\n2) Whole Lotta Love ( Includes: &quot; Cold Sweat&quot;)\n3) Communication Breakdown ( Includes: &quot; Cold Sweat&quot;, Reprise)\n\nWhen the audience tape for Led Zeppelin&amp;#039;s New Orleans show first circulated, Empress Valley were the first to issue a six cd set on Bourbon Street Renegades last September featuring both the new tape and the old soundboard source that has been circulating for about twenty years.  The Witch Queen is the latest release on the Tarantura label and like the previous issue presents the audience and soundboard recordings spread over six discs.  It isn&amp;#039;t, however, a simple copy and remaster of the Empress Valley.  This presents another first generation transfer from the master tapes with Tarantura doing their own work and presents a completely different listening experience.  The Empress Valley was clear enough, but did contain noticeable amounts of hiss and sounded dull.  The Witch Queen, by contrast, is a dramatic improvement.  There is not a trace of hiss in the audience recording and is significantly more clear, powerful and punchy.  Speaking personally, I didn&amp;#039;t realize how poor the audience tape Empress Valley used until I heard this and was able to compare the two.  Further, Empress Valley treats the audience recording as an appendix to the soundboard recording by placing it on the second three discs and presenting it &quot;as is&quot;, without filling the cuts with the soundboard source.  Tarantura emphasizes the audience by placing it on the first three discs and using the soundboard to fix two holes. The first occurs during &quot;The Rain Song&quot; where the soundboard recordingfades in at 6:59 and runs until about 7:36 with a small cut at 7:21.  The second is in &quot;Moby Dick&quot; between 17:59 and 18:59.  The fades are very smooth and gentle.  The second three cd set contains the soundboard recording and like the Empress Valley release uses the audience recording to fill some of the holes.  Both begin with the tuning and approximately the first two minutes of &quot;Rock And Roll&quot; before the soundboard recording fades in.  On Bourbon Street Renegades the right channel of the soundboard tape becomes unstable for several seconds, but Tarantura use more of the audience recording to eliminate that flaw.  On The Witch Queen, the soundboard is cut at 7:18 in &quot;The Rain Song&quot; and at 18:00 in &quot;Moby Dick&quot; with no filler.  The audience recording is used again between for twenty seconds in &quot;Moby Dick&quot; between 19:38 and 19:58 and in &quot;Whole Lotta Love&quot; between 7:28 to 8:03.  Empress Valley make the same splices in their version of the soundboard recording but are much more abrupt whereas Tarantura use very smooth fades between the two tape sources.  There are more detailed comments about the concert in the review of the Empress Valley release, but generally speaking the upgrade in sound quality with the audience recording vastly improves one&amp;#039;s appreciation for the actual performance.  For all the years with only the soundboard recording, which makes the mistakes painfully obvious, this was considered a good but not great show in the early part of Zeppelin&amp;#039;s biggest tour to date.The first release of the audience recording raised the appreciation higher, but hearing the tape on this release raises it even higher. New Orleans is one of the highlights in the first leg of the ninth tour and this tape is one of only a handful that is truly able to capture Zeppelin&amp;#039;s &quot;power, mystery, and the hammer of the gods&quot; aesthetic.  The Witch Queen, so named for a comment Plant makes before &quot;Moby Dick&quot;, is beautifully packaged.  Each of the two three-cd sets come in their unique four fold glossy cardboard gatefold sleeves.  Each is adorned with a collage of photographs of the band and medieval woodcuts of witches and covens to fit the theme of the title. The two fit into the box and the cover art is different depending upon the number.  LTD#001~050 is the St. Michael cover which is a variation of the famous painting by Raphael.  St. Michael&amp;#039;s shield, which in the original has the Cross Of St. George, is replaced by the four symbols.  LTD#051~100 is the Pan &amp; Nymph cover and finally LTD#101~120 is the Jimmy Page for promo sampler.  One the back is an old painting of a baphomet celebrating the black mass to a coven of witches.  The people behind Tarantura have an excellent artistic sense and this box set is simply beautiful.  Overall, in comparing the Empress Valley with the Tarantura, the latter is a worthy upgrade on all counts:  editing, sound quality, and presentation and is worth picking up even if one already owns the earlier release.","torrent":{"xt":"urn:btih:ad38de96b42b6b88f738ae1ab9df6711d4f4af94","amp;dn":"Led+Zeppelin+1973.05.14+-+New+Orleans+-+The+Witch+Queen","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad38de96b42b6b88f738ae1ab9df6711d4f4af94","infoHashBuffer":{"type":"Buffer","data":[173,56,222,150,180,43,107,136,247,56,174,26,185,223,103,17,212,244,175,148]},"announce":[],"urlList":[]}}