{"title":"SCHLONDORFF - Coup de Grace (1976) CRITERION","uid":4072736,"size":734664535,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ad7b71ffdccde2e77c332aa1c03d054431d7b4ba&amp;dn=SCHLONDORFF+-+Coup+de+Grace+%281976%29+CRITERION&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zeinabqureshi","files":5,"time":1205140427,"description":"Coup de Grace (1976)\nVolker Schlondorff\n____________________________________________________\n\nSynposis (Wikipedia)\nIn 1919 Latvia, a detachment of German soldiers is stationed in a chateau in the town of Kratovice to fight Bolshevik guerrillas. The chateau is the home of the soldier Konrad de Reval and his sister Sophie de Reval. Sophie is attracted to another soldier, a close friend of Konrad's named Erich von Lhomond. However, the reticent Erich rebuffs her advances. In retaliation, Sophie has trysts with other members of the military troop. Erich is noticeably angered by her behavior. Eventually, Sophie learns that Erich and Konrad are lovers. After this discovery, she joins the leftist guerrillas, whom she had been in contact with previously. Erich's soldiers capture her and her comrades. Sophie asks that Erich execute her himself, and he obliges. In a striking single tracking shot, we see Erich casually shoot Sophie in the head before joining in a photo with the other soldiers. As all board a train, the camera pans back to the corpses of the executed.\n\nCast\n\tSophie\t\tMargarethe von Trotta\n\tErich\t\tMathias Habich\n\tKonrad\t\tRudiger Kirschstein\n\t\nComments (:-))\t----------------------------\nIf you want to see a war happening, this is probably the film. War is something which happens as a matter of course, so there's nothing heroic or unusual about it. One also wonders what must have been passing through the minds of the German soldiers (remember that this is WWI), where it was not exactly about German domination of the world. \n\nNotes on the Subs\t------------------------\t\nThere are lots of files for subtitles. These are\n\t.IDX + .SUB (in RAR format, read automatically by VobSub)\n\t.SRT\n\nYou need EITHER the first OR the second.\n\nI've really ckecked and formatted the SRT, so this is the only file you actually need. In case you want to burn the IDX/SUB, you may delete the SRT before burning. In my opinion, the SRT is better. \n\nAbout the Rip\t----------------------------\nFilm runs about 100 min, so this was the best I could do using DivX. An MKV rip would have had much better quality, but it wouldn't play on standlaones. \n\nIt's not a very high-quality rip, but considering the original (B&amp;W, monaural) there hardly seems to be the need.\n\neNjOY AND SeED!\n -=:ZEiNAB:=-\n Mar 10, 2008\n-:(To Raphael):-\n\n******************************** FREAKYFLICKS *********************************\n\nFreakyFlicks is a free and open community dedicated to preserving and sharing cinematic art in the digital era. Our goal is to disseminate such works of art to the widest audience possible through the channels provided by P2P technology.\n\nThe FreakyFlicks collection is limited to those films that have played an exceptional role in the history of cinema and its progression in becoming a great art. Films that are usually described as classic, cult, arthouse and avant-garde.\n\nIf you have films that fit this description feel free to share them and participate in our community. All you need do is include this tag in your upload and join us at the forum to announce your release.\n\n   &lt;a href=&quot; http://freakyflicks.proboards54.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://freakyflicks.proboards54.com/&lt;/a&gt;\n\n'If we all seed just 1:1, give at least what we take, this torrent will NEVER DIE'","torrent":{"xt":"urn:btih:ad7b71ffdccde2e77c332aa1c03d054431d7b4ba","amp;dn":"SCHLONDORFF+-+Coup+de+Grace+%281976%29+CRITERION","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ad7b71ffdccde2e77c332aa1c03d054431d7b4ba","infoHashBuffer":{"type":"Buffer","data":[173,123,113,255,220,205,226,231,124,51,42,161,192,61,5,68,49,215,180,186]},"announce":[],"urlList":[]}}