{"title":"Prosecution of George Bush for MURDER ? NYT BEST SELLER ? Cashma","uid":4241111,"size":344115281,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:adb62c2b77a126a9965a3b20d7190b1fcccd2d5d&amp;dn=Prosecution+of+George+Bush+for+MURDER+%3F+NYT+BEST+SELLER+%3F+Cashma&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RevolutionaryNonviolence","files":174,"time":1213549399,"description":"Prosecution of George Bush for MURDER ? NYT BEST SELLER ? Cashman reads\n\nDEMOCRACYNOW! JUNE 13, 2008 Guest: Vincent Bugliosi, renowned attorney who successfully prosecuted 105 of 106 felony jury trials, including twenty-one murder convictions without a single loss. His latest book is The Prosecution of George W. Bush for Murder.\n\nAmy Goodman: Citing Iraq War, Renowned Attorney Vincent Bugliosi Seeks ?The Prosecution of George W. Bush for Murder?\nVincent Bugliosi is one of the most successful prosecutors in this country, with a record including twenty-one murder convictions without a single loss. With a new book, he outlines his case for the prosecution of George W. Bush for murder. [includes rush transcript]\n\nFrom Barnes &amp; Noble\nVincent Bugliosi is the only American true crime author who has written three New York Times bestsellers. His record as a lawyer is even more impressive: In his career at the L.A. County District Attorney&amp;#039;s office, he successfully prosecuted 105 out of 106 felony jury trials, including all 21 homicide cases. In The Prosecution of George W. Bush for Murder, he tackles his most challenging case yet. This controversial book presents a searing legal indictment against the 43rd president of the United States, arguing that he must be held accountable for crimes related to the Iraq War. Meticulously researched and volatile.\n\nEditorial Reviews\nProduct Description\nFamed Charles Manson prosecutor and three time #1 New York Times bestselling author Vincent Bugliosi has written the most powerful, explosive, and thought-provoking book of his storied career.\nIn The Prosecution of George W. Bush for Murder, Bugliosi presents a tight, meticulously researched legal case that puts George W. Bush on trial in an American courtroom for the murder of nearly 4,000 American soldiers fighting the war in Iraq. Bugliosi sets forth the legal architecture and incontrovertible evidence that President Bush took this nation to war in Iraq under false pretenses?a war that has not only caused the deaths of American soldiers but also over 100,000 innocent Iraqi men, women, and children; cost the United States over one trillion dollars thus far with no end in sight; and alienated many American allies in the Western world.\n\nAs a prosecutor who is dedicated to seeking justice, Bugliosi, in his inimitable style, delivers a non-partisan argument, free from party lines and instead based upon hard facts and pure objectivity.\nA searing indictment of the President and his administration, The Prosecution of George W. Bush for Murder also outlines a legally credible pathway to holding our highest government officials accountable for their actions, thereby creating a framework for future occupants of the oval office.\nVincent Bugliosi calls for the United States of America to return to the great nation it once was and can be again. He believes the first step to achieving this goal is to bring those responsible for the war in Iraq to justice.\n\nAbout the Author\nVincent Bugliosi received his law degree in 1964. In his career at the L.A. County District Attorney?s office, he successfully prosecuted 105 out of 106 felony jury trials, including 21 murder convictions without a single loss. His most famous trial, the Charles Manson case, became the basis of his classic, Helter Skelter, the biggest selling true-crime book in publishing history. Two of Bugliosi?s other books?And the Sea Will Tell and Outrage?also reached #1 on the New York Times hardcover bestseller list. No other American true-crime writer has ever had more than one book that achieved this ranking. His latest book, Reclaiming History: The Assassination of President John F. Kennedy, has been heralded as ?epic? and ?a book for the ages.?\n\nBugliosi has uncommonly attained success in two separate and distinct fields, as an author and a lawyer. His excellence as a trial lawyer is best captured in the judgment of his peers. ?Bugliosi is as good a prosecutor as there ever was,? Alan Dershowitz says. F. Lee Bailey calls Bugliosi ?the quintessential prosecutor.? ?There is only one Vince Bugliosi. He?s the best,? says Robert Tanenbaum, for years the top homicide prosecutor in the Manhattan D.A.?s office. Most telling is the comment by Gerry Spence, who squared off against Bugliosi in a twenty-one-hour televised, scriptless ?docu-trial? of Lee Harvey Oswald, in which the original key witnesses to the Kennedy assassination testified and were cross-examined. After the Dallas jury returned a guilty verdict in Bugliosi?s favor, Spence said, ?No other lawyer in America could have done what Vince did in this case.?\nBugliosi lives with his wife, Gail, in Los Angeles.\n","torrent":{"xt":"urn:btih:adb62c2b77a126a9965a3b20d7190b1fcccd2d5d","amp;dn":"Prosecution+of+George+Bush+for+MURDER+%3F+NYT+BEST+SELLER+%3F+Cashma","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adb62c2b77a126a9965a3b20d7190b1fcccd2d5d","infoHashBuffer":{"type":"Buffer","data":[173,182,44,43,119,161,38,169,150,90,59,32,215,25,11,31,204,205,45,93]},"announce":[],"urlList":[]}}