{"title":"Still game series 6.rar","uid":4064934,"size":1703823228,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:adeb01e5a94dcfdc14298446adb68bea187840bb&amp;dn=Still+game+series+6.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"o0oliambeeo0o","files":1,"time":1204756806,"description":"Series 6 (2007)\n\n\nSeries 6 of Still Game started on July 12, 2007 on BBC Two.Shooting locations included the Tunnock&amp;#039;s factory in Uddingston, South Lanarkshire and at the Par&amp;#039;s Foods factory Glasgow, in episode 6 &quot;recipe&quot;. One of the show&amp;#039;s characters was killed off, which was revealed to be Isa&amp;#039;s husband Harry in episode 1. The series had cameo appearances by Lorraine Kelly, Michelle McManus and boxing champion Jim Watt. Although the series was originally planned for six episodes (like the previous two),it was revealed that another episode had been added, bringing the count up to seven.\n\nWhen questioned about any further series (after the sixth), creator Ford Kiernan said he believed there was at least &quot;three more series&quot; worth of ideas for the show and that they are &quot;not finished with Jack and Victor&amp;#039;s story by a long shot&quot;.\n\nHot Seat - Craiglang is in the grip of a hot spell. Jack and Victor have found the perfect place to relax in the park on the ultimate bench. Unfortunately, Tam and Winston have the same idea. Isa receives news about her ex husband Harry that changes her life.\n\nFly Society - Jack and Victor get a taste of how the other half live when they are mistaken for two socialites by a couple of rich widows. But the gang from Craiglang are not happy at missing out.\n\nLights Out - Craiglang is plunged into eternal darkness when the sub station goes on the blink. Our vulnerable pensioners are to take radical measures to protect themselves from the night crawlers.\n\nSeconds Out - Boabby the barman and Stevie the bookie vie for the attention of the new pizza girl. Jack and Victor are hell bent on getting a free pizza now that their old pal Winston works there.\n\nHyper - Navid&amp;#039;s business is suffering at the hands of the corporate giant Hyperdales and his regular customers loyalty is being put to the test. Meanwhile, Tam is going through some bizarre changes. The drinks are on him.\n\nRecipe - Jack and Victor discover Pete the Jakey was the inventor of The famous Beefy bake and seek recompense on his behalf. Tam and Frances are having marital problems. Who can offer counsel, Navid?\n\nOne In One Out - Tam and Frances enjoy fame and fortune with their new addition but it means baby sitting stints for Jack and Victor which is proving a bit of a strain.\n\n","torrent":{"xt":"urn:btih:adeb01e5a94dcfdc14298446adb68bea187840bb","amp;dn":"Still+game+series+6.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"adeb01e5a94dcfdc14298446adb68bea187840bb","infoHashBuffer":{"type":"Buffer","data":[173,235,1,229,169,77,207,220,20,41,132,70,173,182,139,234,24,120,64,187]},"announce":[],"urlList":[]}}