{"title":"Bait &amp; Switch: The (Futile) Pursuit of the American Dream  48k","uid":4094744,"size":147963211,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:ae1a342500b4218aaf433209fef4c8be0a3a9317&amp;dn=Bait+%26+Switch%3A+The+%28Futile%29+Pursuit+of+the+American+Dream++48k++&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"Diaperzone","files":82,"time":1206250115,"description":"\nBait and Switch: The Futile Pursuit of the American Dream\n\n   Author: Barbara Ehrenreich\n   Reader: Anne Twomey\n   Year  : 2005 \n\n48kbps .MP3 Audiobook \nCDs 1-6, Run Time 6:50:31\n\nBarbara Ehrenreich&amp;#039;s latest work of social commentary, &quot;Bait and Switch: The (Futile) Pursuit of the American Dream,&quot; is an indictment of the &quot;magisterial indifference of the corporate world.&quot; Posing as an unemployed white-collar worker, Ehrenreich adopts an alias and markets herself as a public relations person and event planner. Her goal is to obtain a corporate job that pays approximately fifty thousand a year with health benefits. She plans to keep the job for three or four months, write about her experiences, and then quit. The author sets aside five thousand dollars for travel and other expenses connected with her job search.\n\nThe author offers a sobering look at the plight of the white-collar unemployed and the &quot;transition&quot; industry that offers them counselling, prayer, and dubious advice - at a hefty price, of course. Particularly hard hit are the middle-aged workers who have fallen victim to sudden lay-offs or down-sizings. After years of loyalty to their employers, and years of playing by the rules, they now find their companies have no such loyalty to them.\n\nThis book is mostly about the industry that has come into being for the sole purpose of &quot;coaching&quot; these ex-employees so that they can find new jobs. In reality, they are seldom helpful at all.\n\nThe author acknowledges that any or all of the above may have been factors in her failure to find work. However, she wrote the book because she believes that there is a bigger problem holding job-seekers back--corporate America&amp;#039;s indifference to the needs of its workers. Ehrenreich maintains that human resources departments rarely even acknowledge receiving a resume anymore. Even worse, when an applicant sends in a bid for a job, he is often the victim of &quot;bait and switch&quot; tactics. Instead of offering the advertised job, the company rep tries to convince the job seeker to settle for a lesser job with no benefits or job security. In desperation, some white-collar workers take &quot;survival jobs&quot; such as housecleaning, cab driving, and retail sales in order to put food on the table. When the income from these jobs does not cover the bills, these stressed-out individuals max out their credit cards, seek help from relatives, and downsize their lifestyles as much as possible. Without health insurance, workers are terrified of becoming become ill because they have no money to pay for medical care and prescription drugs.\n\nIn the final chapter, Ms. Ehrenreich points to the fact that the middle class is under attack as never before. Just look at the bankruptcy bill, the attempts to eliminate Social Security, and the loss of company pensions and health care. Reading this book will be a wake-up call for many. Feeling secure? You shouldn&amp;#039;t. \n\nYou could be next.\n","torrent":{"xt":"urn:btih:ae1a342500b4218aaf433209fef4c8be0a3a9317","amp;dn":"Bait+%26+Switch%3A+The+%28Futile%29+Pursuit+of+the+American+Dream++48k++","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae1a342500b4218aaf433209fef4c8be0a3a9317","infoHashBuffer":{"type":"Buffer","data":[174,26,52,37,0,180,33,138,175,67,50,9,254,244,200,190,10,58,147,23]},"announce":[],"urlList":[]}}