{"title":"Depeche Mode - Ultra (1997) (FLAC-EAC-CUE)","uid":4216539,"size":398945190,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ae9b7b53c75c4411555b25861d545dc7f19ea377&amp;dn=Depeche+Mode+-+Ultra+%281997%29+%28FLAC-EAC-CUE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigsimon","files":20,"time":1212369408,"description":"Music : Pop : Lossless\n\n\n\n\n\n\n\n\nDepeche Mode - Ultra (1997) (FLAC-EAC-CUE)\n\n\n\n\n\n\n\n\nDepeche Mode Biography From allmusic.com\n\n\n\nBiography by Jason Ankeny\n\nOriginally a product of Britain&amp;#039;s new romantic movement, Depeche Mode went on to become the quintessential electro-pop band of the 1980s. One of the first acts to establish a musical identity based completely around the use of synthesizers, Depeche Mode began their existence as a bouncy dance-pop outfit but gradually developed a darker, more dramatic sound that ultimately positioned them as one of the most successful alternative bands of their era.\n\nThe roots of Depeche Mode date to 1976, when Basildon, England-based keyboardists Vince Clarke and Andrew Fletcher first teamed to form the group No Romance in China. The band proved short-lived, and by 1979 Clarke had formed French Look, another duo featuring guitarist/keyboardist Martin Gore; Fletcher soon signed on, and the group rechristened itself Composition of Sound. Initially, Clarke handled vocal chores, but in 1980 singer David Gahan was brought in to complete the lineup; after one final name change to Depeche Mode, the quartet members jettisoned all instruments excluding their synthesizers, honing a slick, techno-based sound to showcase Clarke&amp;#039;s catchy melodies.\n\nAfter building a following on the London club scene, Depeche Mode debuted in 1980 with &quot;Photographic,&quot; a track included on the Some Bizarre Album label compilation. After signing to Mute Records, they issued &quot;Dreaming of Me&quot; in early 1981; while neither the single nor its follow-up, &quot;New Life,&quot; caused much of a stir, their third effort, &quot;Just Can&amp;#039;t Get Enough,&quot; became a Top Ten U.K. hit, and their 1981 debut LP, Speak and Spell, was also a success. Just as Depeche Mode appeared poised for a major commercial breakthrough, however, principal songwriter Clarke abruptly exited to form Yazoo with singer Alison Moyet, leaving the group&amp;#039;s future in grave doubt.\n\nAs Gore grabbed the band&amp;#039;s songwriting reins, the remaining trio recruited keyboardist Alan Wilder to fill the technological void created by Clarke&amp;#039;s departure; while 1982&amp;#039;s A Broken Frame deviated only slightly from Depeche Mode&amp;#039;s earlier work, Gore&amp;#039;s ominous songs grew more assured and sophisticated by the time of 1983&amp;#039;s Construction time Again. Some Great Reward, issued the following year, was their artistic and commercial breakthrough, as Gore&amp;#039;s dark, kinky preoccupations with spiritual doubt (&quot;Blasphemous Rumours&quot;) and psychosexual manipulation (&quot;Master and Servant&quot;) came to the fore; the egalitarian single &quot;People Are People&quot; was a major hit on both sides of the Atlantic and typified the music&amp;#039;s turn toward more industrial textures.\n\nReleased in 1986, the atmospheric Black Celebration continued the trend toward grim melancholy and further established the group as a major commercial force. After the superb single &quot;Strangelove,&quot; Depeche Mode issued 1987&amp;#039;s Music for the Masses; a subsequent sold-out tour yielded the 1989 double live set 101 as well as a concert film directed by the legendary D.A. Pennebaker. Still, despite an enormous fan base, the group was considered very much an underground cult phenomenon prior to the release of 1990&amp;#039;s Violator, a Top Ten smash that spawned the hits &quot;Enjoy the Silence,&quot; &quot;Policy of Truth,&quot; and &quot;Personal Jesus.&quot;\n\nWith the alternative music boom of the early &amp;#039;90s, Depeche Mode emerged as one of the world&amp;#039;s most successful acts, and their 1993 LP Songs of Faith &amp; Devotion entered the charts in the number one slot. However, at the peak of its success, the group began to unravel; first Wilder exited in 1995, and then Gahan was the subject of a failed suicide attempt. (He later entered a drug rehabilitation clinic to battle an addiction to heroin.) After a four-year layoff, Depeche Mode -- continuing on as a trio -- released 1997&amp;#039;s Ultra, which featured the hits &quot;Barrel of a Gun&quot; and &quot;It&amp;#039;s No Good.&quot; A year later, the band embarked on a tour in support of The Singles 86&gt;98 greatest-hits album. Depeche Mode played 64 shows in 18 countries for over a million fans. It also marked the end of a decade for the band. Each member took some considerable time off, and Depeche Mode would not regroup for another three years.\n\nExciter, the band&amp;#039;s follow-up to 1997&amp;#039;s Ultra, was released in 2001. Singles such as &quot;Dream On&quot; and &quot;I Feel Loved&quot; did moderately well. Two years later, Gahan issued his debut solo album, the dark and sultry Paper Monsters. Gore also followed suit by issuing his debut full-length, CounterfeitÂ². Each member did respective tours of the U.S. and Europe; however, it wouldn&amp;#039;t be long until Depeche Mode came back together. Playing the Angel became a Top Ten hit upon release in October 2005, produced by Ben Hillier (Doves, Blur, U2, Elbow). With the success of the &quot;Precious&quot; and &quot;John (The Revelator)&quot; singles, Playing the Angel topped the album charts in 18 countries and went multiple platinum and gold in 20 countries. Depeche Mode went to on play to 2.5 million fans worldwide, and the special-edition three-disc set Touring the Angel: Live in Milan (2006) captured the essence of one of the band&amp;#039;s greatest shows.\n\n\n\n\n\n\nCD Pressing Information\n\n\n\nLabel: Mute Records Ltd\nCatalog#: CD STUMM 148\nFormat: CD, Album\nCountry: Europe\nReleased: 14 Apr 1997\nGenre: Electronic, Rock\nStyle: Alternative Rock, Downtempo, Synth-pop\n\n\n\nCredits\n\n\nArtwork By [Colour Prints] - Brian Dowling\nArtwork By [Sleeve Design] - Area\nEngineer - Q\nEngineer [Additional Vocal] - Gareth Jones (tracks: 2, 3, 9)\nKeyboards, Programmed By [Keyboard] - Dave Clayton\nMastered By - Mike Marsh\nMixed By - Q , Tim Simenon\nPhotography, Artwork By [Art Direction &amp; Front Cover] - Anton Corbijn\nProducer - Tim Simenon\nProgrammed By - Kerry Hopwood\nWritten-By - Martin L Gore\n\n\n\nNotes\n\n\nTrack 12 is not mentioned on the cover.\n\nRecorded at - Abbey Road, Westside, Strongroom, RAK - London; Electric Lady - New York; Larrabee West - Los Angeles.\nMastered at The Exchange.\n\nDepeche Mode (1997 Line-Up): David Gahan, Andrew Fletcher, Martin Gore.\n\n\n\n\n\n\nUltra album review from allmusic.com\n\n\n\nReview by Ned Raggett\n\nWhen news surfaced in 1995 that Alan Wilder had departed Depeche Mode to concentrate on his solo project Recoil, the immediate concern among fans was whether the band would be able to hit past heights again. Though Wilder&amp;#039;s profile was always much lesser than that of Martin Gore and David Gahan -- and almost even that of Alan Fletcher, whose nonperformance live has always been a running joke in the fan community and who freely admits to generally being around merely to maintain a vibe with his childhood friend Gore -- his capability at arranging the songs over the years gave the band its increasingly distinct, unique edge. Combined with Gahan&amp;#039;s near suicide and lengthy recovery from drugs, things looked bleak. Happily, Ultra turned out a winner; hooking up with Tim Simenon, longtime U.K. dance maven and producer of arty fare such as Gavin Friday&amp;#039;s Adam &amp;#039;n&amp;#039; Eve, Depeche delivered a strong album as a rejuvenated band. The most immediate change was Gahan&amp;#039;s singing; for the first time ever, he took singing lessons beforehand, and his new control and projection simply shines, especially on the marvelous &quot;It&amp;#039;s No Good,&quot; a pulsing, tense, yet beautiful song with another deeply romantic Gore lyric. Opener &quot;Barrel of a Gun&quot; continues in the vein of arena-level stompers like &quot;Never Let Me Down Again&quot; and &quot;I Feel You,&quot; with huge drum slams and scratching to boot, but Ultra mostly covers subtler territory, such as the slightly creepy &quot;Sister of Night&quot; and the gentle &quot;The Love Thieves.&quot; Gore sings two winners: the orchestral, slow dance groove &quot;Home&quot; and &quot;The Bottom Line,&quot; featuring steel guitar and Can&amp;#039;s Jaki Liebezeit on drums, distinctly different territory for Depeche. Closing with &quot;Insight,&quot; a quite lovely, building ballad, Ultra showed Depeche wasn&amp;#039;t ready to quit by any means.\n\n\n\n\n\n\n\n\nTrack List\n\n\n\nDepeche Mode - Ultra (1997)\n\n\n01. Barrel Of A Gun 05:35\n02. The Love Thieves 06:34\n03. Home 05:42\n04. It&amp;#039;s No Good 05:58\n05. Uselink 02:21\n06. Useless 05:12\n07. Sister Of Night 06:04\n08. Jazz Thieves 02:54\n09. Freestate 06:44\n10. The Bottom Line 04:26\n11. Insight 06:26\n12. Junior Painkiller 02:11\n\n\n\n\n\n\n\n\n\n\n\n\n\nENJOY ..........................................................................\n\n\n","torrent":{"xt":"urn:btih:ae9b7b53c75c4411555b25861d545dc7f19ea377","amp;dn":"Depeche+Mode+-+Ultra+%281997%29+%28FLAC-EAC-CUE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ae9b7b53c75c4411555b25861d545dc7f19ea377","infoHashBuffer":{"type":"Buffer","data":[174,155,123,83,199,92,68,17,85,91,37,134,29,84,93,199,241,158,163,119]},"announce":[],"urlList":[]}}