{"title":"This I Believe - NPR - chaptered itunes audiobook","uid":4090415,"size":82192144,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:af311628648821389c2ccb3df47b0e4315a7789c&amp;dn=This+I+Believe+-+NPR+-+chaptered+itunes+audiobook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"slwbe","files":1,"time":1206040879,"description":"This is the 5 CD set of NPR\\'s segment \\&quot;this i believe\\&quot;.  It\\'s a good listen and is the compilation of some of the best stories and the most famous contributors.  There\\'s Einstein, Colon Powell, Eleanor Roosevelt, and some really funny and inspiring stories.  \n\nIt\\'s 32kb bitrate which is how the cds came and it\\'s 5 hours and 40 minutes long.\n\nenjoy!\n\n\n*UPDATE\nif having problems with the tracker add this one:\nhttp://tracker.openbittorrent.com:80/announce\n\nhere's all the tracks again (even though they're more easily readable below in comments).  just wanted to maybe increase the hits for this.\ntuds Turkel, Sarah Adams, Phyllis Allen, Isabel Allende, Elvia Bautista, Leonard, Bernstein, William F. Buckley, Jr, Niven Busch, Benjamin Carson, Greg Chapman, Warren Christopher, Mary Cook, Norman Corwin, Susan Corio, Kathy Dahlen, Willam O. Douglas, Elizabeth Deutsch, Elizabeth Deutsch Earle, Albert Einstein (Read by Robert Krulwich), Eve Ensler, Anthony Fauci, John W. Fountain, Bill Gates, Cecile Gilmer, Newt Gingrich, Miles Goodwin, Martha Graham, Temple Grandin, Brian Grazer, Brian Greene, Ted Gup, Debbie Hall, Jane Hamill, Oscar Hammerstein II, Victor Hanson, Joy Harjo, Helen Hayes, Robert A. Heinlein, Maximilian Hodder, Kay Redfield Jamison, Penn Jillette, Pius Kamau, Ruth Kamps, Helen Keller, Harold Hongju Koh, Jackie Lantry, Alan Lightman, Thomas Mann, George Mardikian, John McCain, Rick Moody, Errol Morris, Michael Mullane, Cecilia Munoz, Azar Nafasi, Gregory Orr, Eboo Patel, Steve Porter, Colin Powell, Frederic Reamer, Jamaica Ritcher, Josh Rittenberg, Jackie Robinson, Eleanor Roosevelt, Mel Rusnov, Carl Sandburg, Margaret Sanger, Colleen Shaddox, Jason Sheehan, Mark Shields, Wallace Stenger, Gloria Steinem, Andrew Sullivan, Deidre Sullivan, Harold Taw, Arnold Toynbee, John Updike, Loudon Wainwright III, Frank X Walker, Rebecca West, Jody Williams, Dan Gediman, Edward R. Murrow's Introduction to the 1950s &quot;This I Believe&quot;","torrent":{"xt":"urn:btih:af311628648821389c2ccb3df47b0e4315a7789c","amp;dn":"This+I+Believe+-+NPR+-+chaptered+itunes+audiobook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af311628648821389c2ccb3df47b0e4315a7789c","infoHashBuffer":{"type":"Buffer","data":[175,49,22,40,100,136,33,56,156,44,203,61,244,123,14,67,21,167,120,156]},"announce":[],"urlList":[]}}