{"title":"Zone Stad Seizoen 3en4 HDTV NL By Jeffrey","uid":12825963,"size":8857200640,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:af5349fc371717cb0c99e60f6ed681908325f9a8&amp;dn=Zone+Stad+Seizoen+3en4+HDTV+NL+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"gljeffrey45","files":26,"time":1448343390,"description":"ZoneStad Seizoen 3 HDTV NL Collected By Jeffrey\r\n\r\nZone Stad speelt zich af in het hartje van Antwerpen. In elke aflevering staan de beroepsactiviteiten van de politie-inspecteurs, hun privéleven en hun relatie tot de andere personages centraal. Actie, spanning, intriges, humor, emotie en romantiek lopen dan ook als een rode draad doorheen deze serie.\r\n\r\nDe politierechercheurs van Zone Stad pakken de misdaad aan van het centrum van Antwerpen tot in de haven. Elke nieuwe zaak confronteert hen met een ander milieu en met andere drijfveren. Ze krijgen met het volledige gamma van de criminaliteit te maken.\r\n\r\nZone Stad is een weldoordachte reeks, waarvoor de acteurs en actrices door het politiekorps van Antwerpen met raad en daad werden bijgestaan. De cast leerde omgaan met wapens, leerde hoe ze misdadigers moest arresteren en leerde eveneens hoe bepaalde situaties psychologisch moesten worden ingeschat.\r\n\r\n\r\nAfleveringen:\r\n\r\n1. Schijn bedriegt\r\n2. De nieuwe\r\n3. De babymoord\r\n4. Wapensmokkel\r\n5. De zegelring\r\n6. De doorbraak\r\n7. De ontvoering\r\n8. Verdwenen met de noorderzon\r\n9. Inbraakgolf\r\n10. Lijk in het bos\r\n11. Geïnfiltreerd\r\n12. Manhunting\r\n13. De korpschef\r\n\r\nNL Gesproken\r\nAVI\r\n\r\n[/size][/center]\r\n\r\nZoneStad Seizoen 4 HDTV NL Collected By Jeffrey\r\n\r\nZone Stad speelt zich af in het hartje van Antwerpen. In elke aflevering staan de beroepsactiviteiten van de politie-inspecteurs, hun privé-leven en hun relatie tot de andere personages centraal. Actie, spanning, intriges, humor, emotie en romantiek lopen dan ook als een rode draad doorheen deze serie. De politierechercheurs van Zone Stad pakken de misdaad aan van het centrum van Antwerpen tot in de haven. Elke nieuwe zaak confronteert hen met een ander milieu en met andere drijfveren. Ze krijgen met het volledige gamma van de criminaliteit te maken. Zone Stad is een weldoordachte reeks, waarvoor de acteurs en actrices door het politiekorps van Antwerpen met raad en daad werden bijgestaan. De cast leerde omgaan met wapens, leerde hoe ze misdadigers moest arresteren en leerde eveneens hoe bepaalde situaties psychologisch moesten worden ingeschat. Zone Stad vaart resoluut een eigen koers en serveert een spannende cocktail van actie en misdaad, met boeiende plots die snel in elkaar vloeien en even dynamisch verfilmd worden. Deze aanpak resulteerde reeds in een trouwe aanhang in de Vlaamse huiskamer en bij de critici in een nominatie voor de Plateau prijs.\r\n\r\nDani (Katrien Vandendries) maakt promotie en komt aan het hoofd van Zone Stad te staan. Haar vroegere politiepartner Tom (Guy Van Sande) moet nu een team vormen met de jonge Fien (Lien Van de Kelder). Hun samenwerking neemt een moeilijke start. Agent Jimmy (George Arrendell) moet ook wennen, want zijn nieuwe politiepartner Mike (Peter Van Asbroeck) is een macho pur sang. En dan zijn er nog forensisch expert Lucas (Werner De Smedt) en wetsdokter Kathy (Tine Van den Brande), twee krakken in hun vak die zowel een impact hebben op het professionele als op het persoonlijke leven van de inspecteurs in het korps.\r\n\r\n\r\nAfleveringen:\r\n\r\n1. Schuld en boete\r\n2. De spijkermoord\r\n3. Dubbel spel\r\n4. De kleine prinses\r\n5. Diamant\r\n6. Onzichtbaar\r\n7. Horen, zien en zwijgen\r\n8. De brouwerij\r\n9. De zondebok\r\n10. Baba Polley\r\n11. Oog om oog\r\n12. Full house\r\n13. Het blijft in de familie\r\n\r\nNL Gesproken\r\nAVI","torrent":{"xt":"urn:btih:af5349fc371717cb0c99e60f6ed681908325f9a8","amp;dn":"Zone+Stad+Seizoen+3en4+HDTV+NL+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"af5349fc371717cb0c99e60f6ed681908325f9a8","infoHashBuffer":{"type":"Buffer","data":[175,83,73,252,55,23,23,203,12,153,230,15,110,214,129,144,131,37,249,168]},"announce":[],"urlList":[]}}