{"title":"Aquaman v2-v4","uid":4071766,"size":246308529,"categoryP":"other","categoryS":"comics","magnet":"?xt=urn:btih:afd0a3ca9bbd1b191da689157a8522af7af3088a&amp;dn=Aquaman+v2-v4&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"SatanManofPeace","files":25,"time":1205086555,"description":"After the 1985 Crisis on Infinite Earths limited series, several short limited series were produced in the late 1980s and early 1990s -- beginning with 1986&amp;#039;s, four-issue Aquaman (Feb 1986-May 1986), featuring Aquaman in a new, largely deep-sea blue, costume. The series was well received and a follow up mini series was in the works, though it was eventually canceled due to creative problems. This series also shed some light on the Silver Age version of Aquaman&amp;#039;s origin as well as Aquaman&amp;#039;s relationship with his half-brother, Ocean Master, whose origin is retold in more complete detail. The series also added new mystical elements to the Aquaman mythos and reinvented Ocean Master as a sorcerer. Aquaman reappeared in his blue costume in the Aquaman Special #1 (1988).\n\n\nAs detailed in the five-issue Aquaman limited series (Jun-Oct 1989) (by the same creative team of the 1989 special of Robert Loren Fleming, Keith Giffen and Curt Swan), which continued a few of the themes from the Special, Mera was eventually driven insane by grief over the death of Arthur, Jr., and was committed to an asylum in Poseidonis. Shortly afterwards, an alien force conquered Atlantis. Arthur was forced to save the city but was hampered by an escaped Mera who personally blamed Arthur for the death of their son. In a fit of rage, Mera left Aquaman&amp;#039;s dimension.\n\n\nA new Aquaman ongoing series (#1-13) thereafter ran from December 1991 to December 1992, which portrayed Aquaman reluctantly deciding to remain in Poseidonis as its protector once again. For a time, he served as Atlantis&amp;#039; representative to the United Nations but always found himself thrust back into the superhero role. Becoming more and more of a workaholic and solitary figure, Aquaman eventually returned to the oceans. He soon became tangled up in another attempt by Black Manta to destroy Atlantis by dragging it into a war with a surface nation.\n\n\nIf you like the books, support your local comic shop! Make sure you favorite books can continue!\n\n","torrent":{"xt":"urn:btih:afd0a3ca9bbd1b191da689157a8522af7af3088a","amp;dn":"Aquaman+v2-v4","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afd0a3ca9bbd1b191da689157a8522af7af3088a","infoHashBuffer":{"type":"Buffer","data":[175,208,163,202,155,189,27,25,29,166,137,21,122,133,34,175,122,243,8,138]},"announce":[],"urlList":[]}}