{"title":"Deconstruction (1994) - self titled","uid":4077364,"size":69426943,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:afeb80764d7c9c16e12f648f6b098e6628934b9e&amp;dn=Deconstruction+%281994%29+-+self+titled&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"david.lar","files":15,"time":1205382884,"description":"This is a fantastic album, recommend it if you&amp;#039;re a fan of Avery or Dave Navarro. Some of their best work. A must for any Jane&amp;#039;s fans.\nSorry the quality isn&amp;#039;t fantastic, it did not import so well (new to making torrents, comments on how to improve are appreciated).\nEnjoy!\n\n\nA bit of history:\na little history: this is the single-album project that Eric Avery (bass) and Dave Navarro (guitar) of Jane&amp;#039;s Addiction put together after the band broke up to get the last of that era out of their systems before moving on to other things.\n\nhow did it turn out? I think it is one of the best albums in my collection and could easily compete with &quot;Ritual de lo Habitual&quot; or &quot;Nothing&amp;#039;s Shocking&quot; in terms of musical virtuosity, quality of songwriting, and, perhaps most importantly, imagination and beauty.\n\nthe album was a conscious effort to break away from standard rock song structures. the end result is a collection of beautifully crafted, interesting and complex songs. they throb with power and passion and shimmer with polished technique, and are held together with solid songwriting. for fans of guitar greatness, the song &quot;Iris&quot; (an instrumental) is probably reason enough to pick up this album. some of Dave Navarro&amp;#039;s finest strumming went into this project.\n\nnot all Jane&amp;#039;s Addiction fans will go for this album. Eric Avery does the singing on most of the songs (Navarro sings &quot;Big Sur&quot;) and his voice is certainly an adjustment from Perry Farrell&amp;#039;s. he sounds a bit like Peter Murphy, if anyone is familiar with that style. on first listen it may sound dirgelike and monotonous, but give it a chance and I think you will grow to love Avery&amp;#039;s vocal style.\n\nif you are looking for an interesting, forward-thinking album that will keep you listening for years, you really ought to give this album a try. it may not be for you, but it may also become that obscure, little-known gem in your collection. ","torrent":{"xt":"urn:btih:afeb80764d7c9c16e12f648f6b098e6628934b9e","amp;dn":"Deconstruction+%281994%29+-+self+titled","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"afeb80764d7c9c16e12f648f6b098e6628934b9e","infoHashBuffer":{"type":"Buffer","data":[175,235,128,118,77,124,156,22,225,47,100,143,107,9,142,102,40,147,75,158]},"announce":[],"urlList":[]}}