{"title":"Tibia 8.11 Elf-Bot v2.0 Cracked","uid":4235084,"size":1380668,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:b021c69dc87451f839012b21d692f85e30043cd8&amp;dn=Tibia+8.11+Elf-Bot+v2.0+Cracked&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Rox_Fox_246","files":1,"time":1213265809,"description":"A proper version of ElfBot NG for Tibia 8.11 is finally available. This version&amp;#039;s main focus is to provide more simplicity, ease of use and a better understanding for its users. \n\nInterface\n\nThe interface has been reworked thoroughly to house the continually increasing amount of features adding to the bot. There is now several subsections which open panels containing several options related to them. Additionnally, every field or button in ElfBot NG now has a tooltip attached to it which explains a lot about their purpose. This makes it easier for anyone to understand the functionality of features quickly and properly without going through several pages of documentation.\n\nBug Fixes\n\nA lot of old bugs, major and minor, have now been fixed. Notably, an annoying potion bug with auto-healing through the interface causing the bot to not heal has now been resolved. \n\nAdditions\n\nDespite it being mainly a GUI update, several useful additions have also been implemented, such as support for new runes, more lists, hotkeys, visual guides, off-screen support, etc. These changes can now be observed by exploring the bot. A special feature called &amp;#039;dash&amp;#039; allows you to run faster in Tibia than you normally can! Read the attached documentation in the bot for more details. \n\nIt is to be noted that now that the interface has been redesigned, new space for additional features arose and they now can and will be added more easily and frequently. \n\n\nIt would usually cost 19,99$ to purchase an Elf-Bot key.\nBut we could finally also crack this one too.\nWith this version of Elf-Bot v2.0, you do NOT need to pay anything.\nJust install it, open your Tibia Client and Elf-Bot.\nEnjoy!\n","torrent":{"xt":"urn:btih:b021c69dc87451f839012b21d692f85e30043cd8","amp;dn":"Tibia+8.11+Elf-Bot+v2.0+Cracked","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b021c69dc87451f839012b21d692f85e30043cd8","infoHashBuffer":{"type":"Buffer","data":[176,33,198,157,200,116,81,248,57,1,43,33,214,146,248,94,48,4,60,216]},"announce":[],"urlList":[]}}