{"title":"Little Black Dress_Zoe Luckers Exercise Workout_avi","uid":4206493,"size":826425412,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:b0ccf96918f54736401ab32920c308961c075ca7&amp;dn=Little+Black+Dress_Zoe+Luckers+Exercise+Workout_avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"georgeanne","files":11,"time":1211830914,"description":"Firstly, Please help SEED, I have limited bandwith. \n\n========================================\nZoe Lucker s: Little Black Dress Workout\n========================================\n\nAdvantages: Gives you a good work out, without taking up too much time and can be done in 10 minute increments.\n \nDisadvantages: Camera angles can make the moves difficult to follow sometimes. \n\n--------------------------------------------------------------------------------\n \nThere are five sections, which you can work through all in order for a more intense work out, or just select one, two or three whichever time allows.\n\nWarm-Up: This is the first, and I would strongly recommend doing it. It stretches off all the muscles you use throughout the rest of the dvd, and is quite effective for preparing your mind as well as body.\n\nDance: Although not too intense, this is quite complex the first time you do it, and you may find you need to watch it once or twice before doing it. The curse of the camera-man strikes again, but shouldn\\&amp;#039;t present too much of a problem once you have done it a couple of times.\n\nBox: By far my favourite section, this is the most intense on the dvd, and is incredibly simple to follow. Despite having been doing martial arts for over a year, I needed to take a break after this section. \n\nDon\\&amp;#039;t let the fact it\\&amp;#039;s only 10 minutes long fool you - it\\&amp;#039;s pure hell (and I loved every second of it!)\n\nTone: There\\&amp;#039;s not really a lot that can be said about this section. Again, it is simple to follow, and fairly intense, and you\\&amp;#039;ll know you did it when you wake up the next morning! Not a bad toning routine, but after a few weeks of doing it, I found that it felt like it was lacking that something.\n\nYoga: This section is so relaxing that sometimes I do it a couple of times a day, just to chill out! There\\&amp;#039;s nothing too intense here, the focus is mostly on relaxing and cooling down. I think it rounds off Little Black Dress nicely, calming you down and puting you in the right frame of mind for a nice \nrelaxing soak in the bath.\n\nOverall, the music running through the background was pretty good - just upbeat enough to motivate you to move, without making you feel like you\\&amp;#039;re being left behind. \n\nI\\&amp;#039;d recommend this dvd to to anyone who wanted to get fitter, but didn\\&amp;#039;t have much time to spare, or didn\\&amp;#039;t fancy doing one of those dance videos that leaves you behind or expects you to be able to tie your body in knots. This video is: Simple, straight forward, and good fun. \n","torrent":{"xt":"urn:btih:b0ccf96918f54736401ab32920c308961c075ca7","amp;dn":"Little+Black+Dress_Zoe+Luckers+Exercise+Workout_avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b0ccf96918f54736401ab32920c308961c075ca7","infoHashBuffer":{"type":"Buffer","data":[176,204,249,105,24,245,71,54,64,26,179,41,32,195,8,150,28,7,92,167]},"announce":[],"urlList":[]}}