{"title":"Project Camelot PAL DVDR 3 of 3 ( ~6 h. ).buBBBas","uid":4076992,"size":4593448223,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:b2eed26bd7c25fb164222913fca2b58913122380&amp;dn=Project+Camelot+PAL+DVDR+3+of+3+%28+%7E6+h.+%29.buBBBas&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BUBBBAS","files":26,"time":1205362152,"description":"Duncan O`Finiogan             74 Min.\n\nDuncan O`Finiogan,David Corso 34 Min.\n\nGordon Novel                  87 Min.\n\nMichael St Clair              44 Min.\n\nMr. X                         20 Min.\n\nRalph Ring                    52 Min.\n\n\nhe following is a detailed summary of our tentative, current understanding of the core issues related to the presence of the visitors, and the possible earth changes that may be ahead of us.\n\nBy its very nature it is subject to change and revision at any time, as the Big Picture comes into focus and becomes clearer. It is also intended to provoke thought and to invite readers to do their own research and analysis. It would be extraordinary if every detail below were correct.\n\nMuch of this information is also elsewhere on this site (in interview form or on the Henry Deacon pages) and elsewhere, but the summary below may be a useful synopsis for the purposes of discussion. \n\n_____________________________ \n\nThe Roswell Catastrophe \n\nThe visitors who crashed at Roswell were future humans1. They were not from another planet2, but from a future Earth ? stepping (which may be a better word than traveling) back in time to 1947 to attempt to deal with serious problems which had occurred in their history3. Their mission was to try to change their past by creating an alternative branch of their own timeline, so that particular events ? about to happen to us in our very near future ? would not actually occur. \n\nThe Roswell visitors were on a purely altruistic mission. They did not have to do this, but chose to... out of compassion. But the mission went disastrously wrong ? not just because they crashed (an accident caused by high-powered radar ? later the military realized this and made use of radar as a weapon), but because they had a device with them which was their only means, as an orientation device in time and space, to get them home and back to their own time. \n\nThe device was a little box, highly advanced and multifunctional in nature, and was far smaller than the &quot;Looking Glass&quot; that Dan Burisch4 and Bill Hamilton5 describe as being subsequently utilized by military scientists in various experiments. When the box was acquired and investigated by the military, this became a catastrophe in itself. It made the timeline problem many times worse, because this both introduced time manipulation technology to us at the wrong time... and also told the military what lay ahead.\n\nIt can not be stressed too strongly how totally calamitous for us all the Roswell incident was. It was a major, major setback, right at the start of the future humans&amp;#039; project to help fix the problem. Acquiring a device such as that which the Roswell visitors carried would immediately alter the timeline which the future humans were trying to change in the first place... so there would then be two timelines that need fixing, and not just one.\n\nNOAA, the Dark Star, and Global Warming\n\nA small organization within NOAA (the National Oceanic and Atmospheric Administration) is aware of what scientists there sometimes call the ?second sun?. This is a massive astronomical object, possibly a brown dwarf6, which is on a long elliptical orbit around our own sun on an inclined plane to the rest of the planets. To align with other researchers7, we&amp;#039;ll refer to this as the Dark Star.\n\nThe Dark Star is now approaching, and is causing resonance effects on our sun in various ways8. This is the cause of the warming of all the planets, not just the Earth9. This information is classified, but has been known for a number of years10.\n\nThis issue is connected with the Roswell catastrophe described above. The problems the future humans were attempting to address were multiple, but principally featured a possible event triggered by a massive &amp;#039;spike&amp;#039; of solar activity at some point in our currently near future.\n\nWe emphasize most strongly that this event is only possible (having been observed in Looking Glass devices in a possible future)... and, importantly, is now evaluated to be unlikely11.\n\nThe increase in solar activity is caused only in part by the Dark Star, multiple factors being at play. These are complex. Some of them are on a galactic scale12, and are associated with natural, periodic events which the Earth has suffered through a number of times previously. What makes this particular time completely unique for our planet is that there is a convergence of serious factors ? such as carbon emissions13, overpopulation, and our propensity for choreographing war14 ? all of which combine with these major, cyclic and solar events to simultaneously threaten the well-being of ourselves and the biosphere.\n\nThe large-scale events are unstoppable. It&amp;#039;s also unclear when the &amp;#039;spike&amp;#039; of solar activity is due to be - though our understanding is that this is imminent, and could occur at any time in the next ten years or so. Although the issue has been considerably hyped, it&amp;#039;s impossible not to observe that the year 201215 is right in the middle of this bell-curve of probability.\n\nWhat is possible, however, is to minimize the effects of the solar event. Evaluated Looking Glass data concludes that there is a 19% probability of the worse case scenario occurring, with 85% confidence that that 19% figure is correct16. It seems we&amp;#039;re off the hook... although no matter what timeline one is on, significant problems lie ahead with the man-made crises that surround us (exacerbated by solar activity).\n\nInsurance: Underground Bases, Project Preserve Destiny, and the Martian Colony \n\nReaders may by now have made the connection with the trillions of dollars17 spent in recent decades by various military agencies on underground bases in a number of different countries18. Given the possibility of an imminent near-ELE (extinction level event)19, a cynic would argue that it&amp;#039;s a smart use of our tax dollars to ensure that at least some humans survive20.\n\nOther readers will connect this potential scenario with the story told by Dan Sherman21, in straightforward, unassuming and sober fashion, in which he was trained as an IC (Intuitive Communicator) as a preparation for an unknown future event that would include all electronic communications being rendered unusable22. The project he was part of was called Project Preserve Destiny... the title of which gives us a very heavy clue to what this was all about23.\n\nResearchers who have looked into the claims of the infamous TV program Alternative 3 24 conclude in the main that the show was a hoax. There is clear evidence that the show was a dramatic portrayal of arguably fictional events. However, it would appear that it may have been accidental disinformation rather than a hoax per se. Certain events portrayed in the program25 are markedly similar to the scenario presented here.\n\nAmong those is the existence of a substantial Mars base, established in the early 1960s and supplied by a combination of stargates26 and an advanced, classified space program codenamed SOLAR WARDEN27. The Mars base apparently has a number of functions28 but among those would certainly be the ensured survival of the human species should anything untoward happen on or to our home planet.\n\nWhat Can Be Done? \n\nAs has been written above, the major, cyclic large-scale events that are set to occur are unstoppable by us or any other race, no matter how advanced their technology. But what can be mitigated are certain effects. Much remains under our control, although as every day passes the clock is ticking: carbon emissions are not helping13; choreographed and orchestrated war14 adds to the chaos; and new diseases and possible pandemics29 may be controllable if we act in harness.\n\nThis is no different a warning than has been stated by many other messengers in recent years, but we place this in a context where the stakes are rather higher than usually recognized. It IS possible to work together to make a difference in a situation in which the backs of the human race may be up against the wall.\n\nOn an individual level, more is possible. Michael St Clair30 says simply: find a safe place, and do it now. Many others agree. It may be smart to avoid living on the coast, on low-lying land, on a fault zone, in a major city, or on the sides of a volcano. Fresh water is likely to be a major issue. Some analysts consider the southern hemisphere (Australia?) to be safer than the north, as the craziness of orchestrated war threatens.\n\nRemember that global warming will really start to bite in the near future. The Atlantic Conveyor31 may conceivably shut down, plunging Europe into a deep freeze. The warmer the Earth gets, the more evaporation there will be from the sea; so expect Katrina-scale hurricanes (in the west) and cyclones (in the east - they&amp;#039;re pretty much the same thing), and disrupted and extreme weather patterns everywhere.\n\nThere is a metaphysical approach, too. Lynne McTaggart32 in her new book The Intention Experiment: Using Your Thoughts to Change Your Life argues as she did in her previous work, The Field, that consciousness is a factor that can and does affect macro-scale events. We would wholeheartedly agree. Morphic fields33 ? templates or patterns of manifestations yet to unfold ? are as powerful and influential as they are invisible; and morphic resonance is also amenable to the power of thought34.\n\nIt&amp;#039;s even possible to bootstrap oneself into an optimum (least worst) timeline... though there&amp;#039;s no instruction book on a mechanical means to do this. Spiritual methodologies such as the many forms of Meditation and other Yogic practice, Buddhism, Sufiism and Shamanism can assist one here. (This is far from an exclusive list, and may include some of the major organized religions. Prayer, if well understood and applied by a mature and aware spirit, is certainly capable of working miracles.)\n\nTimes are changing, and global awareness (actually, a large morphic field) is gradually being heightened. The real question is, how fast? The way to put one&amp;#039;s shoulder to the wheel is to add one&amp;#039;s own strong and optimistic intention to the concept of the positive outcome. And like all such mental or spiritual gymnastics, this has to be real: it cannot be faked. \n\nFootnotes:\n\nThis information has been reported by Dan Burisch. See our interviews page and also Dan Burisch&amp;#039;s website.\nNot all visitors are time travelers. There are a great many races currently visiting this planet; many of these are genuine extraterrestrials. Reported numbers vary, but the respected witness Sgt. Clifford Stone, for example, says he knew of 57. Other witnesses have reported numbers of a similar order of magnitude.\nThe motivations of the visitors are likely to vary as much as human agendas do. We can safely assume that some are benevolent and altruistic; some are evil and self-serving; and others may have agendas we can only guess at and may be beyond human understanding.\n\nAccording to Burisch, some of the subsequent visitors were future humans who were (at that future time) based on other planets, and no longer on the future Earth.\n\nThis matter is complex. According to Burisch, some future humans are benevolent, while others are actually seeking to ensure that history is not changed; see note 23 below. \nDan Burisch has made detailed technical drawings, from memory, of the &amp;#039;Looking Glass&amp;#039; device he was familiar with. We&amp;#039;ll publish these as soon as we have clearance. Henry Deacon has said that he never worked with or encountered the form of Looking Glass that Burisch described, and therefore is not in a position to confirm it. \nBill Hamilton described the Looking Glass in some detail on this page of his website. (Note: the image shown is not the real thing; this is taken from the movie The Time Machine.) The text is also reproduced here. \nSee Andy Lloyd&amp;#039;s excellent website here, and the Binary Research Institute&amp;#039;s website here. For a series of excellent graphics depicting the Dark Star&amp;#039;s possible orbit, click here. \nResearchers differ in some details, but the consensus is that this is probably a brown dwarf. Deacon only referred to it as a massive astronomical object, causing serious gravitational and other effects. Burisch has stated in personal correspondence that his best recall is that he had been told that this object was a small black hole. \nThe mechanism is unclear, but appears to include electromagnetic, gravitational, and other resonance effects. \nThis information is in the public domain. It has been observed, for instance that Mars, Jupiter and Pluto are all warming up. There are many other references. \nA possible contender for the companion star was announced in 1983 by the Infrared Astronomical Satellite (IRAS) team, reporting a Jupiter-sized object at a distance of 550 astronomical units (550 times the Earth&amp;#039;s distance from the sun). The report was withdrawn soon afterwards, though IRAS have always claimed this was not a cover-up. Deacon reports that the small organization within NOAA has known about the &quot;second sun&quot; for a decade or possibly much longer, but has never made any public reference to it. \nBurisch has stated on record that according to the most recent computer-analyzed Looking Glass data, there is a 19% chance of the worse case scenario occurring, with 85% confidence in that 19% figure. \nBurisch and Deacon both report that the principal factors at play are large scale and galactic in nature, linked with long-term, recurring cycles of influence on the Earth. Read this article about the correlation between cosmic ray activity and global warming, for instance. \nAl Gore, in his acclaimed documentary An Inconvenient Truth, makes the case for the harmful effect of increased carbon emissions with considerable impact. \nThe Report from Iron Mountain, among other documents in the public domain, references the organized and orchestrated requirement for war in order to maintain macro-scale economic and social stability. \n21 December, 2012 is when the famous Mayan calendar comes to an end. Much has been written in speculation about the reasons why the Mayans saw no need to extend their calendar beyond that date. Deacon and Burisch state that this apparently exact date is not a precise prediction and that the solar events in question could occur at almost any time in the window 2007 ? 2016. \nSee note 11 above. Because (according to Burisch) steps were taken to decommission certain devices which were in danger of triggering massively amplified earth changes at the time of the solar &amp;#039;spike&amp;#039;, Burisch is confident in this calculation. Deacon states the the situation is continually subject to change, and is less sure of the figures. \nSee this site for some details, and also many others. \nThere are persistent reports of underground bases in the US, the UK, Puerto Rico, France, Germany, Norway, Canada, Australia, South America and Antarctica.\nClick here, here and here for three interesting photos of giant tunnel boring machines.\nThere are also undersea bases, confirmed by Deacon and researched by Dr. Richard Sauder and others. \nBurisch reports that according to Looking Glass data, in the worse case scenario up to 94% of the Earth&amp;#039;s population might be killed over the period of a small number of years following the catastrophe. \nAny high-level military scenario planning would be based on the premise that not everyone could be saved if the world&amp;#039;s population were under serious threat. \nSherman&amp;#039;s story is told in his excellent e-book, Above Black. \nIt&amp;#039;s accepted by scientists that one of the possible effects from a sufficiently major solar &amp;#039;spike&amp;#039; is that on Earth all electronic communications might be rendered unusable for some time. \nThe title Project Preserve Destiny is chilling, implying that the project may be based on the premise that a cataclysmic future event has been observed through very high technology time-portal devices... and that it is to be ensured that what has been observed must occur. Burisch reports that a certain group of future humans, whom he calls The Rogues and who come from approx. 45,000 years hence, are committed to making sure that events in their history do indeed come to pass in our timeline and are not averted. \nAlternative 3 was shown by UK&amp;#039;s Anglia TV on 20 June, 1977 ? although it was initially scheduled to be premiered on 1 April. Anglia TV made a statement the day after the program that it had been intended as a joke. \nClick here for to see a streaming video of the program itself (54 mins). \nClick here for a newspaper cutting in which Leslie Watkins, who authored the book of the same name, reveals that although he intended it as fiction in support of the TV program, he appears to have accidentally hit on something very real with the premise he portrayed. \nThe premise described in the TV program (and the book) was that to deal with the twin problems of overpopulation and global warming, there were three alternative solutions:\nAlternative 1: to drastically reduce the human population on Earth;\nAlternative 2: to construct a network of underground bases to safeguard a small, elite population; \nAlternative 3: to establish a &amp;#039;Noah&amp;#039;s Ark&amp;#039; colony of humanity&amp;#039;s best and brightest off of the planet ? on Mars. \nAccording to Deacon, stargates are routinely used for transport to distant locations, &amp;#039;travel time&amp;#039; being instantaneous. \nDeacon reports that SOLAR WARDEN encompasses a small fleet of large, highly classified spaceplanes. \nAccording to Deacon, the Mars base is multifunctional and has a large population of around 670,000 (not all of whom are present-day humans). Situated underground on the bottom of an ancient dried-up sea, it has, apparently, been in existence for thousands of years but was recently re-established in the early 1960s by an international team. Its functions include stargate access to more distant locations still. \nHIV, SARS, Avian (&amp;#039;bird&amp;#039;) flu, and other modern scares ? whether orchestrated or not ? come to mind. \nSee our interviews page for more on Michael St Clair, a well-known visionary and astrologer who predicts major problems in the coming few years and who advocates prudently identifying safe places to live. (St Clair has already moved to live in a small community in a remote location.) \nClick here for a summary of the importance of the Atlantic Conveyor, a critical component of the oceanic circulatory system. If the Atlantic Conveyor were to shut down (as might be triggered by a massive amount of cool water flooding into the North Atlantic from, for instance, the melting of Arctic ice or Greenland glaciers), then the warm waters of the Gulf Stream would no longer reach European shores and Europe would experience a much cooler climate... despite global warming. \nLynne McTaggart&amp;#039;s book, The Intention Experiment: Using Your Thoughts to Change Your Life, is available here. She is also the author of the ground-breaking book, The Field. \nThe British Biologist Dr. Rupert Sheldrake introduced the concepts of Morphic Fields and Morphic Resonance in his revolutionary 1981 book A New Science of Life: The Hypothesis of Formative Causation. Simply put, Sheldrake argues that species create Morphic Fields ? templates based on accumulated experience that have an an effect on the behaviors, attitudes and abilities of subsequent members of the same species ? which influence others encountering the same situations at the same or a later time. \nThe relevance here is that humans can consciously create Morphic Fields, which influence others once a critical mass of intention is gathered. It&amp;#039;s one way in which a small group, powerfully and positively focused, can gradually change the world. \n\n\n\n\n\n\n\n","torrent":{"xt":"urn:btih:b2eed26bd7c25fb164222913fca2b58913122380","amp;dn":"Project+Camelot+PAL+DVDR+3+of+3+%28+%7E6+h.+%29.buBBBas","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b2eed26bd7c25fb164222913fca2b58913122380","infoHashBuffer":{"type":"Buffer","data":[178,238,210,107,215,194,95,177,100,34,41,19,252,162,181,137,19,18,35,128]},"announce":[],"urlList":[]}}