{"title":"HISTORY OF POP AND ROCK MUSIC - part 597","uid":12755411,"size":806357109,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b3d345e3d5fb573a0aa912d05934b3c7fa2cd64b&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+597&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"pupovaczlatko","files":11,"time":1447443604,"description":"\n\r\n                PART 597   \r\n\r\n\r\n\r\n        THE SUNDAYS  -    Wild Horses  (1992)    \r\n        FIONA  APPLE  -    Across the universe  (1998)  \r\n        KATIE MELUA   -    Spider's Web  (2006)      \r\n        SHERIL CROW  -  Sign Your Name  (2010) \r\n\r\n\r\n\r\n\r\n           The Sundays were an English alternative rock band. The band formed in the late 1980s and released three albums in the 1990s.Their debut single was &quot;Can't Be Sure&quot;. Their first album, &quot;Reading, Writing and Arithmetic&quot; was released in 1990, along with their next single &quot;Here's Where the Story Ends&quot;. The album was a UK Top 5 hit.  Their next album, &quot;Blind&quot; , arrived in 1992 , reaching the UK Top 15. The &quot;Goodbye&quot; B-side, a cover of The Rolling Stones' &quot;Wild Horses&quot;, also appeared on the US release of Blind as well as in the movie Fear (1996) and on the 1999 soundtrack album for the popular television series Buffy the Vampire Slayer. The band toured in support of these recordings.  In 1997 their third album, &quot;Static &amp; Silence&quot; was followed by the release of their most successful single to date, &quot;Summertime&quot;, which made the UK Top 15. The album itself reached the UK Top 10. However, the band has been on a lengthy hiatus since those releases, with Wheeler and Gavurin focusing on raising their two children.\r\n\r\n           &quot;Spider's Web&quot; is the sixth single of Georgian born singer Katie Melua and is the third single from her album &quot;Piece by Piece&quot; .The single was a bigger success in continental Europe than in Britain, where it only made #52 in the UK Singles Chart. In Poland, it made the top three.\r\n\r\n             &quot;Sign Your Name&quot; is a song written and performed by Terence Trent D'Arby (now known as Sananda Maitreya), released as a single in 1988.     Sheryl Crow released her rendition of the song as the second single for her eighth studio album, 100 Miles from Memphis in 2010. It features Justin Timberlake on background vocals. The music video, directed by Wayne Isham, was released on September 16, 2010 through her VEVO account","torrent":{"xt":"urn:btih:b3d345e3d5fb573a0aa912d05934b3c7fa2cd64b","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+597","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3d345e3d5fb573a0aa912d05934b3c7fa2cd64b","infoHashBuffer":{"type":"Buffer","data":[179,211,69,227,213,251,87,58,10,169,18,208,89,52,179,199,250,44,214,75]},"announce":[],"urlList":[]}}