{"title":"Queen City Kids - The Best of the Queen City Kids (1989)","uid":4079229,"size":102165112,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b3edfed5c57e518f33f1976ad84300bb12d09bb4&amp;dn=Queen+City+Kids+-+The+Best+of+the+Queen+City+Kids+%281989%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"duchessnukem","files":12,"time":1205483987,"description":"Dance\nGirls\nIn Your Eyes\nBlack Box\nCrazy In Love\nCarrying The Stick\nSecret Smoke\nRipped Off\nKids World\nFollow You There\nDown Again\n\n------------------------------\n\nFrom www . canadianbands . com\n\nThough their run was short, Queen City Kids left an indelible mark on the face of Canadian rock. Forged from no-nonsense crunching bar-room beats, QCK emerged from Regina in the late '70's by founding members Alex Chuaqui on vocals and guitars, Jeffrey Germain on drums, John Donnelly on bass and guitarist Kevin Fyhn. \nWhile paying their dues on the unpaven back roads of the prairies, they were noticed by Capitol Records. Impressed by their low-production but straight-shooting demo, they signed the group to a deal and the self-titled debut came out in the summer of '81. Recorded at Winnipeg's Century 21 Studios, the same studio the majority of Streetheart's music was made. With Gene Martynec behind the controls, the band had an experienced producer at the helm, whose previous works had included Rough Trade, Doug &amp; The Slugs, BB Gabor and Edward Bear.\n\nThe record had a straight-ahead punch. No mistaking the intention of &quot;Carrying The Stick&quot;, it's driving beat pounding in your head. Going-nowhere guitar solo aside, just give me a brick wall baby ... &quot;Kids World&quot; and &quot;Follow You There&quot; showed the true versatility of the group, giving a hint of something special, their eclectic side coming out most in &quot;Secret Smoke&quot; and &quot;Down Again&quot;, complete with layered harmonies. Regional tours followed, seeing them in bars and small gigs all across the western provinces and into the States. The loyal following helped push the debut to gold status.\n\nThe Kids came back a year and a half later with BLACK BOX. More tight guitar trade-offs between Fyhn and Chuaqui with Donnelly and Germain holding the backbeat was the concept. With Rob Freeman as producer, the &quot;just gotta make your feet move&quot; single &quot;Dance&quot; and the title track helped circulate the group's message of straight-forward rock and roll. &quot;Girls&quot; was also heavy on the FM playlists that summer as the third single helped break new ground, showing they were capable of the tender power ballad as well as the guitar crunching sound paved with the first record. Their second straight gold record was the result, and another extensive tour ensued, this time taking the group to eastern Canada and deeper in the US.\n\nFeeling the band wasn't headed in the right direction, Capitol Records pulled the plug on QCK after BLACK BOX , opting not to extend their contract. Nonetheless, the group carried on for a bit until going their seperate ways in late '82. Post QCK, Chuaqui formed a group called Straw Dogs, while Donnelly joined Babyface, a group out of Vancouver which enjoyed success with the independant &quot;In The Night&quot; in 1985. THE BEST OF QCK was released in 1989 and is required material if you're going to pass Canadian Headbanging 101. The band reunited in 2000 for a series of shows - prompting a full-fledged reunion to this day. Still driving home their message the old fashioned way (with the amps turned up to 11), they've recently gone back into the studios and a new album is expected in the near future.\n\n------------------------------\n\nRip from CD @ 320kbps\n\nEnjoy!","torrent":{"xt":"urn:btih:b3edfed5c57e518f33f1976ad84300bb12d09bb4","amp;dn":"Queen+City+Kids+-+The+Best+of+the+Queen+City+Kids+%281989%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b3edfed5c57e518f33f1976ad84300bb12d09bb4","infoHashBuffer":{"type":"Buffer","data":[179,237,254,213,197,126,81,143,51,241,151,106,216,67,0,187,18,208,155,180]},"announce":[],"urlList":[]}}