{"title":"Ahora.O.Nunca[DVDRip][Spanish]","uid":4237629,"size":735934802,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b44f644f44a41ac189256fdac810e08756ab42a1&amp;dn=Ahora.O.Nunca%5BDVDRip%5D%5BSpanish%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mois20","files":4,"time":1213375859,"description":"Hace mucho tiempo, el profesor de filosofÃƒÂ­a de Carter Chambers, en su primer aÃƒÂ±o de carrera, les sugiriÃƒÂ³ a sus estudiantes que elaborasen una &quot;lista de deseos&quot;, un recuento de todas las cosas que querÃƒÂ­an hacer, ver y experimentar en la vida antes de morir. Pero, mientras Carter estaba aÃƒÂºn tratando de aclarar sus sueÃƒÂ±os y planes privados, la realidad se entrometiÃƒÂ³: matrimonio, hijos, una multitud de responsabilidades y, finalmente, un trabajo de mecÃƒÂ¡nico de automÃƒÂ³viles durante 46 aÃƒÂ±os, gradualmente cambiaron su idea de lo que era una lista de deseos en poco mÃƒÂ¡s que un recuerdo agridulce de oportunidades perdidas y en un ejercicio mental en el que pensaba de vez en cuando para pasar el tiempo mientras trabajaba bajo la capota de un coche. Entretanto, el multimillonario empresario Edward Cole nunca vio una lista sin pensar en los beneficios. Siempre estaba demasiado atareado haciendo dinero y construyendo un imperio para pensar en cuÃƒÂ¡les podrÃƒÂ­an ser sus necesidades mÃƒÂ¡s profundas, mÃƒÂ¡s allÃƒÂ¡ de la siguiente adquisiciÃƒÂ³n o una taza de cafÃƒÂ© para gourmets. Pero entonces la vida les dio a ambos un toque de atenciÃƒÂ³n urgente e inesperado. Carter y Edward se encontraron compartiendo una habitaciÃƒÂ³n de hospital con mucho tiempo para pensar en lo que sucederÃƒÂ­a a continuaciÃƒÂ³n, y en cuÃƒÂ¡nto de ello estaba en sus manos. A pesar de sus diferencias, pronto descubrieron que tenÃƒÂ­an dos cosas muy importantes en comÃƒÂºn: una necesidad no satisfecha de aceptarse a sÃƒÂ­ mismos y las elecciones que habÃƒÂ­an hecho, y un deseo urgente de pasar el tiempo que habÃƒÂ­an perdido haciendo todo lo que siempre quisieron hacer. AsÃƒÂ­ que, en contra de las ÃƒÂ³rdenes del mÃƒÂ©dico y del sentido comÃƒÂºn, estos dos autÃƒÂ©nticos desconocidos abandonan el hospital y se lanzan juntos a la carretera para vivir la aventura de sus vidas.","torrent":{"xt":"urn:btih:b44f644f44a41ac189256fdac810e08756ab42a1","amp;dn":"Ahora.O.Nunca%5BDVDRip%5D%5BSpanish%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b44f644f44a41ac189256fdac810e08756ab42a1","infoHashBuffer":{"type":"Buffer","data":[180,79,100,79,68,164,26,193,137,37,111,218,200,16,224,135,86,171,66,161]},"announce":[],"urlList":[]}}