{"title":"flexcrypt.exe","uid":4205912,"size":9698136,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b4f0583641c89ba977579408af784a23f332a0c8&amp;dn=flexcrypt.exe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"urfgurf","files":1,"time":1211802126,"description":"GENERAL\nFlexcrypt is a small software application that enables encryption and decryption of your emails. The reason for encrypting is to ensure the integrity and privacy of your email. Flexcrypt is very easy to install and use. After installation, simply add the email addresses you wish to send and receive encrypted emails with. \n\nFor each address, you must make up a password. This password is the key used in order to decrypt the message, thus, you must inform the receiver of the encrypted email of your chosen password. Do this by phone or in person, NOT by un-encrypted email. This only has to be done once, after that, Flexcrypt will remember your password and encrypt/decrypt your messages automatically or as you choose.\n\nIMPORTANT\nYou must use an email application in order for Flexcrypt to work. Any email application is OK, such as Thunderbird, Outlook, Outlook Express, etc. This means that Flexcrypt does NOT work with WEBMAIL.\nYou know that you are using webmail if you go to an internet address and log in to your email account.\n\nFlexcrypt gives you endpoint to endpoint security, this means that your email is encrypted at the moment it leaves your computer, and remains encrypted until it reaches the receiving persons computer. Webmail does not provide this level of endpoint to endpoint security.\n\nAlways test Flexcrypt with non-critical data first.\n\nFLEXCRYPT FREE SPECIFIC\nFlexcrypt Free includes encrypted communication with up to 3 email addresses.\n\nFlexcrypt free is true-free, this means that there are no hidden charges or a limited period of usage.\n","torrent":{"xt":"urn:btih:b4f0583641c89ba977579408af784a23f332a0c8","amp;dn":"flexcrypt.exe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b4f0583641c89ba977579408af784a23f332a0c8","infoHashBuffer":{"type":"Buffer","data":[180,240,88,54,65,200,155,169,119,87,148,8,175,120,74,35,243,50,160,200]},"announce":[],"urlList":[]}}