{"title":"Velvet Revolver - She Builds Quick Machines","uid":4211976,"size":149544964,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:b573403dfd9bf5cdfe386a65e0af230807b18370&amp;dn=Velvet+Revolver+-+She+Builds+Quick+Machines&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"2nafish","files":1,"time":1212115304,"description":"Source: TV\n\nFile Info:\n\nVideo: MPEG-2 video , 720x480, 29.97 fps, VBR (Constant quality), Maximum 6124 kbps\nAudio: Dolby Digital, 48000 Hz, Stereo, 448 kbps\n\n\nVelvet Revolver (abbreviated to VR) is a Grammy Award-winning hard rock supergroup currently consisting of Slash (lead guitar), Duff McKagan (bass guitar, backing vocals), Matt Sorum (drums, percussion, backing vocals) of Guns N&amp;#039; Roses, and Dave Kushner (rhythm guitar, backing vocals), of Wasted Youth. Following the breakup of Stone Temple Pilots in 2003, the band achieved success with their debut album Contraband and released their second album Libertad in 2007. Scott Weiland of Stone Temple Pilots was the lead singer for the band from 2003 until 2008, when he left to reunite STP after a fall out with the other members of Velvet Revolver.\n\nDirected by Dean Karr, the band is a group of modern cowboys standing on what appears to be a desert in the Texas/Mexico Border. Something is seen falling from the sky and Scott Weiland holds up a telescope, in which they see a female angel called &quot;Libertad&quot;. After crashing to Earth, she is kidnapped by the people of a Mexican village, who seem hostile. Various members of the band lip sync the lyrics of the song as if they were the dialogue of the &quot;film&quot;. The band tries to track her down on various vehicles equipped with radios, distributed in the following way: Weiland and Duff McKagan in a car, Matt Sorum on a motorcycle and Slash with Dave Kushner in a van. They arrive at the village and have a big fight that involves explosions, molotov cocktails and gun shooting. After the fight is over, the band finds Libertad and releases her.\n\n\nMy Videos:\n &lt;a href=&quot;\nhttp://thepiratebay.se/user/2nafish/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://thepiratebay.se/user/2nafish/&lt;/a&gt;","torrent":{"xt":"urn:btih:b573403dfd9bf5cdfe386a65e0af230807b18370","amp;dn":"Velvet+Revolver+-+She+Builds+Quick+Machines","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b573403dfd9bf5cdfe386a65e0af230807b18370","infoHashBuffer":{"type":"Buffer","data":[181,115,64,61,253,155,245,205,254,56,106,101,224,175,35,8,7,177,131,112]},"announce":[],"urlList":[]}}