{"title":"Adhesives - Mechanical Properties Technologies and Economic Impo","uid":12753490,"size":5200054,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:b709d32340ebfdb97e28823ed2bfc3d0bf6c084b&amp;dn=Adhesives+-+Mechanical+Properties+Technologies+and+Economic+Impo&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clouderone","files":1,"time":1447415931,"description":"Adhesives - Mechanical Properties Technologies and Economic Importance - Dario Croccolo (Nova, 2014).pdf\r\n\r\nISBN: 9781631176609\r\n\r\nIn this book, some interesting technologies and applications dedicated to adhesives are presented and discussed. First, the interference fitted and adhesively bonded joints are extensively studied as an effective means to increase the transferable load while reducing both the weight and the stress level of the joined components. In such type of joints, the influence of the assembly technique on the shear strength of the joints has been investigated. Therefore, the shear strength of hybrid joints realized by ‘press fitting’, by ‘shrink fitting’ or by ‘cryogenic fitting’ were compared in order to suggest the best way of joining both for technological and economic importance. Then, some design aspects for practical application (for instance in the automotive steel wheel) were analyzed. The adhesive and interference contributions to the resultant resistance of the hybrid joint were carried out with particular attention to the phenomena occurring at the interface. The effect of the adhesive nature, its curing technology and its mechanical response were strongly related to the type of adhesive exploited. Also, the static and fatigue strength properties of press fitted and adhesively bonded joints was studied by considering their Engagement Ratio, which is the ratio between the coupling length and the coupling diameter. Coupling and decoupling tests have been performed both on press-fitted and adhesively bonded specimens and on pin-collar samples, considering four different levels for the Engagement Ratio. The study shows that the Engagement Ratio has a negligible effect on the shear strength of the adhesive and also on the relationship between the decoupling and the coupling forces. Then, the assessment of the adhesive performance of two binders for reassembling fragment porous stones and, more specifically, the effect of nano-titania in the hydration and carbonation of the derived mortars was investigated. The mechanical characterization indicated that the mortars with the nano-titania addition showed improved mechanical properties when compared to the specimens without nano-titania. This property can be exploited in the fabrication of mortars for reassembling fragments of porous limestones from monuments, where the presence of humidity controls the mortar setting and adhesion efficiency. Based on the physico-chemical and mechanical characterization of the studied adhesive mortars with nano-titania, binders of metakaolin-lime and natural hydraulic lime have been selected as the most appropriate formulations for the adhesion of fragment porous stones in restoration applications. Furthermore, the adhesive crack propagation was investigated for some load bearing applications. It was determined that fatigue cracks, either induced by defects or by applied stresses, may appear and propagate, thus becoming potentially harmful for the structural integrity of a part or a whole structure. Case studies are presented and discussed for adhesively bonded single lap joint (SLJ). Finally, a numerical method able to reproduce three-dimensionally the fatigue debonding and/or delamination evolution in bonded structures is proposed in this book in order to improve their performances. The cohesive zone model previously developed by the authors to simulate fatigue crack growth at interfaces in 2D geometries is extended to 3D cracks under mixed-mode I/II loading","torrent":{"xt":"urn:btih:b709d32340ebfdb97e28823ed2bfc3d0bf6c084b","amp;dn":"Adhesives+-+Mechanical+Properties+Technologies+and+Economic+Impo","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b709d32340ebfdb97e28823ed2bfc3d0bf6c084b","infoHashBuffer":{"type":"Buffer","data":[183,9,211,35,64,235,253,185,126,40,130,62,210,191,195,208,191,108,8,75]},"announce":[],"urlList":[]}}