{"title":"Drugstore-2 CDs (1st and 2nd), Mazzy Star like alternative","uid":12766580,"size":697681938,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:b72dcec6ccaf9dd051092ced0f78651a4b569782&amp;dn=Drugstore-2+CDs+%281st+and+2nd%29%2C+Mazzy+Star+like+alternative&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rontoolsie","files":23,"time":1447607365,"description":"Drugstore's 1995 self-titled debut album is a beautiful and mesmeric listening experience. With a sound scape at times reminiscent of Belle and Sebastian, (and the more mellow works from) The Velvet Underground, Pavement and Yo La Tengo, this is a truly sublime mix of out-and-out ballads interspersed with wall of sound climaxes.\r\n\r\nFrom the apparent 'live studio' introduction to album opener Speaker 12 which morphs into Isabel Monteiro's heavenly vocal of 'This baby's going to heaven', it does feel, mood-wise, as though we're on our way there - of course, the listener is lulled into a false sense of serenity as the song opens up into a tour-de-force wall of sound (guitar, bass, drum) effect. There are elements of repetition in terms of the structure of some of the songs here, but this really does not detract from such a brilliantly melodic collection of, sometimes under-developed (I would say), musical creations. Other standout songs include the brilliantly morbid ditty Alive, the lament to lost love that is the song If, with its repeated motif of 'If I could have you, have you, completely', and the marvellous Fader, which provides another compelling mix of exquisite verse and hook-laden chorus.\r\n\r\nBut it is really on the 'second side' of the album that this underrated band really begin to excel with a sublime series of ballads. Superglider, with its Knocking On Heaven's Door-like (Television's version, of course) strummed opening, sets a stunning pace, but is matched by the brilliant murder ballad Nectarine and the album's closer, the equally morbid (but totally sublime) Accelerate, which contains the memorable lyric, 'Even plastic horses get put down'. A fitting end to an outstanding album","torrent":{"xt":"urn:btih:b72dcec6ccaf9dd051092ced0f78651a4b569782","amp;dn":"Drugstore-2+CDs+%281st+and+2nd%29%2C+Mazzy+Star+like+alternative","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b72dcec6ccaf9dd051092ced0f78651a4b569782","infoHashBuffer":{"type":"Buffer","data":[183,45,206,198,204,175,157,208,81,9,44,237,15,120,101,26,75,86,151,130]},"announce":[],"urlList":[]}}