{"title":"Safari 3.1 Para Windows Spanis","uid":4127693,"size":130038098,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:b7ddd8a6fe35e67e2a77ee9628166a3d4d453e9d&amp;dn=Safari+3.1+Para+Windows+Spanis&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"el_abuelo","files":8,"time":1207870314,"description":"Safari es un navegador web desarrollado por Apple Inc. y que dispone de versiones para Mac OS X y Microsoft Windows. El cÃƒÂ³digo utilizado para renderizar pÃƒÂ¡ginas web estÃƒÂ¡ basado en el motor KHTML, creado para el proyecto KDE para su navegador Konqueror. Como resultado de esto, el motor interno de Safari es software libre y es liberado bajo los terminos de la licencia GPL. Las mejoras al cÃƒÂ³digo de KHTML por parte de Apple son incorporadas al cÃƒÂ³digo de KDE rÃƒÂ¡pidamente.\n\nRendimiento deslumbrante\n\nSafari, el navegador web mÃƒÂ¡s veloz en cualquier plataforma, carga pÃƒÂ¡ginas hasta al doble de velocidad que Internet Explorer 7 y hasta 1,7 veces mÃƒÂ¡s rÃƒÂ¡pido que Firefox 2.\n\nInterfaz de usuario impecable\n\nEl aspecto pulcro de Safari te permite concentrarte en la web, no en tu navegador. El marco del navegador apenas mide un pÃƒÂ­xel de ancho y ves la barra de desplazamiento sÃƒÂ³lo cuando la necesitas. Por omisiÃƒÂ³n, no hay barra de estado, sino que una barra de progreso azul va rellenando el campo de la direcciÃƒÂ³n a medida que la pÃƒÂ¡gina se va cargando; asÃƒÂ­ dispones de mÃƒÂ¡s espacio para ver la pÃƒÂ¡gina.\nPor otro lado, con las herramientas mÃƒÂ¡s utilizadas, como el campo de bÃƒÂºsqueda de Google, integradas directamente en Safari, puedes encontrar cualquier cosa en Internet con mayor rapidez.\n\nBloqueo de ventanas emergentes\n\nDespÃƒÂ­dete de la molesta publicidad en ventanas emergentes que invaden tu escritorio y te distraen.\nPor defecto, Safari bloquea todas las nuevas ventanas espontÃƒÂ¡neas para que, cuando pulses algÃƒÂºn enlace, no te lleves desagradables sorpresas con inesperadas ventanas emergentes no deseadas.\n\nSnapBack\n\nCon la mayorÃƒÂ­a de los navegadores, es fÃƒÂ¡cil perderse por la web. Vas navegando y, sin darte cuenta, te encuentras a la deriva, lejos de donde empezaste. Deja de pulsar el botÃƒÂ³n Volver y empieza a utilizar SnapBack en Safari. SnapBack te permite volver al instante a los resultados de tu bÃƒÂºsqueda original o al primer nivel de cualquier pÃƒÂ¡gina web, aunque te encuentres a varios niveles de distancia.\n\nAutorrelleno de formularios\n\nA partir de ahora, nunca mÃƒÂ¡s tendrÃƒÂ¡s que cumplimentar un formulario de Internet desde cero. La razÃƒÂ³n es que la prestaciÃƒÂ³n Autorrelleno de formularios de Safari lo cumplimenta con informaciÃƒÂ³n de tu Agenda o de formularios que rellenaste con anterioridad.\n\nSeguridad\n\nYa puedes navegar por Internet sin preocupaciones, pues los ingenieros de Apple diseÃƒÂ±aron Safari para que fuera seguro desde el primer dÃƒÂ­a.\n\n","torrent":{"xt":"urn:btih:b7ddd8a6fe35e67e2a77ee9628166a3d4d453e9d","amp;dn":"Safari+3.1+Para+Windows+Spanis","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b7ddd8a6fe35e67e2a77ee9628166a3d4d453e9d","infoHashBuffer":{"type":"Buffer","data":[183,221,216,166,254,53,230,126,42,119,238,150,40,22,106,61,77,69,62,157]},"announce":[],"urlList":[]}}