{"title":"Cavestar - Cavestar 1997","uid":4068727,"size":82517392,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b85376264efeb74862ae20ba27b6fb259c30ef04&amp;dn=Cavestar+-+Cavestar+1997&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"stavecar","files":10,"time":1204932180,"description":"Cavestar is an interesting debut, and a bit more diverse than the usual ambient-trance for which Mindspore Records is known. Most tracks have the sci-fi samples, moderate rhythm, world-music percussion, and ambient strings, which is practically de rigeur for the genre, but vocalist Mona Moore\\&amp;#039;s presence on two tracks provides a nice respite. On several other tracks, the percussion grows noisy and practically red-lines, which is also nice to hear when most albums of the sort appear to want to lull you to sleep instead of actually divert you with the music. ~ John Bush, All Music Guide \n\n\n\nA warm and lovely fusion of tribal-ambiance and scintillating soundscapes, this brilliantly creative, enigmatic record will certainly please fans of James Asher\\&amp;#039;s Feet In The Soil and Steve Roach\\&amp;#039;s Dreamtime Return. Its softly rounded rhythms urge one\\&amp;#039;s feet to wander through lush jungle landscapes into a magical, forgotten realm where the music radiates with a meditative, cocooning pulse from the earth itself. On \\&quot;The Visitation,\\&quot; an enchanter\\&amp;#039;s mesmerizing words -- \\&quot;meteorites...optical illusions...hallucinations...weather balloons\\&quot; -- is ritually woven through gently percolating percussion. Exotically sweet sax and violin strains, hushed murmurs, soft keyboard swirls, and luminescent aural shadings layer into floating atmospheres for a truly transformative listening experience.\n","torrent":{"xt":"urn:btih:b85376264efeb74862ae20ba27b6fb259c30ef04","amp;dn":"Cavestar+-+Cavestar+1997","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b85376264efeb74862ae20ba27b6fb259c30ef04","infoHashBuffer":{"type":"Buffer","data":[184,83,118,38,78,254,183,72,98,174,32,186,39,182,251,37,156,48,239,4]},"announce":[],"urlList":[]}}