{"title":"Weaponology S02 E01 - E13 Full","uid":4080080,"size":4167861920,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b8a64392eaa3f61f12703fd6d1b7ab6922dc4f6b&amp;dn=Weaponology+S02+E01+-+E13+Full&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"4n00bis","files":14,"time":1205520021,"description":"Information\n\nTitle: Weaponology S02 E01 - E13 Full\nSource: Recorded from The Military Channel\nPre-Processing/Editing: Commercials edited out\n\nVideo Details\n\nResolution: 720 x 480\nFrame Rate: 29.97 FPS\nCodec: XviD Mp4\nAudio: Mp3 128kbps\n\nNotes\n\nDuring the beginning of compression of these videos I was fine tuning my method, resulting in different file sizes.  There is only a slight differnece in quality but they will all rip to DVD and look fine at standard TV resolution.  The majority of the videos are 2 pass @ 723kbps and around 320 MB in size. Enjoy the vids.\n\n--------------------------------------------------------\n\nEpisode 1: Navy SEALs\nMasters of stealth, lords of destruction: the U.S. Navy SEALs are the most versatile special operations force in the world. SEAL teams smash their enemies from land, sea and air using cutting-edge combat tactics and state-of-the-art equipment. Now Weaponology traces the SEALs&amp;#039; development from search-and-destroy missions in the jungles of Vietnam to hunting the Taliban in the highlands of Afghanistan.\n\nEpisode 2: U.S.M.C.\nThe United States Marine Corps is the ultimate combined arms force. This well-oiled military machine unites beach-assault vehicles, devastating air support and battle-hardened riflemen. Now Weaponology traces the U.S.M.C.&amp;#039;s development from its beginning as a group of shipboard warriors in the 18th century to the ultimate all arms force operating in Iraq today.\n\nEpisode 3: Waffen S.S.\nThe Waffen S.S. were Nazi Germany&amp;#039;s ultimate warriors -- earning their brutal reputation in blood during World War II. Adolf Hitler&amp;#039;s elite units destroyed their enemies with futuristic weapons systems backed up by an unrivaled fanaticism.  Weaponology takes you back through time to take a closer look at the men, machines and moments that shaped Hitler&amp;#039;s henchmen.\n\nEpisode 4: U.S. Airborne\nThe United States Airborne are America&amp;#039;s sky soldiers, hitting the combat zone from just 600 feet, striking their enemy hard and fast. Now, Weaponology invites you to take a closer look at the men, machines and moments that shaped this elite fighting unit.\n\nEpisode 5: Rangers\nThe Army Rangers are the hammer and anvil of U.S. military might. Men of steel, forged in the fire of every major conflict from the beaches of D-Day to the streets of Baghdad, the Rangers are the elite assault-and-ambush team of the U.S. Army. Weaponology shows viewers how the U.S. Army Rangers always ride the cutting edge of military technology to get the job done.\n\nEpisode 6: Green Berets\nShadow warriors, the Green Berets are lords of unconventional warfare. Their mission is to train and raise armies behind enemy lines. On this episode, Weaponology explores how the Green Berets rose out the ashes of World War II to fight the clandestine conflicts of the Cold War and the post-Sept. 11 world.\n\nEpisode 7: SAS\nWith a motto that reads &quot;Who Dares Wins,&quot; the SAS are at the cutting edge of global special forces operations. The SAS go in where it hurts to take out the trash using deep insertion behind enemy lines and have revolutionized the global war on terrorism.\n\nEpisode 8: Royal Marines\nWith a bulldog spirit, the royal marine commandos are a pup that loves to bite. They are all-terrain tsunami, military chameleons who attack the enemy amphibiously, in the mountains, skies and on land.\n\nEpisode 9: Extreme Warriors\nExtreme Warriors are trained to live and fight in the harshest environments known to man - exposed mountaintops, extreme altitude, sub-zero temperatures, snowstorms - these guys bring the pain in any terrain.\n\nEpisode 10: Combat Engineers\nCombat Engineers build with one hand, and destroy with the other. First onto the battlefield they have got the nuts, and bolts, to build bridges, blow up obstacles, diffuse landmines, take out bunkers and detect I.E.D&amp;#039;s.\n\nEpisode 11: French Foreign Legion\nWeaponology looks at the genealogy of France&amp;#039;s famous Foreign Legion. Which draws its ranks from other countries around the world.\n\nEpisode 12: Spetsnaz\nMembers of Russia&amp;#039;s elite fighting force work in counter terrorist strike squads and special operations. Go behind the scenes of Russia&amp;#039;s super soldiers and see why the world fears the word Spetsnaz!\n\nEpisode 13: Israeli Commandos\nWeaponology looks at the genealogy of Israel&amp;#039;s Elite Commando Unit from the Israel Defense Forces which specialise in hostage rescue missions and pre-emptive strikes against terrorists.\n\nWatch The Military Channel - Go Behind The Lines\n\n4n00bis","torrent":{"xt":"urn:btih:b8a64392eaa3f61f12703fd6d1b7ab6922dc4f6b","amp;dn":"Weaponology+S02+E01+-+E13+Full","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8a64392eaa3f61f12703fd6d1b7ab6922dc4f6b","infoHashBuffer":{"type":"Buffer","data":[184,166,67,146,234,163,246,31,18,112,63,214,209,183,171,105,34,220,79,107]},"announce":[],"urlList":[]}}