{"title":"END OF FREEDOM - Lisbon Treaty (Documentation on the EU takeover","uid":4073054,"size":712568151,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:b8db26a8bf3501b99971360a9b9d5deaed2ca908&amp;dn=END+OF+FREEDOM+-+Lisbon+Treaty+%28Documentation+on+the+EU+takeover&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BakuninXL","files":69,"time":1205162931,"description":"Collected information on the European Union and related topics. \n\nThe EU elites try to hide the significance of the Lisbon treaty (EU Constitution2.0) by making it unreadable. The ?Lisbon Treaty? establishes the same EU Constitution that was rejected by the French and Dutch referendums in 2005. This violates the principle of unanimity, where all Member States must consent to each treaty. As Italian interior minister, Giuliano Amato said at the London School of Economics last February, ?The good thing about not calling it a constitution is that no one can ask for a referendum.? \n\nAs a result, the French and Dutch votes were ignored, and five governments have cancelled a promised referendum (Czech Rep., Denmark, Poland, Portugal, UK).\n\nOnly Ireland will have a referendum. The other 26 Member States will ratify the treaty in parliament without asking the people.\n\nThey know that the people don&amp;#039;t want the constitution and that&amp;#039;s why they don&amp;#039;t ask us in form of a referendum. It&amp;#039;s quite simple, the only way to get that totalitarian constitution threw is by not letting the people vote on it! Can you smell the spirit of freedom and democracy in this infamous act? The Future of Europe can be different than the centralized monolith which the EU Constitution creates. \n\nEU totalitarianism must stop. The EU is not what it seems to be! \n\n\n\n\n\nPlease share and help spreading the word! It&amp;#039;s our all future! \n\n\n\nIncludes: \n\n- Wise Up Journal Â» END OF NATIONS - EU Takeover - the Lisbon Treaty (MOVIE)\n- Video clips on the Lisbon Treaty (EU Constitution2.0)\n- The Rise of the Rothschild&amp;#039;s and Communism\n- North Korea - A View in the Socialistic Future of Europe?\n- Sounds of the EU (Anthem and related)\n- Interview, speech, and video clip of the Soviet Dissident Vladimir Bukovsky\n- Documentation on why communism does not work\n- Sheep on their way to the gulag\n- Related books and essay&amp;#039;s on communism and  the EU\n- Documentation on the ideology behind the EU\n- Documenation concerning the difference between democracy and tyranny (political science)\n- Yuri Bezmenov - The KGB and the brain washing of the West (Video clip)\n- Communist Rules for evolution\n\n\n(Video Codec - XVID/mp3)\n\n\n\n&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Veritas vos Liberabit &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;","torrent":{"xt":"urn:btih:b8db26a8bf3501b99971360a9b9d5deaed2ca908","amp;dn":"END+OF+FREEDOM+-+Lisbon+Treaty+%28Documentation+on+the+EU+takeover","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8db26a8bf3501b99971360a9b9d5deaed2ca908","infoHashBuffer":{"type":"Buffer","data":[184,219,38,168,191,53,1,185,153,113,54,10,155,157,93,234,237,44,169,8]},"announce":[],"urlList":[]}}