{"title":"George Maharis - Sings 1961","uid":4190546,"size":63935013,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:b8f14940b5f0116715301653244a4ca6976289c8&amp;dn=George+Maharis+-+Sings+1961&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"mingy2","files":13,"time":1210931391,"description":"George Maharis - Sings 1961\n\n\n\n\n\nGeorge Maharis (born September 1, 1928 in Astoria, New York) is an American actor. Best known for his role as Buz Murdock in first three seasons of the TV series Route 66, he also recorded numerous pop music albums at the height of his fame, and later starred in the short-lived TV series The Most Dangerous Game.\n\nMaharis was one of seven children born to Greek immigrants in Astoria, Queens.[1] Although his father was in the restaurant business, Maharis had early ambitions to be a professional singer. After injuring his vocal cords through overuse, however, he switched to acting. He studied at the Actor&amp;#039;s Studio and appeared in Off-Broadway productions of Jean Genet&amp;#039;s Deathwatch and Edward Albee&amp;#039;s The Zoo Story. Soon he was on television as well, in such showcases as Studio One, Kraft Theater, Goodyear Theater, Stirling Silliphant&amp;#039;s Naked City and Otto Preminger&amp;#039;s Exodus. Maharis also was featured on the soap opera Search for Tomorrow as Bud Gardner, one of Joanne Gardner&amp;#039;s relatives who married Janet Bergman Collins.\n\n\nIn 1960, Maharis shot to stardom with his successful turn as Buz Murdock in the popular TV series Route 66, which co-starred Martin Milner as formerly rich, now orphaned Tod Stiles. The show featured the two rebel-hunks traveling throughout the United States along Route 66 (and elsewhere) in a new Corvette that belonged to Milner&amp;#039;s character. The series featured directors as acclaimed as Sam Peckinpah and Arthur Hiller, as well as guest stars as renowned as Robert Redford, Robert Duvall, Buster Keaton, Ethel Waters and Martin Sheen. Even in such company, Maharis&amp;#039; own acting skills did not go unnoticed, as he received an Emmy nomination in 1962 for his continuing performance as Buz.\n\nUnfortunately, Maharis departed without completing his third season on the series. Maharis&amp;#039;s participation that season had been spotty due to health problems, including two bouts of infectious hepatitis beginning in April 1962. Maharis insisted that he left Route 66 entirely for health reasons, due to the long hours and grueling conditions he frequently experienced while shooting episodes on location. &quot;I have to protect my future,&quot; Maharis said in a 1963 interview. &quot;If I keep going at the present pace, I&amp;#039;m a fool. Even if you have $4,000,000 in the bank, you can&amp;#039;t buy another liver.&quot;[3] This interpretation of events was disputed by series producers Stirling Silliphant and Herbert B. Leonard, who believed that the health issue camouflaged Maharis&amp;#039; desire to break his contract and make movies. Another claim was that there were conflicts between Milner and Maharis over acting styles, but this appears to have been less of an issue than was reported at the time.[3] After Maharis&amp;#039; departure, the show&amp;#039;s appeal declined. Glenn Corbett stepped in as Milner&amp;#039;s new sidekick on the road, Linc Case, but a year later, Route 66 was canceled.\n\n\nFor Maharis, a string of unsuccessful films followed, including Quick Before It Melts (1964), The Satan Bug and Sylvia (both 1965), A Covenant with Death and The Happening (both 1967) and The Desperados (1969). Returning to series television in 1970, Maharis starred as criminologist Jonathan Croft in the ABC adventure series The Most Deadly Game, co-starring Ralph Bellamy as Mr. Arcane. The series lasted twelve episodes, ending in January 1971. However, Maharis remained a popular sex symbol and in July 1973 posed nude for Playgirl&amp;#039;s second issue.\n\nThroughout the 1970s and 1980s, Maharis guest-starred in dozens of hit television series, including Fantasy Island, Kojak, McMillan and Wife, Barnaby Jones, Police Story, Switch, Night Gallery and The Bionic Woman as well as Murder She Wrote in 1990. His most significant film role of this era is probably as Count Machelli, King Cromwell&amp;#039;s War Chancellor (who is not what he seems) in The Sword and the Sorcerer (1982). In the 1980s he also frequently starred in Las Vegas dinner theater. In 1993 he performed in his, to date, final film, Doppelganger. Maharis is now reported to be &quot;fully retired.&quot;\n\nFilmmaker Mercedes Maharis, maker of the controversial 2005 documentary Cochise County USA - Cries From The Border, is married to Maharis&amp;#039;s brother Robert.\n\n\n\n01 - I Want To Be Wanted\n02 - It&amp;#039;s All In The Game\n03 - I&amp;#039;ll Never Smile Again\n04 - Moon River\n05 - Can&amp;#039;t Help Falling In Love\n06 - Hurt\n07 - Teach Me Tonight\n08 - You Must Have Been A Beautiful Baby\n09 - (Get Your Kicks On) Route 66!\n10 - My Kind Of Girl\n11 - Witchcraft\n12 - After The Lights Go Down Low\n\nArranged And Conducted By Robert Mersey","torrent":{"xt":"urn:btih:b8f14940b5f0116715301653244a4ca6976289c8","amp;dn":"George+Maharis+-+Sings+1961","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b8f14940b5f0116715301653244a4ca6976289c8","infoHashBuffer":{"type":"Buffer","data":[184,241,73,64,181,240,17,103,21,48,22,83,36,74,76,166,151,98,137,200]},"announce":[],"urlList":[]}}