{"title":"Dr Stanley Montieth - 2008 05 08-09 - Joel Skousen - MP3","uid":4181735,"size":29839832,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:b96addfcca9b92761d0abc72325561c36571be54&amp;dn=Dr+Stanley+Montieth+-+2008+05+08-09+-+Joel+Skousen+-+MP3+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anotha_modemho","files":2,"time":1210441524,"description":"Dr Stanley Montieth with guest Joel Skousen\n\nFor over a decade, prior to his retirement, Dr. Monteith led a delegation of physicians from Santa Cruz County to the House of Delegates of the California Medical Association. For 10 years he led the battle within organized medicine in California to address the AIDS epidemic as a medical issue rather than a civil rights issue. As a result of his experiences trying to implement an effective medical approach to the HIV epidemic, he wrote the book, &quot;AIDS:The Unnecessary Epidemic&quot;, the widely circulated pamphlet, &quot;To Deceive a Nation&quot;, and more recently, &quot;A Nation Deceived and Betrayed.&quot; Supported by physicians across our nation, his public health approach to the HIV epidemic was eventually accepted by the California Medical Association. Unfortunately, powerful forces continue to oppose the dictates of doctors. Dr Monteith currently spends five hours daily on talk radio, writes extensively, and lectures on geopolitics. He has spent 30 years researching the causes for America&amp;#039;s spiritual and moral decline.\n\nDr. Stans guest is Joel Skousen.\n\nJoel Skousen is a political scientist, by training, specializing in the philosophy of law and Constitutional theory, and is also a designer of high security residences and retreats. He has designed Self-sufficient and High Security homes throughout North America, and has consulted in Central America as well. His latest book in this field is Strategic Relocation--North American Guide to Safe Places, and is active in consulting with persons who need to relocate for security and increased self-sufficiency. He also assists people who need to live near a large city to develop contingency retreat plans involving rural farm or recreation property. \n\nJoel was raised in Oregon and later served as a fighter pilot for the US Marine Corps during the Vietnam era prior to beginning his design firm specializing in high security residences and retreats. During the 80&amp;#039;s he took a leave of absence to serve as the Chairman of the Conservative National Committee in Washington DC. and concurrently served as the Executive Editor of Conservative Digest. For two years he published a newsletter entitled, the WORLD AFFAIRS BRIEF, and served as a Senior Editor of &quot;Cogitations&quot; a quarterly journal on law and government . The World Affairs Brief is now back in publication and is available as a weekly email newsletter or in a monthly print edition.\n\nDr Stanley Montieth - 2008 05 08-09 - Joel Skousen - MP3 ","torrent":{"xt":"urn:btih:b96addfcca9b92761d0abc72325561c36571be54","amp;dn":"Dr+Stanley+Montieth+-+2008+05+08-09+-+Joel+Skousen+-+MP3+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b96addfcca9b92761d0abc72325561c36571be54","infoHashBuffer":{"type":"Buffer","data":[185,106,221,252,202,155,146,118,29,10,188,114,50,85,97,195,101,113,190,84]},"announce":[],"urlList":[]}}