{"title":"NubileFilms - Chloe Amour, Veronica Rodriguez (Drippin Wet","uid":12750604,"size":302279385,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:b979bd97b85b0a56c627175294eb0706c2b7a82f&amp;dn=NubileFilms+-+Chloe+Amour%2C+Veronica+Rodriguez+%28Drippin+Wet&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"feeldabyte","files":1,"time":1447367117,"description":"\nScreens &amp; Info :\r\n\r\n―――――――――――――――――――――――――――――――――\r\n  \nhttp://imgkiss.com/image/fSyko \nhttp://imgkiss.com/image/fSzP0\r\n\r\n―――――――――――――――――――――――――――――――――\r\n\r\nBikini babes Veronica Rodriguez and Chloe Amour are locked in a passionate embrace beneath the outdoor shower as they peel off their swimsuits and pepper each other with scorching kisses and licks. When Van Wylde arrives on the scene to join in the fun, the two girls welcome him with open arms to kick off a sultry threesome.\r\n\r\nThe girls are enamored with Van's long cock. While they enjoy themselves stroking Van's member, it's not long before they lead him over to an outdoor couch so that Veronica can put her puffy lip mouth to work delivering a wet and wild blowjob while Chloe plants her creamy pussy on van's face so that he can eat her out.\r\n\r\nSwitching things up, the girls exchange places so that Veronica can have her turn at a twat licking while Chloe climbs aboard Van's cock and takes him for a stiffie ride deep in her warm wetness. She holds nothing back, bouncing away on her man's fuck stick as her tits jiggle with the force of her movements until she is screaming her climax.\r\n\r\nNext Chloe takes her place on the ottoman while Veronica climbs on top of her in the 69 position. The girls' plans are temporarily waylaid by Van coming up from behind and sliding his cock deep into Veronica's snatch, so they come up with an alternative where Veronica sits on Chloe's face for her girlfriend to go to town licking and sucking her twat while Chloe gets fucked by Van.\r\n\r\nNext the girls position themselves side by side on their knees to give Van his choice of twats to pound. He gives it to Chloe first, but soon Veronica gets her turn to be filled and fucked to completion. While Veronica is enjoying Van's dick buried deep in her dripping wet sheath, Chloe spreads her legs so that the Latina babe can feast one last time on her needy slit.\r\n\r\nWith two luscious coeds to please, Van has been very patient about waiting to cum. When he can't hold it in any more, he positions himself so that Chloe and Veronica can take turns sucking and deep throating his cock until he creams all over Veronica's mouth and Chloe's chest. Finally sated, the girls exchange one last long kiss as their lovemaking winds down.\r\n\r\n\r\nSail to another one :\r\n  \nhttps://thepiratebay.se/user/feeldabyte/","torrent":{"xt":"urn:btih:b979bd97b85b0a56c627175294eb0706c2b7a82f","amp;dn":"NubileFilms+-+Chloe+Amour%2C+Veronica+Rodriguez+%28Drippin+Wet","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b979bd97b85b0a56c627175294eb0706c2b7a82f","infoHashBuffer":{"type":"Buffer","data":[185,121,189,151,184,91,10,86,198,39,23,82,148,235,7,6,194,183,168,47]},"announce":[],"urlList":[]}}