{"title":"Doctor Who - The Hand of Fear DVD (PAL)","uid":4182380,"size":4745993509,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:b9dc07abb16c1e309827c87f86493e52fb3609ee&amp;dn=Doctor+Who+-+The+Hand+of+Fear+DVD+%28PAL%29+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"BOB-ARCTOR","files":32,"time":1210472388,"description":"First Transmitted\n\n1 - 02/10/1976 18:10\n\n2 - 09/10/1976 17:50\n\n3 - 16/10/1976 18:05\n\n4 - 23/10/1976 18:00\nPlot\n\nThe TARDIS arrives on contemporary Earth, where Sarah comes into contact with what appears to be a fossilised human hand. This is in fact the last surviving fragment of a Kastrian called Eldrad, who was blown up in space as a punishment for attempting to wipe out his own people. \n\nEldrad&amp;#039;s essence lives on in a blue-stoned ring, which the possessed Sarah removes from the hand and places on her own. She then takes the hand to the nearby Nunton nuclear research and development complex where it soaks up the radiation from the reactor core and regenerates into a complete being. \n\nEldrad - who, having patterned his new body on Sarah&amp;#039;s, appears to all intents and purposes female - persuades the Doctor to take him back to Kastria where he might reclaim his heritage. There he discovers only a dead planet: the Kastrians are extinct and their race banks were destroyed by their last King, Rokon, in case Eldrad should ever return. \n\nFurious, Eldrad, whose body has now been reconfigured into its proper form, tries to get the Doctor to return him to Earth so that he might rule there instead. The two time travellers use the Doctor&amp;#039;s scarf to trip him into a deep crevasse. \n\nBack in the TARDIS, the Doctor receives a summons to return to Gallifrey and, as he cannot take Sarah there, endeavours to drop her off at her home.","torrent":{"xt":"urn:btih:b9dc07abb16c1e309827c87f86493e52fb3609ee","amp;dn":"Doctor+Who+-+The+Hand+of+Fear+DVD+%28PAL%29+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"b9dc07abb16c1e309827c87f86493e52fb3609ee","infoHashBuffer":{"type":"Buffer","data":[185,220,7,171,177,108,30,48,152,39,200,127,134,73,62,82,251,54,9,238]},"announce":[],"urlList":[]}}