{"title":"Savant Ascent v1.70.6 apk obb","uid":12842911,"size":82619248,"categoryP":"games","categoryS":"android","magnet":"?xt=urn:btih:ba60fc4b058d4cf78340f79e51023e17127f8743&amp;dn=Savant+Ascent+v1.70.6+apk+obb&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tiropitaki","files":2,"time":1448521143,"description":"A malicious orb has cast Savant out of his tower and transformed his surroundings into dangerous enemies!\r\n\r\nDodge and shoot your way back up the tower, and blast down waves of enemies as you make your way towards the top! As you progress, you unlock CDs that not only give you new tracks to play to, but also grant you powerful new abilities!\r\n\r\nYou play as the powerful Alchemist, a mechanical wizard who tries to possess the power of the mysterious orb. He's able to shoot vollyes of magic missiles, aswell as being nimble enough to dodge and jump out of harms way.\r\n\r\nUnlock 6 unique soundtracks from musical artist Savant each with unique powers to help you ascend the Alchemist's tower, or reach new highscores in Time Attack or Endless Mode. There are also secret powers to unlock, and several achievements to challenge the most experienced of players.\r\n\r\nCan you make it to the top?\r\n\r\nFeatures:\r\n\r\nChallenging dodge &amp; shoot gameplay!\r\nPowerful abilities, fast action, hoards of enemies to obliterate!\r\n6 unlockable soundtracks, each one gives you a new power\r\nSeveral modes to play\r\nSecret powers!\r\n\r\nWhat's new in this version\r\nFixed a screen tearing issue on larger devices(Nexus 6, Galaxy Note, etc.), adjusted controls, added animation options(animation defaults to ON, if you're device crashes when starting the first level, try turning these OFF from the options menu). Golden Enemies no longer dissapear in Endless Mode. You can now unlock the Space Level by obtaining the Philosopher's Stone.\r\n\r\nInstall APK, place data folder in SDCard/Android/obb/ and play.\r\nRequired Android O/S : 2.3+","torrent":{"xt":"urn:btih:ba60fc4b058d4cf78340f79e51023e17127f8743","amp;dn":"Savant+Ascent+v1.70.6+apk+obb","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ba60fc4b058d4cf78340f79e51023e17127f8743","infoHashBuffer":{"type":"Buffer","data":[186,96,252,75,5,141,76,247,131,64,247,158,81,2,62,23,18,127,135,67]},"announce":[],"urlList":[]}}