{"title":"Ghost Rider Stockholm Run","uid":4216600,"size":214926675,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bb0f750b503c08797e79a17af7034c9883cac305&amp;dn=Ghost+Rider+Stockholm+Run&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"d1111s","files":-1,"time":1212373740,"description":"Format - .mpg\nRunning Time - 20min 35s\n\n&quot;Ghost Rider&quot; is the alias used by a Swedish motorcycle stunt rider in a series of independently produced DVD movies where the recurring theme involves Ghost Rider himself performing illegal maneuvers on his motorcycle on public roads across Sweden and other countries in Europe. The movies show Ghost Rider, mostly in the perspective of cameras mounted on his motorbike, racing at extreme speeds on busy roadways, provoking law enforcement officers into high-speed chases, and performing various dangerous stunts in mostly uncontrolled environments. Ghost Rider usually wears black leathers and a black helmet with black visor to help protect his identity.\n\nGhost Rider's motorbikes of choice for the movies are the Suzuki GSX-R1000 and Suzuki GSX-R1300 . He has used a variety of different year models with differing modifications to each, including a fully carbon fiber GSX-R1000 K4 in Ghost Rider Goes Crazy in Europe and a 280+ brake horsepower turbocharged GSX-R1000 K5 in Ghost Rider Goes Undercover. Although Ghost Rider's primary vehicle is a motorcycle, he uses a wide variety of other vehicles in the movies including different types of cars, bicycles, minibikes, and even a snowmobile on public streets. Each movie has a scene where Ghost Rider rides a highly tuned, turbocharged Suzuki Hayabusa. The Hayabusa in Ghost Rider: The Final Ride was tuned to 417 bhp (311 kW), and the one used for the later movies was at 499 bhp (372 kW).\n\n\nThis Swedish madman, the mysterious unidentified Ghost Rider, is supposed to be in his fifties, owns a Mitsubishi dealership, has a professional black racing bike that can top 280km (before tuning) and sets off around Stockholm at unbelievable, dangerous, suicidal, breakneck speeds, weaving traffic with millimetres to spare, while being filmed via POV cameras on his bike and additional crew members filming at the sides of the freeway. It is all very illegal but because the guy has such a fast bike, and is obviously a professional with probably forty years experience, no one, not even the police can catch him, as this clearly demonstrates on a number of occasions. This is the sort of stuff that makes you hair stand on end, knowing full well you do not agree with what you are witnessing and yet can not believe what you are seeing.\n\n\n\nSTOCKHOLM RUN is the big run as Ghost Rider does a full lap of Stockholm at an average speed of about 200km, topping out the 280km speedometer for most of it.\n &lt;a href=&quot;\nhttp://workittothebone.blogspot.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://workittothebone.blogspot.com/&lt;/a&gt;","torrent":{"xt":"urn:btih:bb0f750b503c08797e79a17af7034c9883cac305","amp;dn":"Ghost+Rider+Stockholm+Run","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb0f750b503c08797e79a17af7034c9883cac305","infoHashBuffer":{"type":"Buffer","data":[187,15,117,11,80,60,8,121,126,121,161,122,247,3,76,152,131,202,195,5]},"announce":[],"urlList":[]}}