{"title":"HELLYEAH - BELOW THE BELT.rar","uid":4082781,"size":1006044402,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:bb650c000d670ef0cc3b1a5b44c5b9718ec1e662&amp;dn=HELLYEAH+-+BELOW+THE+BELT.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"djcircitbeat","files":1,"time":1205644355,"description":"HELLYEAH - Below the Belt (2007)\n\nIf you ever wondered what life on the road is like for a metal band these days, you?ll get an eyeful in Hellyeah?s first DVD Below The Belt. Going against the grain, the band focuses more on their daily activities than the actual performance aspect in the DVD. This may turn off some fans, but the most engaging parts come during the moments when the band does go a little crazy. It might get annoying with any other band, but the guys in Hellyeah do seem like they appreciate every aspect of their success.\n\nFor all of you who are missing Dimebag Darrell, the latest project from brother and ex-Pantera drummer Vinnie Paul definitely shows exactly how much of an influence the fallen guitarist has left on the band Hellyeah. There are plenty of scenes in the band?s first DVD Below The Belt that recall Dimebag, but it never feels like they are overdoing it. The focus absolutely is definitely upon Hellyeah, but there are constant reminders of the ties that remain with Paul. Whether he?s mentioning his brother?s name in passing or the band playing in a rehearsal space that belonged to Dimebag, it can become quite nostalgic at times.\n\nRather than just showing a full concert, Below The Belt documents the evolution of Hellyeah. We hear how the band met, see the musicians record their debut album and watch as Hellyeah sells out venues all over the world. You get everything in between as well, including lots of partying and nearly-naked women. There are plenty of testosterone-driven scenes in the DVD, whether the guys in Hellyeah are getting lap dances or simply drinking excessive amounts of alcohol. It?s a pretty honest, no-frills look at the band?s day-to-day life that. And it?s although exhausting to take in at times, it?s still a trip to watch.\n\nThroughout Below The Belt you?ll hear clips of various songs from Hellyeah, and there are a couple of live performances that are featured. Although the concert scenes are few, you still get a pretty good idea of the band?s chemistry onstage. The band?s first gig in Baltimore is the main feature, and there are also some worthwhile concert scenes from a show in Australia.\n// 8\n\nContent:\nThe documentary is the main feature, which runs at almost 2 hours long. It?s a pretty lengthy film and never really gets dull. The entire road crew, from roadies to the tour manager to the camera operator, are given a good amount of screen time as well, and you?re likely to find those lesser-known characters just as entertaining. There are plenty of interviews with every member of the band, and it never feels just like the Vinnie Paul Show.\n\nThere are some extras, including 2 music videos (?Alcohaulin? Ass? and ?You Wouldn?t Know?) and assorted band interviews. It would have been great to get a few performances of their harder songs, but you do get glimpses of those during the documentary portion.\n// 8\n\nProduction Quality:\nA lot of Below The Belt is shot by one of the band?s crew, but it?s surprisingly very well done. Does it match the quality of some of the artsy concert DVDs out there? No, but the style matches the atmosphere in which the band exists on a daily basis. It?s not necessarily pretty, and seeing the DVD with that same sense of imperfection works pretty well.\n// 8\n\nImpression:\nIf there?s one thing you?re left with after watching Below The Belt, it?s that the guys in Hellyeah love what they do. Regardless of their backgrounds in Pantera, Mudvayne, or Nothingface, the musicians share a common love for music and performing that is conveyed perfectly. It will be hard to live up to their past bands and no can say if they?ll get to that point musically, but Hellyeah make it clear that they live and breathe to play metal. Even if you aren?t wild about the new music, there?s enough going on behind the scenes (including lots of ladies and booze) to make for a pretty interesting DVD. // 8","torrent":{"xt":"urn:btih:bb650c000d670ef0cc3b1a5b44c5b9718ec1e662","amp;dn":"HELLYEAH+-+BELOW+THE+BELT.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bb650c000d670ef0cc3b1a5b44c5b9718ec1e662","infoHashBuffer":{"type":"Buffer","data":[187,101,12,0,13,103,14,240,204,59,26,91,68,197,185,113,142,193,230,98]},"announce":[],"urlList":[]}}