{"title":"Clocking Off - S03E06 - Alan's Story (ITV3 3 June 2008) [TVri","uid":4231825,"size":367034368,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bbc6cacf645a41e105085fea518a62d0ebb1df4d&amp;dn=Clocking+Off+-+S03E06+-+Alan%5C%27s+Story+%28ITV3+3+June+2008%29+%5BTVri&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"HarryRoberts","files":1,"time":1213095877,"description":"Clocking Off - S03E06 - Alan&amp;#039;s Story (ITV3 3 June 2008) [TVrip (XVID)]\n\nThis is one of the missing episodes\n\nFirst aired: 3/7/2002    Production Code: ICDA362A \nAlan (Bob Pugh) is always the life and soul of the party. In his mid-forties, he&amp;#039;s not quite one of the lads anymore but still sees life as a giggle. He has a wonderfully happy marriage to Sally (Lorriane Ashbourne), who although she&amp;#039;s the much quieter, more sensible half of the partnership, watches all his shenanigans with fond amusement. They have two teenage sons, the oldest of whom Chris (Ciaran Griffiths) is about to go off to university, a cause of enormous pride for them both. For Sally&amp;#039;s fortieth, Alan throws a big do, inviting all the lads from Mackintosh. It&amp;#039;s a night to remember - everyone drinking, dancing, having a wail of a time. You can tell that Sally would rather have had a quiet evening with Alan, that the party&amp;#039;s more for him than her, but she enjoys herself none the less. When the evening&amp;#039;s in full swing, Alan makes a little speech and tells Sally about her present - in front of everyone, he announces he&amp;#039;s going to have a vasectomy so she doesn&amp;#039;t have to take the pill anymore! But for Alan, the laughter soon fades to regret and despair. Because when he goes in for the operation, the doctors discover something unthinkable - they find out that he has a rare condition, which causes infertility - he has always been infertile. He could not possibly be the father of his beloved sons. As his happy life threatens to crumble into dust, Alan is faced with an appalling dilemma - does he keep this secret, eating away inside or does he bring it out in the open, where it could destroy everything...\n\nWriter: Peter Bowker \nDirector: David Jackson \nGuest star: Lorriane Ashbourne (Sally Preston), Bob Pugh (Alan Preston), Ciaran Griffiths (Chris Preston) \n\nVideo \nXviD\n49:51 (74778 frms)\n624x352 (1.77:1)\nAudio\n48000Hz CBR 128 kb/s total (2 chnls) \n\n\nTaken from The Box, www.thebox.bz. A most excellent torrent site which is heartily recommended to you.\n","torrent":{"xt":"urn:btih:bbc6cacf645a41e105085fea518a62d0ebb1df4d","amp;dn":"Clocking+Off+-+S03E06+-+Alan%5C%27s+Story+%28ITV3+3+June+2008%29+%5BTVri","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbc6cacf645a41e105085fea518a62d0ebb1df4d","infoHashBuffer":{"type":"Buffer","data":[187,198,202,207,100,90,65,225,5,8,95,234,81,138,98,208,235,177,223,77]},"announce":[],"urlList":[]}}