{"title":"Alfredo Rodriguez - Cuba Linda@320","uid":4067434,"size":176275079,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bbdcbc1622791a12af6345b0b2b8b2b4ab440254&amp;dn=Alfredo+Rodriguez+-+Cuba+Linda%40320&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"alekow1","files":21,"time":1204869658,"description":"Pianist Rodriguez serves up a panoramic view of Afro-Cuban music on this dizzyingly varied release. He uses different-sized lineups, but his literate, complementary piano playing is in the midst of it all. Some of the more prominent sidemen include trumpeter Jesus Alemany, saxophonist/percussionist Yosvany Terry, percussionists Tata Guines and Monguito, bassist Carlos Del Puerto, Jr., and, on loan from Orquesta Aragon, flautist Eduardo Rubio and violinists Dagoberto and Lazarito Gonzalez. Rodriguez contributes some writing and arranging. The album\\\\\\&amp;#039;s most jazz-oriented number, \\\\\\&quot;Tumbao a Peruchin,\\\\\\&quot; is an all-out descarga/jam composed by Rodriguez and featuring Peruchin Jr. on guitar. \\\\\\&quot;Tumba, Mi Tumba,\\\\\\&quot; also composed by Rodriguez, is a Haitian francesa arranged and directed by Leonardo Alexander; dancing drums and Enrique Navarro\\\\\\&amp;#039;s flute keep the pianist jumping on this number. Rodriguez also penned \\\\\\&quot;Mercedita Ya Me Voy,\\\\\\&quot; which features vocal choir chants and an uptempo bridge driven by montuno piano and the Gonzalez brothers\\\\\\&amp;#039; forceful violins. The conga-driven \\\\\\&quot;Para Francia Flores\\\\\\&quot; features Valentin Serrano Pezo on a Chinese cornet, while \\\\\\&quot;Canto de Palo\\\\\\&quot; speaks to spirits of the deceased, with Rodriguez\\\\\\&amp;#039; piano intensifying the inquiring chants. More tranquil is the montuno violin-led version of \\\\\\&quot;What a Difference a Day\\\\\\&amp;#039;s Made,\\\\\\&quot; which features Rubio\\\\\\&amp;#039;s exceptional flute playing. The simmering title cut contains a long vocal and percussion intro and Rodriguez\\\\\\&amp;#039;s placid yet ruminating piano. No stone is left unturned on this program of variety, depth, and fine musicianship. The CD was recorded at the famed Egrem Studios in Havana with local musicians. It\\\\\\&amp;#039;s a fine example of what\\\\\\&amp;#039;s happening in this music today, and it makes a strong argument for Rodriguez as one of the best Afro-Cuban pianist/bandleaders going. (AMG)\n\n\n\n\n01. Tumbao A Peruchin                                                                                                  \n02. Cuba Linda                                                                                                          \n03. Cuando Vuelvo A Tu Lado                                                                                            \n04. Canto De Palo                                                                                                      \n05. Tumba, Mi Tumba                                                                                                    \n06. Mercedita Y Me Voy (To Mercedes)                                                                                    \n07. Drume Negrita                                                                                                      \n08. Para Francia Flores Y Para Cuba Tambien\n\n\n\n\nPersonnel includes: Alfredo Rodriguez (piano); Gregorio Hernandez \\\\\\&quot;El Goyo\\\\\\&quot; (vocals); Pedro Justiz Marquez \\\\\\&quot;Peruchin Jr\\\\\\&quot; (guitar); Dagoberto Gonzalez, Lazarito Gonzalez (violin); Eduardo Rubio, Enrique Navarro (flute); Yosvany Terry Cabrera (tenor saxophone); Jesus Alemany, Luis Alemany (trumpet); Carlos Del Puerto, Jr. (bass); Tata Guines (congas); Dave Pattman (bongos); Emilito Del Monte (timbales); Mario Jauregui \\\\\\&quot;Aspirina\\\\\\&quot; (quinto, congas, percussion); Eladio Terry Gonzales (chekere); Justo Pelladito, Amado J. Dedeu (congas, percussion); Xiomara Larrinaga, Mario Dreque \\\\\\&quot;Chabalonga\\\\\\&quot; (background vocals).\n\n\nTumba Francesa \\\\\\&quot;La Caridad De Oriente\\\\\\&quot; De Santiago De Cuba includes: Flavio Figueroa, Flavio Figueroa, Jr., Gilberto Hernandez (percussion).\n\nRecorded at Egrem Studios, Havana, Cuba and Egrem Studios, Santiago De Cuba, Cuba in May 1996.\nIncludes liner notes by Mike Charroppin.\n\n\nLabel: Rykodisc\nDate: 1996\n\nBITRATE: 320\n\nMy cd-rip (EAC and Lame)\nCovers Included\n\n\n\n\n\nEnjoy,Seed and Share","torrent":{"xt":"urn:btih:bbdcbc1622791a12af6345b0b2b8b2b4ab440254","amp;dn":"Alfredo+Rodriguez+-+Cuba+Linda%40320","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bbdcbc1622791a12af6345b0b2b8b2b4ab440254","infoHashBuffer":{"type":"Buffer","data":[187,220,188,22,34,121,26,18,175,99,69,176,178,184,178,180,171,68,2,84]},"announce":[],"urlList":[]}}