{"title":"Gerard Manset discography  1968 to 2008","uid":12724541,"size":1994299520,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:bc48c31d128ddfe7479118a983f359d83d89efe0&amp;dn=Gerard+Manset+discography++1968+to+2008&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"trocadero37","files":302,"time":1447029749,"description":"Artist Biography by Jason Ankeny\r\n\r\nThe self-styled mystery man of contemporary French pop, singer/songwriter Gérard Manset spent his career in the margins of the mainstream, steadfastly avoiding the press interviews, live performances, and promotional commitments so vital to commercial success. His uncompromisingly stark and intimate music nevertheless captured a rabid cult following, and despite (or perhaps because of) his extended retreats from the musical landscape, each new Manset record was celebrated as an event by listeners and critics alike.\r\n\r\nManset was born in the Paris suburb of Saint Cloud on August 21, 1945. The son of affluent parents, he grew up in the city's 16ème arrondissement, and later studied at the Ecole des Arts Déco. While in art school he discovered rock &amp; roll, teaching himself guitar and writing his first original songs. In early 1968, Manset self-financed the sessions for what would become his full-length debut album, Animal on N'Est Mal, and while Pathé Marconi agreed to manufacture and distribute the release, the student revolts that followed in May guaranteed the record little attention, and it sold only a few hundred copies.\r\n\r\nLa Mort d'Orion\r\nManset's music nevertheless piqued the curiosity of a few adventurous Paris radio programmers, and his burgeoning cult following was enough to convince Pathé to record a second LP, a self-titled effort issued in late 1968. The potent mysticism and melancholy of songs like &quot;Je Suis Dieu&quot; and &quot;On Ne Tue Pas Son Prochain&quot; captivated critics, and set the stage for his 1970 follow-up, La Mort d'Orion, a symphonic concept album that was the first Manset project to generate sales commensurate with its media acclaim","torrent":{"xt":"urn:btih:bc48c31d128ddfe7479118a983f359d83d89efe0","amp;dn":"Gerard+Manset+discography++1968+to+2008","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc48c31d128ddfe7479118a983f359d83d89efe0","infoHashBuffer":{"type":"Buffer","data":[188,72,195,29,18,141,223,231,71,145,24,169,131,243,89,216,61,137,239,224]},"announce":[],"urlList":[]}}