{"title":"Catalina Video Presents a Jeff Stryker Retrospective","uid":4207300,"size":183744512,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:bc53d5ad8cd51c3a351253f11ba5d5948de63cde&amp;dn=Catalina+Video+Presents+a+Jeff+Stryker+Retrospective&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"TopsyCrett","files":1,"time":1211868717,"description":"A bodybuilder since age 11, Jeff Stryker was discovered by adult film producer John Travis at age 26. Stryker soon became famous in the adult film industry for his tanned good looks, penchant for extreme dirty talk, aggressive domination of partners, and his large penis, which is promoted as being 10 inches (25 cm) long, with an unusually large girth. Mr. Stryker has been seen on television shows worldwide and is one of the most famous adult celebrities in the history of adult movies.\n\nHe is primarily known as a performer in gay films, although Jamie Loves Jeff was one of the biggest selling heterosexual adult movies of all time. For a number of years he asserted that he was not even bi-sexual in his personal life. He later described himself as &quot;universal&quot; depending on what movie you watch. [1]\n\nThe Jeff Stryker realistic dildo is noted for being the largest selling dildo in history, and many television shows have featured it throughout the world. [2]\n\nHe also tried his hand at other acting, notably starring in a 1989 Italian-produced horror movie called After Death, (Revenge of the Zombies) in which he was credited as Chuck Peyton and was seen in other movies such as Can I be your Bratwurst Please?, and Dirty Love (available in DVD rental stores across America).\n\nStryker has one son, Joseph Peyton, whom he has raised independently (after a lengthy custody battle) since the child was one year old. The birth mother had her parental rights terminated so Stryker became legally both father and mother of the child as sole parent. In September 2004, his son, then 14 years old, was the victim of a hate crime when he was surrounded by nine Hispanic gang members, badly beaten and stabbed at Ulysses S. Grant High School in Van Nuys, California. Jeff was interviewed by TV reporters and stated that he believed that the attack was racially motivated. Both Jeff and his son were interviewed by NBC news in Los Angeles about the incident.[3]\n\n \n","torrent":{"xt":"urn:btih:bc53d5ad8cd51c3a351253f11ba5d5948de63cde","amp;dn":"Catalina+Video+Presents+a+Jeff+Stryker+Retrospective","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc53d5ad8cd51c3a351253f11ba5d5948de63cde","infoHashBuffer":{"type":"Buffer","data":[188,83,213,173,140,213,28,58,53,18,83,241,27,165,213,148,141,230,60,222]},"announce":[],"urlList":[]}}