{"title":"The Pallisers - Volume I-3 and 4 - BBC 1970","uid":4087024,"size":1723254516,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:bc5553ab0694e586f07781de917780dabf947758&amp;dn=The+Pallisers+-+Volume+I-3+and+4+-+BBC+1970&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"anca13","files":5,"time":1205872221,"description":"[img]http://www.designwithus.com/Pallisers I.jpg[/img]\n\n[color=Red][b]Please seed after download [/b][/color]  ;) \n\nReviewer:\tJay Dickson (Portland, OR) - \n\nAfter Susan Hampshire had played Fleur Forsyte, Becky Sharp, and Lady Sarah Churchill for the great BBC miniseries of the late 60s and early 70s it might have seemed inevitable that she was called upon to play her greatest part, Lady Glencora M&amp;#039;Cluskie Palliser, when the BBC decided to adapt Trollope&amp;#039;s six &quot;Parliamentary&quot; novels over the period of three years beginning in 1974. Oddly enough, as she explains in an interview extra on this DVD, the part was originally slated to be played by Hayley Mills. But when Mills had to bow out for personal reasons, Hampshire was called to play the part she was almost born to essay, and the greatest treat in this terrific Victorian soap opera is watching her lovely and loopy &quot;Lady Glen,&quot; the wealthiest titled woman in England who is yet so childlike and insecure she clutches a doll during her early married years. Hampshire intentionally makes Glencora maddeningly silly at times but also plays her always with a real core of generosity and kindness. She is nearly equalled by Philip Latham as her dull and pedantic but goodhearted husband Platagenet Palliser, the heir to the richest dukedom in England. \n\nThe first few epsiodes of this series are a bit shaky, since the writers try to expand upon things that are backstory in the six &quot;Palliser&quot; novels, namely the arranged marriage of Plantagenet and Lady Glencora. Although the adapters come up with good reasons why Palliser would be persuaded to marry this frivolous (but wealthy) woman, they did not fully convince us why Glencora would give up her true love Burgo Fitzgerald for Palliser: we see her resisting and resisting the marriage schemes of her titled gargoyles of aunts, and then all of a sudden she&amp;#039;s agreed to marry Plantagenet. But once the series gets going it gets better and better, and it has the added delight of a fully first-rate cast in the other roles, particularly Anna Massey (in a rare change from the unsympathetic roles she usually portrayed) as the intelligent Lady Laura Standish, who makes an ill-advised marriage to a repressive religious fanatic, and Barbara Murray as the fascinating Madame Max.\n","torrent":{"xt":"urn:btih:bc5553ab0694e586f07781de917780dabf947758","amp;dn":"The+Pallisers+-+Volume+I-3+and+4+-+BBC+1970","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc5553ab0694e586f07781de917780dabf947758","infoHashBuffer":{"type":"Buffer","data":[188,85,83,171,6,148,229,134,240,119,129,222,145,119,128,218,191,148,119,88]},"announce":[],"urlList":[]}}