{"title":"SME Blue Knights - Official Recordings","uid":4078942,"size":71240258,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bc9659cf9f0c2179b223e61fe94c31bcace8693e&amp;dn=SME+Blue+Knights+-+Official+Recordings&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jakobe101","files":11,"time":1205462418,"description":"Hailing from Shawnee Mission East High School, the Blue Knights are the top of two jazz bands at the local public school. The school is located in Prairie Village, Kansas. The Blue Knights are a nationally known jazz ensemble. Every year, the Blue Knights record a tape of 3 Duke Ellington songs to send in to the national Essentially Ellington Festival. The top 15 bands in the nation are invited to New York City to play at Lincoln Center. The Blue Knights have made the Top 15 and been invited to play in New York twice, in 2001, and then again in 2006.\n\nThe Blue Knights are the premier high school jazz band from the Midwest. The Blue Knights attend around 2-3 jazz festivals every year, and at every festival since 1997 they have failed to receive anything less than 1st place. The only exception to this is the Essentially Ellington Festival in NYC.\n\nThis is a collection of their 2007 and 2008 Essentially Ellington recordings, as well as another professionally done live recording at the state music convention in 2002. I hope you all enjoy these recordings. There are only 4 members featured in the 2008 Essentially Ellington recording that played with the band on the 2007 recording.","torrent":{"xt":"urn:btih:bc9659cf9f0c2179b223e61fe94c31bcace8693e","amp;dn":"SME+Blue+Knights+-+Official+Recordings","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bc9659cf9f0c2179b223e61fe94c31bcace8693e","infoHashBuffer":{"type":"Buffer","data":[188,150,89,207,159,12,33,121,178,35,230,31,233,76,49,188,172,232,105,62]},"announce":[],"urlList":[]}}