{"title":"Hellion","uid":4201464,"size":224239444,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bd018daaf481643652cd739cfa654147168d0073&amp;dn=Hellion&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"butcherboys","files":31,"time":1211521226,"description":"Artist: Hellion\nAlbum: Screams In The Night\nRelease: 1987\nBitrate: 320\nFile Size: 90.7mb\n\nTrack List:\n\n1. Hellion - Screams In The Night (3:53)\n2. Hellion - Bad Attitude (5:10)\n3. Hellion - Better Off Dead (4:34)\n4. Hellion - Upside Down Guitar Solo (1:09)\n5. Hellion - The Hand (4:08)\n6. Hellion - Explode (3:21)\n7. Hellion - Easy Action (3:34)\n8. Hellion - Put The Hammer Down (4:22)\n9. Hellion - Stick &amp;#039;Em (0:47)\n10. Hellion - Children Of The Night (3:48)\n11. Hellion - The Tower Of Air (4:38)\n-----------------------------------------------------------------------\n\nArtist: Hellion\nAlbum: Up From the Depths\nRelease: 1998\nBitrate: VBR 250+\nFile Size: 78.2mb\n\nTrack List:\n\n1. Hellion - Nightmares in Daylight (4:08)\n2. Hellion - Backstabber (3:37)\n3. Hellion - Fire (4:43)\n4. Hellion - Up From The Depths (5:29)\n5. Hellion - Break The Spell (4:11)\n6. Hellion - Nevermore (3:57)\n7. Hellion - The Evil One (7:10)\n8. Hellion - Exciter (5:46)\n9. Hellion - Run For Your Life (4:26)\n------------------------------------------------------------------------\n\nArtist: Hellion\nAlbum: Witching Hour EP\nRelease: 2000\nBitrate: 320\nFile Size: 44.8mb\n\nTrack List:\n\n1. Hellion - The Witching Hour (4:50)\n2. Hellion - Morning Star (Previously Unreleased) (4:18)\n3. Hellion - The Hand (Extended Version) (4:42)\n4. Hellion - Children Of The Night (Alternate) (3:49)\n-------------------------------------------------------------------------\n\nArtist Info:\n\nHELLION, fronted by vocalist Ann Boleyn (a.k.a. Anne Hull), who actually claims some distance lineage to the decapitated former second wife of Henry VIII, made their mark on the Los Angeles circuit with a series of demos. The founding roster saw Boleyn, previously of POWER PROGRAM and BEOWULF, alongside Minneapolis, Minnesota musicians guitarist Ray Schenk, bass player Peyton Tuthill and drummer Eiler Savage (Paul Eiler). The latter came up with the HELLION brand and designed the original logo. Previous to this the band had used the title DB. The group made a reputation on the local scene by holding house concerts, performing covers by the likes of UFO, BLACK SABBATH, SCORPIONS and RAINBOW, at Boleyn&amp;#039;s &quot;haunted mansion&quot; residence. Eiler quit in 1981 to forge FINAL WARNING.\n\nMystic Records offered HELLION a spot on a compilation album, &amp;#039;Sound Of Hollywood Girls&amp;#039;, but prior to these sessions Peyton Tuthill left the band, claiming Ann Boleyn&amp;#039;s supposed involvement in the occult arts as a deciding factor. Tuthill become ordained as a minister. Erstwhile W.A.S.P. bassist Rik Fox (real surname Sulima-Suligowski) briefly replaced Tuthill. However, Foxx quit just days before the band&amp;#039;s debut recording session, enticed away by Ron Keel&amp;#039;s STEELER. Brian West, who had played in POWER PROGRAM with Ann Boleyn, was inducted for the recordings, which took place on New Year&amp;#039;s Eve. The relationship with Mystic fragmented but, although HELLION had not gone to contract, the label paired off a HELLION track, &amp;#039;Nightmares In Daylight&amp;#039;, with another high profile Los Angeles female fronted act, BITCH, on a split 7&quot; vinyl single. The same label also released a further HELLION 7&quot; the following year, &amp;#039;Driving Hard&amp;#039; / &amp;#039;Black Knight&amp;#039; as &amp;#039;Streetzine&amp;#039; magazine voted the group the &quot;Best band in L.A.&quot;\n\nIn 1983 HELLION recruited lead guitarist Alan Barlam and bass player Bill Sweet and utilised Fiddler&amp;#039;s Studio in Hollywood, California to cut demos, laying down four tracks overnight. With no deal forthcoming, HELLION manufactured custom imprint Bongus Lodus Records to press the material on 12&quot; vinyl. The band, now managed by Wendy Dio, were soon the focus of attention when the record was picked up in Europe by Music For Nations. The London based label financed the recording of a further two songs, &amp;#039;Break The Spell&amp;#039; and &amp;#039;Up From The Depths&amp;#039;, to make up the European release of &amp;#039;Hellion&amp;#039; in January 1984.\n\nThe HELLION line-up for the mini-album saw Boleyn alongside guitarists Ray Schenk and Alan Barlam, bassist Bill Sweet and drummer Sean Kelly. Expert self publicists, HELLION arrived at one 1983 gig at the Los Angeles Troubadour club in a tank. However, disagreements between management and band were to break the band apart.\n\nIn 1985 Barlam, Schenk and Kelly departed to form BURN, with singer Richard Parico, after apparently being convinced that a female lead singer was deterring major label attention. BURN, still managed by the Niji organisation cut demos produced by Dana Strum and later inducted another ex-HELLION man, Rik Fox on bass, but were to disband.\n\nRetaining the HELLION name, Boleyn soon regrouped to record a new album &amp;#039;Screams In The Night&amp;#039; at Baby O Studios in Hollywood with a fresh line-up comprising guitarist Chet Thompson, former LION and ROBIN TROWER band bassist Alex Campbell and ex-DOKKEN drummer Greg Pekka. Boleyn, who had also initiated her own record company, New Renaissance Records, contributed the track &amp;#039;Monster Mash&amp;#039; to the 1987 movie &amp;#039;Return Of The Living Dead- Part II&amp;#039; soundtrack.\n\nThe 1988 mini-album &amp;#039;Postcards From The Asylum&amp;#039;, with new bassist Dave Dutton, saw the reunion of original HELLION members Barlam and Kelly and features a cover of the JUDAS PRIEST classic &amp;#039;Exciter&amp;#039;. Also of note would be the track &amp;#039;Run For Your Life&amp;#039;, produced by none other than Ronnie James Dio. Thompson, meanwhile, had a short spell with BRITTON.\n\nThe band put in a British club tour during early 1988 supported by MARSHALL LAW, which saw the addition of former ALLEGANCE bassist Rex Tennyson, who would later join ex-CATS IN BOOTS vocalist Joel Ellis in HEAVY BONES. &amp;#039;The Black Book&amp;#039;, cut at The Music Grinder and EQ Sound Studios in Los Angeles, proved to HELLION&amp;#039;s last outing for a lengthy period. Boleyn, acting as producer for the record, published a novel to coincide with the release. Thompson founded ALICE IN THUNDERLAND with vocalist Emi Canyn for a 1995 Japanese release eponymous album.\n\nHELLION was resurrected in 1998 by Boleyn, Schenk and Kelly cutting a album the following year which still awaits release. In 1999 New Renaissance issued the EP &amp;#039;The Witching Hour&amp;#039;, essentially a collection of archive demo material crafted by the Boleyn/Campbell/Thompson/Pecka line up. Also issued would be the limited edition live album &amp;#039;Live And Well In Hell&amp;#039;, recorded at D&amp;#039;Anza Theater in Riverside, California during 1984. Fans were still waiting developments when it was learned in mid 2001 that Boleyn had recorded an album, produced by Mikey Davis, and was auditioning for an entire new band. This new unit, simply billed as ANN BOLEYN and comprising guitarists Mike Guererro and Chris Kessler, former RHINO BUCKET man Eric Becica on bass and drummer Vince Rage, toured Japan in October. ","torrent":{"xt":"urn:btih:bd018daaf481643652cd739cfa654147168d0073","amp;dn":"Hellion","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd018daaf481643652cd739cfa654147168d0073","infoHashBuffer":{"type":"Buffer","data":[189,1,141,170,244,129,100,54,82,205,115,156,250,101,65,71,22,141,0,115]},"announce":[],"urlList":[]}}