{"title":"Kingpin - Life Of Crime","uid":4066007,"size":558191474,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bd3fb312331f89642f8487e4027c6101e3ea0181&amp;dn=Kingpin+-+Life+Of+Crime&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xxThugxx","files":4,"time":1204763093,"description":"                            *******   *    *  *     *   *****\n                               *      *    *  *     *   *\n                               *      ******  *     *   *\n                               *      *    *  *     *   * ****\n                               *      *    *  *     *   *    *\n                               *      *    *  *******   ****** \n\n        \n                                  \n                                   Kingpin - Life Of Crime      \n\n\n\n\n\n\nKingpin, Xatrix&amp;#039;s encore to its first-person shooter Redneck Rampage, is packaged with the most disclaimers of any game ever released. \nBy the time you&amp;#039;ve successfully installed it, you will have clicked through an age statement, some dire content warnings, and an impassioned editorial on youth violence and responsible parenting by Xatrix CEO Drew Markham. \nAfter all the dramatic claims of impending immorality, you may be disappointed to discover that the hand-wringing is simply over Kingpin&amp;#039;s inclusion of an absurd Smurf-esque hooligan dialect in which every second word is profane. That&amp;#039;s it. \nThere&amp;#039;s plenty of violent content tossed in, but no more than in any other game in the genre. Whether the prerelease infamy and the embarrassment of disclaimers are a result of the current political climate or conscious hyperbole by the Interplay marketing machine, \nthey tend to overshadow what is actually a decent shooter.\n\n\nThe developers claim to have been greatly influenced by film. Kingpin&amp;#039;s dialogue is inspired by and, as often as not, lifted directly from Pulp Fiction. \nThe mob bigwig you&amp;#039;re chasing is a Ving Rhames look- and sound-alike (the credits list Drew Markham himself as having provided the dead-on impersonation). \nOne enemy, called The Jesus, repeatedly screams all of that character&amp;#039;s most obscene lines from The Big Lebowski. The more obvious of these pop culture appropriations occasionally gives Kingpin the feel of an amateur novelty mod. \nWhen it comes to plot, though, Kingpin is less Tarantino and more an homage to the side-scrolling beat-&amp;#039;em-ups of the &amp;#039;80s. You&amp;#039;re an avenging thick-necked goon traveling through a bleak urban landscape on a quest to kick some big boss tail. \nQuite frankly, this isn&amp;#039;t a bad choice. It&amp;#039;s high time someone brought Double Dragon into the world of action shooters.\n\n\nThe nonstop cussing rapidly becomes background noise, and you&amp;#039;ll immediately become aware of what incredible use the developers have made of the Aging Quake II Engine (through repeated use, &quot;Aging&quot; is now officially part of the immortal codebase&amp;#039;s title). \nTaking inspiration from the cluttered post-retro styles of City of Lost Children and Brazil, Xatrix has created a stunningly bleak cityscape. Each of the game&amp;#039;s six locales is a beautifully depicted metropolitan nightmare - trash-strewn slum apartments, \nsteaming grilles, rattling graffiti-covered trains, monolithic smokestacks, and grimy brick bathed in twilight all add to the dense atmosphere. \nThe programmers have added the obligatory corona, fog, and shadow effects, along with amazing texture work and some convincingly towering architecture.\n\n\nAs with its environments, Kingpin boasts some of the most distinctive character design of any available shooter. \nAlthough there are only four basic models included - fat man, muscle man, woman, and dog - there is a huge assortment of skins and accessories so that no two figures look exactly alike. \nThe models themselves are a perfect match for the architecture - outsize and thick. As they are damaged, the characters become noticeably mangled. An enemy&amp;#039;s blood-streaked face illuminated by the muzzle flash of his tommy gun is a fiercely effective image common in the game. \n\n\nWhile Kingpin&amp;#039;s appearance is beyond reproach, its gameplay is not. Xatrix has attempted to incorporate some adventure elements into the standard first-person shooter play style, but, \nas often as not, these features are either poorly implemented or simply extraneous. You can communicate with NPCs, and, depending on which key you use to initiate the interaction, your approach can be either passive or aggressive. \nIt&amp;#039;s a good idea, but as presented, it has little real effect on the game. Necessary information will be given, seemingly regardless of the attitude picked, and nonessential NPC dialogues are merely an endless series of profanity-laden non sequiturs amounting to absolutely nothing. Meanwhile, friendly characters are provoked by your drawn weapon. \nTo prevent them from becoming combative, there is a command to holster your gun and walk around peacefully. Again, a good idea, but as implemented, ultimately frustrating. By the game&amp;#039;s second level, enemies tend to attack on sight, and it&amp;#039;s not always clear who&amp;#039;s a thug and who&amp;#039;s a civilian, \noften making the game a saving and loading drill as you wander around, guns down, while mapping out which personalities are aggressive.\n\n\nIn another nod to adventure games, several levels have a Pawn-O-Matic - a shop selling weapons and armor. Cash can be looted from corpses and spent here. While lots of items are listed, \nthe only products in supply are those currently available in the level, resulting in the whole thing being somewhat pointless except as a way to stock up on health.\nCash can also be used to retain up to two bodyguards, and here Kingpin is quite successful. \nThe AI for your companions is exemplary and easily outshines the similar presentation in Half-Life. \nYour hired muscle will effortlessly follow you through level transitions, up and down ladders, and through cramped tunnels, always making an almost flawless effort to keep up with you. Guards can be commanded to either follow you, stay put, or target a specific object. This simple interface adds a fun aspect to the game - positioning your goons lets you set up tactical retreats and stage bloody ambushes.\n\n\nHalf-Life proved that a game designed using the Quake II engine can have seamless, almost unnoticeable level transitions. \nValve could start a side business teaching other licensees how to accomplish this feat, because no other developer has managed it, Xatrix included. \nKingpin&amp;#039;s load times are painful, and the oft-repeated act of quick loading a saved game takes as long as an initial level startup. The game also suffers from the Unreal model of diminishing features. \nThe first level utilizes all the engine and interface elements rather well - the Pawn-O-Matic is useful, character interaction is meaningful, \nthe importance of sneaking is established then employed - but by the second level these things are quickly abandoned and replaced by increasingly indistinguishable firefights. \nSome miniboss battles are so poorly staged that you may not even be aware that something of importance is occurring. \nYour final encounter with the crime lord is unembellished and anticlimactic, though by the time you reach it, you won&amp;#039;t be expecting much else.\n\n\nAccompanying the gameplay on its descent into repetition is Kingpin&amp;#039;s heavily promoted soundtrack by Cypress Hill. \nOnly three tracks are included, all taken directly off the group&amp;#039;s 1998 album IV. With just three songs available, \nwith one of them constantly playing, each cut quickly wears out its welcome.\n\nConsidering Kingpin uses the mature Quake II engine, multiplayer is, as expected, acceptable, \nwith performance not as good as Quake itself but superior to most other available products. Heat.net and Gamespy support are included, as are the standard deathmatch and team-play options. \nWhile no co-op mode is present, Xatrix has created a custom team-play mod called Bagman. It&amp;#039;s a fun variation on capture the flag, in which safes and piles of money replace flags. Additionally, the game&amp;#039;s huge number of enemy skins can be used in deathmatch play, \nallowing for an unparalleled level of out-of-the-box player customization.\n\nThe list of annoying weaknesses and underused features is long but doesn&amp;#039;t ruin Kingpin. \nTo say it isn&amp;#039;t much more than what&amp;#039;s come before shouldn&amp;#039;t be taken as a complete dismissal; it merely separates the game from a fully realized landmark product like Half-Life. \nThere is fun to be had here, and the game offers a more than acceptable amount of intense gunplay. And for those of you worried about your delicate sensibilities, \nthe game has a low-violence install that bleeps out the swearing - making the dialogue a long string of beeps punctuated by the words &quot;mother,&quot; &quot;you,&quot; and &quot;yourself.&quot;\n","torrent":{"xt":"urn:btih:bd3fb312331f89642f8487e4027c6101e3ea0181","amp;dn":"Kingpin+-+Life+Of+Crime","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd3fb312331f89642f8487e4027c6101e3ea0181","infoHashBuffer":{"type":"Buffer","data":[189,63,179,18,51,31,137,100,47,132,135,228,2,124,97,1,227,234,1,129]},"announce":[],"urlList":[]}}