{"title":"Multi Lingual Bit Torrent Tutorial's","uid":12766380,"size":2035882,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:bd70fd8e55c57b9491c534526ec585ab90089585&amp;dn=Multi+Lingual+Bit+Torrent+Tutorial%27s&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"rigmar_radio","files":24,"time":1447604783,"description":"Some small files in various languages addressing common problems preventing many from getting good download speeds when torrenting.   Max out your download speeds.  Any user questions can be made in the comments section and I will give you individual help.  If English is not your primary language please use google translate.\r\n\r\nRigmar Radio - Helping other bit torrent users since 2003\r\n\r\nCertains petits fichiers dans différentes langues résoudre les problèmes communs qui empêchent beaucoup d'avoir de bons vitesses de téléchargement lorsque torrenting. Max vos Les vitesses de téléchargement. Toutes les questions des utilisateurs peuvent être faites dans la section des commentaires et je vais vous donner une aide individuelle. Si l'anglais est votre langue maternelle pas s'il vous plaît utiliser google translate.\r\n\r\nRigmar Radio - Aider les autres utilisateurs bit torrent depuis 2003\r\n\r\nAlgunos pequeños archivos en varios idiomas para abordar los problemas comunes que impiden a muchos de obtener buenas velocidades de descarga cuando torrenting. Max tus velocidades de descarga. Para cualquier duda de los usuarios se pueden hacer en la sección de comentarios y te voy a dar ayuda individual. Si el Inglés no es su idioma principal por favor, utilice el traductor de google.\r\n\r\nRigmar Radio - Ayudar a otros usuarios bit torrent desde 2003","torrent":{"xt":"urn:btih:bd70fd8e55c57b9491c534526ec585ab90089585","amp;dn":"Multi+Lingual+Bit+Torrent+Tutorial%27s","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd70fd8e55c57b9491c534526ec585ab90089585","infoHashBuffer":{"type":"Buffer","data":[189,112,253,142,85,197,123,148,145,197,52,82,110,197,133,171,144,8,149,133]},"announce":[],"urlList":[]}}