{"title":"Black Label  2006 AVN AWARD NOMINEE","uid":4174257,"size":2060251322,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:bd83882c2703afcd78872c295dd0091ace7ca3c7&amp;dn=Black+Label++2006+AVN+AWARD+NOMINEE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"tigerdirect","files":6,"time":1210033315,"description":"2006 AVN Award Nominee for Best Ethnic-Themed Video Black \n\nLike top shelf whiskey these are the divas with top shelf pussy. With some of the biggest cocks in adult, you can bet the cum will be flowing all night. After-hours has never seen this kind of action. Take a shot of Black Label.\n\nWhen there is an end there is always a beginning. Five tales intertwine as Dianna Devoe lends her eye to five blistering acts of sex! Carmen Hayes ravishes Mandingo&amp;#039;s huge tool, then encourages Pink to do the same with John E Depths. After riding him till he&amp;#039;s spent, Pink gets him into trouble with his girlfriend Angel Eyes who walks in on the scene. She seduces her driver, John Claude Batiste, unknowingly performing for a snooping news team. Marcus and Kandi Kreme, after filming the big scoop, deliver it to their boss, Monet Divine, who is so turned on by the footage that she offers her pussy to both Marcus and Kandi, while Kandi opens her anal cavity to the mix. Jada Fire, drowning her sorrows in a bar, replaces her seldom-available husband with bartender Tyler Knight, taking him in the ass like it was her pussy. Lovers of dark skin, luscious asses and wild nasty sex, experience Black Label!\n\t\nStars: Mr. Marcus, Angel Eyes, Diana DeVoe, John E. Depth, Jada Fire, Carmen Hayes, Tyler Knight, Jean-Claude Batiste, Pink (pornstar), Kandi Kreme, Monet Divine, \n \n\nDirector: Diana DeVoe\nApproximate Running Time: 01:48:47\n\n","torrent":{"xt":"urn:btih:bd83882c2703afcd78872c295dd0091ace7ca3c7","amp;dn":"Black+Label++2006+AVN+AWARD+NOMINEE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bd83882c2703afcd78872c295dd0091ace7ca3c7","infoHashBuffer":{"type":"Buffer","data":[189,131,136,44,39,3,175,205,120,135,44,41,93,208,9,26,206,124,163,199]},"announce":[],"urlList":[]}}