{"title":"QuakeWorld Impacted v2.6 - the most complete QuakeWorld (Quake1)","uid":4237365,"size":409819654,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:bda6b951134e639febda09a49e93b04feb2b3fb2&amp;dn=QuakeWorld+Impacted+v2.6+-+the+most+complete+QuakeWorld+%28Quake1%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"impact0r","files":1,"time":1213365448,"description":"QuakeWorld Impacted v2.6\n\n\n                      ------------- EDIT --------------\n\n           DOWNLOAD IT MUCH FASTER: r a p i d s h a r e.com/users/A6MPUK\n\n                      ---------------------------------\n\n\n&quot;A lot of the best discoveries were accidents - the universal law of gravitaty, penicillin, dynamite, and the QuakeWorld gameplay. There really will be nothing like it ever again.&quot;\n\n* * *\n\nThis compilation has been created to revitalize and propagate QuakeWorld among the FPP community. Its content is assembled from artwork of various QuakeWorld contributors, including myself.\n\nTrue, there is nQuake which is an excellent project. However, the package I submit is far more complete. You don't need to have/download anything else to enjoy the QuakeWorld experience to the fullest in terms of both graphics and gameplay. \nAlso, there are ready configurations that will require very little amendments to suit most players' needs. Just install and run the shortcut appropriate to your hardware and preferences.\n\nAs a bonus, there is 'out-of-the-box' widescreen support.\n\n* * *\n\nI. QuakeWorld Impacted v2.6 consists of THREE parts. You may choose to install the first two or the third one. To install everything, you will need to run this installation twice.\n\n------------------------\n1. QuakeWorld\n------------------------\nThe most up-to-date QuakeWorld client and graphics for both multi and single-player engagements. Breathtaking eye-candy features will bring you up to speed with todayÃƒÂ¢??s QuakeWorld, whether it is your first time or you are a Quake 1 veteran. If you played old-school Quake 1 years ago, you are in for some serious shock.\nThis option includes bots.\n\n------------------------------\n2. QuakeWorld Pro\n------------------------------\nQuakeWorld for professional online gaming, tuned for maximum performance and efficiency. Based on the most up-to-date client and DefÃƒÂ¢??s config with various modifications by myself. This version is meant for efficient fragging, so if you are looking for visual experience go for option No 1. \nThis option includes bots.\n\n------------------------------\n3. QuakeWorld Q3\n------------------------------\nThis version of the game includes advanced graphics that make QuakeWorld look very much like Quake 3 Arena. Far from faithful but Interesting, especially for Q3A players. However this version is graphically inferior to option No 1.\nIncluded as a tribute to and based on ÃƒÂ¢??QuakeWorld by Impact v0.9ÃƒÂ¢?? which has been the very first version of this installer.\n\n* * *\n\nII. If you have a panoramic monitor, use &quot;Panoramic&quot; shortcuts. If the panoramic picture you get does not fill entire screen, try running &quot;Panoramic 75Hz&quot;.\nIf it doesnt help, you need to manually edit BAT file, setting the proper refresh frequency with '-freq' parameter.\n\nTo set higher resolutions, you will need to edit BAT files as well.\n\n* * *\n\nIII. Make sure you visit quakeworld.nu and its forums regularly.\nFor some awesome movies, go qwmovies.does.it\n\n* * *\n\nIV. Credits go to entire QuakeWorld community. \n\n\nI hope you'll enjoy this release and the greatest FPS game of all time.\n\n\nImpact a.k.a Mav","torrent":{"xt":"urn:btih:bda6b951134e639febda09a49e93b04feb2b3fb2","amp;dn":"QuakeWorld+Impacted+v2.6+-+the+most+complete+QuakeWorld+%28Quake1%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bda6b951134e639febda09a49e93b04feb2b3fb2","infoHashBuffer":{"type":"Buffer","data":[189,166,185,81,19,78,99,159,235,218,9,164,158,147,176,79,235,43,63,178]},"announce":[],"urlList":[]}}