{"title":"MAGNUM P.I. 714 Murder by Night [retr?tv]","uid":4075649,"size":367476783,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:be6f3f0585a4805abfd0144c47cd66795b5614bc&amp;dn=MAGNUM+P.I.+714+Murder+by+Night+%5Bretr%3Ftv%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"flixer","files":2,"time":1205284522,"description":"Magnum, P.I.  (1980-1988)\nFormer Naval Intelligence officer Thomas Magnum resigns his commission to become a private investigator on the north shore of Oahu, Hawaii. He lands a home in the guest house on the estate of millionaire author Robin Masters in exchange for testing the estate&amp;#039;s security, but is forced to work under the strict and ever watchful eye of Jonathan Higgins, a former British Army soldier who serves as the estate manager, and constantly patrols the grounds with his two &quot;lads&quot; Zeus and Apollo, who are loyally trained Doberman Pinschers always ready to pounce on Magnum. Two of Magnum&amp;#039;s former Vietnam comrades and friends live and work nearby. T.C. Calvin owns &quot;Island Hoppers&quot;, a helicopter tour company, and Rick Wright manages the King Kamehameha Club, an exclusive beach front club. T.C.&amp;#039;s piloting skills and Rick&amp;#039;s shady underworld contacts often get them roped into Magnum&amp;#039;s cases. Others in Magnum&amp;#039;s circle include Naval officers Mac MacReynolds, Maggie Pool, and Buck Greene; Hawaii P.D. officers Nolan Page and Yoshi Tanaka; Dr. Ibold; Higgins&amp;#039;s fellow Brit Agatha Chumley; Rick&amp;#039;s underworld contact &quot;Ice Pick&quot;; and Deputy D.A. Carol Baldwin. Robin Masters was never fully seen, ultimately leading Magnum to the conclusion that Higgins was actually Masters, though this theory was never fully proven.\nStars: Tom Selleck (Thomas Magnum), John Hillerman (Jonathan Quayle Higgins), Roger E. Mosley (T.C. Calvin), Larry Manetti (Rick Wright), Elisha Cook Jr. (Francis &amp;#039;Ice Pick&amp;#039; Hofstetler), Kathleen Lloyd (Carol Baldwin)\n\n7x14. Murder by Night     1/14/1987 \nMagnum and company step out of character and into an old plot line out of the 40&amp;#039;s who-dun-it plot.\n1940s San Francisco: Private Investigator Thomas S. Magnum investigates the murder of newspaper tycoon William Maxfield. The case involves characters that strangely bear a strong resemblance to the (modern day) Magnum, T.C., Higgins and Rick.\nWriter: Robert Hamilton\nDirector: Russ Mayberry\nGuest star: Jeff MacKay (Coroner) , Anne Twomey (Alicia Maxfield), Jennifer Runyon (Christine Maxfield Bentley), Phyllis Davis (Tiffy), Henry Jones (Butler), Bill Edwards (William J. \n\n= DVDRip/XviD/942Kbps/512x384/23.97fps\nmp3/Eng/71Kbps/48KHz/Mono/48min = \n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0080240/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0080240/&lt;/a&gt;\n\n*BY REQUEST*\nI, personally, missed the decade in which Magnum was showing in the States, but I have managed to find a few episodes - For some strange reason, there&amp;#039;s a lot out there dubbed in German, Italian, and French, but not so much with the original English soundtrack.  Anyway, as usual, leave a comment if you&amp;#039;d like me to find more. :) ","torrent":{"xt":"urn:btih:be6f3f0585a4805abfd0144c47cd66795b5614bc","amp;dn":"MAGNUM+P.I.+714+Murder+by+Night+%5Bretr%3Ftv%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"be6f3f0585a4805abfd0144c47cd66795b5614bc","infoHashBuffer":{"type":"Buffer","data":[190,111,63,5,133,164,128,90,191,208,20,76,71,205,102,121,91,86,20,188]},"announce":[],"urlList":[]}}