{"title":"Ken Hensley(uriah heep) - From Time To Time 1994","uid":4194230,"size":147233542,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:bf0fa604354c102438bd1db2bebc75ea1999f4b9&amp;dn=Ken+Hensley%28uriah+heep%29+-+From+Time+To+Time+1994&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"abominogjnr","files":21,"time":1211132567,"description":"Ken Hensley-From Time to Time\nReleased 1994 On Red Steel\n\n\n\nSongs:\n\n \n Inspiration (Hensley) 3.17     Recorded at dodgy demos* (date unknown). It was transfered to 24-track at the Roundhouse and mixed in 1979 Features. Ian Paice on drums\n\n I Don't Wanna Wait (Hensley) 4.08   Recorded at Applewood Studious,just outside Denver,in 1982 during a demo session\n\n There Comes A Time (Hensley) 3.56   Also recorded at Applewood\n\n Love At First Sight (Hensley) 3.25  Recorde sometime in 1990. Geoff Allen on Drums,Denny Ball on base\n\n You (Hensley) 3.26     A ballad featuring Henry Spinetti and Dave Markee (who were in Eric Clapton's band at the time) and B.J.Cole On pedal steel. The string arrangement is by Linton Naiff and the background vocals are by Clare Torry (Pink Floyd - Dark Side of the Moon),Liza Strike and Kaye Gordon. Recorded in 1979\n\n The Name Of The Game (Hensley) 3.23   This one features Simon Kirke,Boz Burrell and Mick Ralphs (Bad Company). Recorded at Dodgy Demos (unknown date). Originally intended for the Freespirit album but never used. Interestingly a version of this song was recorded by Uriah Heep apparently During the High and Mighty sessions and has since been released on various disks as a bonus track\n\n Guilty (Hensley) 2.57      Recorded in 1979 featuring Linton Naiff (piano and string arrangement)\n\n Who Will Sing For You (Hensley) 2.52   b side to the single In the Morning(from Eager to Please). Featuring Mark Clarke on Bass and Bugs Pemberton On drums Recorded at Ctystal Studious,LA and NovaSound, London 1974\n\n Maybe You Can Tell Me (Hensley) 3.25 Recorded in 1979 with the same line up as 'you\n\n Free Spirit (Hensley) 3.24  Recorded at the same time as the album of the same name but left off the final product (why is a mystery to me as it is much better than a lot of the songs on the album) featuring Kenny Jones on Drums and Trever Bolder on Bass\n\n Cold Autumn Sunday (Hensley) 6.54  The original demo of the song on Proud Words... It was recorded at Luxembourg Studious in 1971 and features Free Members Paul Kossoff and Simon Kirke\n\n Longer Shadows (Hensley) 3.16   Also from luxembourg. Demo of the song that ended up on Eager to Please\n\n Black-Hearted Lady (Hensley) 3.30  Another one featuring Kirke and Kossoff From Luxembourgdemo of the song that ended up on Proud words..\n\n Take Care (Hensley) 2.54    Original demo of the song Footprints in the Snow that ended up on High and Mighty Recorded at Dodgy Demos\n\n Does Anything Matter (Hensley) 3.54  Another dodgy Demo Recording ultimately To end up on High and Mighty as 'Woman of the World' (check Out The intro!!)\n\n If I Had The Time (Hensley) 5.15  finally another from the Luxembourg sessions featuring some classic Paul Kossoff This is the demo of the song that ended up on the Sweet Freedom album\n\n\n\n\n*Dodgy Demos Was the name ken gave to his 16-track recording studio he had built at his home in sonning \n","torrent":{"xt":"urn:btih:bf0fa604354c102438bd1db2bebc75ea1999f4b9","amp;dn":"Ken+Hensley%28uriah+heep%29+-+From+Time+To+Time+1994","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf0fa604354c102438bd1db2bebc75ea1999f4b9","infoHashBuffer":{"type":"Buffer","data":[191,15,166,4,53,76,16,36,56,189,29,178,190,188,117,234,25,153,244,185]},"announce":[],"urlList":[]}}