{"title":"Nevermore - Dead Heart In A Dead World (2000) [EAC-FLAC]","uid":4211004,"size":529100934,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:bf2917b177d4d2941cf37c648c6b3fb65f4d0c81&amp;dn=Nevermore+-+Dead+Heart+In+A+Dead+World+%282000%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Sworduigi","files":10,"time":1212071926,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure with NO C2, accurate stream, disable cache.\nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD (silver CD)\nArtwork: Back, Front, Inlay and CD (Web Found).\n\n\nGeneral Info:\n\n          Tracklist:\n  1. &quot;Narcosynthesis&quot; ? 5:31\n   2. &quot;We Disintegrate&quot; ? 5:11\n   3. &quot;Inside Four Walls&quot; ? 4:39\n   4. &quot;Evolution 169&quot; ? 5:51\n   5. &quot;The River Dragon Has Come&quot; ? 5:05\n   6. &quot;The Heart Collector&quot; ? 5:55\n   7. &quot;Engines of Hate&quot; ? 4:42\n   8. &quot;The Sound of Silence&quot; (Paul Simon) ? 5:13\n   9. &quot;Insignificant&quot; ? 4:56\n  10. &quot;Believe in Nothing&quot; ? 4:21\n  11. &quot;Dead Heart in a Dead World&quot; ? 5:08\n  12. &quot;Next in Line&quot; (bonus video track)\n  13. &quot;What Tomorrow Knows&quot; (bonus video track)\n\n\n\n\n              LINE UP:\n# Warrel Dane - vocals\n# Jeff Loomis - guitars\n# Jim Sheppard - bass\n# Van Williams - drums\n\n# Andy Sneap - production, engineering, mixing, mastering\n\n\n\nReview taken from metalstorm.ee:\nSo, when you think of metal bands with some of the all-time great line-ups, whom do you think of? Go ahead; think for a moment. As for me, names like Bloodbath, Opeth, Cynic, and Diabolical Masquerade are a few that come to mind. Hmm, it's interesting that three of those share common members, isn's it? And oh yeah, by the way, there are several others you can add to that list, one of them being Nevermore. Let's see here, we have one of the best vocalists in not only metal, but in all of music in Warrel Dane, without a doubt one of music's best guitarists in Jeff Loomis, an incredible drummer in Van Williams, and a bass player by the name of Jim Sheppard who had no problem keeping up with all of them.\nSo, now that we?ve established them as incredible musicians, the question is, how do they sound as a unit. Well, the answer is: simply amazing. Dead Heart in a Dead World was one of, if not THE best album of 2000. And once again, that's not only in metal, but in all of music. No, that's not debatable. While every song on this album is an absolute masterpiece in-and-of themselves, let's look a few, shall we?\nFirst the opening song, Narcosynthesis:\nThe verses have a strong, obviously Meshuggah-influenced, technical riff, while the choruses are slower and very dark sounding. Note that while I'm using the terms verse and chorus here, the song is most certainly not simplistic in structure. Indeed, it's fairly complicated. Some fantastic melodic guitar work thrown in here and there only adds to the atmosphere.\nNow, the third song, Inside Four Walls:\nOnce again we have a super-heavy, technical thrash composition sure to get your head uncontrollably bobbing up and down. They get bonus points here for the thought provoking political commentary that is the lyrics. Actually, all the lyrics on this album are well done and thought provoking. That's a lot better than: ?I will slit your throat and drink the blood,? or ?Hail Satan! Hail Satan!? isn's it? Of course it is.\nThe eighth song, the Sound of Silence, is next on my list:\nThis song is actually a cover a song by Simon and Garfunkel. You?d never know this by listening to the song. It's a ripping thrash tune that's as fast and heavy as any on the album.\nThe final song to be discussed is number 10 on the track list, Believe in Nothing:\nThis song is a beautiful, yet melancholic depiction of a journey I'm sure everyone has taken at one point in their lives. Acoustic guitars, melodic electric guitars, and emotional vocals are the rule of thumb on this one.\nBasically, it all comes down to this: If you don's already own this album, get up off your butt right now, and go buy Dead Heart In A Dead World. If you do already own it, then why the heck are you reading this review? You could be listening to the album it's praising.","torrent":{"xt":"urn:btih:bf2917b177d4d2941cf37c648c6b3fb65f4d0c81","amp;dn":"Nevermore+-+Dead+Heart+In+A+Dead+World+%282000%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf2917b177d4d2941cf37c648c6b3fb65f4d0c81","infoHashBuffer":{"type":"Buffer","data":[191,41,23,177,119,212,210,148,28,243,124,100,140,107,63,182,95,77,12,129]},"announce":[],"urlList":[]}}