{"title":"Stossel.2015.10.30.Truth.or.Scare.720p.WEBrip","uid":12757319,"size":793781346,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:bf2c07ac4c698af70c57e391f45eb3b2f02d2485&amp;dn=Stossel.2015.10.30.Truth.or.Scare.720p.WEBrip&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BBreach","files":1,"time":1447467027,"description":"_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nJohn F. Stossel is an American consumer reporter, investigative journalist, author, libertarian columnist, and former co-anchor for the ABC News show 20/20. In this show he looks at consumer-focused topics, such as civil liberties, the business of health care, and free trade\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2\r\n\r\nTRUTH OR SCARE\r\n\r\nFriday at 8PM ET on FBN\r\n\r\nMY TAKE: I once got into an argument with the hosts &quot;Outnumbered&quot; after government issued a warning about the &quot;incredibly transmissible&quot; disease Ebola. The media was shrieking, &quot;Are Hospitals Ready?&quot; and all four women were alarmed. Government must do something! I pushed back.\r\n\r\nWe're terrified by threats, like Ebola. Fear is a friend of the state. Because when people get frightened, they willingly give money and power to politicians and bureaucrats. Government steals more money and freedom every time people get scared.\r\n\r\nNATION IN FEAR: What do you fear? I ask people in Times Square. Most did not mention things we in the news media usually talk about.\r\n\r\nWhy are people afraid of snakes or spiders? What happens to our brains when we become scared? &quot;Fear sociologist&quot; Margee Kerr explains the science behind fear and why fear can be a good thing! I have my own fears tested when I hold this creepy crawly.\r\n\r\nWe also sent producer Rikki Ratliff to an amusement park of horrors to try to find out why people pay 30 dollars to be frightened.\r\n\r\n&quot;SCARCE&quot; RESOURCES: The world is running out of oil, food and water! So claim the environmental left and clueless politicians. James Taylor of the Heartland Institute explains how, thanks to the genius of human innovation, we will have oil, food and water for years to come.\r\n\r\nFOOD SCARES: For the past 50 years, we've been told that we shouldn't eat saturated fat. But oops! Now research says saturated fat is just fine. &quot;The Big Fat Surprise&quot; author Nina Teicholz explains why much of what government says to scare us about food is wrong.\r\n\r\nCRIMINALLY AFRAID: We constantly hear that crime is increasing, but it's not! Crime has been dropping for years, and despite the recent claim that crime is up due to a &quot;war on cops,&quot; crime has continued to fall.\r\n\r\n_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2_,-'2","torrent":{"xt":"urn:btih:bf2c07ac4c698af70c57e391f45eb3b2f02d2485","amp;dn":"Stossel.2015.10.30.Truth.or.Scare.720p.WEBrip","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"bf2c07ac4c698af70c57e391f45eb3b2f02d2485","infoHashBuffer":{"type":"Buffer","data":[191,44,7,172,76,105,138,247,12,87,227,145,244,94,179,178,240,45,36,133]},"announce":[],"urlList":[]}}