{"title":"Black Bomb Squad 2","uid":4123421,"size":732372992,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:c048d51642dc0b64d59d3766e64cda08eef7a5d0&amp;dn=Black+Bomb+Squad+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"AllNightGirl","files":1,"time":1207674192,"description":"Onyxxx and Playboy T are back with four of the finest all natural black babes in the biz! Guy D goes ga-ga bonkers for Carmen&amp;#039;s heavy udders. He smothers himself silly between her twin peaks, rubbing his shaved head between them and her ass crack before munching on her smooth puss! Carmen&amp;#039;s cock-sucking skills have more suction than a Hoover vacuum. Guy wastes no time to slide his Havanah Banana deep in her chocolate honey pot! The heat is on as they fuck like crazy before Carmen begs for his creamy milkshake. Scene two opens with Jasmin getting manhandled by Tony! He fingers her cunt while her massive jugs bounce up and down with orgasmic pleasure. Super Tit Star Kim Eternity reunites with Byron Long. Byron slides his jumbo black log between her hot loaves of pleasure for an amazing titty fuck blowjob. He then spear fucks her with his Zulu Warrior. Byron gets a gold medal for power lifting Kim in mid air to fuck standing up! Damn, the sight of her sexy legs wrapped around his waist while her beach ball sized ass goes up and down on his dick is awesome! He finishes with a heavy load all over her tits! Panther is pretty in purple. She does a sexy strip tease in her sexy lingerie. Her mega mams spill out of her corset like a Victorian debutante. She takes Dick James&amp;#039;s two toned terror like a true slut. Fucking and suckin&amp;#039; till he blasts all over her shaved pussy. Black Bomb Squad #2 is sure to please! \n\n\nRuntime: 104 minutes\n\n\nStarring\n\nCarmen Hayes\nJasmin\nKim Eternity\nMs Panther\nByron Long\nGuy DiSilver\nTony Eveready\nDick James \n\nScreenshots: &lt;a href=&quot;\nhttp://www.imagefap.com/gallery.php?gid=1080133&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imagefap.com/gallery.php?gid=1080133&lt;/a&gt;","torrent":{"xt":"urn:btih:c048d51642dc0b64d59d3766e64cda08eef7a5d0","amp;dn":"Black+Bomb+Squad+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c048d51642dc0b64d59d3766e64cda08eef7a5d0","infoHashBuffer":{"type":"Buffer","data":[192,72,213,22,66,220,11,100,213,157,55,102,230,76,218,8,238,247,165,208]},"announce":[],"urlList":[]}}