{"title":"RAMA [PC] [ENG] [DOS - 7] - Hybrid360","uid":4183668,"size":1858730724,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:c1548d579bb958a42e899ce51ba4e640b564f799&amp;dn=RAMA+%5BPC%5D+%5BENG%5D+%5BDOS+-+7%5D+-+Hybrid360&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"oharaandrewlp","files":8,"time":1210543414,"description":"NOTICE: You may follow the instructions in the .nfo file, but I have a new and updated set which will make the game more compatible and stable.  See the instructions section below.\n\nHYBRID360\n    presents\n-&lt;|&gt;------------------------RAMA-------------------------&lt;|&gt;-\n                 developed by: Sierra\n\n--------\nFOREWORD\n--------\n\nHello, this is my first release.  There seems to be only one release of this game, and it is currently on Demonoid.  I wanted to bring this game to Piratebay.\nHowever, I do not take credit for ripping the first disc, which would not be read by my DVD-ROM.  Credits go to Manchu1968 for that.\n\nThis is a very old game from 1996 but extremely fun, and very difficult.\nIt is also quite difficult to install on windows xp, as it was designed for DOS and Windows 95.  You will need to pay close attention to the installation instructions.\n\n--------\nSYNOPSIS\n--------\n\nBased on RAMA II, by Arrthur C. Clarke and Gentry Lee.\n\nThe year is 2200, and a giant cylindrical structure has appeared on the edge of our solar system.  We call it RAMA.  You are an austronaut who is to replace another who mysteriously died during a routine medical procedure.\n\nExplore this fascinating world, solving puzzles and unearthing a massive controversy.  You will meet other intelligent beings on this structure, but they are asking the same question as you: who are the RAMAN'S, and what is the purpose of RAMA.\n\n----------\nTo Install\n----------\n\n1.Download the special insaller here: &lt;a href=&quot;\nhttp://www.squirtthecat.com/games/rama/index.html&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.squirtthecat.com/games/rama/index.html&lt;/a&gt;\n\n2. Run the installer and mount the first CD.\n\n3. Tell the installer which drive to use (go to &quot;my computer&quot;, and see which drive letter the disc is in)\n\n4.  To play the game, you will still need to mount disc one.  Disc 2 will be needed for the second half of the champaign, and disc 3 is used for bonus content.\n\n\nAfter installation, VDM Sound will not be required and the sound quality will be noticeably better; the game will also crash far less often.\n\nHowever, some elements will run slower, such as the Raman math machines in the Bangkok region.\n\n\n-----\nNOTES\n-----\n\nYou will need to mount disc 1 to begin a new game.  Do not unmount the disc as the game runs heavily on it.  You will need to mount the other discs when you are asked.  Only disc 1 &amp; 2 are required to finish the game.  The third disc is just bonus content.\n\nYou can install Daemon Tools Lite to mount the disc, but you can use whatever mounting software that you like.  I would not reccomend burning the discs however, as they will probably not work that way.\n\nYou will definately need to consult the RAMA walkthrough because this is an extremely difficult game\n\nUnless you can recognize that the alien numbers are in - read backwards( lamicedaxeh and latco) you will need to heavily rely on the walkthrough.  There is a shortcut to a superb one iside the installation folder.\n\n\n","torrent":{"xt":"urn:btih:c1548d579bb958a42e899ce51ba4e640b564f799","amp;dn":"RAMA+%5BPC%5D+%5BENG%5D+%5BDOS+-+7%5D+-+Hybrid360","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1548d579bb958a42e899ce51ba4e640b564f799","infoHashBuffer":{"type":"Buffer","data":[193,84,141,87,155,185,88,164,46,137,156,229,27,164,230,64,181,100,247,153]},"announce":[],"urlList":[]}}