{"title":"Coast to Coast Radio Program! Commercial Free! Apr 27th thru May","uid":4172676,"size":390489789,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:c1609fd311067813f53a3e41c404d7237f19e5bc&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Apr+27th+thru+May&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Stokeman","files":35,"time":1209952345,"description":"Expanding the Consciousness of the entire planet! Coast to Coast with George Noory! Here are another seven broadcasts for you all to download and enjoy! Thanks in advance to the seeders and the pollinators. The pollinators are those who continue to spread these torrents to many other sites ensuring the growth of the mind. Well, anyway, Download, SEED, Pollinate, and Enjoy! Until next week! Stokeman Out...\n\n\nSunday April 27th, 2008\nUFO Cases, Skeptics, and Photos\nRetired U.S. Navy research physicist Bruce Maccabee joined George Knapp (email) to discuss his extensive research on UFOs, including international cases, his take on debunkers, and analysis of alleged photos of unidentified flying objects. On the... \nHost: George Knapp\nGuest(s): Bruce Maccabee, Col. John Alexander\n\nMonday April 28th, 2008\nUFO Propulsion, Tesla, &amp; Electrotherapy\nDoctor of Engineering Physics Tom Valone discussed his work in zero point energy, Tesla technology, &amp; electro-gravitics and how these technologies translate into possible UFO energy and propulsion systems. He also spoke about the healing aspects of various... \nHost: George Noory\nGuest(s): Thomas Valone, Gerald Celente\n\nTuesday April 29th, 2008\nSecret Door VI\nAfter a first hour of Open Lines, six surprise guests joined us in separate segments for our latest edition of Behind the Secret Door. Numerologist Glynis McCants kicked things off with a look at the rest of 2008. Regarding the election, McCain is... \nHost: George Noory\nGuest(s): Glynis McCants, Dr. Robert Zubrin, Alex Jones, Cal Orey, David Icke, Dr. Louis Turi\n\nWednesday April 30th, 2008\nAstronomy &amp; the Vatican Observatory\nAstronomer and Curator of Meteorites at the Vatican Observatory, Brother Guy Consolmagno gave an update on discoveries in space, and spoke about the intersection of science and religion. The Vatican has observatories at two sites, one in the small Italian... \nHost: George Noory\nGuest(s): Brother Guy Consolmagno, Randall Lockwood\n\nThursday May 1st, 2008\nChurch of Satan &amp; Haunted Bedroom\nParanormal investigator Joshua P. Warren shared his research on the Church of Satan, including his filming of their secret rituals. After he interviewed Peter H. Gilmore, High Priest of the Church of Satan, for his radio show Speaking of Strange, Gilmore... \nHost: George Noory\nGuest(s): Joshua P. Warren, Jerome Corsi, Douglas Hagmann, Joe Kovacs\n\nFriday May 2nd, 2008\nNV Quake Grid, 2012 &amp; Strange People\nDuring the first hour, author and research physicist Stan Deyo talked about his discovery of an unmistakable grid pattern (pictured) formed by the recent Nevada earthquakes. Deyo said he does not think this was a naturally occurring event, and even suggested... \nHost: George Noory\nGuest(s): Open Lines, Stan Deyo, David B. Sereda\n\nSaturday May 3rd, 2008\nCharles Fort\nHistorian of stage magic Jim Steinmeyer discussed his new work on author Charles Fort (the namesake of &quot;Fortean&quot; phenomena) and how he influenced and promoted the world of the supernatural. Full recap forthcoming...\nHost: Ian Punnett\nGuest(s): Jim Steinmeyer, Kristi Piehl","torrent":{"xt":"urn:btih:c1609fd311067813f53a3e41c404d7237f19e5bc","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Apr+27th+thru+May","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c1609fd311067813f53a3e41c404d7237f19e5bc","infoHashBuffer":{"type":"Buffer","data":[193,96,159,211,17,6,120,19,245,58,62,65,196,4,215,35,127,25,229,188]},"announce":[],"urlList":[]}}