{"title":"Runescape Autoer - Ligar","uid":4210219,"size":517120,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c20866e5ec3da22c30705722d2b3c112b109b0ca&amp;dn=Runescape+Autoer+-+Ligar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Ligar","files":1,"time":1212023249,"description":"This is a pretty dumb little autominer, made for RS1 but it does do a mouse macro pretty well and also the auto-talker works well, just select &quot;no color&quot; and manually put it in your message.\n\nFor support, e-mail me at &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;f09c99979182af8ab09c998695de939f9d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;\nI do not upload viruses, check the username before downloading torrents from impersonators of legit uploaders like myself (Ligar), axxo, TheOneX, FXG, and others, if they have a green pirate symbol by their name, they are legit confirmed by The Pirate Bay. If you spot an impersonator, don't be quiet! report them and leave comments warning others. Another way to help is to check the files, some uploads (videos + music in particular) are open in folders and you can see that there are no dangerous EXE files loaded in music and video.\n\nHere's the direct download:\nHere's directions for good uses for the autoer:\n\nopen up the autoer, click on the tab called &quot;autoaction&quot;, now look at the drop down menu and change it to &quot;autocustom&quot; now you may click &quot;start recording&quot;, then click &quot;ok&quot; on the pop-up.\n\nNow you're recording every click until you click &quot;F12&quot;, it doesn't matter at what interval you click, you can change the interval later. Now click anything you want it to click over and over again. Now hold the button &quot;F12&quot; on your keyboard to stop recording and the autoer will pop up again. Now you should click on the &quot;Play back&quot; button, hold &quot;F12&quot; when you want it to stop like the pop-up says and click &quot;OK&quot; to start it. It's handy when you want to refresh pages constantly or you want to automine for short periods of time (although the screen does turn around your character very slowly, so you will have to keep an eye on it)\n\nIF YOU WANT TO MAKE MONEY ON RUNESCAPE, HERE'S A SAFE WAY WITH THE AUTOER:\n\n==================================================================================\n\nYou're going to auto-buy death runes at the rune shop in Varrock for 310 each and sell them at the grand exchange for more. PLEASE MAKE SURE Death Rune Prices are higher than 310 at the Grand Exchange before proceeding.\n\nSet the Action Speed to 4 and the Repeat Delay to 10s (although I don't think it matters)\n\ngo to the rune shop in the west side of varrock jsut south of the little bank there with A LOT of money\n\ntrade aubery (or whatever that guy's name is lol)\n\nnow switch to to the autoer's window and click &quot;record&quot;, make sure you click the &quot;ok button&quot; once you've read the dialog box that pops up.\n\nTHIS IS VERY IMPORTANT: DO NOT click anywhere other than what I tell you where to click, so do not click back to this email, so MEMORIZE this (it's pretty simple, you're just buying a death rune, then a mind and an air rune that are free with a little twist so you buy them at a good price.)\n\nright click on the death rune and buy 1 death rune\n\nright click on the death rune and buy 1 FREE air rune\n\nright click on the death rune and buy 1 FREE mind rune\n\nright click on the death rune and buy 1 death rune\n\nright click on the death rune and buy 1 FREE air rune\n\nright click on the death rune and buy 1 FREE mind rune\n\nleft (normal) click somewhere blank inside the shop's window\n\n&gt;&gt;HOLD&lt;&lt; F12 ON YOUR KEYBOARD TO STOP RECORDING\n\nBefore you click playback, look in the dialog box that is in the runescape autoer, it should say something like this:\nRight X:*** Y:***\nLeft X:*** Y:***\nRight X:*** Y:***\nLeft X:*** Y:***\nRight X:*** Y:***\nLeft X:*** Y:***\nRight X:*** Y:***\nLeft X:*** Y:***\nRight X:*** Y:***\nLeft X:*** Y:***\nRight X:*** Y:***\nLeft X:*** Y:***\nLeft X:*** Y:***\n\nOf coarse the stars should be filled in with numbers of some sort.\n\nNow you're ready, click &quot;playback&quot; and let it buy overnight or while you're at school. You will not be killed by a random event. You WILL get randoms though and you will need to do them yourself, but it's really easy usually.\n\nOnce you've bought all those death runes, you can sell them at the grand exchange. they sell VERY fast at the regular price and you'll see that you will make about 1.5 the amount you spent (for instance if you spend 1 mil, you will get about 1.5 mil back (depending on the price)\n\nI have made tons of money doing it this way in a short period of time. You just have to do it overnight or while you're at school/work. There are NO random events that can kill you now, so don't be worried about losing any money.\n\nDirect download it here:\n\n==================================================================================\nGod, people can be retards, there is no virus, I'm a VIP, this torrent has been up for a long time and hasn't been taken down. Any virus would have been. Shut the hell up guys, seriously, you don't have lives. Don't be afraid to download, it'd perfectly fine.","torrent":{"xt":"urn:btih:c20866e5ec3da22c30705722d2b3c112b109b0ca","amp;dn":"Runescape+Autoer+-+Ligar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c20866e5ec3da22c30705722d2b3c112b109b0ca","infoHashBuffer":{"type":"Buffer","data":[194,8,102,229,236,61,162,44,48,112,87,34,210,179,193,18,177,9,176,202]},"announce":[],"urlList":[]}}