{"title":"Salvando a Grace 1x01","uid":4230355,"size":367077376,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:c2739fef9e8dc666479b065e219de4a3ebe74583&amp;dn=Salvando+a+Grace+1x01&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"clu.","files":1,"time":1213022909,"description":"Ganadora de un Oscar por Ã‚?El pianoÃ‚? y protagonista de pelÃƒÂ­culas como Ã‚?Al filo de la noticiaÃ‚?, Ã‚?La tapaderaÃ‚?, Ã‚?CopycatÃ‚?, Ã‚?Oh BrotherÃ‚?,Ã‚?Cosas que dirÃƒÂ­a con solo mirarlaÃ‚? o Ã‚?Nueve vidasÃ‚?, Holly Hunter protagoniza esta serie con un personaje que le viene como anillo al dedo: la policÃƒÂ­a Grace Hanadarko, una agente al margen de los cÃƒÂ¡nones, protagonista de la serie Ã‚?Salvando a GraceÃ‚?, de la que ademÃƒÂ¡s tambiÃƒÂ©n es productora. CÃƒÂ­nica, bebedora, caÃƒÂ³tica y desafiante con sus superiores. AsÃƒÂ­ es Grace Hanadarko, una agente de policÃƒÂ­a de Oklahoma City a la que la vida no ha tratado muy bien tanto en lo personal como en lo profesional. Instalada bien entrada la cuarentena y con la ÃƒÂºnica alegrÃƒÂ­a de una veintena de sobrinos con los que sÃƒÂ­ logra mostrar su lado mÃƒÂ¡s tierno, Grace supera como puede el trance de haber sobrevivido a una tragedia personal, entregÃƒÂ¡ndose demasiado a menudo al alcohol y a compaÃƒÂ±eros de cama no muy afortunados. Pero la vida de Grace estÃƒÂ¡ a punto de dar un vuelco inesperado y sobrenatural. El Ã‚?milagroÃ‚? sucederÃƒÂ¡ una noche cuando trata de hacerse con el control de su coche tras haber tomado bastantes copas de mÃƒÂ¡s. Grace implora a Dios y ÃƒÂ©ste le demuestra su solidaridad mandÃƒÂ¡ndole a Earl (Leon Rippy Ã‚? Ã‚?DeadwoodÃ‚?), un ÃƒÂ¡ngel enviado con la ÃƒÂºnica misiÃƒÂ³n de redimirla y llevarla por el buen camino. Ã‚?Salvando a GraceÃ‚? nace de la imaginaciÃƒÂ³n de la guionista Nancy Miller, responsable de Ã‚?The CloserÃ‚?, otra serie con protagonista femenina, policÃƒÂ­a y difÃƒÂ­cil. En Ã‚?Salvando a GraceÃ‚?, Miller parte de una situaciÃƒÂ³n que parece una versiÃƒÂ³n urbana, contemporÃƒÂ¡nea y mucho mÃƒÂ¡s ÃƒÂ¡cida del clÃƒÂ¡sico de Frank Capra Ã‚?QuÃƒÂ© bello es vivirÃ‚?, en la que un ÃƒÂ¡ngel tambiÃƒÂ©n redimÃƒÂ­a al personaje interpretado por James Stewart. En esta ocasiÃƒÂ³n, el ÃƒÂ¡ngel Earl y la policÃƒÂ­a Grace van a compartir momentos singulares, muy poco convencionales. Su relaciÃƒÂ³n no va a ser nada fÃƒÂ¡cil y Earl deberÃƒÂ¡ emplearse mucho mÃƒÂ¡s que en cualquier otra misiÃƒÂ³n redentora. La serie le ha valido en su primer aÃƒÂ±o a Holly Hunter sendas nominaciones a Mejor Actriz en una serie dramÃƒÂ¡tica en los Globos de Oro y en los Screen Actors Guide Awards. AdemÃƒÂ¡s, ha obtenido el respaldo de la crÃƒÂ­tica, que ha alabado no sÃƒÂ³lo la actuaciÃƒÂ³n de su protagonista, sino la originalidad del argumento y la frescura de los guiones, y se ha convertido en la mÃƒÂ¡s vista del aÃƒÂ±o en la televisiÃƒÂ³n por cable en Estados Unidos con una audiencia de casi siete millones de espectadores. Junto a Hunter y Leon Rippy, Ã‚?Salvando a GraceÃ‚? se completa con un reparto de actores muy solventes, entre los que cabe citar a Kenneth Johnson (Ã‚?The ShieldÃ‚?), que da vida a Ham Dewey, el compaÃƒÂ±ero casado de Grace, con el que mantiene una relaciÃƒÂ³n; Gregory Norman Cruz (Ã‚?Mentes criminalesÃ‚?), como el detective Bobby Stillwater; Bailey Chase (Ã‚?Las VegasÃ‚?), en la piel del agente Butch Ada; Bokeem Woodbine (Ã‚?Equipo mortalÃ‚?), como un preso del corredor de la muerte relacionado con Grace; y Laura San Giacomo (Ã‚?Pretty WomanÃ‚?) en el papel de Rhetta RodrÃƒÂ­guez, la mejor amiga de Grace, una abogada criminalista que, pese a sus fuertes creencias religiosas, es la ÃƒÂºnica que no juzga su comportamiento.\n","torrent":{"xt":"urn:btih:c2739fef9e8dc666479b065e219de4a3ebe74583","amp;dn":"Salvando+a+Grace+1x01","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2739fef9e8dc666479b065e219de4a3ebe74583","infoHashBuffer":{"type":"Buffer","data":[194,115,159,239,158,141,198,102,71,155,6,94,33,157,228,163,235,231,69,131]},"announce":[],"urlList":[]}}