{"title":"Einer flog ÃƒÂ¼ber das Kuckucksnest (1975) [DivX]","uid":4226964,"size":737845248,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c2975b6ae7b0756715967341f0502fd754fa0c03&amp;dn=Einer+flog+%C3%83%C2%BCber+das+Kuckucksnest+%281975%29+%5BDivX%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"wirefall","files":1,"time":1212875561,"description":"amazon.de:\nMilos Formans Werk nach Ken Keseys gleichnamigem aufwÃƒÂ¼hlenden Roman ist einer der SchlÃƒÂ¼sselfilme der 70er Jahre. Damals wurden so aufregende, bahnbrechende und persÃƒÂ¶nliche Filme noch in Hollywood produziert. Einer flog ÃƒÂ¼ber das Kuckucksnest betont den humanistischen Ansatz des Buches, und man hat den Eindruck, dass der brillante Jack Nicholson (Shining, Besser gehtÃ‚Â´s nicht) geradezu fÃƒÂ¼r die Rolle des Randle Patrick McMurphy geboren wurde. McMurphy ist rebellischer Insasse einer geschlossenen psychiatrischen Klinik, der den Kampf aufnimmt gegen die AutoritÃƒÂ¤t und die kalte AttitÃƒÂ¼de institutioneller Ãƒ?berlegenheit, personifiziert durch Schwester Ratched (Louise Fletcher). Die klassische Anti-Establishment-Geschichte eines Mannes, der seine IndividualitÃƒÂ¤t gegen ein repressives, konformistisches System behaupten will, funktioniert hier auf allen Ebenen. Forman bevÃƒÂ¶lkert seinen Film mit einprÃƒÂ¤gsamen, exzentrischen Gesichtern und bekommt eine so detailfreudige und spontane Arbeit von seinem Ensemble geliefert, dass der Film manchmal wie eine Dokumentation anmutet.\n\nEiner flog ÃƒÂ¼ber das Kuckucksnest hat von seiner AktualitÃƒÂ¤t bis heute nicht einen Deut eingebÃƒÂ¼Ãƒ?t, wie viele andere Filme aus den 70er Jahren, die sich mit der damaligen Jugendkultur befassten. Das liegt daran, dass es Forman gelingt, einige GrundcharakterzÃƒÂ¼ge der menschlichen Natur einzufangen, die universell und zeitlos GÃƒÂ¼ltigkeit haben: Ausgelassenheit, Mut, Inspiration, Stolz und HartnÃƒÂ¤ckigkeit. Bei den Academy Awards 1976 rÃƒÂ¤umte der Film dann auch zu Recht krÃƒÂ¤ftig ab. Zum ersten Mal seit 1931, als Frank Capras It Happened One Night diese Ehre zuteil wurde, erhielt ein Film in allen wichtigen Kategorien (Film, Regie, Hauptdarsteller, Hauptdarstellerin, Drehbuch) den Oscar. --Jim Emerson \n\nOscar: Bester Film, Beste Regie, Bestes Drehbuch nach literarischer Vorlage, Bester Hauptdarsteller (Jack Nicholson), Beste Hauptdarstellerin (Louise Fletcher).\n\n98% @ rottentomatoes.com","torrent":{"xt":"urn:btih:c2975b6ae7b0756715967341f0502fd754fa0c03","amp;dn":"Einer+flog+%C3%83%C2%BCber+das+Kuckucksnest+%281975%29+%5BDivX%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c2975b6ae7b0756715967341f0502fd754fa0c03","infoHashBuffer":{"type":"Buffer","data":[194,151,91,106,231,176,117,103,21,150,115,65,240,80,47,215,84,250,12,3]},"announce":[],"urlList":[]}}