{"title":"HISTORY OF POP AND ROCK MUSIC - part 598","uid":12760520,"size":547097420,"categoryP":"video","categoryS":"music_videos","magnet":"?xt=urn:btih:c3369f1ee4b8897a8590411e1318fc4af89bd5fd&amp;dn=HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+598&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pupovaczlatko","files":9,"time":1447524708,"description":"\n\r\n                         PART  598\r\n\r\n\r\n\r\n                SCOTT McKENZIE - &quot;San Francisco (1967) \r\n                SCOTT McKENZIE  -   Like An Old Time Movie  (1967) \r\n                MOODY BLUES   -    Legend Of A Mind  (1968) \r\n\r\n\r\n                 &quot;San Francisco (Be Sure to Wear Flowers in Your Hair)&quot; is an American pop music song, written by John Phillips of The Mamas &amp; the Papas, and sung by Scott McKenzie. The song was produced and released in May 1967 by Phillips and Lou Adler, who used it to promote their Monterey International Pop Music Festival held in June of that year. John Phillips played guitar on the recording and session musician Gary L. Coleman played orchestra bells and chimes. The bass line of the song was supplied by session musician Joe Osborn. Hal Blaine played drums.  McKenzie's version of the song has been called &quot;the unofficial anthem of the counterculture movement of the 1960s.&quot;\r\n\r\n               &quot;Like An Old Time Movie&quot;   is a  song performed by Scott McKenzie and appears on the album The Voice Of Scott McKenzie (1967).   It was his a minor hit (number 27 in Canada).  He was best known for his 1967 hit single and generational anthem, &quot;San Francisco (Be Sure to Wear Flowers in Your Hair)&quot;\r\n\r\n                &quot;Legend of a Mind&quot; is a song by The Moody Blues, and was written by the band's flautist Ray Thomas, who provides the lead vocals. &quot;Legend of a Mind&quot; was recorded in January 1968 and was first released on the Moody Blues' album In Search of the Lost Chord. It was the first song recorded for the album.\r\nThe original promotional black-and-white film for the song was filmed on location at Groot-Bijgaarden Castle near Brussels in Belgium.   &quot;Legend of a Mind&quot; is one of the Moody Blues' longer songs, lasting about six and a half minutes (although it is not quite as long as &quot;Nights in White Satin,&quot; which is seven and a half minutes). The song also features a flute solo by Ray Thomas, lasting about two minutes in the middle.\r\n\r\n                  The song's lyrics are about 1960s LSD icon Timothy Leary. Leary was an advocate for the use of LSD, enjoying its spiritual benefits, with one of his catchphrases being &quot;Turn on, tune in, drop out.&quot;\r\nThe song is perhaps best known for its opening lines: &quot;Timothy Leary's dead / No, n-n-no he's outside looking in&quot;, which allude to Leary's use of eastern mysticism (most notably the Tibetan Book of the Dead) to frame the psychedelic experience.\r\n\r\n\r\nThe song's lyrics describe both Leary and the effects of LSD, such as:\r\n\r\n\r\nHe'll fly his astral plane\r\nTakes you trips around the bay\r\nBrings you back the same day\r\n\r\nas well as:\r\n\r\nHe'll take you up,\r\nHe'll bring you down.\r\nHe'll plant your feet back firmly on the ground.\r\nHe flies so high,\r\nHe swoops so low.\r\nHe knows exactly which way he's gonna go","torrent":{"xt":"urn:btih:c3369f1ee4b8897a8590411e1318fc4af89bd5fd","amp;dn":"HISTORY+OF+POP+AND+ROCK+MUSIC+-+part+598","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3369f1ee4b8897a8590411e1318fc4af89bd5fd","infoHashBuffer":{"type":"Buffer","data":[195,54,159,30,228,184,137,122,133,144,65,30,19,24,252,74,248,155,213,253]},"announce":[],"urlList":[]}}