{"title":"Raging Speedhorn - We Will Be Dead Tomorrow","uid":4183573,"size":77958110,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c3f3b4886515a7f046ea5bd89ef49f1db91e8c43&amp;dn=Raging+Speedhorn+-+We+Will+Be+Dead+Tomorrow&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"billy_stretcher","files":11,"time":1210540100,"description":"Raging Speedhorn\nWe Will Be Dead Tomorrow\nMetal/Sludgecore\n2002\n192Kbps\n\n1.The Hate Song\n2.Scrapin&amp;#039; The Resin\n3.Me And You Man\n4.Scaramanga\n5.Chronic Youth\n6.Iron Cobra\n7.Heartbreaker\n8.Fuck The Voodooman\n9.Spitting Blood\n10.Welcome To Shitsville\n11.Ride With The Devil\n\n&amp;#039;We Will Be Dead Tomorrow&amp;#039; is the ear-shattering new album from Corby hardcore metallers Raging Speedhorn. A pummelling mix of hardcore punk and extreme heavy metal, it spits out a lethal amalgam of blazing guitars and aggressive dual in-your-face vocals, mixed with elements of thrash metal, speed metal and stoner-rock\nFollowing the success of their 2000 self-titled debut, Raging Speedhorn&amp;#039;s second album &amp;#039;We Will Be Dead Tomorrow&amp;#039; continues along the same lines, combining vicious hardcore with liberal doses of thrash metal and classic rock riffs.\n\nTrue to past form, the second album from Raging Speedhorn is about as subtle as a fist in the face. On We Will Be Dead Tomorrow, these six Corby metalheads take the doom-laden grind blueprint of Black Sabbath, pump it full of steroids and strong lager, and--with the help of Biohazard men Billy Graziadei and Danny Schuler at the mixing desk--psyche it up for a punishing eleven tracks of terror-metal mayhem. Kicking off with &quot;The Hate Song&quot;, it&amp;#039;s immediately obvious that since their eponymous debut in 2000, they&amp;#039;ve toned up the intensity: now, the vocals are totally indecipherable, a cacophony of phlegmatic shrieks and hoarse screams. But Speedhorn&amp;#039;s recognisable motifs remain: the cyclical, headbang-friendly riffs; the call-and-response assault exercised by vocalists Frank Regan and John Loughlin; and the sturdy, robust formula that borrows from thrash metal, speed metal and stoner-rock forms before boiling them down into one syrupy, acrid brew. Highlights include tokers&amp;#039; anthem &quot;Scrapin&amp;#039; the Resin&quot;, the fierce &quot;Fuck the Voodooman&quot; and the Motorhead-tinged &quot;Chronic Youth&quot;. And happily, there&amp;#039;s not a pop single among them: this dirty, depraved and quite astonishing album offers no mercy and no restraint. \n\n\n&amp;#039;Raging Speedhorn are indeed the unavoidable future of British heavy music. Fantastic&amp;#039; 10/10 - Metal Hammer\n\n&amp;#039;Raging Speedhorn are more vital to ensuring real bands exist and inspire others to keep it real than ever before. More groove orientated, thicker and showing more clarity, &amp;#039;We Will Be Dead Tomorrow&amp;#039; is a defiant two finger salute to the world and it&amp;#039;s f*cking immense! Don&amp;#039;t miss out&amp;#039; - Rock Sound\n\n&amp;#039;...without question, one of the best metal albums of 2002. You know you want it&amp;#039; - Kerrang!\n\n&amp;#039;Desparate, pointlessly stoopid, and at times deranged, the Speedhorn&amp;#039;s second album is a wired triumphant quest for basic rock &amp;#039;n&amp;#039; roll thrills by a band who clearly take their fun seriously&amp;#039; - NME\n\nEnjoy! :)","torrent":{"xt":"urn:btih:c3f3b4886515a7f046ea5bd89ef49f1db91e8c43","amp;dn":"Raging+Speedhorn+-+We+Will+Be+Dead+Tomorrow","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c3f3b4886515a7f046ea5bd89ef49f1db91e8c43","infoHashBuffer":{"type":"Buffer","data":[195,243,180,136,101,21,167,240,70,234,91,216,158,244,159,29,185,30,140,67]},"announce":[],"urlList":[]}}