{"title":"MyBigFatFontCollection","uid":4223287,"size":411943641,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c4983a8af061192245e49b05b800d97590c87a7a&amp;dn=MyBigFatFontCollection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"heavypops","files":1,"time":1212697121,"description":"OK, let&amp;#039;s try this again, hopefully I&amp;#039;m a successful seeder...\n\nWelcome to my Big Fat Font Collection!\n\nFirst of all I&amp;#039;d like to say I use a mac and don&amp;#039;t use any virus/malware/spyware etc. protection (I&amp;#039;ve been using mac for about 25 years and never had a virus once, knock on wood...old school), so if you use windows you might want to scan these. If someone does scan and find such nasty things please post alerts so others on windows will know.\n\nSecond of all this is a huge variety of fonts, collected and created from various sources...all of which total 608 MB.\n\nThe kinds: mostly TTF but also OTF, FFIL, LWFN, PFM, PFB and who knows what else! Some are windows fonts that work on my mac perfectly.\n\nIt&amp;#039;s well over 2000 fonts with the Adobe collection included (some of the Adobe fonts are the ones that come with installation but I don&amp;#039;t know which are which anymore so I included them all).\n\nI put a READ ME file in the folder which is pretty self explanatory. I zipped it with Stuffit, please let me know if anyone has trouble opening it.\n\nI really wanted to give back especially to all that upload and share:\nI couldn&amp;#039;t think of what else to share but if anyone has anything they seek let me know, this is just something I really enjoy and if you do graphics or just want to have a nice font collection this is a great thing!\n\nA note to any trolls:\nAlerts of spyware etc. are helpful and great if not essential, but negative comments are poo. If you don&amp;#039;t like the free stuff you get here or anywhere else, go buy it and quit ur complainin&amp;#039;!\n\nLet me know if you like.\n\nA big thanks to all that share!!!\t","torrent":{"xt":"urn:btih:c4983a8af061192245e49b05b800d97590c87a7a","amp;dn":"MyBigFatFontCollection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4983a8af061192245e49b05b800d97590c87a7a","infoHashBuffer":{"type":"Buffer","data":[196,152,58,138,240,97,25,34,69,228,155,5,184,0,217,117,144,200,122,122]},"announce":[],"urlList":[]}}