{"title":"The Pallisers - Volume II-5 and 6 - BBC 1970","uid":4088383,"size":1609092168,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c4d0b0a490bf3665286dbf2e1dece0a9bc4a821e&amp;dn=The+Pallisers+-+Volume+II-5+and+6+-+BBC+1970&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anca13","files":10,"time":1205943039,"description":"Reviewer:\tJay Dickson (Portland, OR)  \n\nThe second set of DVDs in the BBC 26-part series &quot;The Pallisers&quot; from the mid 1970s is every bit as good as the first, and features at its core superb performances by Barbara Murray as the sharp and cagey Madame Max Goesler, Philip Latham as the stodgy but goodhearted Plantagent Palliser, and the charming Susan Hampshire as his impish wife, Lady Glencora. These DVDs cover the actions of Trollope&amp;#039;s key novels in the Palliser sequence, PHINEAS FINN and THE EUSTACE DIAMONDS, which detail the doings among the highest political and moneyed set in the United Kingdom of the 1860s. They bring in several new characters, including the tiny, scheming, melodramatic Lizzie Eustace (Sarah Badel), the bumptious Adelaide Palliser (Jo Kendall), and the lazy and entitled dandy Gerald Maule (Jeremy Clyde, late of the British Invasion music duo Chad and Jeremy, in an absolutely first-rate performance). The casting is not everything it could be--John hallam is probably no one&amp;#039;s idea of the Byronic and dashing Lord Chiltern--, but for the most part the performances are terrific. Watch for Peter Sallis&amp;#039;s fine work as the pompous Mr. Bonteen in the last DVD in this set at one of Lady Glencora&amp;#039;s parties as she plies him with drink to start his tongue wagging so as to expose his conceit and arrogance to his fellow party members: it&amp;#039;s one of the best performances of a person getting drunker and drunker I&amp;#039;ve ever seen. The episodes involve murder, death, two diamond thefts, and incredible amounts of scheming and jockeying for position and power, but the pleasure of Trollope (which this series well captures) is his evocation of character and conscience. You feel like you know these people, even if they lived a century and a half earlier.\n","torrent":{"xt":"urn:btih:c4d0b0a490bf3665286dbf2e1dece0a9bc4a821e","amp;dn":"The+Pallisers+-+Volume+II-5+and+6+-+BBC+1970","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c4d0b0a490bf3665286dbf2e1dece0a9bc4a821e","infoHashBuffer":{"type":"Buffer","data":[196,208,176,164,144,191,54,101,40,109,191,46,29,236,224,169,188,74,130,30]},"announce":[],"urlList":[]}}