{"title":"iGlasses_v2.0.1","uid":4079433,"size":924678,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c512f9a1e9cd23f2bc54186d0e8740b1432b22a4&amp;dn=iGlasses_v2.0.1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"anoylla","files":1,"time":1205452935,"description":"DESCRIPTION\niGlasses... Get total control over your iSight or iMage video settings from within iChat AV, QuickTime Pro Player and 50 other programs such as Yahoo! Messenger, Skype and SightSpeed. Choose from easy built-in preset settings or fine tune settings manually. Enhance your picture! Cool night vision setting! Flip your image upside down or use a mirror image. Even rotate your image sideways. Using the Digital Zoom feature of iGlasses 2.0, users can virtually change their camera angle in order to center themselves in the video frame. iGlasses is now fully compatible with the Logitech QuickCam, Macally IceCam, iMage USB Webcam, or any camera that uses macam as a driver.\n\nWHAT\\&amp;#039;S NEW in Version 2.0.1:\nAdds support for iGlasses in Iris, SquidCam, and XMeeting.\nFixes a problem where iGlasses did not work in Photo Booth 2 on OS X 10.5 (Leopard).\nFixes a problem with DVDpedia, Gamepedia, CDpedia, and Bookpedia when using OS X 10.3.9.\nFixes a possible conflict with an old version of iChatUSBCam.\nFixes a problem where iGlasses would not load for some OS X 10.5 (Leopard) users.\nOther fixes and enhancements.\n\nREQUIREMENTS\nMac OS X 10.3.9 or later, iChat AV, iSight or other webcam\n\nSupported applications:\n\niChat AV -- iMovie 4.0 or higher -- iSpQ 6.3.1 or higher -- Yahoo! Messenger 2.5.3 or higher -- QuickTime Broadcaster -- EvoCam 3.5 Preview 1 or higher -- GCam 1.2 or higher -- iVisit -- vChat -- A web-based chat program within Safari -- iCamShare -- QuickTime 7 Pro Player -- ohphoneX -- ineen -- BTV -- BTV Pro -- SecuritySpy -- Apple Photo Booth -- WuffCam -- Blog.Mac -- iVeZeen -- iStopMotion -- MulleSight -- aMSN -- Mercury Messenger -- SightSpeed -- Skype 1.5 Beta Video Preview -- Gawker -- Journler -- PiXiMation -- FlipBook -- Comic Life -- Camfrog -- jmeeting -- Delicious Library -- WebcamTweaker -- CamSpinner -- Funny Photographer -- CamGrabber -- I Can Animate -- Freak Show -- SAFlashPlayer -- Periscope -- DVDpedia -- Bookpedia -- CDPedia -- Gamepedia -- KeyCamX -- CoverScout -- iSale -- Marratech -- FireFox -- iRecord -- Flash Player 9 -- CamCamX -- Video Viewer -- iMovie 8 -- SAM Animation\n\n***No need sn***","torrent":{"xt":"urn:btih:c512f9a1e9cd23f2bc54186d0e8740b1432b22a4","amp;dn":"iGlasses_v2.0.1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c512f9a1e9cd23f2bc54186d0e8740b1432b22a4","infoHashBuffer":{"type":"Buffer","data":[197,18,249,161,233,205,35,242,188,84,24,109,14,135,64,177,67,43,34,164]},"announce":[],"urlList":[]}}