{"title":"GameGrab v2.2 - (Auto Xbox 360 Game Downloader)","uid":4194521,"size":13920019,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:c5c5d51f4f050d3c20799831ef36599e561a4554&amp;dn=GameGrab+v2.2+-+%28Auto+Xbox+360+Game+Downloader%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gamerack1","files":1,"time":1211142588,"description":"GameGrab is a program that lists links for Xbox 360 game ISO&amp;#039;s.  From the game info page, you can grab the download links for the game itself, the stealth security sector patches, disk labels, jacket covers and more, all from a single page.\n\nMain Features\n\n* All links updated live through the Internet for the freshest content possible (no more dead links!).\n\n* Lists games in either a &quot;virtual game rack&quot; format, or a quick text grid format sorted alphabetically.\n\n* Game info page gives you access to game iso, stealth patches, cover and label links.\n\n* Separate sections for PAL and NTSC version links.\n    \n* Powerful search functions lets you find the game you are looking for instantly.\n    \n* Instant update feature informs you when a new version is released and prompts you for an update.\n    \n* Much care has been taken to ensure privacy and anonymity.  Database connection can be changed on the fly. \n\n* Copies all download links with a single click, which you can import to your favorite download manager.\n \n\nThe best thing about GameGrab is that all content is updated live through your internet connection, ensuring the newest content and games as they are released, and fresh links that arn&amp;#039;t dead.  Download that newly released game with a few clicks.  Of course, all game ISO&amp;#039;s are already pre-patched with their appropriate stealth files, but jsut in case you want the stealth patches separately, you can grab those also with a single mouse click. \n\nIncludes all game iso links from Rapidshare, Megashares and others!  Snag all the newest Xbox360 games, like Grand Theft Auto 4 (IV), Halo 3, Call of Duty 4 and all your other favorites in minutes with this easy-to-use daily live updated software!\t\t","torrent":{"xt":"urn:btih:c5c5d51f4f050d3c20799831ef36599e561a4554","amp;dn":"GameGrab+v2.2+-+%28Auto+Xbox+360+Game+Downloader%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c5c5d51f4f050d3c20799831ef36599e561a4554","infoHashBuffer":{"type":"Buffer","data":[197,197,213,31,79,5,13,60,32,121,152,49,239,54,89,158,86,26,69,84]},"announce":[],"urlList":[]}}