{"title":"Richard Clarke - Against All Enemies - Inside America's War o","uid":4222776,"size":135446528,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:c689230e2836657ee2d87726e5774a4e386b2dfe&amp;dn=Richard+Clarke+-+Against+All+Enemies+-+Inside+America%5C%27s+War+o&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"rambam1776","files":107,"time":1212677659,"description":"Against All Enemies - Inside America&amp;#039;s War on Terror\nby Richard Clarke \n &lt;a href=&quot;\nhttp://www.amazon.com/Against-All-Enemies-Inside-Americas/dp/B000WMJ6TC/ref=pd_bbs_2?ie=UTF8&amp;s=books&amp;qid=1212669902&amp;sr=8-2&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Against-All-Enemies-Inside-Americas/dp/B000WMJ6TC/ref=pd_bbs_2?ie=UTF8&amp;s=books&amp;qid=1212669902&amp;sr=8-2&lt;/a&gt;\n\nEditorial Reviews\nAmazon.com\nFew political memoirs have made such a dramatic entrance as that by Richard A. Clarke. During the week of the initial publication of Against All Enemies, Clarke was featured on 60 Minutes, testified before the 9/11 commission, and touched off a raging controversy over how the presidential administration handled the threat of terrorism and the post-9/11 geopolitical landscape. Clarke, a veteran Washington insider who had advised presidents Reagan, George H.W. Bush, Clinton, and George W. Bush, dissects each man&amp;#039;s approach to terrorism but levels the harshest criticism at the latter Bush and his advisors who, Clarke asserts, failed to take terrorism and Al-Qaeda seriously. Clarke details how, in light of mounting intelligence of the danger Al-Qaeda presented, his urgent requests to move terrorism up the list of priorities in the early days of the administration were met with apathy and procrastination and how, after the attacks took place, Bush and key figures such as Donald Rumsfeld, Paul Wolfowitz, and Dick Cheney turned their attention almost immediately to Iraq, a nation not involved in the attacks. Against All Enemies takes the reader inside the Beltway beginning with the Reagan administration, who failed to retaliate against the 1982 Beirut bombings, fueling the perception around the world that the United States was vulnerable to such attacks. Terrorism becomes a growing but largely ignored threat under the first President Bush, whom Clarke cites for his failure to eliminate Saddam Hussein, thereby necessitating a continued American presence in Saudi Arabia that further inflamed anti-American sentiment. Clinton, according to Clarke, understood the gravity of the situation and became increasingly obsessed with stopping Al-Qaeda. He had developed workable plans but was hamstrung by political infighting and the sex scandal that led to his impeachment. But Bush and his advisers, Clarke says, didn&amp;#039;t get it before 9/11 and they didn&amp;#039;t get it after, taking a unilateral approach that seemed destined to lead to more attacks on Americans and American interests around the world. Clarke&amp;#039;s inside accounts of what happens in the corridors of power are fascinating and the book, written in a compelling, highly readable style, at times almost seems like a fiction thriller. But the threat of terrorism and the consequences of Bush&amp;#039;s approach to it feel very sobering and very real. --John Moe --This text refers to an out of print or unavailable edition of this title. \n\nFrom Publishers Weekly\nA few bars of heavy, ominous-sounding orchestral music set the tone for this incendiary account of the events that occurred inside the White House on 9/11 and the months and years prior to it. Former counterterrorism director Clarke starts out by describing how he took charge in the situation room on the day of the attacks and facilitated communication among the White House, the FBI and the FAA. The level of detail Clarke includes is impressive. Not only does he paint a vivid portrait of the White House in crisis mode, but he even recalls a number of conversations (including one in which Bush, after learning of al Qaeda&amp;#039;s involvement, purportedly tells Clarke, &quot;See if Saddam did this. See if he&amp;#039;s linked in any way&quot;). Whether one chooses to believe Clarke&amp;#039;s version of events or not, this first chapter is riveting, and Clarke delivers it like a pro. With his deep tenor and weighty pauses, Clarke never lets listeners forget the gravity of the situation, but he isn&amp;#039;t above making an attempt at the various accents and inflections of the major players. His frustration over how the current administration has responded to 9/11 and how he believes the FBI and CIA failed to act leaks through at times, but by the end of this compelling audiobook, many listeners may share it. \nCopyright Â© Reed Business Information, a division of Reed Elsevier Inc. All rights reserved. --This text refers to an out of print or unavailable edition of this title. \n\n See all Editorial Reviews \n________________________________________\nProduct Details\n?\tPaperback: 352 pages \n?\tPublisher: Free Press (September 14, 2004) \n?\tLanguage: English \n?\tISBN-10: 0743260457 \n\n","torrent":{"xt":"urn:btih:c689230e2836657ee2d87726e5774a4e386b2dfe","amp;dn":"Richard+Clarke+-+Against+All+Enemies+-+Inside+America%5C%27s+War+o","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c689230e2836657ee2d87726e5774a4e386b2dfe","infoHashBuffer":{"type":"Buffer","data":[198,137,35,14,40,54,101,126,226,216,119,38,229,119,74,78,56,107,45,254]},"announce":[],"urlList":[]}}