{"title":"Cloverfield Full DVD","uid":4184077,"size":4829055023,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:c7397821e05361e69e522d8651e2175e58c82def&amp;dn=Cloverfield+Full+DVD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"meh_64_12","files":2,"time":1210565305,"description":"&quot;Cloverfield&quot; is a 2008 monster/horror film directed by Matt Reeves, produced by J. J. Abrams and written by Drew Goddard. Before the film&amp;#039;s release Paramount Pictures carried out a viral marketing campaign to promote the film. The campaign included viral tie-ins similar to Lost Experience. The film follows five young New Yorkers who throw their friend a going-away party on the same night that a gigantic monster attacks the city. First publicized within a teaser trailer in screenings of Transformers, the film was released on January 17 in New Zealand and Australia, on January 18 in North America, on January 24 in South Korea and on February 1 in Ireland, in the UK and in Italy. In Japan, the film was released on April 5. Prior to its release, the trailers for the film did not list the title ? merely its release date, &quot;01Â·18Â·08&quot; ? leaving the name of the film unknown until only weeks before its official release.\n\nThe film is presented as a video file recovered from a digital hand-held camera by the United States Department of Defense. At the start of the film, it is stated the camera was &quot;found in US-447, area formerly known as Central Park&quot;. The main record of events is interspersed with footage shot under the context of a personal hand-held camera used by various characters prior to the crisis.\n\nThis is the full DVD in ISO form. Mount using something like Daemon tools or burn to DVD.","torrent":{"xt":"urn:btih:c7397821e05361e69e522d8651e2175e58c82def","amp;dn":"Cloverfield+Full+DVD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7397821e05361e69e522d8651e2175e58c82def","infoHashBuffer":{"type":"Buffer","data":[199,57,120,33,224,83,97,230,158,82,45,134,81,226,23,94,88,200,45,239]},"announce":[],"urlList":[]}}