{"title":"10000 BC divx dvd quality","uid":4175656,"size":592933092,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c7c17ad85bb66590aada13449b97a5ffa202a79a&amp;dn=10000+BC+divx+dvd+quality&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bureself","files":1,"time":1210108920,"description":"Director Roland Emmerich weaves myth and legend together in this epic love story. As the Ice Age is ending, the Yagahl people are struggling to survive. When Evolet (Camilla Belle), a young, blue-eyed girl is found and brought back to the tribe, their esteemed elder, Old Mother (Mona Hammond), realizes that the child is fulfilling a prophecy and will be instrumental in saving the Yagahl. D&amp;#039;Leh (Steven Strait) swore his heart to Evolet when she first came to the tribe, and after many years claims her as his own. But no sooner are the young lovers together, than they are torn apart by mysterious men arriving on horseback who kidnap many of the Yagahl, including Evolet, for slave trade. Determined to save his love and their people, D&amp;#039;Leh embarks on a rescue mission with his father figure Tic&amp;#039;Tic (Cliff Curtis). Along the way, they encounter different lands, new people, and strange creatures including giant birds akin to a killer ostrich. Mixing history and fantasy, there is little (if anything) that is historically accurate in this film. Rather, Emmerich weaves together myths and legends to unite people from different lands into one force and bring down a great evil that threatens all of their civilizations. Emmerich also tackles multiple universal themes: the redemption of an outsider, the coming of age of a boy who becomes a leader, the importance of loyalty, and the discovery and understanding of new cultures. Ultimately, he tackles the age-old saga of star-crossed lovers and the power of love. Omar Sharif narrates this love story that spans mountains, valleys, deserts, and rivers.","torrent":{"xt":"urn:btih:c7c17ad85bb66590aada13449b97a5ffa202a79a","amp;dn":"10000+BC+divx+dvd+quality","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c7c17ad85bb66590aada13449b97a5ffa202a79a","infoHashBuffer":{"type":"Buffer","data":[199,193,122,216,91,182,101,144,170,218,19,68,155,151,165,255,162,2,167,154]},"announce":[],"urlList":[]}}