{"title":"The Cardigans - Long Gone Before Daylight [2003][FLAC]","uid":4082457,"size":336523339,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:c849c77e69fe4f7b5a4625c472f451d16c07541f&amp;dn=The+Cardigans+-+Long+Gone+Before+Daylight+%5B2003%5D%5BFLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"z247","files":13,"time":1205624585,"description":"Long Gone Before Daylight marks a shift in theme for the Cardigans. Their last album, 1998&amp;#039;s Gran Turismo, was a masterpiece. With Peter Svensson&amp;#039;s quirky, driving, ultra-modern pop backing Nina Persson&amp;#039;s icy dissections of doomed relationships, it was a Love Album informed more by Bret Easton Ellis than any high romance. So catchy, so cool, and so incredibly bleak--exceptional, intelligent pop in the tradition of Soft Cell and ABC. Long Gone Before Daylight, then, comes as something of a shock when the opening &quot;Communication&quot; and &quot;You&amp;#039;re the Storm&quot;--both lush and beautiful pop--find Persson struggling for love then, come the Doors-like &quot;And Then You Kissed Me,&quot; actually finding it. Real love, too--not the fascinatingly twisted variety of before. It&amp;#039;s a terrible shame, for love reduces the Cardigans to the level of other musicians. But then, unpredictable devils, they hit you with &quot;Couldn&amp;#039;t Care Less,&quot; as Persson loses it all again, in the following &quot;Please Sister&quot; begging for advice, succor, anything. And now you realize; it&amp;#039;s a pop-rock opera, the tale of one heart&amp;#039;s tortuous and tortured journey through the mill. And it&amp;#039;s superb. Persson, the finest pop lyricist working today, is on peak form while the band&amp;#039;s back-to-roots grand piano and grander acoustic guitars provide an appropriately magnificent backing.\n\n\n\nThe Cardigans - Long Gone Before Daylight\n\n1. Communication \t\n2. You&amp;#039;re The storm \t\n3. A Good Horse \t\n4. And Then You Kissed Me \t\t\n5. Couldn&amp;#039;t Care Less \t\n6. Please Sister \t\n7. For What It&amp;#039;s Worth \t\n8. Lead Me Into The Night \t\n9. Live and Learn \t\n10. Feathers And Down \t\n11. 03.45: No Sleep\n\nThere are different versions of this album. I am uploading the shortest one, the only available in Poland. I a am attaching the screenshot of the back of the cover (with the labels of authenticity, the hologram is in the fron cover :-)). There are versions which containt one or three extra tracks, unfortunately not available in my country.\n\n\nEnjoy!","torrent":{"xt":"urn:btih:c849c77e69fe4f7b5a4625c472f451d16c07541f","amp;dn":"The+Cardigans+-+Long+Gone+Before+Daylight+%5B2003%5D%5BFLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c849c77e69fe4f7b5a4625c472f451d16c07541f","infoHashBuffer":{"type":"Buffer","data":[200,73,199,126,105,254,79,123,90,70,37,196,114,244,81,209,108,7,84,31]},"announce":[],"urlList":[]}}