{"title":"Polly Bergen - All Alone By The Telephone","uid":4171344,"size":63985940,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c852d4894113c507c2740ed51ebcecbc18b6e87d&amp;dn=Polly+Bergen+-+All+Alone+By+The+Telephone&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"glum22","files":15,"time":1209890365,"description":"Polly Bergen was born Nellie Pauline Burgin on July 14, 1930 in Knoxville, Tennessee. She was the oldest daughter of William Hugh, and Lucy (Lawhorn) Burgin. Polly&amp;#039;s grandfather, Daniel Patton Burgin (#152641D) and my grandfather, Joseph Hatten Burgin (#1526419) were brothers. \n\nThe beautiful and versatile Miss Bergen was a radio performer at age 14. She did summer stock and made club appearances en route to Hollywood in 1949. During her first months in Tinseltown, Bergen married actor Jerome Courtland, a marriage that was virtually over before it began.\n\nPolly did not change her name immediately however. In the 1949 movie, Across the Rio Grande, the credits listed her: Polly Burgin as Cantina singer. It wasn&amp;#039;t until her first movie with Dean Martin and Jerry Lewis, At War with the Army (1950) that she changed the spelling to Bergen. \n\nShe made two more movies with Martin and Lewis, That&amp;#039;s My Boy (1951) and The Stooge (1953). When Hal Wallis failed to notice her contract with Paramount had expired, she signed with MGM. Tired of the lackluster movie parts offered by MGM, Bergen walked out of a very lucrative contract in 1953 and headed for New York.\n\nShe later divorced Courtland and married Freddie Fields in 1955, a union that lasted nearly 20 years producing two adopted children, Pamela Kerry [P.K.] and Peter. Bergen has a stepdaughter Kathy via her marriage to Fields. She also married and divorced Jeffrey Endervelt in the 1980s.\n\nWhile headlining in the Broadway revue John Murray Anderson&amp;#039;s Almanac, she strained her voice and was forced to undergo a painful throat operation. Another serious career set-back occurred in 1959 when, while starring in the musical &quot;First Impressions&quot;, she almost died during a difficult pregnancy. \n\nGamely surviving these and other personal travails, Bergen rose to stardom via her Broadway stage performance, her one-woman cabaret act, and her many TV appearances. She won an Emmy in 1957 for her searing portrayal of Helen Morgan, (The Helen Morgan Story) the torch singer who died an alcoholic in her early 40s. In 1957, NBC also gave Polly her own primetime show, The Polly Bergen Show (a musical variety) in which she starred as Hostess (1957-1958).\n\nIn 1962, she gave films a second chance when she played a North Carolina housewife threatened with rape by rampaging ex-con Robert Mitchum in Cape Fear (over 20 years later, she and Mitchum played husband and wife in the popular TV miniseries The Winds of War and War and Remembrance).\n\nHer fantastic portrayal of a mental patient in The Caretakers (1963) was quite an shock for those only familiar with Bergen through her appearances on TV&amp;#039;s To Tell the Truth. Less successful was the movie Kisses for My President (1964), in which Bergen starred as the first female Chief Exec. \n\nIt is interesting to note that, in her Who&amp;#039;s Who entry, Bergen lists herself as a business executive first, an actress second. There is certainly plenty of justification for this; over the last 40 years, she has maintained such successful business ventures as Polly Bergen Cosmetics, Polly Bergen Jewelry, and Polly Bergen Shoes; she has also been active as part-owner of and pitch person for Oil-of-the-Turtle cosmetics.\n\nEqually busy in nonprofit organizations, she has served with such concerns as the National Business Council and Freedom of Choice. Scarcely a year goes by without Bergen receiving an award or some honorarium from a professional, charitable, political or civic organization. As if all this wasn&amp;#039;t activity enough, Polly Bergen is also the author of three books: Fashion and Charm (1960), Polly&amp;#039;s Principles (1974), and I&amp;#039;d Love to, but What&amp;#039;ll I Wear? (1977). \n\n\nPolly Bergen - All Alone By The Telephone\n=========================================\n\n01 - All Alone\n02 - Something Wonderful\n03 - Glad To Be Unhappy\n04 - Too Late Now\n05 - He Didn&amp;#039;t Call\n06 - Spring Is Here\n07 - By Myself\n08 - When The Wind Was Green\n09 - It&amp;#039;s Easy To Remember\n10 - Not Like Me\n11 - I&amp;#039;m Always Chasing Rainbows\n12 - I&amp;#039;m Glad There Is You\n","torrent":{"xt":"urn:btih:c852d4894113c507c2740ed51ebcecbc18b6e87d","amp;dn":"Polly+Bergen+-+All+Alone+By+The+Telephone","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c852d4894113c507c2740ed51ebcecbc18b6e87d","infoHashBuffer":{"type":"Buffer","data":[200,82,212,137,65,19,197,7,194,116,14,213,30,188,236,188,24,182,232,125]},"announce":[],"urlList":[]}}