{"title":"The Ant Bully Espanol-Spanish Only","uid":4177300,"size":666169250,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:c8c072ce5d6315c0d80c8354ed6ec81a2091f42f&amp;dn=The+Ant+Bully+Espanol-Spanish+Only&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"TheLabMan","files":1,"time":1210201125,"description":"This is the story of a ten-year-old boy named Lucas Nickle, who has just moved to a new neighborhood, has no friends, and is the target for the local bully and his gang. His parents are leaving for a honeymoon in Puerto Vallarta, so they are too busy to attend to his problems. His sister is distracted by her cellular phone, and the grandmother is obsessed with UFOs and aliens. Lucas is constantly being beat up by the obese yet intimidating neighborhood bully. Because he cannot fight back, he takes out his anger on an anthill in his front yard; He kicks it, stomps it, squirts it with his water gun, and floods it with a hose. This terrifies the ants, who call Lucas the Destroyer. One wizard ant, known as Zoc being a hopeful and adventurous type, is trying to solve this dilemma. He tries to devise a magic potion that he believes will solve all their problems. As the plan to shrink Lucas down to their size with a magic potion and forcing him to live like an ant within the colony--an astonishing new world opens up to him. Lucas learns, first-hand, the value of friendship and teamwork, ultimately leading the ants in an effort to save their colony from annihilation. And in the process, Lucas obtains the things he wants most: friends, companionship, acceptance and the courage to stand up for himself.  Written by Anthony Pereyra {&lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;e88091988d9a9b8786818bd1d9a89189808787c68b8785&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script cf-hash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;cf-hash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}}}catch(u){}}();/* ]]&gt; */&lt;/script&gt;}\n\nLucas Nickle&amp;#039;s the new kid in town and the local bully, Steve, makes sure he knows it. Lucas gets so fed up with being bullied, he takes out his frustration on ants in his backyard in hilarious ways, like squirting them with his garden hose or stamping on the ant hill. The ants are understandably fed up with this and Zoc the ant wizard uses a potion to shrink him down to ant size! Lucas is sentenced to hard labor in the ruins and learns to be more compassionate to ants. He becomes an ant friend, then must become an ant hero when Stan Beals, the local pest control guy, who&amp;#039;s an even bigger bully, comes to wipe out the entire colony. An &quot;ants vs pest control&quot; battle ensues and Zoc reluctantly accepts that Lucas may be the ants&amp;#039; only chance of survival. Written by movieguy3 ","torrent":{"xt":"urn:btih:c8c072ce5d6315c0d80c8354ed6ec81a2091f42f","amp;dn":"The+Ant+Bully+Espanol-Spanish+Only","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c8c072ce5d6315c0d80c8354ed6ec81a2091f42f","infoHashBuffer":{"type":"Buffer","data":[200,192,114,206,93,99,21,192,216,12,131,84,237,110,200,26,32,145,244,47]},"announce":[],"urlList":[]}}