{"title":"Ghost on your macbook pro V01 - DMK","uid":4130188,"size":13658213,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:c91ef45e9b6cdc70b2dd7ec1e60e4d15a0f7cc7c&amp;dn=Ghost+on+your+macbook+pro+V01+-+DMK&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ZeNiTH_NL","files":4,"time":1207999704,"description":"This tool is my first \\&quot;proof of concept\\&quot; for starting Symantec Ghost from a bootcd on a Macbook Pro 15Ãƒ?Ã‚Â´Ãƒ?Ã‚Â´ WITH network (TCP/IP) support!!!\n\nYou might wonder: Why the hell would I do that? I have great tools like superduper, time machine, bla bla..\n\n- you can image your 200mb partition that contains the firmware of your apple. Pretty cool huh :P\n- you are a IT-technician and you are used to working with ghost and dislike the completely different concept to backup apple computers. There is a big difference in the way \\&quot;old tools\\&quot; like ghost and PQDI etc work and how a modern backup program like ghost/superduper/...works.\n- because you can :)\n\n\nHow does it work?\n\nIf you have a FAT32 partition on your mac, you can boot from this cd straight to ghost and leave your image there (or restore it!). Piece of cake!! \n\nYou can burn this iso with any tool that can burn isoÃƒ?Ã‚Â´s. No special settings needed.\nThis bootcd has Ghost 11.0 on it ; this version recognises Hfs+ partitions. \n\nIf you donÃƒ?Ã‚Â´t have a FAT32 partition on your mac, you can ghostcast your partitions to another computer with Windows on it and leave your image there. If you donÃƒ?Ã‚Â´t know what this is, look it up first. It is not for noobs.\n\nTested on on my XP configuration like this:\n\n- Make sure your firewall is shut down (or make sure ghostsrv.exe can accept packages!)\n- Use a 192.168.x.x. network with subnet 255.255.255.0 (if you have a 10.10.x.x. network, it probably wonÃƒ?Ã‚Â´t work, change it into 192.168.x.x, that is less work than changing my iso! :P )\n- Plug a crosscable from your mac into your windows computer, or plug it in the same switch/router as the one you are using internet from. If you are using a crosscable or a second network card, give it IP: 192.168.1.5 and subnet 255.255.255.0 (no gateway, no DNS, nothing else..). The crosscable solution is faster.\n- start ghostsrv.exe on your windows machine and make sure it is ready to receive\n- boot your macbook pro 15Ãƒ?Ã‚Â´Ãƒ?Ã‚Â´ from the bootdisk and ghostcast!\n\nI added Ghostsrv.exe (ghostcast), because I expect people with macbooks pro DO NOT have FAT32 partitions)\nI added Ghostexp.exe so you can explore your ghostpartitions on your windows machine (you cannot read the HFS+ partition, this is your journaled partition on your mac)\n\nIt took me around 5 hours to make this bootcd, so if you complain, keep it gentle ;)\nI made this for myself, but I thought, why not share it? Maybe there are more people like me who would like to use Ghost.\n\nGreetz,\nDemesmaeker","torrent":{"xt":"urn:btih:c91ef45e9b6cdc70b2dd7ec1e60e4d15a0f7cc7c","amp;dn":"Ghost+on+your+macbook+pro+V01+-+DMK","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c91ef45e9b6cdc70b2dd7ec1e60e4d15a0f7cc7c","infoHashBuffer":{"type":"Buffer","data":[201,30,244,94,155,108,220,112,178,221,126,193,230,14,77,21,160,247,204,124]},"announce":[],"urlList":[]}}