{"title":"A - Teen Dance Ordinance","uid":4207878,"size":69133622,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:c925c89f62d4cc2e82bd5bcab09087fbf8feacad&amp;dn=A+-+Teen+Dance+Ordinance&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"billy_stretcher","files":15,"time":1211904464,"description":"A\nTeen Dance Ordinance\nAlt.Rock/Britrock\n2005\n192Kbps\n\n1.Rush Song  \n2.Better Off With Him  \n3.The Art Of Making Sense  \n4.Someone Else  \n5.Die Tonight  \n6.2nd Coming  \n7.Wake Up  \n8.Black Hole  \n9.Hey  \n10.Worst Thing That Can Happen  \n11.Afterburner  \n12.Wisdom  \n\nFront, Back And CD Covers Included.\n\n\nTeen Dance Ordinance is the fourth album by the Alternative Rock group A. It was released on June 25, 2005 in the United Kingdom and later in the United States. The title refers to a law passed in 1985 by Seattle City Council and repealed in 2002 which prohibited minors and adults from attending the same dance clubs. It featured a more straight-rock sound and displayed an almost complete absence of the keyboards and sampling that marked the early sound of the band.\n\nOn their fourth album, Teen Dance Ordinance, A have undergone yet another transmogrification, mutating from the Sting that it&amp;#039;s alright to mosh to into a thrashy, hard-rock band of furious energy and impressive capability. Kicking off with the explosive &quot;Rush Song&quot; which sees frontman Jason Perry shrieking about &quot;shitting bricks&quot; and sneering &quot;Hey! This is a love song/Hands up if you feel it&quot;, while it so very clearly isn&amp;#039;t. This is a record that comfortably runs rings round most of the heavy-rock competition, the likes of &quot;The Art Of Making Sense&quot; and &quot;2nd Coming&quot; meshing buzzsaw guitars and Adam Perry&amp;#039;s frenetic, on-point drumming with a nagging tunefulness (since day one, something of an A trump-card). \nThe lack of chirpiness could be down to several things: the influence of producer Terry Richardson, known for his work with Pantera, the Deftones and Soundgarden; or the recording locale, Seattle&amp;#039;s Studio X, which has previously hosted the likes of Nirvana and Pearl Jam. Whatever, it suits A, and Teen Dance Ordinance is testament to the virtue of being the sort of band that just can&amp;#039;t sit still\n\nEnjoy! :)","torrent":{"xt":"urn:btih:c925c89f62d4cc2e82bd5bcab09087fbf8feacad","amp;dn":"A+-+Teen+Dance+Ordinance","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c925c89f62d4cc2e82bd5bcab09087fbf8feacad","infoHashBuffer":{"type":"Buffer","data":[201,37,200,159,98,212,204,46,130,189,91,202,176,144,135,251,248,254,172,173]},"announce":[],"urlList":[]}}