{"title":"SmartWhois 4.3 Build 216 (New)","uid":4206206,"size":12152420,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:c92955b7fe4c49f2775fd4da48b959823e17d77f&amp;dn=SmartWhois+4.3+Build+216+%28New%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"cherenpiper","files":11,"time":1211817422,"description":"SmartWhois is a useful network information utility that allows you to look up all the available information about an IP address, hostname or domain, including country, state or province, city, name of the network provider, administrator and technical support contact information. It helps you find answers to these important questions:\n\nWho is the owner of the domain?\nWhen was the domain registered and what is the owner&amp;#039;s contact information?\nWho is the owner of the IP address block?\n\nWith SmartWhois you can focus on your work; the program will unmistakably choose the right database from over 60 whois databases all over the world and fetch the most complete results within a few seconds.\n\nFeatures:\n\nSmart operation: The program always looks up whois data in the right database; you don&amp;#039;t have to waste your time trying them all.\nIntegration with Microsoft Internet Explorer and Microsoft Outlook. Look up domain owners and IP addresses in e-mail headers instantly!\nSaving results into an archive: you can build your own database that can be viewed offline.\nBatch processing of IP addresses or domain lists.\nCaching of obtained results.\nHostname resolution and DNS caching.\nIntegration with CommView Network Monitor: Can be accessed from CommView for quick, easy lookup.\nCalling SmartWhois directly from your application. See SmartWhois FAQ.\nWildcard queries.\nWhois console for custom queries.\nCountry code reference.\nCustomizable interface.\nSOCKS5 firewall support.\nAnd much more!\n\nWho needs SmartWhois\n\nEveryone who uses standard Whois utilities: SmartWhois saves a lot of time and does things standard Whois utilities can&amp;#039;t do.\nPeople who hate spam or want to identify the origin of suspicious e-mail messages: check the message header and locate the real sender! You can also send e-mail to the network administrator with a mouse click.\nWebmasters who want to study the logs more carefully and are unable to identify many IP addresses.\nOnline vendors who want to learn exactly where an order comes from.\nPeople who want to identify the origin of suspicious e-mail messages by studying the headers. ","torrent":{"xt":"urn:btih:c92955b7fe4c49f2775fd4da48b959823e17d77f","amp;dn":"SmartWhois+4.3+Build+216+%28New%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"c92955b7fe4c49f2775fd4da48b959823e17d77f","infoHashBuffer":{"type":"Buffer","data":[201,41,85,183,254,76,73,242,119,95,212,218,72,185,89,130,62,23,215,127]},"announce":[],"urlList":[]}}