{"title":"Gogi Grant - Torch Time  1958","uid":4178205,"size":78927097,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cb430be0e5c98eb1ca0e005a1e8c5398f16a5d8d&amp;dn=Gogi+Grant+-+Torch+Time++1958&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"glum22","files":13,"time":1210255131,"description":"Gogi Grant - Torch Time  1958\n\n\n\n\n\n\n\nShe was born in Philadelphia, Pennsylvania. At the age of twelve she moved to Los Angeles, California. In California she won a teenage singing contest and appeared on television talent shows. In 1952 she began to record, using first the name &quot;Audrey Brown&quot; and later &quot;Audrey Grant&quot;. She was given the name &quot;Gogi&quot; by Dave Kapp, the head of Artists and Repertory at RCA Records, who liked to patronize a restaurant called &quot;Gogi&amp;#039;s LaRue.&quot;\n\nIn 1955 she signed with a small record company, Era Records, and had her first top ten hit with &quot;Suddenly There&amp;#039;s a Valley.&quot; The next year, she had an even bigger hit (reaching Billboard magazine&amp;#039;s number one spot) with &quot;The Wayward Wind&quot; and she was voted most popular female vocalist by Billboard magazine. This single returned to the Billboard Hot 100 in 1961.\n\nIn 1957 she supplied the vocals for Ann Blyth in the movie portrayal of Helen Morgan&amp;#039;s life. The soundtrack occasioned her return to RCA (the soundtrack album climbed to #25 in the Billboard album chart), where she also had a minor hit the following year with &quot;Strange Are the Ways of Love&quot;.\n\nAlthough she made albums and appeared on television into the 1960s, her popularity declined and she retired from singing in 1967,after a final US chart single, &quot;The Sea&quot; (top 20 on Bilboard&amp;#039;s Easy Listening chart). Nevertheless an album of hers was released in England some twenty years later.\n\nMiss Grant is still performing, currently she headlined with The Fabulous Palm Springs Follies in Palm Springs, California. Her last show was on December 31, 2006 with the Follies, and she continues to perform well into her 80s.\n\n\n1. They Say It&amp;#039;s Wonderful\n2. The Thrill Is gone\n3. Poor Butterfly\n4. My Man\n5. Bewitched\n6. Lover, Come Back To Me\n7. Yesterdays\n8. Summertime\n9. Something Wonderful\n10. I Didn&amp;#039;t Know What Time It Was\n11. Mad About They Boy\n\nRecorded in Hollywood, 1958\n","torrent":{"xt":"urn:btih:cb430be0e5c98eb1ca0e005a1e8c5398f16a5d8d","amp;dn":"Gogi+Grant+-+Torch+Time++1958","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb430be0e5c98eb1ca0e005a1e8c5398f16a5d8d","infoHashBuffer":{"type":"Buffer","data":[203,67,11,224,229,201,142,177,202,14,0,90,30,140,83,152,241,106,93,141]},"announce":[],"urlList":[]}}