{"title":"Free YouTube Uploader v2.2.1.1 [with batch mode support]","uid":4174303,"size":6675204,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:cb9bb218940fa614847e4bb96c4144a97e6d4171&amp;dn=Free+YouTube+Uploader+v2.2.1.1+%5Bwith+batch+mode+support%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"elofm","files":1,"time":1210035142,"description":"          Free YouTube Uploader v2.2.1.1 [with batch mode support]\n          ********************************************************\n\n Is the very first PC desktop application to upload video to YouTube without using the original YouTube web interface.\n\n If you often upload videos, this easy to use program will be a good companion for you and save lots of your time.\n\n Also it gives you 100% guaranty that your video will not be rejected by YouTube due to incompatibility reasons.\n\n Convert any video to YouTube friendly video format with optimal size and quality and upload your video to YouTube fast and easy.\n\n New version has the batch mode. So you can upload several video files during one session.\n\nHow to upload video to YouTube:\n\nStep 1\n\nDownload Free YouTube Uploader\n\n There are no spyware or adware. It&amp;#039;s absolutely safe to install and to run!\n\nStep 2\n\nLaunch Free YouTube Uploader\n\nFree YouTube Uploader: upload video to YouTube, batch mode\n\nFollow Start &gt; All Programs &gt; DVDVideoSoft &gt; Free YouTube Uploader or click the DVDVideoSoft Free Studio icon on the desktop and then YouTube Uploader on the left sidebar.\n\n On the first start up the program will ask you to enter your YouTube account login and password.\n\nStep 3\n\nOpen video file to upload to YouTube\n\nFree YouTube Uploader: upload video to YouTube, batch mode\n\nClick the Browse... button to select a video file from your computer.\n\n Next fill Title, Description, Tags and Video Category fields, which helps other Internet users to find your video on YouTube.\n\nYou can click the &quot;switch to a batch mode&quot; link, if you want to upload multiple video files during one session or click the Trim video... button to trim your video before uploading\n\nThen you are ready, click Upload video\n\n Note: Free YouTube Uploader converts your video to YouTube friendly format with optimal size and quality!!!\n\nStep 4\n\nTrim video\n\nFree YouTube Uploader: upload video to YouTube, batch mode\n\n Click the Trim video... button along the bottom of the interface to open the new window.\n\n Use navigation line and special buttons to set start and end selection markers position.\n\nClick Apply &amp; Close to switch back to the main program window.\n\nStep 5\n\nBatch mode\n\nFree YouTube Uploader: upload video to YouTube, batch mode\n\n Here you can open several files to upload to YouTube. Than fill Title, Description, Tags and Video Category fields*.\n\nWhen you are ready, click Upload video.\n\n* Note: They will be the same for all uploaded files during this session.\n\nStep 6\n\nUploading Video\n\nFree YouTube Uploader: upload video to YouTube, batch mode\n\nWait several minutes.\n\nThe uploading time depends on your video duration and Internet connection speed.\n\n Note: It may take just several seconds to upload video to YouTube, but if your connection is slow, it may take 10 - 20 minutes to upload video. Please be patient.","torrent":{"xt":"urn:btih:cb9bb218940fa614847e4bb96c4144a97e6d4171","amp;dn":"Free+YouTube+Uploader+v2.2.1.1+%5Bwith+batch+mode+support%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cb9bb218940fa614847e4bb96c4144a97e6d4171","infoHashBuffer":{"type":"Buffer","data":[203,155,178,24,148,15,166,20,132,126,75,185,108,65,68,169,126,109,65,113]},"announce":[],"urlList":[]}}