{"title":"Omodaka - Cantata No. 147","uid":4193712,"size":84828026,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cbf1ded0fa0ce6c335b1de5cf0e523c4d81f06f1&amp;dn=Omodaka+-+Cantata+No.+147&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AxaliaN","files":10,"time":1211110257,"description":"Omodaka and Far East Recording are both names used by one Soichi Terada.\n\nSoichi has been producing a wide variety of electro/techno music since 1989. Browsing through his extensive discography is much like taking a lesson in electro history. He started out like many others in the early 90s with bare-bone, sample filled dance tracks. He gradually shifted into jungle/drum and bass territory with his \\&quot;Sumo Jungle\\&quot; series of albums. Much of his music featured bossa rhythms and other more sophisticated elements, propelling his tracks slightly further than the usual stagnant underground house and jungle tracks.\n\nHe continued to evolve his sound into a much more lively house realm, pushing the vocal element to the forefront. With his \\&quot;Monkey Turn\\&quot; single, he fused his older jungle style with a new, vocal-centric sort of cyber house, with its roboticized traditional style Japanese vocal track. After that he jumped straight into a Daft Punk style of upbeat house tracks with more traditional Japanese folk-style vocals courtesy of Kanazawa Akiko (I highly recommend checking out the video diaries on her site.) He also slowly incorporated the current trend of using modern/retro 8-bit sounds, eventually creating songs made entirely of vintage video game music tracks. While these songs would be great on their own as instrumentals, his addition of Kanzawa\\&amp;#039;s anachronistic traditional vocals makes for a truly unique mix.\n\nSo far Soichi has released only one album featuring his new 8-bit sound under the name Omodaka. It\\&amp;#039;s basically a collection of his most recent singles (including his excellent version of Bach\\&amp;#039;s Cantata No. 147.) With the amount of attention his new sound, and more notably the excellent videos that accompany them, along with a growing number of high profile remixes for the likes of Ram Rider and YMCK, we can be sure that we\\&amp;#039;ll be hearing (and seeing) a lot more from Omodaka / Far East Recording in the near future.","torrent":{"xt":"urn:btih:cbf1ded0fa0ce6c335b1de5cf0e523c4d81f06f1","amp;dn":"Omodaka+-+Cantata+No.+147","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbf1ded0fa0ce6c335b1de5cf0e523c4d81f06f1","infoHashBuffer":{"type":"Buffer","data":[203,241,222,208,250,12,230,195,53,177,222,92,240,229,35,196,216,31,6,241]},"announce":[],"urlList":[]}}