{"title":"(Jazz) Dave D'Angelo &amp; Section 8 - In A Minute","uid":4117212,"size":41551035,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:cbf9c6e9d939195ba1004b3d75494040616dbefd&amp;dn=%28Jazz%29+Dave+D%5C%27Angelo+%26+Section+8+-+In+A+Minute&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"Falleen_Fan_No_1","files":8,"time":1207365805,"description":"GREAT sax jazz combo....\n\n\nDave D&amp;#039;Angelo: Alto Sax &amp; Flute, Andy Fusco: Alto Sax, Walt Weiskopf: Tenor Sax, Steve Marcus: Tenor &amp; Soprano Sax, Jack Stuckey: Baritone Sax\nJoel Weiskopf: Piano on track 1, 2 &amp; 3, Tardo Hammer: Piano on track 4-8, Phil Palombi: Acoustic Bass, Steve Davis: Drums\n\n1. In Your Dreams 3:48 -Keith Bishop-\nTenors: Walt Weiskopf, Steve Marcus\n\n2. Vitamin C 4:46 -Dave D&amp;#039;Angelo-\nAltos: Dave D&amp;#039;Angelo, Andy Fusco\nPiano: Joel Weiskopf\nDrums: Steve Davis\n\n3. You Won&amp;#039;t Forget Me 4:11-Goell &amp; Spielman- -arr. Walt Weiskopf-\nAlto: Andy Fusco\nTenors: Steve Marcus, Walt Weiskopf\n\n4. Six And Four 4:48 -Oliver Nelson- -arr. Dave D&amp;#039;Angelo-\nAlto: Dave D&amp;#039;Angelo\nTenor: Walt Weiskopf\nBass: Phil Palombi\n\n5. Fancy Free 6:01 -Donald Byrd- -arr. Dave D&amp;#039;Angelo-\nSoprano: Steve Marcus\nPiano: Tardo Hammer\n\n6. Lazy Afternoon 8:09 -J. Moross- -arr. Walt Weiskopf-\nTenor: Walt Weiskopf\nAlto: Dave D&amp;#039;Angelo\nPiano: Tardo Hammer\n\n7. All My Tomorrows 5:16 -Cahn &amp; Van Heusen- -arr. Keith Bishop-\nAlto: Andy Fusco\nPiano: Tardo Hammer\n\n8. In A Minute 5:32 -Dave D&amp;#039;Angelo-\nAltos: Dave D&amp;#039;Angelo\nAndy Fusco\nPiano: Tardo Hammer \n\n \n\n\nIn the world of music, the longer you have worked with another musician, the stronger the musical relationship. In the case of &quot;Section 8&quot; the musical relationships represented here go back almost twenty years (with the notable exception of bassist Phil Palmbi who, twenty years ago, was eight years old).\n\nI joined the Buddy Rich Band in 1981 and had the professional good fortune to play in a sax section with Andy Fusco playing lead alto, Dave D&amp;#039;Angelo on second alto, featured tenor and soprano saxophone solist Steve Marcus (in the middle of his fourteen year reign in that position), and writer/arranger/bariton saxophonist Keith Bishop (who has contributed two selections to this disc).\n\nKnowing Dave D&amp;#039;Angelo as long as we all have, not one of us would have guessed that he would be the one to re-unite us into &quot;Section 8&quot;. We never figured Dave for the entrepreneurial type, he was too nice a guy.\n\nI fist met Dave in 1980. We sat in with a quartet at an out-of-the-way dive in Queens (New York City) that opened its doors each night at eleven p.m. My mission in those days was to join the Buddy Rich Band. Dave was playing second alto at the time and said he would put in a good word for me. The following April (of 1981) I got on the bus. The experience for me was a dream come true. I got to work in one of the best saxophone sections ever. The five of us were together for a year (which is a long time in the world of road bands) until Dave left the band in the Spring of 1982 after a particularly grueling six-week tour of England, Scotland and Ireland.\n\nAfter Buddy&amp;#039;s death in 1987 we were re-united as a section again - with Jack Stuckey adding his fine Baritone sound to the section, replacing Keith Bishop who did not live in the New York area. We played a series of Buddy Rich tribute concerts that culminated in &quot;Burning for Buddy&quot; (Atlantic Records, 1995), a huge project conceived and produced by Neil Peart and Cathy Rich consisting of three CD&amp;#039;s featuring different drummers (everyone from Joe Morello to Dave Weckl) playing Buddy&amp;#039;s music with the band.\n\n&quot;Section 8&quot; was conceived by Dave along with his wife Denise. He has been on a mission ever since; this CD is the fruit of his labor.\n\nIn Your Dreams by Keith Bishop is a vehicle for a two tenor blowout driven by the flawlessly burning duo of Steve Davis and Phil Palombi. Keith makes his presence felt, directing the Section to nimbly negotiate his intricate lines.\n\nDave&amp;#039;s swinging original Vitamin C (dedicated to altoist Clarence &quot;C&quot; Sharp) features him to great advantage. His alto is slick, deft, and straight ahead; followed up with equally brilliant solos by Fusco and pianist Joel Weiskopf.\n\nThe classic Goell, Spielman standard You Won&amp;#039;t Forget Me was adapted from an arrangement for nonet (originally recorded on &quot;Song For My Mother&quot;, Criss Cross 1127) and features a great Andy Fusco alto solo followed by the tenor solo and saxophone section.\n\nA relatively unknown Oliver Nelson composition, Six and Four, is an off beat groove for the three soloists. Phil Palombi has the final word and demonstrates why he is one of the most sought after young bass players in the New York area.\n\nSteve Marcus will readily admit that he is a soprano saxophone player first; a kind of rocked-out Steve Lacy -- who happens to play great tenor. He is heard at his earthy best here on Fancy Free, the Donald Byrd classic arranged for Marcus by Dave D&amp;#039;Angelo.\n\nJerome Moross&amp;#039; Lazy Afternoon was adapted for Section 8 from an arrangement for sextet (originally recorded on &quot;Simplicity&quot;, Criss Cross 1075).\n\nAndy Fusco&amp;#039;s rendition on Keith Bishop&amp;#039;s arrangement of All My Tomorrows is a snapshot of his mastery - he is the state of the art on his instrument.\n\nIn A Minute is reminiscient of the post-bop recordings of Jackie McLean and Wayne Shorter. Fusco and D&amp;#039;Angelo are dealing for real here. Tardo Hammer sounds so authentic as always; he is an unsung hero of modern jazz piano.\n\nThis is the sound that started with &quot;Super Sax&quot;, the great L.A. sax section band dedicated to the music of Charlie Parker. The baton is picked up now by &quot;Section 8&quot;. This is music by saxophone players, for saxophone players - and jazz lovers. - Walt Weiskopf\n\n","torrent":{"xt":"urn:btih:cbf9c6e9d939195ba1004b3d75494040616dbefd","amp;dn":"%28Jazz%29+Dave+D%5C%27Angelo+%26+Section+8+-+In+A+Minute","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cbf9c6e9d939195ba1004b3d75494040616dbefd","infoHashBuffer":{"type":"Buffer","data":[203,249,198,233,217,57,25,91,161,0,75,61,117,73,64,64,97,109,190,253]},"announce":[],"urlList":[]}}