{"title":"The Beatles - Anthology Vol 1 (2cd)[Flac][TNT]","uid":12730636,"size":580309106,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:cc1ce9b7d7881304a47e60a2926d21643ed6380c&amp;dn=The+Beatles+-+Anthology+Vol+1+%282cd%29%5BFlac%5D%5BTNT%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"funk1971","files":75,"time":1447105679,"description":"\n\r\nAnthology 1 includes rarities, outtakes, and live performances from the period 1958–1964, including their days as &quot;The Quarrymen&quot;, through the Decca audition to sessions for the album Beatles for Sale. It is of historical interest as the only official release of performances with Stuart Sutcliffe and Pete Best in the band. Sutcliffe, the band's original bass player during 1960, and sporadically during the group's second Hamburg season, appears on the disc one tracks, &quot;Hallelujah, I Love Her So&quot;, &quot;You'll Be Mine&quot; and &quot;Cayenne&quot;. Best, who was the band's drummer from just prior to the group's first departure for Hamburg in August 1960 until 15 August 1962, is on disc one, tracks 10–12, 15–19 and 21–22.\r\n\r\nDisc one tracks 10–12 were recorded at a session in Hamburg where The Beatles served as the back-up band to the English rock and roll musician Tony Sheridan. Some songs from this session were released on the 1962 LP My Bonnie, credited to Tony Sheridan and the Beat Brothers. The song &quot;My Bonnie&quot; would be their introductory single in England, featuring Sheridan on lead vocal and guitar. Disc one tracks 21–22 are the only surviving recordings of The Beatles' first EMI session. Track 22 is the original recording of &quot;Love Me Do&quot;, which, after Ringo Starr replaced Best, would be re-recorded by the group four months later for their first single. Disc one track 23 features EMI session drummer Andy White in place of Starr.\r\n\r\nDisc two contains performances from comedy duo Morecambe and Wise's popular television programme, Two of a Kind, as well as the opening song from their famed performance on The Ed Sullivan Show, which introduced the band to most of the US in 1964.\r\n\r\nThe flashpoint for the album came with the song &quot;Free as a Bird&quot; – the three remaining Beatles Paul McCartney, George Harrison and Ringo Starr re-working a John Lennon demo recording given to McCartney by Lennon's widow, Yoko Ono Lennon. Produced by Harrison's Traveling Wilburys band-mate Jeff Lynne, the three added additional music and lyrics, instrumentation and backing vocals, with McCartney and Harrison both taking a turn at a lead vocal","torrent":{"xt":"urn:btih:cc1ce9b7d7881304a47e60a2926d21643ed6380c","amp;dn":"The+Beatles+-+Anthology+Vol+1+%282cd%29%5BFlac%5D%5BTNT%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cc1ce9b7d7881304a47e60a2926d21643ed6380c","infoHashBuffer":{"type":"Buffer","data":[204,28,233,183,215,136,19,4,164,126,96,162,146,109,33,100,62,214,56,12]},"announce":[],"urlList":[]}}