{"title":"The Six Wives of Henry the VIII - BBC 1970 - Part 3 of 6","uid":4126184,"size":908664652,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:cd4b3b4b11164601fdba463d750f749ab3da8804&amp;dn=The+Six+Wives+of+Henry+the+VIII+-+BBC+1970+-+Part+3+of+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anca13","files":1,"time":1207799375,"description":"Please seed after download :) \nI like to thank all you seeders for giving back to the &quot;torrent&quot; community.\n\n\nBy \tfelicitaz &quot;felicitaz&quot; (NY, USA) \n\nI saw this series as a child, and it profoundly influenced my life, making me an eager historian and costumer ever after. Just a year or so ago, my brother gave this series to me as a gift, and it is even better than I remembered it. \n\nThe reign of the Tudors followed the War of the Roses, a bloody, chaotic part of British history, characterized by civil war and royal asassinations. The two little princes in the Tower, murdered by order of Richard III, were Henry VIII&amp;#039;s uncles. His father, Henry VII, ended the strife by defeating Richard III, and marrying the Yorkist heir, Elizabeth. Their union brought stability to England. \n\nYou have to keep these events in mind when watching this series, because they make Henry VIII&amp;#039;s actions understandable. His seemingly monomaniacal need for a son was his effort to ensure that nothing like the War of the Roses would happen again. \n\nThis series is for the serious Tudor buff. It comes from the era of BBC productions that were richly intellectual, subtly acted and true to the original material. Also, looking at it again after so many years, I realize what a parade of first class British actors participated: Annette Crosbie, Dame Dorothy Tutin, Patrick (&quot;Dr. Who&quot;) Troughton, Bernard Hepton, and even Mollie (&quot;Are You Being Served&quot;) Sugden. \n\nKeith Michell delivers a Henry VIII whom you can hate and yet sympathize with--very human, sometimes weak, sometimes funny. He is a scholar, musician, knight, statesman, victim, tyrant, penitent, cuckold, and philosopher, as events dictate. His Henry is very complex; and one of the pleasures of this production is that you find yourself watching to see which Henry is going to emerge. One can imagine that his wives and courtiers also walked on eggshells, not knowing which facet of his personality might turn itself in them at any given time. \n\nOf the six episodes: \n\nJANE SEYMOUR: This is the episode that won an award. It is sensitively done. Very little is known about Jane Seymour, beyond the fact that she was basically a pawn for her powerful family, and that she bore Henry the son he longed for. However, Anne Stallybrass renders a deeply-felt portrait of the kind woman who made peace between Henry and his daugther Mary, and somehow left an unforgettable impression on Henry himself. In this episode, too, we get an interesting view of the cryptic character of Thomas Cromwell (as portrayed by Wolfe Morris) --an urbane, nervous little man with an unsettling habit of suddenly turning lethal.\n\n\n\n\n","torrent":{"xt":"urn:btih:cd4b3b4b11164601fdba463d750f749ab3da8804","amp;dn":"The+Six+Wives+of+Henry+the+VIII+-+BBC+1970+-+Part+3+of+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd4b3b4b11164601fdba463d750f749ab3da8804","infoHashBuffer":{"type":"Buffer","data":[205,75,59,75,17,22,70,1,253,186,70,61,117,15,116,154,179,218,136,4]},"announce":[],"urlList":[]}}