{"title":"Salvando A Grace 1x07 - Yeehaw, Geepaw [HDTV-DVB] [LuTTeR].avi","uid":4228665,"size":367577088,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:cd643c08614b7414df88ef64fb826cfa898d22d7&amp;dn=Salvando+A+Grace+1x07+-+Yeehaw%2C+Geepaw+%5BHDTV-DVB%5D+%5BLuTTeR%5D.avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"seriesani","files":1,"time":1212937869,"description":" &lt;a href=&quot;http://seriesani.baywords.com&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://seriesani.baywords.com&lt;/a&gt; -- EL BLOG DE LAS SERIES - ASAT TEAM\n\nFICHA TÃƒ?CNICA SERIE\n\nTÃƒÂ­tulo: Salvando a Grace\nTÃƒÂ­tulo original: Saving Grace\nAÃƒÂ±o de producciÃƒÂ³n: 2007-2008\nTemporadas: una\nCapÃƒÂ­tulos: 13\n\nArgumento: \n\nCÃƒÂ­nica, bebedora, caÃƒÂ³tica y desafiante con sus superiores. AsÃƒÂ­ es Grace Hanadarko, una agente de policÃƒÂ­a de Oklahoma City a la que la vida no ha tratado muy bien tanto en lo personal como en lo profesional. Instalada bien entrada la cuarentena y con la ÃƒÂºnica alegrÃƒÂ­a de una veintena de sobrinos con los que sÃƒÂ­ logra mostrar su lado mÃƒÂ¡s tierno, Grace supera como puede el trance de haber sobrevivido a una tragedia personal, entregÃƒÂ¡ndose demasiado a menudo al alcohol y a compaÃƒÂ±eros de cama no muy afortunados.\n\nPero la vida de Grace estÃƒÂ¡ a punto de dar un vuelco inesperado y sobrenatural. El milagro sucederÃƒÂ¡ una noche cuando trata de hacerse con el control de su coche tras haber tomado bastantes copas de mÃƒÂ¡s. Grace implora a Dios y ÃƒÂ©ste le demuestra su solidaridad mandÃƒÂ¡ndole a Earl (Leon Rippy), un ÃƒÂ¡ngel enviado con la ÃƒÂºnica misiÃƒÂ³n de redimirla y llevarla por el buen camino.\n\nSalvando a Grace nace de la imaginaciÃƒÂ³n de la guionista Nancy Miller, responsable de The Closer, otra serie con protagonista femenina, policÃƒÂ­a y difÃƒÂ­cil. En Salvando a Grace, Miller parte de una situaciÃƒÂ³n que parece una versiÃƒÂ³n urbana, contemporÃƒÂ¡nea y mucho mÃƒÂ¡s ÃƒÂ¡cida del clÃƒÂ¡sico de Frank Capra QuÃƒÂ© bello es vivir, en la que un ÃƒÂ¡ngel tambiÃƒÂ©n redimÃƒÂ­a al personaje interpretado por James Stewart.\n\nEn esta ocasiÃƒÂ³n, el ÃƒÂ¡ngel Earl y la policÃƒÂ­a Grace van a compartir momentos singulares, muy poco convencionales. Su relaciÃƒÂ³n no va a ser nada fÃƒÂ¡cil y Earl deberÃƒÂ¡ emplearse mucho mÃƒÂ¡s que en cualquier otra misiÃƒÂ³n redentora.\n\nReparto: Junto a Holly Hunter (Grace) y Leon Rippy (Earl), Salvando a Grace se completa con un reparto de actores muy solventes, entre los que cabe citar a Kenneth Johnson (The Shield), que da vida a Ham Dewey, el compaÃƒÂ±ero casado de Grace, con el que mantiene una relaciÃƒÂ³n; Gregory Norman Cruz (Mentes criminales), como el detective Bobby Stillwater; Bailey Chase (Las Vegas), en la piel del agente Butch Ada; Bokeem Woodbine (Equipo mortal), como un preso del corredor de la muerte relacionado con Grace; y Laura San Giacomo (Pretty Woman, Dame un respiro) en el papel de Rhetta RodrÃƒÂ­guez, la mejor amiga de Grace, una abogada criminalista que, pese a sus fuertes creencias religiosas, es la ÃƒÂºnica que no juzga su comportamiento.\n\n\nFICHA TÃƒ?CNICA RIPEO\n\nTamaÃƒÂ±o capÃƒÂ­tulos: 350MB (aprox.)\nDuraciÃƒÂ³n: 42 minutos por capÃƒÂ­tulo aproximadamente\nCodecs: XVid 624x352 (Video) mp3-CBR stereo(Audio)\nIdioma: Castellano.\n","torrent":{"xt":"urn:btih:cd643c08614b7414df88ef64fb826cfa898d22d7","amp;dn":"Salvando+A+Grace+1x07+-+Yeehaw%2C+Geepaw+%5BHDTV-DVB%5D+%5BLuTTeR%5D.avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cd643c08614b7414df88ef64fb826cfa898d22d7","infoHashBuffer":{"type":"Buffer","data":[205,100,60,8,97,75,116,20,223,136,239,100,251,130,108,250,137,141,34,215]},"announce":[],"urlList":[]}}