{"title":"The.Simpsons.Movie.2007.ENGLiSH.DivX-KapteN_GuL","uid":4081390,"size":732844032,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce038af57d1f5cac251fa48c3cac0650a48c73bf&amp;dn=The.Simpsons.Movie.2007.ENGLiSH.DivX-KapteN_GuL&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"KapteN_GuL","files":-1,"time":1205587181,"description":"The Simpsons Movie (2007)\n\nFile Size: 698 MB\nLanguage spoken: English\nSubtitles: None (Can be obtainable though)\nPassword protected: None\nFile format: .avi (DVDRiP)\n\nGreat video &amp; sound quality in my opinion.\n\nDescription:\n\n[Review taken from Times Online]\n\nHomer Simpson, the oafish paterfamilias of AmericaÃƒÂ¢??s favourite dysfunctional family, emerges from his big-screen debut a bona fide Hollywood action hero. \n\nAt the start of The Simpsons Movie HomerÃƒÂ¢??s dreams of glory are limited to helping his new pet pig to walk upside down on the ceiling while singing ÃƒÂ¢??Spiderpig, SpiderpigÃƒÂ¢?? to the Spider-Man theme song. But when the adopted swine gets him into bigger trouble than even this celebrated screw-up has ever experienced before, he falls under the influence of a chesty Native American woman he calls ÃƒÂ¢??Boob LadyÃƒÂ¢?? and undergoes an uncharacteristic epiphany that galvanizes him into action for the good of his by-now estranged clan. \n\nBy the time the witty final credits roll, Homer outshines even Arnold Schwarzenegger, who has been elected president and ordered great harm done to Homer&amp;#039;s home town. \n\nThe Hollywood action theme helps the hit cartoon series, after 18 seasons on television, to land its death-defying leap to the big screen with panache. The result is a postmodern parable about an environmental scare that is at the same time hilarious and horrifyingly poignant. But thanks to an unexpected glimpse of BartÃƒÂ¢??s genitalia, this is a postmodern parable with a ÃƒÂ¢??pickle shotÃƒÂ¢??. \n\nThe film boasts the same sly cultural references and flashes of brilliance that have earned the television series a following that ranges from tots to comparative literature PhDs. Despite its clownishness and childish graphics, it still offers searing insights into the pathetic human condition. \n\nWhen the residents of Springfield learn that they are confronting catastrophe, for instance, the panicked occupants of the bar and the next-door church pour out into the street and change places as the drinkers taking solace in religion and the religious finding comfort in drink. \n\nBut the movie will be equally satisfying to those who just find it funny that Homer wants to kiss his pet pig ÃƒÂ¢?? or laugh at Marge pondering the (literally) weighty issue of the pigÃƒÂ¢??s ÃƒÂ¢??leavingsÃƒÂ¢??, or excrement. \n\nEarly on The Simpsons team shows their nerve by making Homer wonder out loud why anyone would pay to buy a cinema ticket to watch what they could see on TV free ÃƒÂ¢?? the underlying question of the whole big-screen adaptation. In HomerÃƒÂ¢??s view, anyone who pays for cinema tickets to watch a TV show is a sucker. Jabbing his finger at the audience, he declares: ÃƒÂ¢??Particularly you!ÃƒÂ¢?? \n\nWhat you get for your money is the Simpsons on an epic scale. The familiar, if geographically indeterminate, territory of Springfield is suddenly transformed into a cross between The Truman Show and Escape from New York, with a Big Brother government conspiring to keep all its unruly residents in line until it can be bombed into a ÃƒÂ¢??new Grand CanyonÃƒÂ¢?? tourist attraction. \n\nThe middle section, set in Alaska, lags because of the absence of the familiar props of the SimpsonsÃƒÂ¢?? home town. I found myself longing for Homer and his tribe to return to wreak more havoc on their neighbours, particularly the long-suffering Flanders. \n\nBut the film ends with a tense second-by-second countdown that fully exploits the bathos of that schlump Homer becoming an action star able save the world, or at least his little part of it. The conventions of the ÃƒÂ¢??disaster flickÃƒÂ¢?? allow The SimpsonsÃƒÂ¢?? left-leaning creator, Matt Groening, to indulge his politics with wry warnings of environmental doom without boring us out of our mustard-yellow skin. \n\nLisa, Homer and MargeÃƒÂ¢??s swotty daughter, has become an ardent environmentalist who makes an Al Gore-style presentation entitled ÃƒÂ¢??An Irritating TruthÃƒÂ¢?? to the local populace. \n\nIn the same spirit, this film could have been subtitled: ÃƒÂ¢??An Inconvenient CartoonÃƒÂ¢??.\n\n[Review taken from Times Online]\n\nNote: Please seed after you have downloaded this file, it&amp;#039;ll make it better for everyone.\n\n\n~ KapteN_GuL ~","torrent":{"xt":"urn:btih:ce038af57d1f5cac251fa48c3cac0650a48c73bf","amp;dn":"The.Simpsons.Movie.2007.ENGLiSH.DivX-KapteN_GuL","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce038af57d1f5cac251fa48c3cac0650a48c73bf","infoHashBuffer":{"type":"Buffer","data":[206,3,138,245,125,31,92,172,37,31,164,140,60,172,6,80,164,140,115,191]},"announce":[],"urlList":[]}}