{"title":"When a Man Falls in the Forest (2007) DVDRip","uid":4074863,"size":735420416,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ce2ba299b62fa1f03baf2ec0fb78ac98acb5ecfe&amp;dn=When+a+Man+Falls+in+the+Forest+%282007%29+DVDRip&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"circlensess","files":1,"time":1205252186,"description":" &lt;a href=&quot;http://www.imdb.com/title/tt0468965/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;http://www.imdb.com/title/tt0468965/&lt;/a&gt;\n\n\nThe intertwining lives of three men reveal that each deal with his problems in different, self-destructive ways\n\nThough marketed as a Sharon Stone thriller, this solemn chamber piece revolves around three men. One evening at work, Gary (Timothy Hutton in ever-present baseball cap) runs into night janitor Bill (Dylan Baker in over-sized spectacles). Gary and Travis (Pruitt Taylor Vince) used to tease Bill, a classical-music enthusiast, in high school. The encounter spurs Gary to reconnect with Travis, with whom he lost touch after the latter was involved in an automobile accident (for which he blames himself). Together, they drink and commiserate over their lonely lives; meanwhile, Gary&amp;#039;s neglected wife, Karen (an uncharacteristically disheveled Stone), takes to sulking and shoplifting. Bill becomes preoccupied with his pretty neighbor, Sadie (Stacie Bono), and her abusive relationship (in his dreams, Bill saves Sadie from her attacker). A senseless tragedy forces these isolated individuals to face their fears once and for all. Originally known as When a Man Falls in the Forest, then When a Man Falls, the follow-up to Ryan Eslinger&amp;#039;s Madness and Genius moves too slowly to generate suspense, while the characters lack sufficient development for their catharsis to have the desired impact. (An absence of personal touches, like portraits and mementos, contributes an air of artifice.) Despite their efforts, this leaves the actors stranded at times, particularly Baker, whose Bill is too bizarre to inspire much sympathy. Of the leads, Vince makes the best impression--would that Eslinger had concentrated more of the story on his character.\n\n\n\n\n","torrent":{"xt":"urn:btih:ce2ba299b62fa1f03baf2ec0fb78ac98acb5ecfe","amp;dn":"When+a+Man+Falls+in+the+Forest+%282007%29+DVDRip","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ce2ba299b62fa1f03baf2ec0fb78ac98acb5ecfe","infoHashBuffer":{"type":"Buffer","data":[206,43,162,153,182,47,161,240,59,175,46,192,251,120,172,152,172,181,236,254]},"announce":[],"urlList":[]}}