{"title":"Matar a un rey - TO KILL A KING [PAL-DVD5][SS28 DVDQ]","uid":4083216,"size":4060755968,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:cf66316e1185cd03e01be7f6b4db1aac3f0b7c27&amp;dn=Matar+a+un+rey+-+TO+KILL+A+KING+%5BPAL-DVD5%5D%5BSS28+DVDQ%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"silversurfer28","files":17,"time":1205628671,"description":"TÃƒ?TULO/Title - TO KILL A KING\n\nAÃƒ?O/Year - 2003  \n \nDURACIÃƒ?N - 102 min\n-----------------------------------------------------------------------------------\nMÃƒ?TODO/Method - AnyDVD + DVDDecrypter\n\nCOMPRESIÃƒ?N/Compression - Ninguna/None\n\nFORMATO/Format - PAL DVD5\n\nDATOS DE LA PELÃƒ?CULA/Data of the movie\nIdiomas/Languages - EspaÃƒÂ±ol e inglÃƒÂ©s / Spanish and english\nSubtÃƒÂ­tulos/Subtitles - EspaÃƒÂ±ol e inglÃƒÂ©s  / Spanish and english\n-----------------------------------------------------------------------------------\nDIRECTOR  - Mike Barker \nREPARTO/Actors - Tim Roth, Dougray Scott, Rupert Everett, Olivia Williams, James Bolam, Corin Redgrave, Finbar Lynch \n\nGÃƒ?NERO/Genre - Drama histÃƒÂ³rico/Historical Drama\n\nSINOPSIS/Synopsis - Inglaterra, 1645. La corte de Carlos I ha sido derrocada por los puritanos tras la amarga guerra civil que ha sacudido al paÃƒÂ­s, dejÃƒÂ¡ndolo en ruinas. El lÃƒÂ­der parlamentario rebelde Thomas Fairfax, miembro de la aristocracia, tiene planes para la reforma moderada de la monarquÃƒÂ­a, pero su leal segundo, Oliver Cromwell, enardecido por sus victorias en el campo de batalla, comienza a ser dominado por el ansia de poder y la paranoia. Cromwell, plebeyo, demanda la ejecuciÃƒÂ³n del rey. (FILMAFFINITY)\n\nEngland, 1645. The court of Charles I has been overthrown by the puritans after the bitter civil war that has shaken the country, leaving it in ruins. The parliamentary rebel leader Thomas Fairfax, a member of the aristocracy, has plans for the reform of the monarchy moderate, but his loyal second, Oliver Cromwell, enardecido for their victories on the battlefield, it begins to be dominated by the lust for power and paranoia. Cromwell, plebeian, demand the execution of the king. (FILMAFFINITY)\n----------------------------------------\nDrama histÃƒÂ³rico que indaga en las relaciones personales e intrigas polÃƒÂ­ticas en la reino de Inglaterra del siglo XVII. Lamentablemente durante el rodaje el film tuvo problemas de financiaciÃƒÂ³n, lo que afectÃƒÂ³ a su producto final. (FILMAFFINITY)\n\nHistorical drama that delves into personal relationships and political intrigues in the kingdom of England of the seventeenth century. Unfortunately during the shooting the film had funding problems, which affected their final product. (FILMAFFINITY)\n----------------------------------------\n&amp;#039;Matar a un rey&amp;#039; es tambiÃƒÂ©n una esplÃƒÂ©ndida lecciÃƒÂ³n de reconstrucciÃƒÂ³n histÃƒÂ³rica (...) una lecciÃƒÂ³n formalista que hubiera quedado mucho mejor si ese mismo esfuerzo de verosimilitud se hubiera trasladado tambiÃƒÂ©n al terreno de la reflexiÃƒÂ³n. (M. Torreiro: Diario El PaÃƒÂ­s)\n\n&amp;#039;To kill a king&amp;#039; is a splendid lesson in historical reconstruction (...) formalistic a lesson that had been much better if the same effort verisimilitude was transferred to the realm of thought. (M. Torreiro: Diary El PaÃƒÂ­s)\n----------------------------------------\nUn compendio de contradicciones que se agota en una suma de gestos excesivos. (Alberto Bermejo: Diario El Mundo)\n\nA compendium of contradictions that end with a sum of excessive gestures. (Alberto Bermejo: Diary El Mundo)\n----------------------------------------------------------------------------------\n\n","torrent":{"xt":"urn:btih:cf66316e1185cd03e01be7f6b4db1aac3f0b7c27","amp;dn":"Matar+a+un+rey+-+TO+KILL+A+KING+%5BPAL-DVD5%5D%5BSS28+DVDQ%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cf66316e1185cd03e01be7f6b4db1aac3f0b7c27","infoHashBuffer":{"type":"Buffer","data":[207,102,49,110,17,133,205,3,224,27,231,246,180,219,26,172,63,11,124,39]},"announce":[],"urlList":[]}}