{"title":"Aero Fly Pro Deluxe - Star Flight AddOn","uid":4076160,"size":584610768,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:cfd151becf6a24c71a507fc29198da66542f8faf&amp;dn=Aero+Fly+Pro+Deluxe+-+Star+Flight+AddOn&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"fducloux","files":1,"time":1205282558,"description":"The new sceneries of the StarFlight AddOn\n\nThe new photo sceneries of the StarFlight AddOn feature extremly high resolution and a perfectly modeled surrounding for ultimate realism.\n\nSeiser Alm: Located in the Dolomites in Italy, this scenery is ideally suited for hang gliding and offers a breathtaking panoramic view of Schlern and the RosszÃƒÂ¤hne. Our recommended wind setting for nice hang gliding: set the wind direction to 70 degrees and use a wind speed of 2 - 5 m/s (depending on the model).\nWÃƒÂ¶llaner Nock: The WÃƒÂ¶llaner Nock is a popular hang gliding site in Austria. Set the wind direction to 200 degrees for perfect hang gliding.\nPilsum: The famous Pilsum lighthouse on the North Sea coast is located on a dike. Use a wind direction abeam the dike ( 50 or 230 degrees ) to generate enough up wind for flying gliders along the dike. Mind the sheep!\nPfaffenhoffen: A secluded model airfield near Pfaffenhoffen (Bavaria). It offers a taxi gras area and a hard runway and is suitable for all kinds of aircraft in the simulator, including the jets and larger scale aircraft.\nTyson: The Tyson Events Center in Sioux City, Iowa is used for a wide variety of entertainment and sporting events like hockey, basketball, football, ice hockey and concerts. There&amp;#039;s plenty of space even for larger aircraft and acrobatic flying.\nCastle: Enjoy flying in the courtyard of Hohenkammern castle in Bavaria. The courtyard is suited for small and indoor airplanes, as well as for helicopters. There is no space for longer take-off runs and landings, so flying with larger aircraft is quite a challenge for more experienced pilots.\nFuerteventura: A nice spot in the hills of the Fuerteventura island. Enjoy helicopter flying and hang gliding on this popular resort island.\n\n\nSorry but I can Only seed from 10 to 17 GMT. But I have pretty good upload bandwidth!\n\nPlease Help me seed!","torrent":{"xt":"urn:btih:cfd151becf6a24c71a507fc29198da66542f8faf","amp;dn":"Aero+Fly+Pro+Deluxe+-+Star+Flight+AddOn","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"cfd151becf6a24c71a507fc29198da66542f8faf","infoHashBuffer":{"type":"Buffer","data":[207,209,81,190,207,106,36,199,26,80,127,194,145,152,218,102,84,47,143,175]},"announce":[],"urlList":[]}}