{"title":"Transformers.2007.DVDRip.XviD","uid":4118760,"size":708422819,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d018c0a4467ed195f056c930527d6d93f5a3e1f8&amp;dn=Transformers.2007.DVDRip.XviD&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Roy_Mustang","files":1,"time":1207438020,"description":"he film opens with Optimus Prime, heroic leader of the benevolent Autobots, describing in a voice-over the destruction of the Transformers&amp;#039; home world, Cybertron. It was destroyed by the evil Decepticon leader Megatron in his quest to obtain the All Spark. The Autobots want to find the All Spark so they can use it to rebuild Cybertron and end the war between the Autobots and the Decepticons, while the Decepticons want to use it to defeat the Autobots and conquer the universe. Megatron found the All Spark on Earth, but crash-landed in the Arctic Circle and was frozen in the ice. Captain Archibald Witwicky and his crew of explorers stumbled upon Megatron&amp;#039;s body in 1897. Captain Witwicky accidentally activated Megatron&amp;#039;s navigational system and his eye glasses were imprinted with the coordinates of the All Spark&amp;#039;s location. Sector 7, a secret United States government organization, discovered the All Spark in the Colorado River and built the Hoover Dam around it to mask its energy emissions. The still-frozen Megatron was moved into this facility and was reverse engineered to advance human technology.","torrent":{"xt":"urn:btih:d018c0a4467ed195f056c930527d6d93f5a3e1f8","amp;dn":"Transformers.2007.DVDRip.XviD","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d018c0a4467ed195f056c930527d6d93f5a3e1f8","infoHashBuffer":{"type":"Buffer","data":[208,24,192,164,70,126,209,149,240,86,201,48,82,125,109,147,245,163,225,248]},"announce":[],"urlList":[]}}