{"title":"Big Brother USA 9 Live Feeds - 03-08-08","uid":4071160,"size":629894933,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d03f1fe750de962978a201f5fa02fcf4f900d099&amp;dn=Big+Brother+USA+9+Live+Feeds+-+03-08-08&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"xx2000xx","files":9,"time":1205062924,"description":"Big Brother USA Live Feeds - 03/08/08 - xx2000xx\n\nFor youtube vids + exclusive content go to - http://bbcouchpotatoes.blogspot.com/\n\nTons of action from today. This sets up which should be an amazing day tomorrow. It may go down as one of the best BB days ever.\n\nPart 1 - 8 min\nMatt talks to Ryan to make sure the plan of getting James is still in effect - Josh/Sharon talk about the POV.\n\nPart 2 - 6 min\nJosh talks to Ryan alone in the HOH. He makes sure the plan of getting Matt out is still going down.\n\nPart 3 - 47 min\nNat/Sheila play Josh like a fiddle, some good stuff here - Nat talks to Ryan about the acting they did with Josh and then they break down the game - Sheila goes up to the HOH room to have a huge pow wow with nat/ryan. Ryan tells them that James is the target now, not Josh.\n\nPart 4 - 28 min\nThey have a huge food fight in the house - Chelsia gets James paranoid - James/Chelsia have a spat - Chelsia tells James she thinks something bad may go down tomorrow - Matt/Adam/Ryan talk about James and the plan - Sheila talks about her life living in the Penthouse mansion.\n\nPart 5 - 50 min\nJosh/Sharon are ultra paranoid and worry about Chelsia - James/Chelsia have a long talk in the hammock. They talk about the POV and trash Matt/Nat - The other side talks about getting rid of James - More James/Chelsia talking shit then of course Josh comes in to talk shit too.\n\nPart 6 - 22 min\nAdam goes upstairs to talk to his new alliance. He talks about all that action from today.\n\nPart 7 - 29 min\nJosh tries to steal Nat&amp;#039;s napkin that she&amp;#039;s been working on for days now - Chelsia tries to go to the HOH room, James is mean to Nat - Josh gives Chelsia a big pep talk before she does the big talk to Ryan -  Chelsia FINALLY has a chance to talk to Ryan. Ryan says he&amp;#039;s down still with getting rid of Matt. She threatens him before she leaves - Chelsia tells James/Josh what Ryan said. They all celebrate because they think Matt&amp;#039;s gone and their going to the final 4.","torrent":{"xt":"urn:btih:d03f1fe750de962978a201f5fa02fcf4f900d099","amp;dn":"Big+Brother+USA+9+Live+Feeds+-+03-08-08","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d03f1fe750de962978a201f5fa02fcf4f900d099","infoHashBuffer":{"type":"Buffer","data":[208,63,31,231,80,222,150,41,120,162,1,245,250,2,252,244,249,0,208,153]},"announce":[],"urlList":[]}}