{"title":"Sarkar Raj {Bollywood movie} Neohunky","uid":4228438,"size":732586804,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:d134be2997e6653251ab90473e5e1af4c5f446cf&amp;dn=Sarkar+Raj+%7BBollywood+movie%7D+Neohunky&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"neohunky","files":2,"time":1212926280,"description":"With Sarkar Raj Ram Gopal Varma has redeemed himself. The camera work is fantastic. Cinematographer&amp;#039;s use of light and specially sunlight is fabulous. At times you actually visualize that chess pieces are moving on a chess board of Politics \n\nThe story begins with plans of building a huge power plant in Maharashtra which will displace around 40,000 people. Subhash Nagre (Amithabh) initially opposes the project because earning the err of people in the area, but his son Shankar (Abhishek) convinces him to take tough decisions for the betterment of the public in the long term.\n\nWith this the duo and Anita (Aishwarya) the CEO of the project move to the interiors of Maharashtra to explain the benefits of the project to the general Public. For this they also rope in Subhash Nagre&amp;#039;s old teacher in Politics Rao Saheb (Dilip Prabhavalkar) But just as things start moving up Rao Saheb&amp;#039;s Grandson Sanjay Somji (Rajesh Shringarpore)opposes the project as it would only benefit Bombay at the price of local farmers. Seeing the opposition in Maharashtra Kantilal Vora (Upendra Limaye) wants to shift the project to Gujarat, much to the dismay of Shankar.\n\nA stage is set for a power struggle between the have&amp;#039;s and the have not&amp;#039;s. Will Shankar be able to keep the power project in Maharashtra, will he be able to keep his credibility with masses or will he have to back down.\n","torrent":{"xt":"urn:btih:d134be2997e6653251ab90473e5e1af4c5f446cf","amp;dn":"Sarkar+Raj+%7BBollywood+movie%7D+Neohunky","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d134be2997e6653251ab90473e5e1af4c5f446cf","infoHashBuffer":{"type":"Buffer","data":[209,52,190,41,151,230,101,50,81,171,144,71,62,94,26,244,197,244,70,207]},"announce":[],"urlList":[]}}