{"title":"Men in Trees S01E12 - Liebes-Chaos (German)","uid":4064725,"size":408762368,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d1515bfc18c48fd59053162ef650e4ff9a72735b&amp;dn=Men+in+Trees+S01E12+-+Liebes-Chaos+%28German%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gwodus","files":1,"time":1204749213,"description":"Rip: TV Rip\nFormat: AVI XviD\nResolution: 624 x 352\nLanguage: German &amp; English Track\n\nKurzbeschreibung:\nNachdem Jack Marin seine Liebe gestanden hat, ist sie gluecklich und verwirrt zugleich. Eigentlich wollten sich beide endlich zu einem romantischen Date treffen. Doch Jack vertroestet Marin immer wieder, weil seine Exfreundin Lynn bei ihm zu Besuch ist. Lynn war ueberraschend in Elmo aufgetaucht: Sie ist schwanger von einem anderen Mann und wollte eigentlich in Vancouver ein neues Leben beginnen. Nach einer relativ kurzen Zeit der Ausschweifungen und des freien Lebens bekam sie jedoch Sehnsucht, wieder nach Elmo zurueckzukehren und ihrem Kind eine gute Mutter zu sein. Jack - anfaenglich nicht begeistert von Lynns Erscheinen - ist ploetzlich von seinen eigenen Gefuehlen irritiert, als es zwischen Lynn und ihm zu einer zaertlichen Begegnung kommt, die mit einem innigen Kuss endet...\n\nCelia ist genervt. Sie wird innerhalb weniger Monate drei Mal von ihrem Vorgesetzten Richard Ellis ueberprueft. Zunaechst bemerkt sie nicht, was hinter der scheinbaren Schikane steckt. Erst als es Richard gelingt, seine Verliebtheit zu zeigen, begreift sie sein Verhalten. Obwohl Celia sich ebenfalls zu Richard hingezogen fuehlt, hat sie grosse Schwierigkeiten, diese Gefuehle zuzulassen - auch, weil sie so lange allein war. Sie redet sich ein, dass es in ihrem Leben keinen Platz fuer einen neuen Mann gibt, zumal sie erst vor kurzem Patrick zurueck zu sich nach Hause geholt hat. Patrick hingegen ist krank vor Sehnsucht nach Annie und begeistert von einem Mann in der Naehe seiner Mutter...\n","torrent":{"xt":"urn:btih:d1515bfc18c48fd59053162ef650e4ff9a72735b","amp;dn":"Men+in+Trees+S01E12+-+Liebes-Chaos+%28German%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d1515bfc18c48fd59053162ef650e4ff9a72735b","infoHashBuffer":{"type":"Buffer","data":[209,81,91,252,24,196,143,213,144,83,22,46,246,80,228,255,154,114,115,91]},"announce":[],"urlList":[]}}