{"title":"Daredevil (R-Rated Director's Cut) (2003) [RePoPo] [PS3]","uid":4240628,"size":1397657809,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:d25530908e07b650dec838991a8d51df9e9c71f3&amp;dn=Daredevil+%28R-Rated+Director%5C%27s+Cut%29+%282003%29+%5BRePoPo%5D+%5BPS3%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"repopo","files":8,"time":1213525906,"description":"*******************************************************************************\n                      Daredevil (R-Rated Director's Cut)\n*******************************************************************************\n\nTHIS IS A PS3-COMPATIBLE MOVIE.  Subtitles are only useful for a PC.\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\nType.................: Movie\nContainer file.......: MP4\nVideo Format.........: MPEG-4 AVC (Playstation 3 Compatible)\nTotal Bitrate........: 1456Kbps\nAudio format.........: AAC (Playstation 3 Compatible)\nAudio Languages......: English 5.1\nSubtitles Ripped.....: English, Spanish\nSubtitles in Subpack.: English, Spanish, Director's commentary in Spanish\nResolution...........: 672x288\nAspect Ratio.........: 2.35:1\nFPS..................: 25.000\nSource...............: Anamorphic DVD\nDuration.............: 02:07:40\nOriginal Format......: DVD PAL\nGenre................: Action\nIMDb Rating..........: 5.5\nMovie Information....: http://www.imdb.com/title/tt0287978/\nFilmaffinity.........: http://www.filmaffinity.com/en/film749632.html\nAllmovie.............:\n\n\nPS: If you don't like a codec/container used here.  Dont' be a pussy.  \nDo your own rip.\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\nCOUNTRY:                United States\nDIRECTOR:               Mark Steven Johnson\nSCREENWRITER:           Mark Steven Johnson (Comic: Stan Lee)\nCOMPOSER:               Graeme Revell\nCINEMATOGRAPHER:        Ericson Core\nCAST:                   Ben Affleck, Jennifer Garner, Michael Clarke Duncan, \n                        Colin Farrell, Joe Pantoliano, Jon Favreau, David Keith, \n                        Scott Terra, Kevin Smith\nSTUDIO/PRODUCER:        20th Century Fox\nOFFICIAL WEB:          \nGENRE:                  Fantasy / Action\n\n\nOne of Marvel Comics' most popular characters comes to the screen for the first \ntime in this sci-fi action-thriller. Matthew Murdock (Ben Affleck) is a lawyer \nwhose father, a prizefighter, was killed by gangsters when Murdock was just a \nboy. Since then, Murdock has devoted his life to bringing wrongdoers to justice \nand is willing to help others by taking on cases no other attorney will touch. \nMurdock is also blind, after being struck down by a truck while trying to save a \nman from being hit. What no one knows is that Murdock was also doused with an \nunusual radioactive isotope which had a strange effect on him -- while Murdock's \nsight may be gone, his other senses have been raised to such a keen pitch that \nthey act like radar, allowing him to tell where he's going and what happens \naround him, both near and far away. Murdock puts his gifts to use at night as \nthe costumed crime-fighter Daredevil, whose pursuit of justice has earned him \nthe wrath of underworld leader Kingpin (Michael Clarke Duncan). Kingpin wants \nDaredevil out of his way once and for all, and hires Bullseye (Colin Farrell), a \nsuper-assassin with an uncanny ability to throw blades, to do the job. Daredevil \nalso makes the acquaintance of Elektra Natchios (Jennifer Garner), a woman with \nsuper-heroic talents who is also on Kingpin's bad side, though it remains to be \nseen if she has aligned herself with the forces of good as Daredevil has done. \nJon Favreau, Joe Pantoliano, and David Keith highlight Daredevil's supporting \ncast.\n\nAccording to IMDB: \n\nThe R-rated director's cut contains 30 minutes of extra footage. In addition to \nthe added material, some footage was removed. The following is a list of the \nchanges between the PG-13 and R rated versions:\n\n    * The confession booth scenes between Father Steven and Matt Murdock have \nbeen removed.\n    * The love scene between Elektra and Matt Murdock has also been removed.\n    * A flashback scene where young Matt is seen with his adopted mother \nfeatured in the comic books.\n    * There are more scenes involving The Kingpin at his most vicious, at point \nkilling two of his own bodyguards by breaking their necks.\n    * The introduction of Bullseye arriving at the airport and going through a \nmetal detector.\n    * The fight scene in the playground with Matt and Elektra is longer.\n    * The scene in the bar where Daredevil takes out the bikers is longer and \nmore violent.\n    * An exchange during the Natchios' party where Foggy and Wesley have a \nverbal exchange, that ends by Foggy saying &quot;What a dick.&quot;\n    * The scene where Matt returns from his battle in the opening of the film, \nhe is seen in his apartment pouring Epsom salt into the water of his coffin and \nas he is about to lay down he starts to hear noises and sounds from the outside \nworld as far as seeing a woman crawling on the floor and ends by him laying down \ninside the coffin and the top sealing.\n    * The subplot involving the character of Daunte Jackson (Coolio) who is \naccused of a murder is reintroduced in it's entirety with Matt Murdock and Foggy \nNelson defending him.\n    * Matt and Foggy break into the apartment of Lisa Tazio, the murder victim \nin the Daunte Jackson trial and finding a clue.\n    * A late night scene where Foggy is working at the office trying to figure \nout the clue found in Tazio's apartment in which Karen (Ellen Pompeo) discovers \nthe answer.\n    * The scene in the morgue with Ben Urich and Kirby is longer in which Foggy \nends up calling him on his cell phone and telling him about who murdered his \ninformant from the clue that Matt had found in the murder victim's apartment.\n    * More scenes between Matt and Ben discussing some personal issues.\n    * Matt interrogating a corrupt police officer played by Jude Cicolella by \nsmashing his car in a parking lot.\n    * The scene where Bullseye demands his own costume is restored to &quot;I want a \nfucking costume&quot; as opposed to the theatrical version where he says &quot;I want a \nbloody costume&quot;\n    * The fight between Elektra and Bullseye is longer and ends with Bullseye \ngiving her a kiss before he throws her onto the roof of the adjacent building.\n    * The final confrontation between Daredevil and The Kingpin is longer and \nmore brutal.\n    * During the finale, Daunte Jackson celebrates his acquittal by hugging \nFoggy on the steps of the courthouse as Matt looks on and the scene shifts with \nMatt walking by the church where he sees father Steven after the afternoon mass \nhad ended.\n-------------------------------------------------------------------------------","torrent":{"xt":"urn:btih:d25530908e07b650dec838991a8d51df9e9c71f3","amp;dn":"Daredevil+%28R-Rated+Director%5C%27s+Cut%29+%282003%29+%5BRePoPo%5D+%5BPS3%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d25530908e07b650dec838991a8d51df9e9c71f3","infoHashBuffer":{"type":"Buffer","data":[210,85,48,144,142,7,182,80,222,200,56,153,26,141,81,223,158,156,113,243]},"announce":[],"urlList":[]}}