{"title":"FSX AlfaFly Moscow Vnukovo","uid":4087891,"size":377238633,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d3192df2670989f574f6cc9be65e7877f9078eba&amp;dn=FSX+AlfaFly+Moscow+Vnukovo&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"CRACKISH","files":1,"time":1205918358,"description":"Pure X Code! \n\nVnukovo Mailin is 100% developed by using advanced technologies that are specified for FSX. We have an improbably shaking level of realism, which will submerge you into the atmosphere of the real Vnukovo! Sparks from gears, water contaminated taxiways, light snow drift on aprons, terminals and? even glasses on cars, which are shining with realistic dynamic reflections, patches of lights on lighting masts (their light is and wonderful sight during the night), detailed relief surfaces in the airport area and ideal shadows - it is just some examples on the huge amount of different technologies that are waiting for you in Vnukovo Mailin!\n\nUltraprecise Animated Jetways \n\nForget about installation of COM1/2 or NAV1/2 frequencies ? it?s impossible to remember them! And millimeter accuracy of your parking position ? it?s all behind our time! New jetways in Vnukovo Mailin will accurate drive to an exit of absolutely every aircraft, even if its an unexciting type. But it isn?t all ? to call the trap - enter Ctrl+J on your keyboard, and then it will automatically drive to your plane. The place of your aircraft doesn?t figure at all. The jetway will find the exit of your aircraft itself. Even if your aircraft isn?t holding on the yellow centerline.\n\nAmazing Clearness of Earth \n\nYou can even see dogs on it, as resolution of this unique 4-season photo terrain is equal to 50 cm on a single pixel! The terrain fits with the default terrains in FSX, again, thanks to the new technologies, and also blend-maps, that are making it possible to have extremely smooth transition layers on terrain borders! As we used only certified methods of development - our scenery is absolutely free of any forms of bugs, lags, etc. The phototerrain doesn?t flicks, it rejects real shadows and brightly pleases a nice look over the Vnukovo Airport \n\nPerfection of Technology \n\nFSX states the most hard-core standards of quality, and only the best sceneries have conformities with those high standards. We made a large amount of deep and detailed investigations of the whole FSX structure, at the moment are we stating the absolute conformity to those high standards ? from various methods of effect night textures imposing to the apron light system. Vnukovo Mailin works completely equally and faultlessly with all versions of FSX, supports the variations of 9-th and 10-th DirectX. Thus, owing to intellectual technology of displaying ? the scenery maintains the highest average FPS compared with other pay/free sceneries!\n\nAnimated Fuel Tankers \n\nBy pressing on two buttons, Shift+F, Vnukovo Mailin will immediately get a signal to send an tanker to your aircraft (even on an random stand!), the tanker will arrive on a special marked way itself, and will fill the volume of fuel, that you had chosen. But that?s not all! Unique technology &quot;Living World!&quot; forces the tanker, as well as all other technical services to work even in VATSIM and also serve AI-planes. Prepare for wait time! There many planes, but a few amount of fuel trucks!\n\nIdeally Exact Towers \n\nVnukovo Mailin is filled with special towers, which will hasten to a forward rack of your plane, you just need to press Shift-P, will the trucker cling to the forward (nose) gear and will tow off there, where it?s necessary to you! All is completely animated and works smoothly with your aircraft, as with the AI-traffic!\n\nLuggage Loaders \n\nYou will note believe it as you read it, but they don?t just find all cargo hatches of your aircraft (type of ACFT isn?t important), but they will also approach themselves to the hatches, without any actions from your side. It&amp;#039;s enough to just open those hatches. The special animated conveyor machine will automatically lift the moving tape directly to the hatch, and after a couple of seconds will a tractor arrive, full of luggage! Its impossible to believe in it... But depending of the luggage volume, the tractor can make several tours to the terminal during loading process of your aircraft!\n\nMaximum Realism \n\nVnukovo ? the most complicated airport of the Moscow ? its because the non-stopping reconstruction is going on, an presidential (government) terminal + the base for the Russian government aircraft is at the Vnukovo. All these factors make it difficult to find any materials about the airport. And nevertheless, for development of Vnukovo Mailin we got an amount of exclusive photos of apron and airport from inside. Owing to which it was possible for us to recreate this unbelievable complicated, but also really cozy port into the world of FS! All parking stands are at their real places at the moment of Vnukovo Mailin release, as they were placed with help of internal Vnukovo drawings, which was approved by the whole management of the airport ? with help of contacts, we managed to get those drawings ? all off it for realism!\n\nLiving Airport! \n\nUncountable amount of animating cars are driving around the airport the day/night around, and not just for &quot;drive&quot;, but they are driving every time on a new route, fulfilling all theirs functions, meanwhile cooperating with the rest of the airport  Those are fuel tankers, vehicles with luggage, catering services, special/government services (FSB, FSO ? Russian presidential guard), fire and rescue services, loaders, towers, vehicles with electrical equipment and many other! Each vehicle is ready to serve! And not only you, but also the AI-traffic! Some says that its so realistic, that if you land without landing gear out, the whole fire and rescue service of the airport will be alarmed and will be at your landing place (or where your aircraft is standing).\n\nBirds \n\nA grasping realistic detail ? a hundred of living, animated birds, flitting the sky over the Vnukovo Mailin! Each bird flies on an individual route, meanwhile they will soar highly up to the clouds, then they will fall to the cockpit of your aircraft  As it states, the birds aren?t dangerous for the air-traffic in the FS, and they are not prevent the flights!\n\n------------------------------------------------------------------------------------\n\nAnd my music:\n\n1. http://thepiratebay.se/tor/4016573\n\n2. http://thepiratebay.se/tor/4037285","torrent":{"xt":"urn:btih:d3192df2670989f574f6cc9be65e7877f9078eba","amp;dn":"FSX+AlfaFly+Moscow+Vnukovo","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3192df2670989f574f6cc9be65e7877f9078eba","infoHashBuffer":{"type":"Buffer","data":[211,25,45,242,103,9,137,245,116,246,204,155,230,94,120,119,249,7,142,186]},"announce":[],"urlList":[]}}