{"title":"Hold Me Close - Megan Hart","uid":12831154,"size":606648,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d31f07c1b68b2f3f83b8f25a0594edc3e4ad1a46&amp;dn=Hold+Me+Close+-+Megan+Hart&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Mohammad_AT","files":3,"time":1448398056,"description":"Apart, they are broken, but together, they are whole \r\n\r\nEffie and Heath are famous. Not for anything they did, but for what happened to them as teenagers. Abducted and abused by the same man, they turned to each other for comfort until they were finally able to make their escape. \r\n\r\nNow adults, their relationship is fraught with guilt and despair. Whether fighting or making love, their passion is strong enough to destroy them both—and Effie's not about to let that happen. She knows it's time for her to have a &quot;normal&quot; relationship, and Heath is nothing but a constant reminder of the dark past they share. Heath, on the other hand, knows Effie is the only woman he can ever love. She may want to forget what happened, but he's convinced that they must face their past together in order to move forward. So while Effie continues to bring new men into her life, Heath becomes obsessed with proving he's the one she needs. \r\n\r\nThen a new crisis arises and Effie begins to lose every scrap of self-control she ever had. As she struggles against her desire to return to the one man who understands her, she discovers that sometimes the only safety you find is with the person who is the most dangerous for you","torrent":{"xt":"urn:btih:d31f07c1b68b2f3f83b8f25a0594edc3e4ad1a46","amp;dn":"Hold+Me+Close+-+Megan+Hart","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d31f07c1b68b2f3f83b8f25a0594edc3e4ad1a46","infoHashBuffer":{"type":"Buffer","data":[211,31,7,193,182,139,47,63,131,184,242,90,5,148,237,195,228,173,26,70]},"announce":[],"urlList":[]}}