{"title":"jPod 1x03 [HDTV DUAL][seriesani.]","uid":4241034,"size":427528192,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d325a1d8b380374fd8eb372a15a8152c7fb1f325&amp;dn=jPod+1x03+%5BHDTV+DUAL%5D%5Bseriesani.%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"seriesani","files":1,"time":1213545818,"description":"FICHA T?CNICA SERIE\nT?tulo: jPod\nA?o de producci?n: 2008\nTemporadas: 1 (En emisi?n)\nCap?tulos: 13\nArgumento: JPod es una serie canadiense basada en el bestseller del mismo nombre creada por el escritor Douglas Coupland. Fue ?l mismo quien populariz? el t?rmino &quot;Generaci?n X&quot; all? por 1991 y quien se embarc? en el proyecto de la serie colaborando directamente en la elaboraci?n de sus guiones.\n\nSeis programadores inform?ticos, cuyos apellidos comienzan por J, trabajan en unos cub?culos (pods) apodados jPod dentro de una gran compa??a de dise?o de videojuegos en Vancouver. De entre este grupo de personajes de vida opaca y sin atisbo de personalidad, &quot;tarados emocionales&quot; como se autocalifican ellos mismos, destaca Ethan Jarlewski, un treinta?ero que no sabe muy bien cu?l es su funci?n dentro de la empresa pero que tiene como objetivo escalar posiciones, tarea en la que le retendr?n una madre soci?pata, un hermano traficante de inmigrantes, un padre aspirante a un papel de actor con di?logo y una serie de incidentes absurdos en los que se ver? involucrado.\n\nEthan Jarlewski trabaja en una empresa de videojuegos (previsiblemente Electronic Arts) y por alguna extra?a peculiaridad del programa que utilizan el departamento de recursos humanos para adjudicar los puestos de trabajo ?l y todos los empleados de la empresa cuyo apellido empieza por J acaban sentados en el mismo grupo de cub?culos, al que han bautizado jPod.\n\nAll? se dedican a procrastinar de forma absolutamente profesional su trabajo inventando juegos, a menudo juegos matem?ticos, o en su defecto desaf?os que resolver usando Google -que es casi un protagonista m?s del libro de tanto que sale-, y excusas para hacer cualquier cosa menos trabajar, esperando s?lo el pr?ximo d?a de pago y que nadie les moleste demasiado, preocupados fundamentalmente de satisfacer sus deseos sin importarles demasiado cosas como que eso est? bien o no.\n\nCada uno tiene sus peculiaridades, que van desde una necesidad absoluta de pasar desapercibido de John Doe (es su nuevo nombre, antes ten?a un apellido que empezaba por J), a la de acostarse con pr?cticamente todos los hombres que conoce, pero s?lo una vez, de Bree, pasando por la man?a de Mark de que todo lo que haya en su cub?culo sea comestible, incluida la grapadora.\n\nAdem?s de esto, Ethan tiene que lidiar con su peculiar familia, compuesta por una madre enamoradiza que cultiva marihuana en el s?tano de la casa familiar, un padre actor frustrado desesperado por conseguir un papel en el que por fin le den una frase, y un hermano dedicado a negocios de dudosa legalidad, lo que le llevar?, entre otras cosas, a tener que ayudar a su madre a deshacerse del cad?ver de un motero al que asesin? ?por accidente? o a tener albergados en su casa un mont?n de inmigrantes ilegales chinos durante un tiempo.\n\nProductora: I&amp;#039;m Feeling Lucky Productions\nReparto: David Kopp (Ethan Jarlewski), Emilie Ullerup (Kaitlin Joyce), Steph Song (Brianna &quot;Bree&quot; Jyang), Ben Ayres (Casper &quot;Cowboy&quot; Jesperson), Torrance Coombs (John Doe), Colin Cunningham (Steve Lefkowitz), Sherry Miller (Carol Jarlewski), Alan Thicke (Jim Jarlewski)\nNacionalidad: Canad?\n\nFICHA T?CNICA RIPEO\nTemporada: Primera\nCap?tulos: 13\nTama?o cap?tulos: 405 MB (aproximadamente)\nDuraci?n: 45 minutos por cap?tulo\nCodecs: XviD (Video) mp3-CBR (Audio)\nRipeo: HDTV+DVB (Buzz)\nIdioma: Espa?ol 192 kb/s-Ingl?s 128 kb/s\nFormato: 16:9\nEncargados: Keane (Montaje) Marcelo (Captura Audio)","torrent":{"xt":"urn:btih:d325a1d8b380374fd8eb372a15a8152c7fb1f325","amp;dn":"jPod+1x03+%5BHDTV+DUAL%5D%5Bseriesani.%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d325a1d8b380374fd8eb372a15a8152c7fb1f325","infoHashBuffer":{"type":"Buffer","data":[211,37,161,216,179,128,55,79,216,235,55,42,21,168,21,44,127,177,243,37]},"announce":[],"urlList":[]}}