{"title":"Mark Twain Tonight DVDR files 1967 Hal Holbrook","uid":4117386,"size":3350620540,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:d3446f08d3d9f8fa83dcb2df5743060c69ea6a17&amp;dn=Mark+Twain+Tonight+DVDR+files+1967+Hal+Holbrook&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":5,"uploader":"rambam1776","files":25,"time":1207381005,"description":"As promised earlier when I released this as a 700 mb AVI file, this is the DVDR copy of the film for purists and educators who want to use this in English classes.\n\nAnyone who just wants to watch it and has no interest in burning to DVD would be better advised to go to torrent\n &lt;a href=&quot; http://thepiratebay.se/tor/4116769/Mark_Twain_Tonight__Live_On_Broadway_1967_AVI_Hal_Holbrook&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://thepiratebay.se/tor/4116769/Mark_Twain_Tonight__Live_On_Broadway_1967_AVI_Hal_Holbrook&lt;/a&gt;  \n\nand just download the smaller version. There are no special features to the DVD. All information below is copied from the other torrent.\n\nRambam1776\n\n\nAnother Live On Broadway DVD. This is the origin of American Standup Comedy, folks. If you have not seen THIS man, you have never seen stand up.\n\nCome meet Mark Twain. OK, true, the humorist has been dead for more years than we care to remember, and not many of us around today were alive to hear what he sounded like. But Hal Holbrook is so spectacular in his one-man performance that you could swear you were listening to Twain himself. The gravelly voice, the lined face, the slow shuffle, and cigar-induced throat clearings seem so natural that you&amp;#039;ll have difficulty recognizing Holbrook beneath the white suit, the gray hair, and the handlebar mustache. \n\nMark Twain Tonight! began as a Broadway show in the 1960s and was filmed as a CBS special in 1967. Yet you&amp;#039;d never know it, because the humor, which is more than a century old, is still laugh-out-loud funny today. Twain--I mean, Holbrook--gives a monologue that is rambling, intelligent, and humorous as he culls together commentary from a variety of Twain sources. From dachshund hounds, politics, and patriotism to cigar smoking, memory loss, and religion, this 90-minute video leaps from subject to subject as we&amp;#039;re entertained by material that&amp;#039;s as fresh today as it was when it was written in the 1800s. --Jenny Brown \n\nReview\nBy the time Hal Holbrook made his big-screen debut in 1966&amp;#039;s The Group, a lot of people were curious to see what he really looked like. This is because the now-veteran actor had spent more than a dozen years under white hair and latex touring as Mark Twain in a one-man show that remains an institution. \nAlways a busy big-screen actor in subordinate roles, Holbrook is probably best known as Twain (an Emmy and a Tony all but cemented that status), but he also played Abraham Lincoln in a series of TV specials and in the miniseries North and South, John Adams in the miniseries George Washington and World War II Gen. George C. Marshall in the Emmy-winning Los Alamos drama Day One. \n\nHis other work on the small screen has been ubiquitous across the decades, from The Ed Sullivan Show in the &amp;#039;50s to Disneyland in the early &amp;#039;70s to The West Wing and The Sopranos. A Holbrook character can align with the forces of good (the kindly mentor type in Wall Street) or evil (he headed the conglomerate of shady lawyers in The Firm). But in terms of career benchmarks, the must-sees include Mark Twain Tonight! (1967, Kultur, unrated, $30): An American classic preserved. --Mike Clark, USA Today \n &lt;a href=&quot;\nhttp://www.amazon.com/Mark-Twain-Tonight-Hal-Holbrook/dp/B00003M5G9&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Mark-Twain-Tonight-Hal-Holbrook/dp/B00003M5G9&lt;/a&gt;\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0204468/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0204468/&lt;/a&gt;\n\nChapter 01 ? Program Start\nChapter 02 ? Whiskey Train Long Dog\nChapter 03 ? Smoke Rings\nChapter 04 ? Half a Gallon\nChapter 05 ? The Water Closet\nChapter 06 ? Reporter &amp; Congress\nChapter 07 ? Grandfathers Old Ram\nChapter 08 ? A Hymn Book\nChapter 09 ? The Silent Lie\nChapter 10 ? Huck &amp; Jim\nChapter 11 ? Lower Than The Angels\nChapter 12 - Lynching\nChapter 13 ? The Creators Pet\nChapter 14 ? Ghost Story (Golden Arm)\nChapter 15 ? Hannibal Boyhood\nChapter 16 ? Piloting At Sunrise\nChapter 17 ? Gold Rush\nChapter 18 ? 70th Escape &amp; Satan\nChapter 19 ? Mary Ann\nChapter 20 ? End Credits\n\n\n","torrent":{"xt":"urn:btih:d3446f08d3d9f8fa83dcb2df5743060c69ea6a17","amp;dn":"Mark+Twain+Tonight+DVDR+files+1967+Hal+Holbrook","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d3446f08d3d9f8fa83dcb2df5743060c69ea6a17","infoHashBuffer":{"type":"Buffer","data":[211,68,111,8,211,217,248,250,131,220,178,223,87,67,6,12,105,234,106,23]},"announce":[],"urlList":[]}}