{"title":"Arrested Development Season 2","uid":4232149,"size":3321712640,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d4f4f5c7afcef4b71bfbb1f3dc2dadcbd37f19cd&amp;dn=Arrested+Development+Season+2+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"hateedge","files":1,"time":1213112188,"description":"ARRESTED DEVELOPMENT \n\nSEASON 2\n\n(EXTRACT ISO., VIDEO IN AVI.)\n\n Amazon.com\nThe axe of cancellation dangled perilously over Arrested Development during its second season, but the award-winning comedy fought against fate to deliver a hilarious if scattershot 18 episodes (reduced from the original show order of 22), and stayed alive for the beginning of a third season. Most likely, the creators and actors knew the clock was ticking down, so they didn&amp;#039;t hesitate to throw their all into these manic, hilarious episodes, which have only the thinnest of plot arcs but an electrifying energy that makes them hard to resist. Some of the story antics were more of the same: good son Michael (Jason Bateman) tries to keep his company afloat, but is often foiled by older brother Gob (Will Arnett); the precarious marriage of Lindsay (Portia de Rossi) and Tobias (David Cross) undergoes a trial separation; and young George-Michael (Michael Cera) fights his attraction to his cousin Maeby (Alia Shawkat). Other show developments, though, were new and stunningly, uproariously bizarre: Buster (Tony Hale) joins the army, but later finds his hand bitten off by a seal (yes, a real seal), and Oscar (Jeffrey Tambor), the hippie brother of jailed George Sr. (also Tambor), rekindles an affair with sister-in-law Lucille (Jessica Walter), which may have resulted in Buster&amp;#039;s conception years ago.\n\nJokes flew fast and furious, as did guest stars--Ben Stiller, Julia Louis-Dreyfuss, Christine Taylor, Thomas Jane, Ed Begley Jr., Ione Skye, and Zach Braff among them--making it hard to keep straight who was doing what and why. No matter, as each of the episodes was in and of itself was a perfect gem of comedy, strung together by sharp writing and fantastic performances. In addition to the regular cast, both Liza Minnelli, reprising her role as &quot;Lucille Two,&quot; and Martin Short, as an, um, eccentric family friend, deserve special mention, with the episode both appeared in, &quot;Ready, Aim, Marry Me,&quot; a frenetic exercise in slapstick farce. Typical examples of the show&amp;#039;s offbeat humor were found in &quot;Afternoon Delight,&quot; in which various members of the Bluth family discover the true meaning of the &amp;#039;70s ballad, &quot;Meet the Veals,&quot; wherein the Bluths encounter the conservative parents of George Michael&amp;#039;s girlfriend, and &quot;Motherboy XXX,&quot; surrounding an unsettling mother-son traditional dance. The entire cast cohered perfectly through this season, and their give and take provided a perfect balance among the actors, all of whom were even better than the previous year. However, it&amp;#039;s Bateman who should be singled out as the show&amp;#039;s anchor, mixing dry sarcasm with impeccable comic timing. Despite plummeting ratings, Arrested Development didn&amp;#039;t just keep its head above water, it swam with grace and hilarity. --Mark Englehart\n\nProduct Description\nIn this 5 time EmmyÃ‚Â®-winning comedy&amp;#039;s hilarious second season, Michael Bluth, once again determined to be free of his dysfunctional family, packs up the car and his son George-Michael and heads for Arizona. But he&amp;#039;s soon pulled over by the police who tell him that his father, George Sr., has broken out of prison. Due to the company&amp;#039;s shady business deal with Iraq, Michael could face prison time, so he returns home to clear his name even as George Sr. secretly flees to Mexico, Tobias decides to be an understudy for the Blue Man Group, and Lucille begins a torrid affair with her husband&amp;#039;s twin brother, Oscar. Arrested Development Season 3 will begin airing this fall on FOX. ","torrent":{"xt":"urn:btih:d4f4f5c7afcef4b71bfbb1f3dc2dadcbd37f19cd","amp;dn":"Arrested+Development+Season+2+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d4f4f5c7afcef4b71bfbb1f3dc2dadcbd37f19cd","infoHashBuffer":{"type":"Buffer","data":[212,244,245,199,175,206,244,183,27,251,177,243,220,45,173,203,211,127,25,205]},"announce":[],"urlList":[]}}