{"title":"AntiARP v5.0.1 The Ultimate way to a secure network connection +","uid":4208327,"size":6950563,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d64f9edf493c4db061bbf64c7627f0686b43ea6f&amp;dn=AntiARP+v5.0.1+The+Ultimate+way+to+a+secure+network+connection+%2B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cccgeek","files":1,"time":1211922699,"description":"The main features of AntiARP:\n\n1. Intercept incoming ARP attack. Intercept incoming spurious ARP packets in OS kernel to protect system to ensure a correct local ARP cache table.\n2. Intercept outgoing ARP attack. Intercept outgoing spurious ARP packets in OS kernel to reduce localhost&amp;#039;s attacking others after affecting malicious programs.\n3. Intercept IP conflict. Intercept ARP packets of Ip conflict in OS kernel to protect system from attack of IP conflict.\n4. Active defence. Actively keep communication with gateway and send the correct MAC address to gateway to keep smooth internet connection and communication security.\n\nBesides main features, there are AntiARP&amp;#039;s assistant features which will help in the use of main features. They are:\n1. Intelligent Defense. Can detect and react to the condition when only the gateway is being ARP spoofed.\n2. Trusted Route Monitor. Can detect and react to condition when only the gateway is being ARP spoofed.\n3. ARP viruses cleaner. Can locate the local viruses when the localhost has outgoing ARP attacks.\n4. Prevent Dos attack. Intercept outgoing spurious DoS data packet of TCP SYN/UDP/ICMP/ARP in OS kernel, note the position of programs which send Dos attack maliciously, and ensure smooth internet connection.\n5. Safety mode. Never response ARP request from other machine except gateway to have a hiding effect and reduce ARP attack.\n6. ARP flow analysis. Analyze all ARP packets localhost receives, monitor internet and find out potential attacker or infected machine.\n7. Monitor ARP cache table. Monitor and repair local ARP cache table automatically. If gateway&amp;#039;s MAC address changed by malicious programs is found, alarms will ring and the false address will be fixed automatically.\n8. Locate attacker. When the software is aware of attack, it will quickly locate the IP address of attacker.\n9. Protect System Time. Prevent the system time from being changed by hostile programs so that to prevent the invalidation of guarding softwares.\n10. IE startup page Protection. Prevent IE startup page being changed by hostile programs.\n11. ARP cache table protection. Prevent ARP cache table being changed by hostile programs.\n12. Self Protection. Prevent AntiARP itself being close by hostile programs.\n13. Detect network management software in Local network, like netcut, etc.\n\n\n***********************************************************************************************\nHow to install\n\n***********************\n# Run the setup file (antiarp5.0.1_eng)\n\nnote: while installing u will receive a message to close anti-virus apps , don&amp;#039;t worry about it\n\n*** the app will be re-installed every 15 days and here is how\n\n\n# copy the patch file (ArpTrial) to the app directory for example (C:\\Program Files\\ColorSoft\\AntiARP ) and run the patch\n# uninstall the app\n# Run the setup file (antiarp5.0.1_eng)","torrent":{"xt":"urn:btih:d64f9edf493c4db061bbf64c7627f0686b43ea6f","amp;dn":"AntiARP+v5.0.1+The+Ultimate+way+to+a+secure+network+connection+%2B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d64f9edf493c4db061bbf64c7627f0686b43ea6f","infoHashBuffer":{"type":"Buffer","data":[214,79,158,223,73,60,77,176,97,187,246,76,118,39,240,104,107,67,234,111]},"announce":[],"urlList":[]}}