{"title":"Hyperionics.Hypersnap-dx.v6.30.02.b9744-ENGiNE","uid":4176750,"size":7771520,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d7435f069869d0068e4c3e97b587005551f2abd1&amp;dn=Hyperionics.Hypersnap-dx.v6.30.02.b9744-ENGiNE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"slugger00001","files":3,"time":1210176368,"description":"\n\nHypersnap from company called Hyperionics is one of the best screen capturing applications on the market and group ENGiNE released a new beta build of this fine piece of software. I?ve been using Hypersnap for years and can?t really complain about anything so if you have to make screenshots from time to time and don?t really appreciate the PrintScreen button, get this app for sure.\n\nHyperSnap is the fastest and easiest way to take screen captures from Windows screen, and text capture (TextSnap?) from places where normal text copy is not possible. HyperSnap combines the power of a first-class screen capture application with an advanced image editing utility - wrapped into one easy-to-use tool!\n\n\nIt?s perfect for capturing images that you want to include in your Help system, online tutorials, manuals, training handouts, presentations, marketing materials, Web pages, emails and more. Use HyperSnap to quickly share a picture-perfect representation of anything on your screen.\n\nProduct features:\n\n    * New in ver. 6 TextSnap? feature to capture editable text from almost anywhere on the screen, when running under Windows 2000, XP, Vista or newer. Starting from ver. 6.10 can also capture tab-delimited data for easy paste into MS Excel.\n    * New &amp; powerful image capture, editing, annotation and manipulation tools.\n    * Snags also those difficult-to-grab screens from DirectX? and Glide? games.\n    * Image stamps, frames, drop shadow, free-hand capture, FTP server uploads, more!\n    * Automatic color substitution!\n    * Non-rectangular window capture!\n    * Button Capture - perfect for professional technical writers who need to snap and document dozens of buttons!\n    * Auto-scrolls and concurrently captures long web pages and other. documents, enabling it to grab more than is visible on the screen.\n    * Tightly integrates with the MS Windows clipboard to automate repetitive tasks - will even automatically PASTE capture images where needed!\n    * Automatically saves your captures to graphics files.\n    * Doubles as effective image viewer, format converter (over 20 image formats supported).\n\nRelease name: Hyperionics.Hypersnap-dx.v6.30.02.b9744-ENGiNE\nSize: 7.7 MB","torrent":{"xt":"urn:btih:d7435f069869d0068e4c3e97b587005551f2abd1","amp;dn":"Hyperionics.Hypersnap-dx.v6.30.02.b9744-ENGiNE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d7435f069869d0068e4c3e97b587005551f2abd1","infoHashBuffer":{"type":"Buffer","data":[215,67,95,6,152,105,208,6,142,76,62,151,181,135,0,85,81,242,171,209]},"announce":[],"urlList":[]}}