{"title":"Atomic Cannon 3.0","uid":4205460,"size":5012356,"categoryP":"games","categoryS":"handheld","magnet":"?xt=urn:btih:d75505ae81f22d55ac5872c4852c27e80c98aeb5&amp;dn=Atomic+Cannon+3.0&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zarape2","files":1,"time":1211772863,"description":"In Atomic Cannon you battle against computers or friends in 25 different environments.  Teams take turns aiming and firing at each other with 85 weapons of mass destruction including nuclear bombs.  Test your skills with this instant classic that is easy to learn but difficult to master.\n\nYour arsenal is outfitted with many types of weapons including guns, bombs, missiles, rockets, and nukes.  Some weapons create landmasses you can use to your tactical advantage to hide behind as cover.  The game includes numerous features to enhance game play, such as rockets producing smoke trails hat move in the wind, and nukes creating glowing radioactive fragments.  Each weapon has its own unique animation, explosion effect, and sound Effect.\n\nGame play is extended to infinite possibilities since each battle is unique and played on a randomly generated landscape in one of twenty-five environments.  You can choose how many human and computer players there are, how many tanks are on each team, how b of wind forces there are, when the wind will change, what type of land formation you battle on, and much more, there are thirty-one settings in total to tweak to your liking, each with several options.  The game also saves your total number of battles, shots, and high scores.  Atomic Cannon is sure to keep you entertained so download the demo and give it a try right now.","torrent":{"xt":"urn:btih:d75505ae81f22d55ac5872c4852c27e80c98aeb5","amp;dn":"Atomic+Cannon+3.0","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d75505ae81f22d55ac5872c4852c27e80c98aeb5","infoHashBuffer":{"type":"Buffer","data":[215,85,5,174,129,242,45,85,172,88,114,196,133,44,39,232,12,152,174,181]},"announce":[],"urlList":[]}}