{"title":"Len.and.Ainsleys.Big.Food.Adventure-S01-Complete--BBC-720p","uid":12854887,"size":7962289959,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:d76c6fd84d66114e1ad5c8b4d2ee47538f004b94&amp;dn=Len.and.Ainsleys.Big.Food.Adventure-S01-Complete--BBC-720p&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"uggauga","files":20,"time":1448658867,"description":"Len and Ainsley's Big Food Adventure\r\n\r\nBBC 2015 - 10 Episodes\r\n\r\nStrictly Judge Len Goodman has never eaten spaghetti or had a curry - now chef Ainsley Harriott is taking him around the country in a bid to educate his palate.\r\n \nhttp://www.bbc.co.uk/programmes/b06qgskq\r\n__________________________________________\r\n\r\nComplete 1st season\r\n\r\n1280x720 resolution - with subtitles - enjoy !!\r\n__________________________________________\r\n\r\nEpisode 1 of 10\r\nThe pair hit Manchester, where Len has his first taste of Chinese food and samples some Mexican mezcal. Ainsley heads to the kitchen and cooks a mouthwatering stir-fried beef inspired by the day's adventures.\r\n\r\nEpisode 2 of 10\r\nThe pair hit Bristol, where Len has his first taste of Jamaican food and samples some Spanish cold soup. Ainsley heads to the kitchen and cooks a dish inspired by his heritage.\r\n\r\nEpisode 3 of 10\r\nThe pair hit central London, where Len has his first taste of Middle Eastern food and samples some Peruvian ceviche. Ainsley heads to the kitchen and cooks a mouthwatering chicken shawarma inspired by the day's adventures.\r\n\r\nEpisode 4 of 10\r\nThe pair hit Birmingham, where Len has his first taste of Polish food and samples some Thai fish curry. Ainsley heads to the kitchen and cooks a mouthwatering dish inspired by the day's travels.\r\n\r\nEpisode 5 of 10\r\nThe pair hit east London, where Len has his first taste of Vietnamese food and goes back to his childhood with some Jewish delicacies.\r\nAinsley heads to the kitchen and cooks a mouthwatering dish inspired by the day's adventures.\r\n\r\nEpisode 6 of 10\r\nThe pair hit Bradford, where Len has his first taste of a Pakistani curry and samples some Latvian cuisine. Ainsley heads to the kitchen and cooks mouthwatering onion bhajis inspired by the day's adventures.\r\n\r\nEpisode 7 of 10\r\nThe pair hit Leicester, where Len has his first ever Indian curry and samples some Greek cuisine. Ainsley heads to the kitchen and cooks some mouthwatering spiced fish cakes inspired by the day's adventures.\r\n\r\nEpisode 8 of 10\r\nThe pair hit the suburbs of London, where Len has his first taste of Korean barbecue food and samples some Swedish cuisine. Ainsley heads to the kitchen and cooks a mouthwatering salmon and mango salad inspired by the day's adventures.\r\n\r\nEpisode 9 of 10\r\nThe pair hit Cardiff, where Len has his first taste of spaghetti and samples some German hospitality. Ainsley heads to the kitchen and cooks a mouthwatering Italian dish inspired by the day's adventures.\r\n\r\nEpisode 10 of 10\r\nThe pair hit south London, where Len has his first taste of Portuguese and Japanese cuisine. Ainsley heads to the kitchen and cooks a mouthwatering Portuguese chicken inspired by the day's adventures","torrent":{"xt":"urn:btih:d76c6fd84d66114e1ad5c8b4d2ee47538f004b94","amp;dn":"Len.and.Ainsleys.Big.Food.Adventure-S01-Complete--BBC-720p","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d76c6fd84d66114e1ad5c8b4d2ee47538f004b94","infoHashBuffer":{"type":"Buffer","data":[215,108,111,216,77,102,17,78,26,213,200,180,210,238,71,83,143,0,75,148]},"announce":[],"urlList":[]}}