{"title":"John Campbell ~ One Believer","uid":4072861,"size":122339301,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:d78d15fbf2b808f93dbf13ffc6a29241b626ee1e&amp;dn=John+Campbell+%7E+One+Believer&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gazzjazz","files":14,"time":1205107697,"description":"This album is a classic! Raw electric blues....somewhere between Kris Kristofferson and Buddy Guy.\nI&amp;#039;ve included scanned cover art, an AMG biography for the late John Campbell (d.1993).\nThis is the AMG review\n\nReview\tby Thom Jurek\n\nThe Elektra debut by the late bluesman John Campbell is a curious affair in more than one respect-despite it&amp;#039;s obvious excellence and original voice. The first is that he was signed at all. Clearly in 1990 when Campbell signed his deal, record company executives were still interested inn finding new and original talent and developing them over a period of time. One Believer was outside of virtually every trend on major labels and in pop at the time. Other than Chris Whitley&amp;#039;s Living with the Law, it was the only roots record issued on a major label in 1991. The other thing is that One Believer is an oddity even for Campbell. It&amp;#039;s a deeply atmospheric record full of subtle shimmering organs and warm guitar textures that accent the dreamy spooky side of the blues more than the crunchy stomp and roll that Campbell was known for in the clubs -- and displayed on his follow-up Howlin&amp;#039; Mercy. Tracks like &quot;Angel of Sorrow,&quot; &quot;World of Trouble,&quot; and &quot;Wild Streak&quot; offer shimmering ambient textures from which the blues emanate from the ether, tonally and melodically challenging all acceptable notions of what Texas blues should sound like -- but then, Mr. Campbell was living and working in New York and his music was certainly influenced by that late-night environment. These are beautiful songs, tempered in shadow and restraint while baring their teeth at all the right moments. Other places the roadhouse magic comes out of the closet as on &quot;Couldn&amp;#039;t Do Nothin&amp;#039;,&quot; &quot;Devil In My Closet,&quot; and &quot;Person to Person. On &quot;Voodoo Edge,&quot; the slowhand blues meets a crisscross New Orleans second-line backbeat a la Dr. John and comes up with chunky honky-tonk piano and shakers to give the piece an &quot;I Walk on Gilded Splinters feel, extending Campbell&amp;#039;s sound over a deeper, darker shade of roots music. This in underlined by the album&amp;#039;s last two tracks -- &quot;Take Me Down&quot; and the title track -- which are menacing in their conviction and creepy swampy in execution. This is a fine, fine debut that remains in print. \n\nthanks for seeding support\nGazza ","torrent":{"xt":"urn:btih:d78d15fbf2b808f93dbf13ffc6a29241b626ee1e","amp;dn":"John+Campbell+%7E+One+Believer","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d78d15fbf2b808f93dbf13ffc6a29241b626ee1e","infoHashBuffer":{"type":"Buffer","data":[215,141,21,251,242,184,8,249,61,191,19,255,198,162,146,65,182,38,238,30]},"announce":[],"urlList":[]}}