{"title":"Sanitarium PC Game with Fixes [Djabolic]","uid":4066197,"size":2116578480,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:d8581c99b538cd87d0b81c3d84ce59c0f8b93b33&amp;dn=Sanitarium+PC+Game+with+Fixes+%5BDjabolic%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DyingBlackSoul","files":5,"time":1204815686,"description":"SANITARIUM\n\nStruggling with inner demons, wrestling with soul-wrenching torment, battling to regain even a slippery grip on reality - doesn&amp;#039;t exactly sound like the makings of a good time, does it? All the more reason to marvel at Sanitarium, Dreamforge Intertainment&amp;#039;s wholly original and gripping adventure game, for these are the very keystones upon which this game is built. Simultaneously breathing hearty lungfuls of life into the tired adventure genre as well as the wheezy &quot;you are an amnesia victim&quot; premise, Sanitarium is the best non-comic adventure I&amp;#039;ve played since Realms of the Haunting.\n\nA brief movie featuring a horrific car crash, with you cast as the unlucky driver, opens the game. Your head completely swathed in bandages, you regain consciousness in a burning, Grand Guignol snake pit of an asylum. Surrounded by babbling lunatics bashing their heads bloody against the wall, your first order of business is to make your escape. After that, you&amp;#039;ll need to discover little things like, oh, your identity and how you came to be institutionalized.\n\nBroken into eight chapters, the entire game is a journey through your own madness to potential salvation. Chapters dealing with the unfolding mystery at the sanitarium are interspersed with segments set in the hallucinatory hells of your character&amp;#039;s tortured mind. These alternate, internal realities are the true high points of Sanitarium, covering such disparate ground as a devastated Aztec tribe, a Children of the Corn-style rural community, and a grotesque alien insect hive that practically oozes agony. The Freudian quotient is jacked up further as your madman takes on a different persona, such as a four-armed cyclops, for each setting. By ping-ponging from hallucination to reality and back again, Sanitarium puts you in the hospital slippers of its protagonist, wondering what is real, what is delusion. The ambiguity of the tattered memories and flashbacks triggered by game events will keep you guessing until the end.\n\nReflecting the internal conflicts and issues your character is grappling with, these worlds establish unique moods that drive the story of the game forward. Particularly effective is the sequence where you wander your childhood home, rendered in washed-out sepia, and observe the specters of your family coping with monumental grief. These shifts in tone keep the game from getting boring and, more importantly, engage you emotionally as well.\n\nAs terrible as some of the subject matter is, the game is a delight to play, thanks to a simple mouse-driven interface controlling every aspect of gameplay, and some of the most lush, richly imagined graphics I&amp;#039;ve seen in a long time. Somehow, the designers of Sanitarium have found a way to make the horrendous beautiful - no mean feat considering the freaks, monsters, and gargoyles peopling the gameworld. Sound makes a solid contribution as well, further enhancing the game.\n\nPuzzles in Sanitarium are generally inventory-related and serve to push the unpredictable action of the story forward. There are some machine and lever puzzles, but, unlike Riven, they make sense and don&amp;#039;t annoy you to death. A few brief action sequences punctuate play, but they don&amp;#039;t present much of an obstacle - even if you die you are immediately reborn to fight again without penalty. If there&amp;#039;s a real knock against the puzzles in the game, it is that many of them are pretty easy. After one night of play I was already into the second of three CD-ROMs. More experienced gamers will probably breeze through Sanitarium in short time - but the gaming experience is so rewarding it isn&amp;#039;t a wasted effort.\n\nUnfortunately, initial shipments of Sanitarium have hit shelves with a heinous bug. It&amp;#039;s possible to get totally locked out of buildings in Chapter Two, thus preventing you from progressing. What makes this worse is that you may not notice it for a while, thinking instead the game is telling you you&amp;#039;re done there. There&amp;#039;s already a patch at ASC&amp;#039;s web site, but because of the nature of the bug, you&amp;#039;ll still have to start the game from the beginning even after installing the patch. Hopefully, this will be fixed in later copies of the game. The same cannot be said of the spotty voice-acting - Sanitarium is pretty much stuck with uneven performances that run from very good to fairly bad. Sadly, one of the worst is the main character.\n\nStill, it&amp;#039;s hard not to recommend this game. Through its deft juggling of mood and story, Sanitarium creates one of the most compelling, involving adventures to grace a hard drive in a long time. As long as you&amp;#039;re not looking for a synapse-frying, brain-buster of a game, Sanitarium can&amp;#039;t be beat.\n\nby Robert Coffey, GameSpot","torrent":{"xt":"urn:btih:d8581c99b538cd87d0b81c3d84ce59c0f8b93b33","amp;dn":"Sanitarium+PC+Game+with+Fixes+%5BDjabolic%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8581c99b538cd87d0b81c3d84ce59c0f8b93b33","infoHashBuffer":{"type":"Buffer","data":[216,88,28,153,181,56,205,135,208,184,28,61,132,206,89,192,248,185,59,51]},"announce":[],"urlList":[]}}