{"title":"Frontline - Bad Voodoo's War (PBS TVrip)","uid":4235349,"size":696057856,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:d8955d474defb3e7b15e957262062571869a608b&amp;dn=Frontline+-+Bad+Voodoo%5C%27s+War+%28PBS+TVrip%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"maan1234","files":1,"time":1213279276,"description":"FRONTLINE goes to war in Iraq with a band of California-based National Guard soldiers who call themselves the &quot;Bad Voodoo Platoon&quot; to tell their very personal story in Bad Voodoo&amp;#039;s War. To record their war, from private reflections to real-time footage of improvised explosive device (IED) attacks on the ground, director Deborah Scranton (The War Tapes) creates a &quot;virtual embed,&quot; supplying cameras to the soldiers of the Bad Voodoo Platoon and working with them to shape an intimate portrait that reveals the hard grind of their war. Says Scranton: &quot;What compels me is telling a story from the inside out, to crawl inside their world with them to see what it looks like, feels like and smells like. It&amp;#039;s really important to give soldiers the chance to press their own record button on this war.&quot;\n\nThrough their daily experiences, acting platoon leader Sgt. 1st Class Toby Nunn, originally from British Columbia and the father of three, and Spc. Jason Shaw, a 23-year-old from Texas, give us a firsthand look at the impact of the U.S. military&amp;#039;s policy of multiple deployments to Iraq and how the Army&amp;#039;s role has changed on the ground.\n\nSpc. Shaw is on his third deployment to Iraq. After the invasion in 2003, he was awarded the Silver Star for valor during the battle for the Baghdad airport. Shaw volunteered for his third tour in Iraq, but is haunted by the loss of so many comrades during his earlier deployments. &quot;I&amp;#039;ve had six of my good friends die,&quot; he explains. &quot;When I lost all of my buddies, I just kind of lost hope. I used to be religious. My last deployment totally made me think otherwise. You know, you pray all the time to keep everybody safe, and then something happens.&quot;\n\nSgt. Nunn, responsible for the safety of the 30 men in his platoon, worries endlessly about their welfare. &quot;I&amp;#039;m worried about my guys,&quot; he confides to the camera one night. &quot;Right now I&amp;#039;m out here talking to you while they&amp;#039;re inside sleeping because I can&amp;#039;t sleep. Can&amp;#039;t rest, you know.&quot;\n\nMany of his men, highly trained veteran combat infantrymen, are deeply frustrated by their primary mission: providing security for convoys transporting supplies throughout Iraq to fuel President Bush&amp;#039;s surge. &quot;A lot of our guys don&amp;#039;t like this mission,&quot; says Nunn. &quot;We&amp;#039;re used to kicking in doors, taking the fight to the enemy. Now you&amp;#039;re driving on the road for hours and hours and hours and days, waiting to get blown up and not allowed to fight back.&quot;\n\nThe platoon is also struggling with a new relationship with the Iraqi security forces, whom the Americans depend on for their own safety. Nunn reflects: &quot;I told myself last time I wanted to train the Iraqis the best I possibly could, because it was my ticket home. ... But here I am, three years later, saying, &amp;#039;Will the Iraqi security forces enforce anything out there?&amp;#039; Every time I talk to these guys, you know, my trust meter isn&amp;#039;t reading in the green all the time.&quot; This constant second-guessing, combined with the relentless monotony of the desert highway, the fear of deadly IEDs and the memories of lost friends, keep the soldiers in an unending state of anxiety. This is Bad Voodoo&amp;#039;s war.\n\nEpisode Website: http://www.pbs.org/wgbh/pages/frontline/badvoodoo/\n\n==============================================================\nName.............: Frontline.BadVoodoosWar.xvid.avi\nFilesize..........: 663 MB (or 679,744 KB or 696,057,856 bytes)\nRuntime.........: 00:55:24 (99,626 fr)\nVideo Codec...: XviD\nVideo Bitrate...: 1516 kb/s\nFPS...............: 29.970\nAudio Codec...: 0x0055(MP3) ID&amp;#039;d as MPEG-1 Layer 3\nAudio Bitrate...: 150 kb/s (75/ch, stereo) VBR LAME3.97\nFrame Size.....: 640x368 (1.74:1) [=40:23]\nFrame Quality..: 0.215 bits/pixel","torrent":{"xt":"urn:btih:d8955d474defb3e7b15e957262062571869a608b","amp;dn":"Frontline+-+Bad+Voodoo%5C%27s+War+%28PBS+TVrip%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d8955d474defb3e7b15e957262062571869a608b","infoHashBuffer":{"type":"Buffer","data":[216,149,93,71,77,239,179,231,177,94,149,114,98,6,37,113,134,154,96,139]},"announce":[],"urlList":[]}}