{"title":"Demon Towers ShapeShifter Series 1 Bundle (Swirls and Twirls, Sp","uid":4228562,"size":1132095,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:d89800bf1051f171da7e8c77f2a0ac92cc8b8eb9&amp;dn=Demon+Towers+ShapeShifter+Series+1+Bundle+%28Swirls+and+Twirls%2C+Sp&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bluetshirt","files":1,"time":1212932766,"description":"\n\n\nDemon Towers ShapeShifter Series 1 Bundle (Swirls and Twirls, Speech Bubbles, Web Badges)\n\nShapeShifter Series 1 Bundle for Adobe Fireworks 8 and Adobe Fireworks CS3, is a collection of the first 3 ShapeShifter sets, including:\n\nSet 1: Swirls and Twirls \n\nShapeShifter Set 1 for Adobe Fireworks 8 and Adobe Fireworks CS3, is a great timesaving extension, which creates swirls within your canvas. Choose from a selection of 15 swirls and twirls, of different types and shapes!\nGreat for when you are in a rush, these swirly twirls are full Adobe Fireworks vector objects, which means once you add them to the canvas, you can break them apart, and make them any color you choose!\nGet this exciting new extension now, to add to your array of design tools within Adobe Fireworks 8 and Adobe Fireworks CS3!\n\n\nSet 2: Web 2.0 Speech Bubbles \nShapeShifter Set 2 for Adobe Fireworks 8 and Adobe Fireworks CS3, is a great timesaving extension, which creates Web 2.0 type speech bubble within your canvas. Choose from a  selection of 7 speech bubbles, of different types and shapes!\nGreat for when you are in a rush, these speech bubbles are full Adobe Fireworks vector objects, which means once you add them to the canvas, you can break them apart, and make them any color you choose!\nGet this exciting new extension now, to add to your array of design tools within Adobe Fireworks 8 and Adobe Fireworks CS3!\n\n\nSet 3: Web 2.0 Web Badges\nShapeShifter Set 3 for Adobe Fireworks 8 and Adobe Fireworks CS3, is a great timesaving extension, which creates Web 2.0 type badges within your canvas. Choose from a selection of 6 vector badges, of different types and shapes!\nGreat for when you are in a rush, these Web 2.0 badges are full Adobe Fireworks vector objects, which means once you add them to the canvas, you can break them apart, and make them any color you choose!\nGet this exciting new extension now, to add to your array of design tools within Adobe Fireworks 8 and Adobe Fireworks CS3! \n\n\tInstall:\n\n\t\t1) Unzip the archives\n\t\t2) Double click the .mxp files, which should launch Adobe Extensions Manager and automatically install the set. \n\n                   ( Alternately you can open Adobe Fireworks, click on Commands, click on Manage Extensions..., this will launch Adobe Extensions Manager, click on File, click on Install Extension and select one of the 3 files in this release. )\n\t\n\tUsage:\n\t\t1) In Fireworks, click on Commands, Click on Demon Towers and select a set.\n                  2) Click the shape you want.\n\n\n\n\n\n","torrent":{"xt":"urn:btih:d89800bf1051f171da7e8c77f2a0ac92cc8b8eb9","amp;dn":"Demon+Towers+ShapeShifter+Series+1+Bundle+%28Swirls+and+Twirls%2C+Sp","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d89800bf1051f171da7e8c77f2a0ac92cc8b8eb9","infoHashBuffer":{"type":"Buffer","data":[216,152,0,191,16,81,241,113,218,126,140,119,242,160,172,146,204,139,142,185]},"announce":[],"urlList":[]}}