{"title":"Glenn Beck's Fusion Magazine","uid":4084556,"size":62596855,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:d93d74f3e61db221e63d8499385ffa70c5141233&amp;dn=Glenn+Beck%5C%27s+Fusion+Magazine&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ta84","files":7,"time":1205734425,"description":"For those of you wondering what Glenn Beck&amp;#039;s Fusion magazine is all about, here it is! I&amp;#039;ve gone ahead and uploaded the following issues of Fusion: October 2007-March 2008. I know I wanted to preview several months of Fusion before I bought, yet there wasn&amp;#039;t any torrents before I subscribed. Now I&amp;#039;m putting these out there so you can see what its all about and then subscribe if you like it. Subscribe here: https://members.premiereinteractive.com/ows-img/glennbeck/pages/28585/41414.html. You will find that its a very funny yet serious magazine. Here&amp;#039;s a description of Fusion taken from GlennBeck.com....\n\nIf you were going to start a whole new division of a business you would probably conduct extensive research and product testing with surveys and focus groups, which would take many months. You&amp;#039;d hire analysts to dissect the market to find out if there was a need for your new product and only when that was all done would you actually start to develop and test it. Great! Now we know what you would do.\n\nWe, on the other hand, noticed one day in an airport that there really weren&amp;#039;t any smart and funny magazines. So we wrote one. No testing, no research and not a single focus group.\n\nEach issue, subscribers to Fusion can expect to get the latest perspective on what is happening in our world, coupled with my personal thoughts as &amp;#039;work in progress&amp;#039; as well as cutting edge comedy and satire. Believe us, this magazine is not the weekly standard and it may not be for everyone, but because we know that, those that do enjoy it are going to LOVE IT.\n\nIt is our sincere hope that you are one of those people.\n\nENJOY AND SEED!","torrent":{"xt":"urn:btih:d93d74f3e61db221e63d8499385ffa70c5141233","amp;dn":"Glenn+Beck%5C%27s+Fusion+Magazine","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"d93d74f3e61db221e63d8499385ffa70c5141233","infoHashBuffer":{"type":"Buffer","data":[217,61,116,243,230,29,178,33,230,61,132,153,56,95,250,112,197,20,18,51]},"announce":[],"urlList":[]}}