{"title":"Coast to Coast Radio Program! Commercial Free! Apr 3rd thru Apr","uid":4127885,"size":386744551,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:da590a9bb62ca8004a9a0bb64e2c46a46e986c63&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Apr+3rd+thru+Apr+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":35,"time":1207882090,"description":"Another Seven broadcasts for the C2C listeners all over the world. Download, SEED, Enjoy, and Spread the Knowledge! Thanks in advance to all the seeders. I really appreciate it. And Thank You especially to you Shiney for sticking with me from the very beginning. I have been uploading these torrents for so long now I really can&amp;#039;t believe it. Thank You All!!! Until we meet again next week, or, who knows, we may even meet on the street. It&amp;#039;s really not a big world in the grand scheme of things is  it! Later All! Stokeman Out...\n\nThursday April 3rd, 2008\nPhiladelphia Experiment &amp; Secret Tech.\nInvestigator of alternative technologies, Joseph P. Farrell discussed his research into secret military projects such as &amp;#039;the Bell&amp;#039; made by the Third Reich, and the Philadelphia Experiment conducted in the United States. Both projects may have incorporated... \nHost: George Noory\nGuest(s): Joseph P. Farrell, Alex Jones, Richard C. Hoagland\n\nFriday April 4th, 2008\nScariest Moments\nDuring Open Lines, George offered a &amp;#039;scariest moment&amp;#039; hotline. James in San Diego said he was tormented by visitations from a dark entity over the course of two to three months in 1975. He described the entity as human-shaped, wearing a hood and colored... \nHost: George Noory\nGuest(s): Open Lines, Vernon Mahabal\n\nSaturday April 5th, 2008\nComic Books &amp; Expanding Earth\nLegendary comic book artist Neal Adams discussed his career in comics as well as his science theory related to the idea of an expanding Earth...\nHost: Ian Punnett\nGuest(s): Neal Adams\n\nSunday April 6th, 2008\nProject Merlin &amp; Timelines\nPaul Guercio of the Merlin Project discussed he and Dr. George Hart&amp;#039;s software-based forecasting technology and its predictive timelines in such arenas as the war, the elections and 2012. Merlin captures in a graphical form timetraks which show the... \nHost: George Noory\nGuest(s): Paul Guercio, Jerome Corsi\n\nMonday April 7th, 2008\nChildren &amp; Reincarnation\nPast life therapist and researcher Carol Bowman shared children&amp;#039;s reports of reincarnation including the James Leininger case in which a toddler had memories of being a WWII fighter pilot. It can be therapeutic for children to talk about past life memories,... \nHost: George Noory\nGuest(s): Carol Bowman, Charles R. Smith, Rollin McCraty\n\nTuesday April 8th, 2008\nEgypt &amp; The Grand Canyon\nAuthor and archeologist David Hatcher Childress discussed his research into artifacts found in the Grand Canyon that suggest Egyptians may have visited North America thousands of years ago. He also talked about his investigation of the Olmecs and amazing... \nHost: George Noory\nGuest(s): David Hatcher Childress, William J. Birnes, Ted Acworth\n\nWednesday April 9th, 2008\nThe Abduction Phenomenon\nScreenwriter, film producer, and co-author of Fastwalker with Jacques Vallee, Tracy Torme discussed his research into abductions and UFOs. Citing a lifelong interest in UFOs, Torme said his first suspicion that the phenomena was real came from &quot;the... \nHost: George Noory\nGuest(s): Tracy Torme, Tom Cryer, Travis Walton, Christopher C. Burt","torrent":{"xt":"urn:btih:da590a9bb62ca8004a9a0bb64e2c46a46e986c63","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+Apr+3rd+thru+Apr+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da590a9bb62ca8004a9a0bb64e2c46a46e986c63","infoHashBuffer":{"type":"Buffer","data":[218,89,10,155,182,44,168,0,74,154,11,182,78,44,70,164,110,152,108,99]},"announce":[],"urlList":[]}}