{"title":"POSTMAN BLUES [XVID JAP]","uid":4097394,"size":734801782,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:da9dc5f34f29c01ce0919975d751148c5678bf0e&amp;dn=POSTMAN+BLUES+%5BXVID+JAP%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":2,"time":1206390882,"description":"subs http://www.allsubs.org/search-subtitle/postman+blues/\n &lt;a href=&quot;\nhttp://www.imdb.com/title/tt0119926/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.imdb.com/title/tt0119926/&lt;/a&gt;\n\nVery creative and charming work, Simon Booth from UK \n\nThere is no doubt in my mind that Japan is home to the most creative cinema in the world today, even if it doesn&amp;#039;t have quite the same mix of artistic and technical virtuosity that Korean cinema has been providing of late. Many of the most interesting Japanese films are very low budget, squeezed out quickly by a small cast and crew and often not even getting a theatrical release in their home country. But they have been drawing increasing attention from the rest of the world, eager to lap up the freshness and creativity so often lacking in other regions&amp;#039; cinema. There are certain directors that have practically become household names - Takeshi Kitano, Takashi Miike and Shinya Tsukamato being the &quot;Big 3&quot; I guess (with Ryuhei Kitamura coming up fast). One director that has yet to achieve the kind of mainstream-cult success that he deserves is SABU (real name Hiroyuki Tanaka) - possibly because his films generally steer away from the kind of shocking scenes that gave many of his contemporaries their foot in the door.\n\nSABU&amp;#039;s films share much in common with Takashi Miike&amp;#039;s films (in fact he may be most recognised as the detective in Miike&amp;#039;s ICHI THE KILLER), in that they often revolve around the Yakuza and use their plots as a rough framework on which to build quirky characters and whimsical, sometimes surreal, scenes. But he has his own particular style that can be seen throughout his films - in particular he seems enamoured with people running - generally chasing or being chased, and most if not all of his films seem to revolve around such moments. Sometimes the &quot;running&quot; might be in a car (&quot;Hard Luck Hero&quot; and, I&amp;#039;m guessing by the name, &quot;Drive&quot;), whilst in Postman Blues it is mostly on bicycles.\n\nThe plot of the film is difficult to explain, as it&amp;#039;s far more about the moments and the characters it throws up than it is about the narrative. This is true of most of Sabu&amp;#039;s films I guess, which might explain why he often has trouble giving them a satisfying ending. Basically, Shinichi Tsutsumi is a postman with really nothing very remarkable in his life, pretty much letting time slip by. He&amp;#039;s not even a very good postman, as he quite often doesn&amp;#039;t even bother delivering his letters. Sometimes he does though, and this leads him to encounter certain characters in the film. First is his old schoolmate, now a Yakuza, then a sick young girl, and then a Hitman named Joe. These meetings trigger different chains of events that eventually come together and give POSTMAN BLUES probably the most satisfying ending for a SABU film yet. However, the ending is really not the important part of the film - it&amp;#039;s the characters, their conversations and their thoughts and their little quirks that make the film very enjoyable and fairly stimulating for the mind. There are moments of absurdity that also make it very funny - it&amp;#039;s the same sort of subtle/dark comedy that not everyone even detects in the films of Miike and Kitano.\n\nI think I&amp;#039;ve seen 5 Sabu films so far, and the common theme(s) and style mean that they are all kind of similar, but all have unique and unusual characters that give the film it&amp;#039;s own unique flavour. I think POSTMAN BLUES is the most satisfying Sabu film I&amp;#039;ve seen overall.\n\nUnfortunately, Sabu&amp;#039;s lack of international recognition so far means that it&amp;#039;s difficult to find his films with English subtitles. His debut DANGAN RUNNER was released under the title NON-STOP in the US, but I think that&amp;#039;s the only one that&amp;#039;s had a legit English subtitled release. As usual with this situation, the grey market provides what the white market will not, and subtitled copies can be found on a certain auction site with little difficulty.\n\n","torrent":{"xt":"urn:btih:da9dc5f34f29c01ce0919975d751148c5678bf0e","amp;dn":"POSTMAN+BLUES+%5BXVID+JAP%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"da9dc5f34f29c01ce0919975d751148c5678bf0e","infoHashBuffer":{"type":"Buffer","data":[218,157,197,243,79,41,192,28,224,145,153,117,215,81,20,140,86,120,191,14]},"announce":[],"urlList":[]}}