{"title":"Easy Pickup Teases Own Anus","uid":12763467,"size":513968289,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:dae4c00304161277275ec6f6d1eba085f8c4e965&amp;dn=Easy+Pickup+Teases+Own+Anus&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"sarah.jensen","files":1,"time":1447562606,"description":"I picked up Christina again, the world's easiest pickup. Fuck me please, she can speak English well, at least these three important words. Standing by a banana tree at the intersection of two main roads, Christina made it quite obvious that she would go in any car that opened its door. So back at my flat I fuck her a bit, and she picks up my emergency black vibrator and start teasing her own asshole with it. I like that. I like her. She likes sex. She doesn't like people, or relationships. Men are purely the implement of sex. She loves her life. Anyway, I bugger her squarely up her bum. Plenty of KY and sweet gasping sounds, she clings onto the sofa as I bang away at her soft round little buttocks. It seems to me that more KY came out of her anus than I squeezed in. I am probably not the first guy to have fucked her asshole this evening. I know as soon as I drop her off in the strip, she is going to find someone else. So long as the sun does not come up, she is out finding guys for sex. Great little fuck. Sweet little anal bum bitch. Pleasurable little street slapper. Nice bobbing little impaled botty on HD video","torrent":{"xt":"urn:btih:dae4c00304161277275ec6f6d1eba085f8c4e965","amp;dn":"Easy+Pickup+Teases+Own+Anus","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dae4c00304161277275ec6f6d1eba085f8c4e965","infoHashBuffer":{"type":"Buffer","data":[218,228,192,3,4,22,18,119,39,94,198,246,209,235,160,133,248,196,233,101]},"announce":[],"urlList":[]}}