{"title":"Soul Bop Vol 1","uid":4120632,"size":48427594,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:db0fc23413c7dad0f608844553f9b149faca4af6&amp;dn=Soul+Bop+Vol+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"broid","files":6,"time":1207525071,"description":"Fusion bands can push contemporary jazz into fresh territory when they open up a brand new bag. Armed with a program of new originals, Randy Brecker, Bill Evans and Hiram Bullock, plus their fiery rhythm section, embarked on an extensive, and hugely successful, tour in 2004. This live double disc set proves how outstanding the band sounded.\n\nUnlike situations where too little attention is paid to ensemble interaction, and the emphasis leans too heavily on soloists, the Soul Bop Band has found an effective balance. Brecker, Evans and Bullock sure do solo with authority?but the band also possesses an homogeneous ensemble sound. The leaders converse creatively and create many examples of a cohesive band sound. After all, it takes several different colors to complete a jazz bouquet.\n\nPianist/organist David Kikoski steps forward and solos, too, as does bassist Victor Bailey. However, the bands wall?to?wall funk/soul sound is what makes the program such a success. Breckers Some Skunk Funk lets the band drive hard and fast, while the ensemble sound fills the auditorium with a fiery rage.Soul Bop introduces a cooler mood, as the band swings with relaxed ease. Brecker contributes a very lame vocal on Hangin In The City, for which we&amp;#039;ll just have to forgive him.\n\nRepresenting both the hot and cool of contemporary jazz, Soul Bop Band gives its audience plenty to hold on to everywhere it goes. Live is recommended for its vivacious spirit and fresh ensemble voice. \n\nSoul Bop Band?Live\n\nTracks: Rattletrap; Big Fun; Above &amp; Below; Lets Pretend; Some Skunk Funk; Greed; Soul Bop; Tease Me; Cool Eddie; Mixed Grill; Hangin In The City; Dixie Hop.\n\nPersonnel: Randy Brecker: trumpet, vocal; Bill Evans: tenor saxophone, soprano saxophone; Hiram Bullock: guitar, vocal; David Kikoski: keyboard; Victor Bailey: bass; Steve Smith: drums. ","torrent":{"xt":"urn:btih:db0fc23413c7dad0f608844553f9b149faca4af6","amp;dn":"Soul+Bop+Vol+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db0fc23413c7dad0f608844553f9b149faca4af6","infoHashBuffer":{"type":"Buffer","data":[219,15,194,52,19,199,218,208,246,8,132,69,83,249,177,73,250,202,74,246]},"announce":[],"urlList":[]}}