{"title":"Quitter-Sender.Receiver-2003-RPM (FLAC)","uid":4068954,"size":316655670,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:db3f526269ecba848853e9fcc0d1a31a63903015&amp;dn=Quitter-Sender.Receiver-2003-RPM+%28FLAC%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"TMA2","files":15,"time":1204945467,"description":"enjoy the only LP from a great, albeit defunct psychedelic-ish alt rock band.\n\n--\n\nIn an era where many groups are panicking trying to figure out where rock music is heading and quickly assimilating to the latest trends, other bands are quietly looking back at the greats and drawing heavy inspiration from them. Sacramento, CA&amp;#039;s Quitter are one of those bands and the maturity and charm they exude through their music is astounding. Like a bastard lovechild of Failure, dredg and U2, the band adeptly etch out vast weighty soundscapes that are nothing short of mesmerizing when firing on all cylinders.\n\nDeeply moving while remaining emotionally restrained, Quitter don&amp;#039;t rely on any of today&amp;#039;s in your face visceral tactics. Instead, they prefer subtle instrumentation, haunting vocal work and epic build-ups that elevate through heartfelt honesty and intelligence. Talented musicians, guitars spiral in and out of consciousness underneath the weathered delivery of band frontman D. Scott Sault. A firmly grounded rhythm section then anchors it all in place and allows the band to fully indulge in their own pursuits which border between technical and experimental. Sure the band borrow a few pages from some of rocks accomplished heroes of days past. But there is a fine line between Quitter and most of the other bands who look to the past for inspiration. Quitter aren&amp;#039;t a mere throwback band with low-production values or paper-thin song-writing. In fact their music is actually quite modern and full-bodied, and it&amp;#039;s qualities like these which truly put them on a level of their own.\n\nBy no means afraid to experiment, the group take on a number of different instruments to aid them on this effort, including a trumpet and a piano. Such extra touches help certain songs flourish and bring new life to the momentum of the album as it progresses on. In fact, momentum may be the only thing holding the band back here. Songs like &quot;Liberation Day&quot; and &quot;Creations In The Fire&quot; easily engulf the listener early on, but as the effort continues an all too similar pacing is implemented and can find a few of the middle tracks occasionally meandering. While this is a minor problem in the face of the handful of standout tracks included, it may hamper the enjoyment of less patient listeners. As it stands, Quitter are a band of a different breed. A rare outfit who put their art before the almighty dollar, making the bulk of the music they create a true pleasure to experience.\n\n- theprp.com","torrent":{"xt":"urn:btih:db3f526269ecba848853e9fcc0d1a31a63903015","amp;dn":"Quitter-Sender.Receiver-2003-RPM+%28FLAC%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"db3f526269ecba848853e9fcc0d1a31a63903015","infoHashBuffer":{"type":"Buffer","data":[219,63,82,98,105,236,186,132,136,83,233,252,192,209,163,26,99,144,48,21]},"announce":[],"urlList":[]}}