{"title":"Rock The Bells DVD Rip BigSmoke101","uid":4089603,"size":733927501,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:dbee3736c99af33713845a8ec070cc0abf6d9c4c&amp;dn=Rock+The+Bells+DVD+Rip+BigSmoke101&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"BigSmoke101","files":2,"time":1206004885,"description":"Filmmakers Denis Henry Hennelly and Casey Suchan have accomplished something quite remarkable with Rock the Bells, their documentary on the preparation and realization of the original Wu-Tang Clan&amp;#039;s final live performance. By skillfully editing together countless hours of footage from more than 20 cameras, Hennelly and Suchan have turned what could have been a ragged, by-the-numbers effort into a coherent, thrilling narrative. The film focuses on hip-hop concert promoter Chang Weisberg, whose Guerrilla Union production company showcases live hip-hop of a noncommercial bent. Weisberg comes across as a mixture of fanboy and snake-oil salesman, but it is his attention to detail that allows him to undertake what no other promoter had managed to accomplish in a long time: the presentation of the complete original lineup of the Wu-Tang Clan in live performance. Using a small, cohesive team of immensely likeable, pleasant people, Weisberg navigates all the pitfalls of his endeavor with amazing composure, even when the concert is in full-throttle. Hours before the concert is supposed to begin, the Guerrilla Union crew is forced to contend with an incompetent security team, an overanxious crowd on the verge of rioting, and the singular mania of the now deceased Ol&amp;#039; Dirty Bastard, in what amounts to a partial tribute film. But the pay off for all the late nights and hustle is a platinum performance, and the audience, in turn, is left with the feeling that they&amp;#039;ve played a crucial part in making this unique occurrence possible.\n\nBigSmoke101\n\nR.I.P O.D.B","torrent":{"xt":"urn:btih:dbee3736c99af33713845a8ec070cc0abf6d9c4c","amp;dn":"Rock+The+Bells+DVD+Rip+BigSmoke101","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dbee3736c99af33713845a8ec070cc0abf6d9c4c","infoHashBuffer":{"type":"Buffer","data":[219,238,55,54,201,154,243,55,19,132,90,142,192,112,204,10,191,109,156,76]},"announce":[],"urlList":[]}}