{"title":"Neuland","uid":4177770,"size":709384284,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:dcbb5b3ba69ad2c3bd2146ba5b997a824987e524&amp;dn=Neuland&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"inkorrupt","files":1,"time":1210230232,"description":"www.neuland-denken.de  \n\nsynopsis\n\nEin Buergermeister ruft nach Kolonisten. Zwei Studenten bauen ihre berufliche Existenz mit Schnecken auf. Ein Planer loescht seine Stadt aus. Ein Heimkehrer zuechtet Bisons im Tagebau. Ein Arbeitsloser mobilisiert Ueberfluessige. Ein Rechtsanwalt experimentiert mit Geld. Ein Sozialwissenschaftler spricht von laendlichen Ghettos, Jugendliche ueber ihre Zukunft in einer sterbenden Stadt. Ein Pionier will im toten Kraftwerk eine lebendige Brauerei. Eine Frau schliesst das letzte Kino der Stadt. Ein Bauer kaempft fuer ein energetisch autarkes Dorf. Eine Kommune zieht in eine ehemalige Puppen-Fabrik. Kulturschaffende wehren sich gegen Nazis. Ein Politiker sieht in regenerativen Energien die Zukunftschance. Neue Siedler besetzen laendlichen Raum. Sie alle leben in...\n\nNeuland\n\nWerden wir verschiedene Gesellschaften in unterschiedlichen Raeumen haben? Im September 2004 sorgte die Infragestellung der Notwendigkeit gleichwertiger Lebensverhaeltnisse in allen Regionen Deutschlands durch den Bundespraesidenten Horst Koehler fuer einen kurzen Aufruhr in den Medien des Landes. Nachhaltig aber sind die Probleme, mit denen sich heute zahlreiche Regionen konfrontiert sehen. De- oder Hyperindustrialisierung sind verantwortlich fuer eine hohe flaechendeckende Arbeitslosigkeit. Die Kommunen sind aussichtslos verschuldet. Zunehmend koennen Infrastrukturleistungen nicht mehr aufrecht erhalten werden. Den disparaten Regionen laufen die Menschen davon. Wenn aber Gleichwertigkeit nicht mehr garantiert wird, koennte dann aus dem Schattenreich der Globalisierung nicht auch ein Neuland fuer Experimente, Lebens- und Arbeitsweisen jenseits bzw. parallel der aktuellen Vergesellschaftung entstehen?\n\nNeuland ist ein Reisebericht durch die ostdeutsche Transformationslandschaft. Die Verdichtung von Realitaetsfragmenten unterschiedlicher Akteure, von Pionieren und ihren Projekten regt an, Neuland zu denken.\n\nDaniel Kunle &amp; Holger Lauinger, D 2007, 74 min, DV / Beta, 16:9 pal, Farbe, Stereo\n\nMit: Rainer Land (Netzwerk Ostdeutschlandforschung), Horst Wilke (Buergermeister Neulietzegoericke), Stefan Paulisch (FH Reichenbach), G. Hartmann (Ladeninhaber Harz4, Weissenfels), Michael Maurer (Die Ueberfluessigen, Jueterbog), Andreas Willisch (Thuenen-Institut, Bollewick), Stefan Helfer &amp; Freunde (Bitterfeld), Karin Fahnert (Filmfabrik Wolfen), Melanie Haller &amp; Stephan Meister (Netzwerk Demokratische Kultur, Wurzen), Hajo Schubert (Kraftwerk Plessa), Danny Huebner &amp; Daniel Weller (Vogtland Schneckenzucht), Falk Selka (Buffalo Ranch, Neukieritzsch), Frank Jansky (Der Urstromtaler, Guesen), Andreas Tornow (Biomassehof Mueritz, Varchentin), Hermann Scheer (MDB, Berlin), Eva Stuetzel (Oekodorf Siebenlinden), Dodo Ender &amp; Lothar Mentz (Kommune Waltershausen)","torrent":{"xt":"urn:btih:dcbb5b3ba69ad2c3bd2146ba5b997a824987e524","amp;dn":"Neuland","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dcbb5b3ba69ad2c3bd2146ba5b997a824987e524","infoHashBuffer":{"type":"Buffer","data":[220,187,91,59,166,154,210,195,189,33,70,186,91,153,122,130,73,135,229,36]},"announce":[],"urlList":[]}}