{"title":"Brocket 99 Full and Uncut-Tape side A &amp; B","uid":4075831,"size":67635392,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:dd033f7ba1c8bbfdd1122482a7506d173a4238e4&amp;dn=Brocket+99+Full+and+Uncut-Tape+side+A+%26+B&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Dersh","files":2,"time":1205297517,"description":"***This is the longest Uncut version of Brocket 99 found online, AC/DC and all--93 mins! The most original version I know of, I actually got these two mp3s from the site listed below, however they have stopped allowing the download of the original tape before purchase. Hence why I attempted to bring it to you, for nothing of course. I will say though it is pretty funny shit. The website is really the only thing Keeping Brocket 99 alive. I am in no way part of that website, just a fan of Brocket 99 since I was a kid.***\n\nHistory, Rumors from...\nFansite/Promoters/Creators of future Brocket99 content--http://www.brocket99.com/ or http://www.brocket99.net/\n\n\nBrocket 99: History\n\nIn 1986 ?Ernie Scar? (a local DJ in Alberta) was given a tape of a radio parody. It was about gay guys running a station called ?AIDS radio?. ?Ernie? and a few friends decided that they wanted to apply this idea to both the local Natives and the Hutterite community in Southern Alberta. Although ?Jake Radio? never became more than an idea, Brocket 99 took off like fire through hell.\n\n?In Southern Alberta it?s white bread? says ?Scar?. ?You?ve got cowboys and Indians? What if the Indians on the Brocket reserve, a bunch of drunk Indians, had their own radio station? What would it sound like??\n\n?It was a joke?; says the man who was only in his twentys when the parody was made. ?It was never meant to be heard by anyone outside of this circle of three or four people. But years later; You dub one and tell someone and they?ll dub one and tell someone. And he?ll dub 10 copies and tell 10 friends and on and on and on.? Brocket 99 grew a life of its own. And now, thanks to the internet, there?s worldwide interest.\n\nRUMOURS\n\nTHESE ARE NOT REAL ORIGINS OF BROCKET 99\n\nThe RCMP have friends at a radio station in Lethbridge. They get drunk one night and decide to make a tape about the indians they&amp;#039;ve been arresting from the local reservation in Brocket.\n\nA couple of people, and apparently some rocker comedian types from Edmonton, happened to be at the Univeristy of Lethbridge, where these tapes got made. About 10 -12 University of Lethbridge students were also involved... Then, when the copies of the tapes were made and shared, things got blown out of proportion, badly and many of those involved probably don&amp;#039;t want their names even mentioned. Any student who would have been involved with the making of Brockett99 would have been in some serious trouble. \n\nPreview quote from tape/the website--***Those who have never herd Brocket 99 need atleast a taste!***\n\nErnie Scar: Fresh corn-on-the-cob is irresistible, especially at Safeway&amp;#039;s low prices. This week we got Washington-grown, Canada Number One corn-on-the-cob, value-priced at three cobs for 88 cen . . .\n\nSafeway Singers: &quot;Workin&amp;#039; hard, doin&amp;#039; it right! . . .&quot;\n\nErnie Scar: Fuck.\n\nSafeway Singers: &quot;. . . Helpin&amp;#039; you more, we&amp;#039;re part of your life! . . .&quot;\n\nErnie Scar: Fuckin&amp;#039; shit.\n\nSafeway Singers: &quot;. . . At Safeway! Safeway&amp;#039;s got it! . . .&quot;\n\nErnie Scar: Sorry about this. I didn&amp;#039;t know it was . . .\n\nSafeway Singers: &quot;. . . Safeway&amp;#039;s got it!&quot;\n\nMUSIC STOPS\n\nErnie Scar: Fuckin&amp;#039; goddamned whitey-produced fuckin&amp;#039; commercials. Never come out the right way. Okay, Safeway&amp;#039;s got everything, that&amp;#039;s 88 cents for the corn. And everything you need for a super summer barbecue, charcoal, starter, napkins, and paper plates. At Brocket Safeway.\n\n\n***Just thought people might want something to read before downloading, Enjoy and Much Love from Canada!*** ","torrent":{"xt":"urn:btih:dd033f7ba1c8bbfdd1122482a7506d173a4238e4","amp;dn":"Brocket+99+Full+and+Uncut-Tape+side+A+%26+B","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd033f7ba1c8bbfdd1122482a7506d173a4238e4","infoHashBuffer":{"type":"Buffer","data":[221,3,63,123,161,200,187,253,209,18,36,130,167,80,109,23,58,66,56,228]},"announce":[],"urlList":[]}}