{"title":"BUFFY CAZAVAMPIROS 6Ã‚Âª TEMPORADA CAPITULOS 101y102","uid":4187050,"size":733356032,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:dd508119baf4e43094bb887b71372b8725481bb7&amp;dn=BUFFY+CAZAVAMPIROS+6%C3%82%C2%AA+TEMPORADA+CAPITULOS+101y102&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"el_abuelo","files":2,"time":1210728230,"description":"BUFFY CAZAVAMPIROS\n\nARGUMENTO\nLa serie se desarrolla a partir de los sucesos ocurridos en el film del mismo nombre rodado en 1992, escrito y producido por Joss Whedon.\n\nEl argumento gira alrededor de la vida de Buffy Summers, una adolescente problemÃƒÂ¡tica, expulsada de su anterior instituto en Los Ãƒ?ngeles por lo que sucediÃƒÂ³ (un intento de masacre por parte de los vampiros en el gimnasio, que acabÃƒÂ³ ardiendo). Esto obliga a su madre, reciÃƒÂ©n divorciada, a mudarse lejos de allÃƒÂ­. Es de ahÃƒÂ­ de donde parte la historia, ya que una vez inicia su nueva vida se va descubriendo la verdadera identidad de Buffy: es La Cazavampiros, La Elegida de esa generaciÃƒÂ³n. Este cargo impuesto guÃƒÂ­a inevitablemente su vida hacia un sinfÃƒÂ­n de problemas y a oponerse a la autoridad de forma repetitiva (desde su madre hasta el director del instituto, pasando por su Vigilante y sus amigos).\n\nSu nuevo hogar se encuentra en Sunnydale, una ciudad propensa a ser atacada por las fuerzas del mal ya que su instituto se encuentra situado encima de La Boca Del Infierno (Hellmouth), portal entre nuestro mundo y el inframundo de los demonios y lugar de convergencia mÃƒÂ­stica para todo tipo criaturas diabÃƒÂ³licas. AllÃƒÂ­ tendrÃƒÂ¡ que lidiar con toda clase de criaturas y demonios, y tambiÃƒÂ©n vivir la existencia de cualquier chica de su edad: los estudios, sus amigos, las peleas con su madre, el primer amor y el primer desamor,...\n\nA pesar de todas las dificultades, contarÃƒÂ¡ con el apoyo incondicional de sus amigos, Xander y Willow, y de su Vigilante, Giles (un guÃƒÂ­a designado por El Consejo De Vigilantes para que la conduzca a travÃƒÂ©s de ese mundo de tinieblas), que ayudarÃƒÂ¡n a Buffy a enfrentarse con las fuerzas demonÃƒÂ­acas, ya sea mediante trabajo de campo patrullando con ella, buscando informaciÃƒÂ³n en la antiquÃƒÂ­sima biblioteca y en internet o usando magia.\n\nA medida que avanza la serie y crecen los personajes, tambiÃƒÂ©n cambian sus vidas y tendrÃƒÂ¡n que enfrentarse a nuevas dificultades: la sexualidad, la vida en pareja, comenzar la universidad, las responsabilidades familiares, encontrar trabajo,... todo ello combinÃƒÂ¡ndolo con una lucha constante y silenciosa contra las fuerzas del mal.\n\nLa fÃƒÂ³rmula de la que parte su ÃƒÂ©xito se basa en la mezcla de distintos gÃƒÂ©neros tales como terror, comedia, aventuras, drama,... lo que ha hecho que se convierta en una serie de culto.\n\n6Ã‚Âª TEMPORADA\n\n6x01 - NegociaciÃƒÂ³n (I)\nDesde que La Cazadora muriÃƒÂ³, todos han colaborado en la caza de vampiros, incluido Spike, y tambiÃƒÂ©n han utilizado a Buffybot para hacer creer a los demonios que sigue viva. AdemÃƒÂ¡s, Giles se prepara para volver a Inglaterra. Por su parte, los chicos no pueden aceptar la muerte de Buffy y deciden realizar un ritual mÃƒÂ¡gico para resucitarla.\n\n\n6x02 - NegociaciÃƒÂ³n (II)\nLos chicos creen que el hechizo para resucitar a Buffy ha salido mal, ademÃƒÂ¡s del mal estado en el que ha quedado Willow tras el ritual. Una maltrecha Buffybot se enfrenta a los vampiros y la pandilla huye para salvar sus vidas.\n","torrent":{"xt":"urn:btih:dd508119baf4e43094bb887b71372b8725481bb7","amp;dn":"BUFFY+CAZAVAMPIROS+6%C3%82%C2%AA+TEMPORADA+CAPITULOS+101y102","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"dd508119baf4e43094bb887b71372b8725481bb7","infoHashBuffer":{"type":"Buffer","data":[221,80,129,25,186,244,228,48,148,187,136,123,113,55,43,135,37,72,27,183]},"announce":[],"urlList":[]}}