{"title":"Ringworm Children - X-rayed to death in Israel, 1950ies","uid":4211190,"size":451506334,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:ddc410d7f135c8058ea11402d39ede85368c38ba&amp;dn=Ringworm+Children+-+X-rayed+to+death+in+Israel%2C+1950ies&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"veruschkaaa","files":4,"time":1212078759,"description":"Video : DIVX, 720x480, 44:41  \nAudio codec: mp3, 48 kHz, stereo \nLanguages: Hebrew spoken, English hard subtitles\n\nIn 2004 this film was shown in Israel at the international film \nfestival of Haifa (where it won the prize for &amp;#039;Best Documentary&amp;#039;) \nand also on Channel 10.\n\n\nX-RAYED TO DEATH IN ISRAEL IN THE 1950&amp;#039;S: \n\nWhen the USA were founded it was to be the land of the free, \nyet it took almost another 100 years for slavery to be abolished \n(formally) and the aftereffects can still be seen in a society \nthat is somewhat segregated. Even as late as 1970 medical \nexperiments were conducted on African Americans without their \nconsent or knowledge (e.g. the Tuskegee Syphilis Study).\n\nThe State of Israel was founded in 1948 in order, amongst \nothers, to provide a safehaven for Jews where they would not have \nto fear persecution. The Zionist movement spearheaded the way \nto Aliya (return to Israel) and was largely composed of Ashkenazi \nJews (mainly of Middle and Northern European descent) who later \nbecame the dominant group in the state, many of them bringing \nwith them a feeling of European superiority, while Mizrahi Jews \n(mainly from Arabic speaking countries like  Morocco and Iraq) \nwere implicitly regarded as second or even third class citizens, \noften having a darker skin tone, dark hair and speaking Arabic \nat home. They were frequently perceived as simple, poor, criminal, \nuncultured, unhygenic, diseased and possibly even a security \nrisk (apocalyptic fantasies of officials then included political \nrebellion and siding with the Palestinians). \n\nIn this documentary a sad and disturbing chapter of Israel&amp;#039;s \nhistory is unveiled when Jewish survivors of medical maltreatment \nwith hot wax and X-rays (officially to treat ringworm, a minor \nskin disease) tell the story of what Israeli government employees \nbrought upon them. It appears that many were subjected to the \nprogram even if they did not have ringworm (almost like a cleansing\nritual).\n\nMost of the mistreated 100,000 or so Mizrahi Jews were children, \nsome died a few weeks after been given an X-ray overdose to their \nheads, many more died before old age of leukemia or are still \nplagued by chancer and other radiation related conditions. \n\nThe program was administered by the Israeli Ministry for Health \nunder the title of &amp;#039;social medicine&amp;#039; and the pretext of ringworm \ntreatment, the funding and the 7 X-ray machines may have been \nprovided by the US government. The then head of the public medical \nservices in Israel states that the Isreali government received 300 \nmillion pounds for conducting the program (at the time a lot more \nthan the annual Israeli budget) which does not show up in the public \naccounts of the time. The radiation treatment of ringworm had led \nto many court cases in the USA in the 1940ies and often the courts \nawarded high damages for the aftereffects. \n\nIn the 1995 the Israeli parliament passed legislation providing  \ncompensation for victims of the X-ray &amp;#039;ringworm treatment&amp;#039;. This \nstep was taken to avoid a Supreme Court ruling on the matter which \nmay have awarded higher damage compensation after investigating the \ncases in detail. But for many victims this measure brought further \nhumiliation and no true recognition of their suffering. \n\nWhy were the parents not informed and pressured into sending \ntheir children on a &amp;#039;trip&amp;#039;?\nWas it a systematic genocide as part of a cynical experiment? \nDid a doctor execute a destructive plan without anybody else \nnoticing or knowing? \nAre the Israeli authorities at present covering up just out of \nembarrassment about negligence or was there premeditated \ninvolvement of the highest government circles at the time?\n\nGenocide is a crime punishable under international law. The &amp;#039;Convention \non the Prevention and Punishment of the Crime of Genocide&amp;#039; (signed \nby Israel in 1949 and ratified in 1950) defines GENOCIDE as follows: \n\nArticle 2 \n\n...any of the following acts committed with intent to destroy, \nin whole or in part, a national, ethnical, racial or religious \ngroup, as such:\n\n    (a) Killing members of the group;\n    (b) Causing serious bodily or mental harm to members of the group;\n    (c) Deliberately inflicting on the group conditions of life \ncalculated to bring about its physical destruction in whole or in part;\n    (d) Imposing measures intended to prevent births within the group;\n    (e) Forcibly transferring children of the group to another group. \n\n\nWEB RESSOURCES: &lt;a href=&quot;\nhttp://en.wikipedia.org/wiki/Ringworm_affair&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://en.wikipedia.org/wiki/Ringworm_affair&lt;/a&gt; &lt;a href=&quot;\nhttp://web.israelinsider.com/views/3998.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://web.israelinsider.com/views/3998.htm&lt;/a&gt;   (-&gt;  Review of the film) &lt;a href=&quot;\nhttp://bmj.bmjjournals.com/cgi/content/full/310/6976/350/a&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://bmj.bmjjournals.com/cgi/content/full/310/6976/350/a&lt;/a&gt;  (-&gt; article) \n","torrent":{"xt":"urn:btih:ddc410d7f135c8058ea11402d39ede85368c38ba","amp;dn":"Ringworm+Children+-+X-rayed+to+death+in+Israel%2C+1950ies","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ddc410d7f135c8058ea11402d39ede85368c38ba","infoHashBuffer":{"type":"Buffer","data":[221,196,16,215,241,53,200,5,142,161,20,2,211,158,222,133,54,140,56,186]},"announce":[],"urlList":[]}}