{"title":"Terminal Error (2002)nl.subs.NLT-Release","uid":4072825,"size":914270391,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:de45e8ad2061ca0d089551aa42e1720aab1c8d0c&amp;dn=Terminal+Error+%282002%29nl.subs.NLT-Release&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"linday1","files":5,"time":1205149142,"description":"Verenigde Staten\nThriller\n90 minuten\n\ngeregisseerd door John Murlowski\nmet Michael Nouri, Marina Sirtis en Timothy Busfield\n\nEen kerncentrale explodeert. Een lift stort neer. Dit is nog maar het begin van\neen stroom van vernietigingen, die alleen een halt kan worden toegeroepen door\nBrad (Micheal Nouri), de eigenaar van AutoCom, het grootste softwarebedrijf ter\nwereld, en zijn zoon Dylan (Mattew Ewald). De verbitterde, voormalige partner van\nhet invloedrijke computerbedrijf Elliot (Timothy Busfiekd), creeert uit wraak een \nuitengewoon intelligente computervirus. Om vervolgens toegang te krijgen tot het \ncomputersysteem van AutoCom bouwt hij een vriendschap met Dylan op. Als Dylan zijn\nvader een plezier wil doen door de MP3 te uploaden, blijkt die MP3 het virus te zijn van Elliot,\ndat direct desatreus om zich heen grijpt door zich vliegensvlug door de servers van de stad te verspreiden.\nVreselijke ongevallen zijn het gevolg. Brad, Dylan en zijn moeder Alex (Marina Sirits)\nproberen wanhopig het virus te stoppen en als ze er achter komen dat Elliot de boosdoener is,\nsmeken ze hem angstvallig het virus uit te bannen. Helaas, het virus blijkt nog sterker en intelligenter\ndan men dacht en gaat zijn eigen weg. Brad, Dylaan en Alex moeten een manier verzinnen om deze\nvirtuele maar realistische doodsvijand te stoppen voor het te laat is.\n\n\n\nEnjoy The Movie!!!!!","torrent":{"xt":"urn:btih:de45e8ad2061ca0d089551aa42e1720aab1c8d0c","amp;dn":"Terminal+Error+%282002%29nl.subs.NLT-Release","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de45e8ad2061ca0d089551aa42e1720aab1c8d0c","infoHashBuffer":{"type":"Buffer","data":[222,69,232,173,32,97,202,13,8,149,81,170,66,225,114,10,171,28,141,12]},"announce":[],"urlList":[]}}