{"title":"[psx]-DRIVER2-DISC1&amp;2-XxGLITCHxX-REUPLOAD!ePSXe","uid":4122479,"size":468179227,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:de9024322253ff89faecf250fbbb20176f6bc6e3&amp;dn=%5Bpsx%5D-DRIVER2-DISC1%262-XxGLITCHxX-REUPLOAD%21ePSXe&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"XxGLITCHxX","files":1,"time":1207622540,"description":"****REUPLOADED****** i now have a better connection!! faster. so more seeders\n\n\nTHIS IS BOTH CD&amp;#039;S!!! BOTH DISC ONE AND TWO! ON SEPRATE IMAGES COMPRESSED TO 446MB in size\n\nEXTRACT AND RUN IN EPSXE.\n\nCOMPRESSED to .BIN/.IMG(image files) works with ePSXe emulator!!!\n\nreason why i uploaded this? because im sick of PSP-PSX, we need games for us Orginal Playstation users, also for emulators!!!\n\nINFO:\n\nPlatform: PlayStation\nRelease Date: November 15, 2000\nSimilar Games: Felony 11-79 (PlayStation), Driver (PlayStation), Grand Theft Auto 2 (PlayStation), The Dukes of Hazzard: Racing for Home (PlayStation), Runabout-2 (PlayStation), 007 Racing (PlayStation), World&amp;#039;s Scariest Police Chases (PlayStation)\n\n\nGENERAL INFO:\n\nDriver 2 is the sequel to 1999&amp;#039;s popular mission-based driving game. Players will once again assume the role of the undercover police officer Tanner. The game picks up right where the first one left off: your job is to run errands for various crimelords throughout the pedestrian-filled cities of Havana, Chicago, Rio de Janeiro and Los Angeles. \n\nThe sequel has many new features not seen in the original installment. Where the first Driver had each urban location set up in a grid-like manner, Driver 2 adds curves to the streets, making the cities closer to their real-life counterparts. Tanner can also jump out of his car at will in order to ditch the police or to carjack someone. In-game hints via radio updates are available from partner Tobias Jones as well.\n\nPlayers can choose between a first-person driver&amp;#039;s seat view and a camera placed directly behind the car. As Tanner, players will traverse through all of the cities evading police, chasing down individuals, and carjacking enemies. Driver 2 also has multiplayer options as well as a free driving mode. A special director&amp;#039;s option allows you to save your mission footage and edit the camera angles, effectively creating your own movie that can be saved onto the PlayStation memory card.\n\n\n\nThanks, XxGLITCHxX","torrent":{"xt":"urn:btih:de9024322253ff89faecf250fbbb20176f6bc6e3","amp;dn":"%5Bpsx%5D-DRIVER2-DISC1%262-XxGLITCHxX-REUPLOAD%21ePSXe","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"de9024322253ff89faecf250fbbb20176f6bc6e3","infoHashBuffer":{"type":"Buffer","data":[222,144,36,50,34,83,255,137,250,236,242,80,251,187,32,23,111,107,198,227]},"announce":[],"urlList":[]}}