{"title":"BBC Horizon 2005 An Experiment To Save The World DivX mp3","uid":4235387,"size":455316776,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:df7b92fea37e3841bdd63f465b3948161e367933&amp;dn=BBC+Horizon+2005+An+Experiment+To+Save+The+World+DivX+mp3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"circlensess","files":1,"time":1213281467,"description":"BBC - Horizon - An Experiment To Save The World\n &lt;a href=&quot;\nhttp://www.bbcactive.com/BroadCastLearning/asp/catalogue/productdetail.asp?productcode=21404&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.bbcactive.com/BroadCastLearning/asp/catalogue/productdetail.asp?productcode=21404&lt;/a&gt;\n\n\nHorizon web site\n\nInformation from BBC Active: \n------------------------------------------------------------------------------\nThe power of nuclear fusion is the force at the heart of the Sun. If it can be harnessed, it could herald a world of endless, cheap energy. For 40 years scientists have toiled to find this Holy Grail. American scientist Rusi Taleyarkahn has controversially claimed to have found a new way to make nuclear fusion in the lab - using sound waves. In an exclusive experiment, this programme attempts to prove his doubters wrong. What would the world be like if fusion is eventually achieved?\n\nFusion is what has kept the sun burning for billions of years. It involves combining two atomic nuclei, usually heavy forms of hydrogen known as &amp;#039;deuterium???. During the reaction, huge amounts of energy are released, but without the radioactive by-products of conventional nuclear reactors. If this could be achieved on Earth, it would transform our world. Overnight, there would be no need for fossil fuels, no more global warming, no reliance on oil. Instead there would be an almost limitless source of clean, green power.\n\nFor 40 years, scientists have pursued this &amp;#039;Holy Grail???, at a cost of billions of pounds and many shattered reputations. Most famously, in 1988, Fleichmann and Pons stunned the world by announcing that they had achieved nuclear fusion in a lab with just a few Â£s worth of equipment. They called it &amp;#039;cold fusion???. For one tantalising moment, it seemed that the answer had been found. But the dream turned out to be a mirage. &amp;#039;Cold fusion??? was branded the scientific blunder of the century. Fleischmann and Pons were discredited.\n\nThen last year, American scientist Rusi Taleyarkahn, then of Oak Ridge National Laboratories, claimed to have found a new way to make nuclear fusion in a laboratory ??? using sound waves. His work was published in that most prestigious journal, Science. However, almost immediately the doubters began sniping. They said it simply could not be true. Taleyarkahn remains adamant. The only way to find out if he is right is to try to replicate his results. And so, in a groundbreaking piece of television, Horizon has commissioned Professor Seth Putterman of UCLA to put Taleyarkahn???s work to the test. If this exclusive experiment reproduces Taleyarkahn???s results, a Nobel Prize beckons. If not, then it is back to square one??? \n\nAs well as revealing the results, this film combines excitement, tension and a stunning CGI vision of what the world will be like if fusion is eventually achieved.\n\n\n\n\n\n\n\n\n\nTechnical Specs :\n------------------------------------------------------------------------------\n\nFile Size (in bytes) ..: 455,316,776 bytes\nRuntime (# of frames) .: 00:48:54 (73349 frames)\n\nVideo Codec ...........: DivX 5.0\nFrame Size ............: 704x384 () [=] [=1.833]\nFPS ...................: 25.000\nVideo Bitrate .........: 1104 kb/s\nBits per Pixel ........: 0.163 bpp\nB-VOP, N-VOP, QPel, GMC ......: [B-VOP]...[N-VOP]...[]...[]\n\nAudio Codec ...........: 0x0055(MP3, ISO) MPEG-1 Layer 3\nSample Rate ...........: 48000 Hz\nAudio bitrate .........: 128 kb/s [2 channel(s)] VBR audio\nInterleave ............: 40 ms\nNo. of audio streams ..: 1\n\n\nRipped by: Unknown ripper","torrent":{"xt":"urn:btih:df7b92fea37e3841bdd63f465b3948161e367933","amp;dn":"BBC+Horizon+2005+An+Experiment+To+Save+The+World+DivX+mp3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"df7b92fea37e3841bdd63f465b3948161e367933","infoHashBuffer":{"type":"Buffer","data":[223,123,146,254,163,126,56,65,189,214,63,70,91,57,72,22,30,54,121,51]},"announce":[],"urlList":[]}}