{"title":"Slysoft CloneDVD v2.9.1.8 - Retail.rar","uid":4231707,"size":5041769,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e05a067528076fe5f7629bf217badf7bc5f5caf8&amp;dn=Slysoft+CloneDVD+v2.9.1.8+-+Retail.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"D0TZLUV3R","files":1,"time":1213087609,"description":"CloneDVD 2 copies movies to create unparalleled picture quality DVD backups, whether it?s the main title you?re copying or the complete DVD. CloneDVD will compress long footage at high speed to the highest of quality using specialised transcoding technology, allowing you to select your audio and language settings and also the final target size. Easy for even the novice user, CloneDVD?s intuitive Filmstrip assistant guides you through all the available configuration settings, allowing you to choose which chapters to include and offering the option to trim individual chapters.\n\nA visual quality bar shows how your configuration choices affect the quality of the final copy. Note that copying protected DVDs also requires AnyDVD.\n\n\n\nFeatures\n\n    * Copies the main movie, special features and/or the original menu onto DVD recordable media or your hard-disk\n    * Newly improved transcoder: Better picture quality at high reduction rates (footage of more than two hours)\n    * Impressive speed at high reduction rates\n    * Video Preview shows an overview of all selectable DVD titles\n    * Include or exclude the original menu\n    * Visual quality control through quality bars during the title and language selection\n    * Target size freely adjustable\n    * Chapter trimming/splitting available\n    * Very easy to use: Our unique Filmstrip assistant will guide you step-by-step through all settings - easy for beginners\n    * Preferences: Memorizes the last settings that were used and uses those settings in future sessions\n    * Layer break flag removal possible\n    * Picture snapshots while transcoding and remixing\n    * Real-time bitrate and frame statistics while transcoding\n    * Logging window available\n    * Preview the movie during transcoding and writing\n    * Works with most DVD player hardware and software\n    * Works with DVD-R/RW and DVD+R/RW media\n    * Stable, fast and does not require an ASPI driver \n\nSystem Requirements\n\n    * An IBM-compatible personal computer with a minimum 500 MHz Pentium-class microprocessor (1 GHz recommended) and 128 MB RAM (256 MB recommended)\n    * Windows 98/98SE/ME/2000/XP/XP64/VISTA/VISTA64\n    * If you use Windows NT, Windows 2000 or Windows XP you must be an administrator to install CloneDVD 2\n    * DVD reader and preferably a DVD writer\n    * About 5 GB of temporary available hard-drive space is necessary to clone DVDs \n\n","torrent":{"xt":"urn:btih:e05a067528076fe5f7629bf217badf7bc5f5caf8","amp;dn":"Slysoft+CloneDVD+v2.9.1.8+-+Retail.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e05a067528076fe5f7629bf217badf7bc5f5caf8","infoHashBuffer":{"type":"Buffer","data":[224,90,6,117,40,7,111,229,247,98,155,242,23,186,223,123,197,245,202,248]},"announce":[],"urlList":[]}}