{"title":"NOD 32 3.0.645.0 Business Edition [FULL]","uid":4211932,"size":19067184,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e0e30de2ced612463c254bd8da8c01c779adf888&amp;dn=NOD+32+3.0.645.0+Business+Edition+%5BFULL%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"googleg","files":3,"time":1212112853,"description":"This is FULL LICENSE UPDATEABLE VERSION! \n\nI don`t like cracked antivirus programs, so I found this FULL version and I`m sharing with others.\n\nSET Smart Security prevents, detects and removes malware such as adware, bots, rootkits, spyware, trojans, viruses, worms and other Internet threats you face on the job, at home and everywhere your computer goes.\n\n      * Stay Healthy: ESET Smart Security blocks more than 70% of new malware threats proactively.\n      * Fewer Email Threats: New spam blocker works to prevent annoying junkmail, scams and phishes from your inbox.\n      * Protect Your Privacy: Prevents, detects and disables spyware. We keep an eye out for them to make sure they?re not keeping an eye on you.\n      * Increased Safety: Bidirectional firewall with intrusion detection features to protect both incoming and outgoing Internet connections.\n      * Lightweight: ESET Smart Security consumes far fewer resources than similar products, which means your computer can spend more time working on other tasks.\n\n\n\nESET Smart Security: A Fully Integrated Security Solution\nThere is no better protection for your computer than ESET Smart Security, built on the award-winning ESET NOD32Â® Antivirus and its powerful ThreatSenseÂ® engine.\nFour Simple Reasons to Choose ESET Smart Security\n\nProactive Protection:\nESET Smart Security was designed and built as a single integrated solution to provide the most proactive threat detection in the world. Engineered to provide the fastest scanning speeds available with the least overhead.\n\nLightweight and Fast:\nESET Smart Security detects and disables Internet threats with minimal impact on your computer&amp;#039;s system performance.\n\nPrecise:\nUtilizes advanced technology to ensure accurate detection of viruses, trojans, spyware and other evolving threats. This means you can surf the web, play games, email your friends and use your computer with complete confidence.\n\nAntivirus + Antispyware + Antispam + Personal firewall = ESET Smart Security \n\nEnjoy!","torrent":{"xt":"urn:btih:e0e30de2ced612463c254bd8da8c01c779adf888","amp;dn":"NOD+32+3.0.645.0+Business+Edition+%5BFULL%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e0e30de2ced612463c254bd8da8c01c779adf888","infoHashBuffer":{"type":"Buffer","data":[224,227,13,226,206,214,18,70,60,37,75,216,218,140,1,199,121,173,248,136]},"announce":[],"urlList":[]}}