{"title":"NOD32_3.0.621 _Business_Edition_A-i-O [bg]","uid":4126878,"size":41095160,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:e1471b80b6d50155359dde78dd9000e1e09a9d56&amp;dn=NOD32_3.0.621+_Business_Edition_A-i-O+%5Bbg%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigbos","files":3,"time":1207840483,"description":"The Business Edition of ESET NOD32 Antivirus is an incredibly scalable solution, accommodating businesses with anywhere from five to hundreds of thousands of seats. \n\nIt includes all the features and benefits described above, but has additional functionality and flexibility that every growing business requires: \nServer Installation: ESET NOD32 Antivirus Business Edition may be installed on servers as well as workstations (the Home Edition can only be installed on workstations). This is a critical feature for the competitive business as servers are just as vulnerable to attack as workstations. Should your servers be unprotected, one virus can take down your entire system. \nRemote Administration: Monitor and administer your security solution from anywhere in the world with the ESET Remote Administrator. This is an absolutely necessary feature for the business with more than one location, or the systems administrator who works remotely or travels. \n?Mirror? Capability: ESET?s mirror functionality enables your IT administrator to conserve bandwidth by creating an internal update server. This prevents each employee from having to access the Internet for updates, which not only conserves resources, but also reduces overall susceptibility to threats.\n\nInsert Bulgarian language and patch !","torrent":{"xt":"urn:btih:e1471b80b6d50155359dde78dd9000e1e09a9d56","amp;dn":"NOD32_3.0.621+_Business_Edition_A-i-O+%5Bbg%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e1471b80b6d50155359dde78dd9000e1e09a9d56","infoHashBuffer":{"type":"Buffer","data":[225,71,27,128,182,213,1,85,53,157,222,120,221,144,0,225,224,154,157,86]},"announce":[],"urlList":[]}}