{"title":"Coast to Coast Radio Program! Commercial Free! May 13th thru May","uid":4201304,"size":496625308,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:e172380b667c2f4713091801db4c5c28178c4eed&amp;dn=Coast+to+Coast+Radio+Program%21+Commercial+Free%21+May+13th+thru+May&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Stokeman","files":45,"time":1211510081,"description":"Expanding the Consciousness of the entire planet! Coast to Coast AM with George Norry! Download, SEED, and Enjoy! Until next week.... Stokeman Out.....\n\n\nTuesday May 13th, 2008\nExopolitics, ETs &amp; the Vatican\nIn a special evening on the subject of &amp;#039;exopolitics,&amp;#039; several guests reacted to the Vatican&amp;#039;s comments about aliens (see below), and the UK&amp;#039;s release of UFO files. In the second hour, UFO journalist Paola Harris noted the quotes that Rev. Funes made... \nHost: George Noory\nGuest(s): Brian Greene, Michael E. Salla, Alfred Webre, Paola Harris, Richard C. Hoagland\n\nWednesday May 14th, 2008\nThe Influence of Randomness\nAppearing in the middle two hours, physicist and writer Leonard Mlodinow spoke about his recent studies on randomness, and the influence it has in our daily lives. The title of his new book, The Drunkard&amp;#039;s Walk, refers to the idea that we often end...\nHost: George Noory\nGuest(s): Leonard Mlodinow, Richard C. Hoagland\n\nThursday May 15th, 2008\nUn-Natural Disasters &amp; Giants\nAuthor and expert in survivalism Steve Quayle discussed how disasters such as the Chinese quake, the Myanmar cyclone, and the tornadoes in the U.S. have been coming fast and furious. He suggested that some of these events could be caused by weather... \nHost: George Noory\nGuest(s): Steve Quayle, Leo Laporte, Douglas Hagmann\n\nFriday May 16th, 2008\nTrilogy Hotline\nDuring Open Lines, George offered a different special topic line each hour. A former Hospital Corpsman in the U.S. Navy phoned into the &amp;#039;Bug Stories&amp;#039; line to share a story about his encounter with an alien that looked like a giant praying mantis. According... \nHost: George Noory\nGuest(s): Open Lines, Anthony Carr\n\nSaturday May 17th, 2008\nGenerations &amp; Crisis Cycles\nHistorian and economist Neil Howe discussed his work on generations and how they shape history as well as cycles of crisis. According to Howe, there are four different types of generations -- Boomers, Generation X, Millennial and Lost -- that have tended...\nHost: Ian Punnett\nGuest(s): Neil Howe, Galen Cook, Tudor Parfitt, Kristi Piehl\n\nSunday May 18th, 2008\nMad Cow Disease in America\nGeorge Knapp (email) was joined by former cattle rancher turned vegetarian and food safety activist, Howard Lyman. People don&amp;#039;t have a clue about the seriousness of Mad Cow Disease (called CJD in humans), and as many as 450,000 Americans may have the... \nHost: George Knapp\nGuest(s): Howard Lyman, John Lear\n\nMonday May 19th, 2008\nAngelic Communications\nAngel communicator Ann Albers discussed mystical dimensions, evolved spiritual beings, and demonic entities. Angels are like the nerve signals of the universe, and can be thought of as frequency beings, she said. Demons, in contrast, are disconnected... \nHost: George Noory\nGuest(s): Ann Albers, Jim Berkland, Jerome Corsi, Deborah Pratt\n\nTuesday May 20th, 2008\nFlex Fuel Mandate\nAppearing during the middle two hours, aerospace engineer Robert Zubrin shared his strategy for reducing dependence on foreign oil. If the oil cartels&amp;#039; profits continue at the current rate, they will eventually be worth more than the entire Fortune 500,... \nHost: George Noory\nGuest(s): Dr. Robert Zubrin, Robert Felix\n\nWednesday May 21st, 2008\nGhosts &amp; the Spirit World\nCelebrated medium James Van Praagh returned for a discussion on his encounters with ghosts and the spirit world, as well as his psychic intuitions. Everyone is mediumistic to some extent and can channel energy from the spiritual dimension or their... \nHost: George Noory\nGuest(s): James Van Praagh, Barrie Schwortz","torrent":{"xt":"urn:btih:e172380b667c2f4713091801db4c5c28178c4eed","amp;dn":"Coast+to+Coast+Radio+Program%21+Commercial+Free%21+May+13th+thru+May","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e172380b667c2f4713091801db4c5c28178c4eed","infoHashBuffer":{"type":"Buffer","data":[225,114,56,11,102,124,47,71,19,9,24,1,219,76,92,40,23,140,78,237]},"announce":[],"urlList":[]}}