{"title":"Nine Inch Nails - Ghosts I [2008][CD+Cover]","uid":4063260,"size":63822735,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e293c399377430d39460dee4863b0d62e06210b0&amp;dn=Nine+Inch+Nails+-+Ghosts+I+%5B2008%5D%5BCD%2BCover%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"softnails4","files":1,"time":1204687094,"description":"Nine Inch Nails: Ghosts I (2008)\n\nHello from Nine Inch Nails.\n\nWe&amp;#039;re very proud to present a new collection of instrumental music, Ghosts I-IV.  Almost two hours of music recorded over an intense ten week period last fall, Ghosts I-IV sprawls Nine Inch Nails across a variety of new terrain.\n\nNow that we&amp;#039;re no longer constrained by a record label, we&amp;#039;ve decided to personally upload Ghosts I, the first of the four volumes, to various torrent sites, because we believe BitTorrent is a revolutionary digital distribution method, and we believe in finding ways to utilize new technologies instead of fighting them.\n\nWe encourage you to share the music of Ghosts I with your friends, post it on your website, play it on your podcast, use it for video projects, etc.  It&amp;#039;s licensed for all non-commercial use under Creative Commons.\n\nWe&amp;#039;ve also made a 40 page PDF book to accompany the album.  If you&amp;#039;d like to download it for free, visit http://ghosts.nin.com/main/pdf\n\nGhosts I is the first part of the 36 track collection Ghosts I-IV.  Undoubtedly you&amp;#039;ll be able to find the complete collection on the same torrent network you found this file, but if you&amp;#039;re interested in the release, we encourage you to check it out at ghosts.nin.com, where the complete Ghosts I-IV is available directly from us in a variety of DRM-free digital formats, including FLAC lossless, for only $5.  You can also order it on CD, or as a deluxe package with multitrack audio files, high definition audio on Blu-ray disc, and a large hard-bound book.\n\nWe genuinely appreciate your support, and hope you enjoy the new music.  \n\nThanks for listening.\n","torrent":{"xt":"urn:btih:e293c399377430d39460dee4863b0d62e06210b0","amp;dn":"Nine+Inch+Nails+-+Ghosts+I+%5B2008%5D%5BCD%2BCover%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e293c399377430d39460dee4863b0d62e06210b0","infoHashBuffer":{"type":"Buffer","data":[226,147,195,153,55,116,48,211,148,96,222,228,134,59,13,98,224,98,16,176]},"announce":[],"urlList":[]}}