{"title":"Black Sabbath - Vol.4 (1972) (W.B.Rhino Rem. 2004) [EAC-FLAC]","uid":4220736,"size":320173505,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:e2dc2ff3a463365dc721ef83ad12512d28bdc981&amp;dn=Black+Sabbath+-+Vol.4+%281972%29+%28W.B.Rhino+Rem.+2004%29+%5BEAC-FLAC%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Sworduigi","files":10,"time":1212538525,"description":"Extractor: EAC 0.99 prebeta 4 \nRead Mode: Secure \nUtilize accurate stream : Yes\nDefeat audio cache      : Yes\nMake use of C2 pointers : No\n\nCodec: Flac 1.2.1;  Level 8  \n\nSource: Found (Ripped by Necromandus)\nArtwork: Full scans.\n\n\nGeneral Info:\n\n\nAlbum: Vol. 4\n\nLabel Warner Bros/Rhino (2004) \n\n\nTracklist:\n   1. &quot;Wheels of Confusion/The Straightener&quot; ? 8:01\n   2. &quot;Tomorrow&amp;#039;s Dream&quot; ? 3:11\n   3. &quot;Changes&quot; ? 4:44\n   4. &quot;FX&quot; ? 1:43\n   5. &quot;Supernaut&quot; ? 4:49\n   6. &quot;Snowblind&quot; ? 5:33\n   7. &quot;Cornucopia&quot; ? 3:54\n   8. &quot;Laguna Sunrise&quot; ? 2:55\n   9. &quot;St. Vitus Dance&quot; ? 2:29\n   10. &quot;Under the Sun/Every Day Comes and Goes&quot; ? 5:52\n\n\n                 LINE UP:\n\n    * Ozzy Osbourne ? vocals\n    * Tony Iommi ? guitar, piano, mellotron\n    * Geezer Butler ? bass guitar\n    * Bill Ward ? drums\n\n    * Colin Caldwell, Vic Smith ? engineering\n    * Patrick Meehan ? production\n    *Dan Hersch, Bill Inglot ? remastering (2004)\n\n\nReview taken from rollingstone.com:\nAs the Sabs poured into &quot;Wheels of Confusion&quot; like giant gobs of wet cement gushing from the heavens in the \n\nnever-ending sameness of a taffy-pull performed by mutants, people began pouring into my house. One by one they \n\ninstantly began digging the Sabs, nodding, heavy dudes one and all. Everyone picked up that old Sab neck-wobble \n\ntrip where your head sort of rocks back and forth on your neck python-fash, right? Where the organ comes in over \n\nthe big slow power chords; no it&amp;#039;s not an organ, call it a component, yah, straight out of the Middle fucking Ages! \n\nSorta walks right on out. Like some giant prehistoric plant learning how to walk ... right over your house ... so boogie \n\nwhile you can. But you can&amp;#039;t lose that dyno chthonic zoomout riff &amp;#039;cos it&amp;#039;s right there in the middle of the next song, \n\n&quot;Tomorrow&amp;#039;s Dream,&quot; which got us so zonked we felt absolutely heavy. The cat did too. Then on into a foxy sorta \n\nCarole King piano folk song or something, whew, &quot;Changes,&quot; kind of David Bowie we guessed, hey orchestra right? \n\nWhat? Went its evil way? Ooh. The room got kind of deep and spacey, brown all over, and the notes then sounded \n\nsorta while coming out of that ... y&amp;#039;know? Like a snowfall? It went on forever. We could dig it. Like we dig chewing \n\ngum made out of caulking compound. Right? So then can you conceive of a piercing tone followed by reverberating \n\npercussion noises called &quot;FX,&quot; huh, that was the next tune, then we got tight with some heavy familiar Sab vibes \n\nagain, swimming right up there to deep space where nothing hears or talks, right? &quot;Supernaut.&quot; My sister had a \n\nvision of electronic buffalo ranches on Uranus, so help me. The drum solo in this song did it to her. Also, my watch \n\nstopped. But the Sabs didn&amp;#039;t. Who needs a watch? I ripped it off my wrist &amp; stomped on it. Slowly. Crunch. Side one \n\ngroaned to a close, but soon side two followed it, without delay adhering to the walls of one&amp;#039;s septum--the total \n\n&quot;icicles in my brain&quot; riff--right--&quot;Snowblind,&quot; no less--climbing those big staircases made out of vanilla fudge, right up \n\ninto your mind--so feed your nose, hey? God&amp;#039;s a Fuzz Tone, right? The Abominable Snowman? Hey. La Fucking Brea! \n\nThe tar pits was a heavy scene, right? Ask Freud or Dave Crosby. What a streaming feast of nerve gobble anyhow! \n\nBut on with the snow, I mean show. Time for a Pez break. Whew. Monster slowness of the unelusive strikes again: \n\n&quot;Cornucopia.&quot; I about fell out. Ten-ton dogs snarled in the mouth of the volcano. Storms of liquid metal blasted their \n\nway into the soap factory. Soaring zoos, etc. Then on to babies&amp;#039; time; breakfast on a sleigh in Hawaii with violins, \n\ntitled &quot;Laguna Sunrise.&quot; All sweet lime stripes across a popsicle spiced with Quaaludes, right. A million artichokes \n\ncan&amp;#039;t be wrong. Dreaming in the sun with their eyes open? Sweet music must end. Grunting, we tumble on into the \n\nnew dance craze, you guessed it, &quot;St. Vitus Dance.&quot; You drive me nervous. Pieces of hair got into my mouth during \n\nthis one. Same old power saw on Venus move, lovely. &quot;Under the Sun&quot; starts out slow, like dinosaurs yawning, then \n\nit speeds up a little. Or does it? I can&amp;#039;t tell. Fantastic four-second guitar solo by a gorilla in there somewhere, \n\nright--beautiful--gorilla! The Sabs pour it on, man, it&amp;#039;s right near the end of the record now and here&amp;#039;s a great \n\nthree-second drum solo by a polar bear, no shit! Put mud in my ears if I lie! I can dig it! Great buncha chords there \n\ntoo, I couldna chose better myself, whew, we&amp;#039;re thudding down toward the ultimate rip chord now. Gotcha. Over and \n\nout. Molten rocks hurtling across space imitating the origin of the universe, you dig? Ah, lay those chord slabs on my \n\ngrave ... whew. The Sabs are genius. ","torrent":{"xt":"urn:btih:e2dc2ff3a463365dc721ef83ad12512d28bdc981","amp;dn":"Black+Sabbath+-+Vol.4+%281972%29+%28W.B.Rhino+Rem.+2004%29+%5BEAC-FLAC%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e2dc2ff3a463365dc721ef83ad12512d28bdc981","infoHashBuffer":{"type":"Buffer","data":[226,220,47,243,164,99,54,93,199,33,239,131,173,18,81,45,40,189,201,129]},"announce":[],"urlList":[]}}