{"title":"Farscape S1D3 NL subs","uid":4090696,"size":4675762223,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e3ef61476990d1c2491cc1b7044093baad3c82b8&amp;dn=Farscape+S1D3+NL+subs&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"viriidaoutlaw","files":12,"time":1206052781,"description":"[img]http://www.farscape-one.de/images/season2_01.jpg[/img]                                                                          \nCommandant John Crichton werkt als astronaut bij de NASA. Zijn hele leven is hij met ruimtevaart opgegroeid, want zijn vader is ook astronaut. Maar John is een nieuwe generatie en hij krijgt andere kansen dan zijn vader kreeg. Zo heeft John een ruimteschip gemaakt welke het mogelijk zou moeten maken om met hoge snelheid in de ruimte te reizen. Natuurlijk kan dit ruimteschip dat in theorie wel, maar nu moet het getest worden. En wie kan dat beter doen dan John zelf. \n\n[img]http://www.farscape-one.de/images/bbphoto27.jpg[/img]\n\nHij gaat met de Spaceshuttle naar het ruimte staion dat in een baan om de aarde draait en vandaar uit stapt hij over in de Farscape 1. Alles gaat prima en zijn snelheid wordt flink opgevoerd. Maar dan zien de computers van Nasa een energie uitbarsting vlak in de buurt van Farscape1. Op dat moment is het contact tussen John en NASA verdwenen. \nJohn wordt in een wormgat getrokken en zijn schip is onbestuurbaar. Bij NASA verdwijnt John van de monitor. \nAls John aan de andere kant uit het wormgat komt treft hij zichzelf onbestuurbaar aan en zit hij midden in een ruimte gevecht. Een wat? Een ruimte gevecht! Aliens bestaan dus en reizen in de ruimte lijkt voor deze wezens een dagelijks uitje! John staat verteld van wat hij ziet en kan het niet voorkomen dat een ander ruimte schip tegen hem aan botst en vernietigd wordt. \n\n[img]http://www.fsfanatic.com/moya.jpg[/img]\n\nHij wordt door een zeer groot schip aan een trekstraal naar binnen gehaald en dan begint zijn nieuwe avontuur aan boord van Moya en leert hij zijn nieuwe reisgenoten kennen.\n\n[img]http://www.farscape-one.de/images/bbphoto14.jpg[/img]\n\nRockne S. O&amp;#039;Bannon is samen met Brian Henson (zoon van Jim Henson) de maker van deze serie. Brian wilde al een tijd laten zien dat het bedrijf &quot;Henson Creature Shop&quot; meer kon dan alleen maar poppen maken voor bijvoorbeeld de Muppets (en niet te vergeten Joda). Hij wilde graag iets doen voor een volwassener publiek. Daar zijn ze zeker in geslaagd. De humor, de actie, de woordspelingen en de special effects zijn &amp;#039;groter gegroeid&amp;#039; en zien er goed uit.\n\n[img]http://www.farscape-one.de/images/rygel06.jpg[/img]\n\nMaar vooral de wezens gemaakt door Henson Creature Shop zijn, werkelijk prachtig. In deze serie spelen Rygel en Pilot daarin de hoofdrollen. Rygel is een kleine veelvraat en is afstammeling van de adellijke kant van zijn volk, maar is afgezet door een neef. \n\n[img]http://www.farscape-one.de/images/pilot03.jpg[/img]\n\nEn Pilot is zoals zijn naam aangeeft de piloot van het levende schip Moya. \nAndere wezens waar John Crichton verder mee moet omgaan tijdens zijn verblijf in Moya is Pa&amp;#039;u Zotoh Zhaan. Een hoge priesteres die geheel blauw is en een rustige wijze invloed op de rest heeft. \n\n\n\n[img]http://www.farscape-one.de/images/bbasphoto01.jpg[/img]\n\nDan is daar ook nog de Luxaanse krijger Ka D&amp;#039;Argo. een groot man die niet van praten maar van vechten houdt.\nJohn Crichton is een nuchter man die veel naar films keer toen hij nog op aarde was, want hij refereert veel naar films of naar acteurs en is een product van de moderne popcultuur.\n\n[img]http://i240.photobucket.com/albums/ff199/sffreak1000/Farscape_S1.jpg[/img]\n\n[img]http://i240.photobucket.com/albums/ff199/sffreak1000/farscapeinfos1.jpg[/img]\n\n[b]Regie:[/b]\nTony Tilse, Rowan Woods, Ian Watson, Andrew Prowse\n[b]Met:[/b] \nBen Browder, Claudia Black, Virginia Hey, Anthony Simcoe, Gigi Edgley, Jonathan Hardy, Lani John Tupu, Wayne Pygram\n[b]Genre:[/b]\nSciencefiction - Aktie - Avontuur\n[b]Beeldformaat:[/b]\n1.33:1 NTSC\n[b]Geluid:[/b]\nEngels Dolby Digital 5.1\n[b]Ondertitels:[/b]\nNederlands","torrent":{"xt":"urn:btih:e3ef61476990d1c2491cc1b7044093baad3c82b8","amp;dn":"Farscape+S1D3+NL+subs","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e3ef61476990d1c2491cc1b7044093baad3c82b8","infoHashBuffer":{"type":"Buffer","data":[227,239,97,71,105,144,209,194,73,28,193,183,4,64,147,186,173,60,130,184]},"announce":[],"urlList":[]}}