{"title":"Freedom Fighters","uid":4091335,"size":694171028,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:e44799c2f22c8c7fb5ab45596894abbe749dd614&amp;dn=Freedom+Fighters&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"arpit_25","files":69,"time":1206086359,"description":"Gameplay     --         10\n    \nGraphics     --         09\n\nSound        --         09\n    \nValue        --         07   \n    \nTilt         --         10 \n\n\nTake to the streets of New York City and fight for your freedom!\n\nIn a world where the Soviet Union won the Cold War, a fierce conflict is unfolding in the streets of America. Taking on the role of Christopher Stone, players evolve from an average New Yorker into a fearless patriot who recruits and leads an army of freedom fighters in the streets of New York City. Freedom Fighters combines the depth of a squad-based game with the intensity of an action-packed war game that unfolds in the streets, subways, and buildings of the city.\n\nWith leadership comes great responsibility. The lives of your soldiers and the quest for American Freedom are held together by your courage, charisma, and leadership skills. Because wars are not won alone, a key component of the game depends on the player\\\\\\\\\\\\\\&amp;#039;s ability to recruit and lead fellow New Yorkers in the battle against the Red Menace. An intuitive recruiting command system allows him to give orders to his fellow soldiers and execute critical missions at the touch of a single button.\n\nPlayers will fight through the recognizable streets of NY with seamless urban fighting that takes place outside as well as indoors.\n\nThere are high rewards and penalties for wins and losses in Freedom Fighters. A charisma-based Recruiting System awards points for rescuing freedom fighters or capturing vital installations, allowing the player to recruit more men as well as providing an emotional tie to the fighters.\n\nYour character and recruits engage the Red army with various types of single and two-handed weapons as well as unarmed combat martial arts maneuvers in their quest for freedom.\n     ","torrent":{"xt":"urn:btih:e44799c2f22c8c7fb5ab45596894abbe749dd614","amp;dn":"Freedom+Fighters","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e44799c2f22c8c7fb5ab45596894abbe749dd614","infoHashBuffer":{"type":"Buffer","data":[228,71,153,194,242,44,140,127,181,171,69,89,104,148,171,190,116,157,214,20]},"announce":[],"urlList":[]}}