{"title":"The Six Wives of Henry the VIII - BBC 1970 - Part 4 of 6","uid":4129754,"size":908894432,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e4c7f7aa5c3f796ed0ce8b0485df2ac445154fb2&amp;dn=The+Six+Wives+of+Henry+the+VIII+-+BBC+1970+-+Part+4+of+6&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"anca13","files":1,"time":1207972415,"description":"Please seed after download. Thanks :)\n\n\nBy \tfelicitaz &quot;felicitaz&quot; (NY, USA) \n\nI saw this series as a child, and it profoundly influenced my life, making me an eager historian and costumer ever after. Just a year or so ago, my brother gave this series to me as a gift, and it is even better than I remembered it. \n\nThe reign of the Tudors followed the War of the Roses, a bloody, chaotic part of British history, characterized by civil war and royal asassinations. The two little princes in the Tower, murdered by order of Richard III, were Henry VIII&amp;#039;s uncles. His father, Henry VII, ended the strife by defeating Richard III, and marrying the Yorkist heir, Elizabeth. Their union brought stability to England. \n\nYou have to keep these events in mind when watching this series, because they make Henry VIII&amp;#039;s actions understandable. His seemingly monomaniacal need for a son was his effort to ensure that nothing like the War of the Roses would happen again. \n\nThis series is for the serious Tudor buff. It comes from the era of BBC productions that were richly intellectual, subtly acted and true to the original material. Also, looking at it again after so many years, I realize what a parade of first class British actors participated: Annette Crosbie, Dame Dorothy Tutin, Patrick (&quot;Dr. Who&quot;) Troughton, Bernard Hepton, and even Mollie (&quot;Are You Being Served&quot;) Sugden. \n\nKeith Michell delivers a Henry VIII whom you can hate and yet sympathize with--very human, sometimes weak, sometimes funny. He is a scholar, musician, knight, statesman, victim, tyrant, penitent, cuckold, and philosopher, as events dictate. His Henry is very complex; and one of the pleasures of this production is that you find yourself watching to see which Henry is going to emerge. One can imagine that his wives and courtiers also walked on eggshells, not knowing which facet of his personality might turn itself in them at any given time. \n\nOf the six episodes: \n\nANNA OF CLEVES: So little is known about this wife that I can&amp;#039;t justly complain over the liberties the script writer took with her story and character. I think this is the weakest of the series, because it tries too hard to turn Anna into a modern woman. It seems that they were inspired by &quot;The Private Life of Henry VIII&quot;--the wedding night scene owes some of its comedy to Elsa Lancaster and Charles Laughton. That said, it&amp;#039;s thoroughly enjoyable. I also enjoy the final dinner scene between the happily to-be-divorced couple. In historical fact, once they were divorced, they became good friends. A nice sideline is Mollie Sugden&amp;#039;s turn as Anna&amp;#039;s maid Lotte. There are one or two scenes where you can see that Mrs. Slocom look on her face, and I quite long to hear her tell Henry to &quot;Shut your cake hole!&quot;\n\n","torrent":{"xt":"urn:btih:e4c7f7aa5c3f796ed0ce8b0485df2ac445154fb2","amp;dn":"The+Six+Wives+of+Henry+the+VIII+-+BBC+1970+-+Part+4+of+6","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4c7f7aa5c3f796ed0ce8b0485df2ac445154fb2","infoHashBuffer":{"type":"Buffer","data":[228,199,247,170,92,63,121,110,208,206,139,4,133,223,42,196,69,21,79,178]},"announce":[],"urlList":[]}}