{"title":"LEARN &amp; MASTER GUITAR BASIC LESSONS 1","uid":4221415,"size":4172349440,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:e4eb1b5fa5a4781237e53285631e2d5ceb78e1ff&amp;dn=LEARN+%26+MASTER+GUITAR+BASIC+LESSONS+1&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":4,"uploader":"GITIT","files":1,"time":1212610053,"description":"MY FIRST ATTEMPT AT UPLOAD, SO BE PATIENT IF THINGS GO WRONG :)\n\nTHIS IS SAID TO BE THE BEST METHOD OF LEARNING GUITAR IF YOU CANT AFFORD A PERSONAL INSTRUCTOR (AND FROM WHAT I HAVE USED, IT SEEMS TO BE A FACT). I COULDNT EVEN AFFORD THE PROGRAM SO I BOUGHT IT ON THE MONEY BACK GUARANTEE, RIPPED TO ISO, PAID THE RETURN SHIPPING, AND NOW I\\\\\\&amp;#039;M SHARING THE LACK OF WEALTH WITH YOU!\n\nUPLOADING: THIS IS COMING TO YOU FROM THE HILLS VIA SATELLITE. IM LIMITED TO 425MB PER DAY (AT $80 A MONTH!!) EXCEPT FOR THE HOURS OF 2 TO 5AM CST. THAT IS THE ONLY TIME I AM ONLINE, BUT I WILL SEED UNTIL 2 HAVE THE COMPLETE FILE, THEN I WILL UPLOAD THE NEXT DVD (THE ENTIRE COLLECTION IS ABOUT 55GB), BUT IF YOU ARE PATIENT IT WILL ALL BE MADE AVAILABLE TO YOU IN THE ORDER IT SHOULD BE VIEWED. THERE IS NO ENCRYPTION, JUST BURN OR MOUNT THE IMAGE.\n\nTHERE ARE A TOTAL OF 20 DVDs (10 BASIC SESSIONS, 10 BONUS WORKSHOPS), AND 5 AUDIO JAM ALONG CDs. THERE IS ALSO A LENGTHY WORKBOOK WHICH, WHEN I HAVE TIME TO SCAN AND CONVERT TO PDF, WILL ALSO BE AVAILABLE. AND ONE JPEG FILE OF INSTRUCTIONS FROM THE PACKAGE COVER. HERE IS BASIC DVD 1.\n\nENJOY. AND THANK YOU ALL FOR THE TREMENDOUS FILES MADE AVAILABLE TO ME OVER THE LAST 6 MONTHS!!","torrent":{"xt":"urn:btih:e4eb1b5fa5a4781237e53285631e2d5ceb78e1ff","amp;dn":"LEARN+%26+MASTER+GUITAR+BASIC+LESSONS+1","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e4eb1b5fa5a4781237e53285631e2d5ceb78e1ff","infoHashBuffer":{"type":"Buffer","data":[228,235,27,95,165,164,120,18,55,229,50,133,99,30,45,92,235,120,225,255]},"announce":[],"urlList":[]}}