{"title":"Lil Laura - Through the Looking Glass","uid":4070944,"size":220839940,"categoryP":"porn","categoryS":"movies","magnet":"?xt=urn:btih:e5a9adceb25d065679da04c3c81f07e999537c0a&amp;dn=Lil+Laura+-+Through+the+Looking+Glass&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Magical.Unicorn.Mayonaise","files":1,"time":1205051134,"description":" &lt;a href=&quot; http://www.lillaura.com/tour/001/main.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.lillaura.com/tour/001/main.php&lt;/a&gt;\n\n\nOne thing that separates Lil Laura from the rest of the teen web girls is that she is not a tease. A lot of the girls pretend to be naughty and you think you are gonna see their bald pussy or see a shot of there ass hole, but they never deliver. Well Lil Laura works hard to make you happy. Not only does Lil Laura deliver, but she also goes above your wildest expectations by getting fully nude with her totally sexy teen friends. They don\\\\\\&amp;#039;t stop with fully nude either. They go all the way and eat pussy and bite nipples and stick toys in each other. There really is no limit from what I can see to what lil laura enjoys doing. Some of the young web girls only do girl girl and won\\\\\\&amp;#039;t touch a cock - not this hardcore redhead. She is not bashful about taking a big cock in her mouth or by being penetrated.\n\none of the things I love about Lil Laura is her beautiful long red hair. She is by far the sexiest redhead teen on line. I dare say that lil laura is one of the naughtiest redheads on line as well. She has little bitty tits and I know some people think that is a turnoff but I find it totally hot. Lil Laura has a totally shaved pussy, a very skinny body, and a tight teen ass. I can\\\\\\&amp;#039;t decide if she is more cute or sexy. She is definitely a little bit of both. A great mix of cute and sexy. I\\\\\\&amp;#039;d say that she was just cute if wasn\\\\\\&amp;#039;t for the fact that she is a horny little slut. Your fantasy is her reality.\t\t","torrent":{"xt":"urn:btih:e5a9adceb25d065679da04c3c81f07e999537c0a","amp;dn":"Lil+Laura+-+Through+the+Looking+Glass","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e5a9adceb25d065679da04c3c81f07e999537c0a","infoHashBuffer":{"type":"Buffer","data":[229,169,173,206,178,93,6,86,121,218,4,195,200,31,7,233,153,83,124,10]},"announce":[],"urlList":[]}}