{"title":"TALVAR (2015)-DVD rip-HEVC-x265.aac.Esubs-1CD-[DDR]","uid":12851521,"size":731084127,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e60ecda8c0e9115c510cd392a90f2963bd9b70c4&amp;dn=TALVAR+%282015%29-DVD+rip-HEVC-x265.aac.Esubs-1CD-%5BDDR%5D&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"SaM","files":2,"time":1448626542,"description":"DDR Presents\r\n\r\n\r\nTALVAR(2015\r\n(A film by Meghna Gulzar)\r\n\r\nHindi - DVD rip - 720x304p (2.35:1)- 697 MB - x265.AAC (Dolby-II) - 2 Hrs:13 Min\r\n\r\nHIGH EFFICIENCY VIDEO ENCODING (HEVC)\r\n \nhttp://extraimago.com/image/YYh \nhttp://extraimago.com/image/YYd \nhttp://extraimago.com/image/YYI \nhttp://extraimago.com/image/YYl \nhttp://extraimago.com/image/YYm \nhttp://extraimago.com/image/YYR \nhttp://extraimago.com/image/YYL \nhttp://extraimago.com/image/YYy \nhttp://extraimago.com/image/YYq \nhttp://extraimago.com/image/YYO \nhttp://extraimago.com/image/YYE\r\n\r\n Tech Specifications:\r\n \nhttp://extraimago.com/image/YYQ\r\n\r\nSynopsis:\r\n14 Year old Shruti Tandon (Ayesha Parveen) is found dead in her room. The police initially think that the servant Khempal iss the murderer, but when his dead body too is recovered the next day, suspicion vers towards Ramesh Tandon (Neeraj Kabi) and his wife Nutan (Konkona Sensharma). When the local police fail to solve the case, it is handed over to the Central Department of Investigation or CDI. The case is given to Detective Ashwin Kumar (Irrfan Khan). Ashwin and his associate Vedant (Sohum Shah) carry out a thorough investigation and decides that the parents are innocent.\r\n\r\nJust then, matters take a turn. Ashwin Kumar's boss, who thought the world of him, retires and his successor, takes the case away from Kumar and gives it to Paul, his former boss and arch enemy. Paul comes to a completely different conclusion from the result of the investigations and believes the Tandons are guilty.\r\n\r\nFinally, CDI decides to state in court that although circumstantial evidence points to the guilt of the parents, there is not enough evidence and requests the case be closed. Ramesh Tandon refuses to accept this conclusion. He wants to be exonerated. The judge throws out the conclusion of the CDI. In the trial that follows, the Tandons are found guilty and sentenced to life imprisonment.\r\n\r\nComments:\r\nThe film is based on the sensational Arushi Talwar Murder case and attempts to provide an impartial analysis of the entire case. It presents a gripping story, with both Niraj Kabi and Konkona Sensharma playing, first the distraught parents and then two individuals fighting to clear their names. But the person who really holds the film together is Irrfan Khan playing the role of a multifaceted Ashwin Kumar. The rest come and go. The actors are backed by a fine script which enhances the already gripping storyline. It is a bold film, that starkly places before us the politics and the twists and turns of a murder investigation; of human foibles and the role of a very intrusive press. I wish it had also been brave enough to portray the fickleness of the judiciary, and how judges too are influenced by the publicity and media reporting.\r\n\r\nTechnically this is a superb film. Pankaj Kumar's cinematography is wonderful as is editing by A Sreekar Prasad. Music is relatively ordinary, despite Gulzaar penning the lyrics of four songs. What surprised me was the mature and bold direction of Meghan Gulzar. Her earlier films had been quite ordinary, but in this near docu-drama, she excels.\r\n\r\nThey call it the Rashomon Effect - different people interpreting circumstances in completely different ways. This film is a good exposition of this effect!. Watch it, for it will grip you as few films do. It will be uncomfortable to watch, as we know the film it is based on a true story, but it will also hold you to your chair as events unfold in rapid succession.\r\n\r\nIf I have a grouse, it is about the role of Tabu as the estranged wife of Ashwin Kumar. Her role is superficial. It adds nothing to the story and could have been easily scrapped.\r\n\r\nUploader's Notes:\r\nI think you will like this rip for its visual quality. I ahve reduced the yellow tinge of the original and the colours come out vividly. I have also done a bit of shadow enhancing, which brings out details in the er scenes. I have used Dolby Prologic -II for the sound instead of giving you 5.1 stereo as there is not much in the sound effects to merit the 5.1 sound in the first place. In addition of course there is the magic of 10-bit encoding.\r\n\r\nCheck the screenshots which are evenly spaced across the film and the sample, which is from the exact center of the movie to get an idea of the quality of this rip.\r\n\r\nPlease note that this rip (and all HEVC rips) will not play on any stand-alone device. You can only watch this on a computer. Be sure that you have the latest versions of VLC (2.1.5 or higher) or Media Player Classic (Ver 1.7.9) or SMPlayer (14.9.0). Earlier versions may not work\r\n\r\nIMDB Link:\r\n \nhttp://www.imdb.com/title/tt4934950/","torrent":{"xt":"urn:btih:e60ecda8c0e9115c510cd392a90f2963bd9b70c4","amp;dn":"TALVAR+%282015%29-DVD+rip-HEVC-x265.aac.Esubs-1CD-%5BDDR%5D","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e60ecda8c0e9115c510cd392a90f2963bd9b70c4","infoHashBuffer":{"type":"Buffer","data":[230,14,205,168,192,233,17,92,81,12,211,146,169,15,41,99,189,155,112,196]},"announce":[],"urlList":[]}}