{"title":"Iron Gypsy (Can) - Iron Gypsy 1984 -  80s Geophagus series","uid":4180670,"size":25289167,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e61bf9f9ae3366e2c4dc4f8706163ebf2e9c3e6d&amp;dn=Iron+Gypsy+%28Can%29+-+Iron+Gypsy+1984+-++80s+Geophagus+series&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"thumbsplus","files":10,"time":1210381459,"description":"192\n &lt;a href=&quot;\nhttp://metal-archives.com/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://metal-archives.com/&lt;/a&gt;\n\n\nIron Gypsy\nGenre(s)\nHeavy Metal\nOrigin \tFormed in \tLast label \tStatus\nCanada (Hamilton, Ontario) \t1983 \tWench Records \tSplit-up\nLast known line-up\nJim ``Wickley`` Mark\n``Killer`` Dave Miller\nKen Firomski - bass\nFormer/past member(s)\nEd ``Breaker`` Zern - drums\nRandy Rampage\nDoug Donut\nZippy Pinhead - drums\n\n\nBiography written by Jim ``Wickley`` Mark:\n\nIRON GYPSY was formed in Hamilton, Ontario 1983. The members then were Ed &amp;#039;Breaker&amp;#039; Zern on drums, and Glenn Harder on bass and vocals. I met these two fine musicians while I was living in Edmonton, Alberta. I played in a bar band called X-Static with them. Domestic issues around general survival dissolved that line-up, while in Hamilton. Neither of us had studio experience at that time, but we did have plenty of &amp;#039;live&amp;#039;. I moved back to Edmonton, their home, to re-form, but both were committed to other projects, so I continued on to Vancouver, a city with more to offer, so I thought. I set myself up with a job... bought a Teac 4 track recording machine, and proceeded to get the songs out of my head.\n\nWhen it came time to realize them in a studio, I called Ed (one of the only double bass drummers I knew at the time) and invited him to do the session. Glenn could not come out, so I did the bass guitar myself. Later a bass player was found - Jay &amp;#039;The Pope&amp;#039; Van Riff who was from Seattle, and IRON GYPSY began rehearsing a &amp;#039;live&amp;#039; show. Jay and I moved to Edmonton for Ed&amp;#039;s sake, and an ease of rehearsals. This was 1984.\n\nThat line-up was problematic, with Jay&amp;#039;s over involvement in black magic and dysfunctional habits, let alone unreliability to getting the work done during rehearsals... Ed was weirded out by him and his behaviour, and left to join an established local act called Winterkill. Jay and I went back to Vancouver, and parted ways professionally.\n\nGlenn reconsidered to re-joined, after I decided to moved back to Edmonton. We recruited an ex-drummer friend from the X-Static days, and a live band was established. We played a lot of underground clubs in Alberta, where the punk scene was being accepted. We gained a small following, by giging and air play on radio stations at this time, including main stream FM stations that had &amp;#039;special&amp;#039; time slots for bands like us. The drummer then was Rick Picard (a mechanically sound double bass drummer). Rick soon left because the metal life was incongruent to his married one. That was 1985.\n\nNext, and probably the best line-up the band ever had, but sadly never played live, was Glenn, myself and a guy named Ken Jones.\nI wish this line-up had stayed together long enough to play live and record because we sounded Great then! After this short incarnation, which attracted management... world-wide distribution with Jem Distribution out of New Jersey, USA... an opening slot on a touring heavy metal festival with Saxon and Accept and other such bands of the day, at that time... the frustration of Ken leaving to join a &amp;#039;well paying&amp;#039; Country and Western band, IRON GYPSY was folded again... but was not shelved.\n\nI moved back to Vancouver and threw together a fun band for the spirit of Expo`86 called Rawhide. This band mostly played at the Smiling Buddha and other such local joints for the door take and beer. I spent all of 1986 in this 4 piece, but I was still hungry for bigger action.\n\nIn early 1987, while scouting around looking for players, to re-form IRON GYPSY in Vancouver, on one occassion I was standing in a line-up to see a show at the New York Theatre on Commercial Drive, and ran into a drunken Randy &amp;#039;Rampage&amp;#039; Archibald. I didn&amp;#039;t know who he was, but he said he played bass, so I made a note. I later approached Doug &amp;#039;Doughnut&amp;#039; Prouxl, whom I saw playing a UBC Shindig show with a three piece band called Death Sentence at the defunked Savoy in Gastown, to have a listen to my new demo tape. He liked what he heard and when asked who I had on bass...? I told him that I was going to audition Randy, and Doug filled me in as to who he was, and agreed to come out as well.\n\nBang... the most note-able line-up had met. Later on though there was a clashing of egos between Doug and Randy, and Doug left. Randy told me that he had a friend that he preferred as our drummer... enter Bob &amp;#039;Zippy Pinhead&amp;#039; Chobatar ex. of The Los Popularos with Art Bergman.\n\nThis line-up, as well as the previous one, rehearsed at a place called The Plaza, and debuted at the Smiling Buddha, where our audience was mainly D.O.A. fans because of Randy. Within weeks of forming, we were playing at the Town Pump in Gastown, backing-up 70&amp;#039;s southern rockers Black Oak Arkansas. The dysfunctional &amp;#039;punk life&amp;#039; and the heavy drinking and drugs cursed this line-up and made it unstable to continue on in a professional manner. Rampage and Pinhead were bosom buddies from yesteryear&amp;#039;s scene... and Zippy was into pawning band gear for beer. I was losing myself along with the dream to excesses which turned into messes, so out went Zippy, and Randy reconsidered Doug, my first choice as our replacement.\n\nBack to the Buddha we went, to tighten up this incarnation, and within a couple of months we were backing up Nazareth at the Commodore Ballroom for two glorious back to back shows. This show was recorded, and was meant to be released because it came out so well, but never did due to finances. I lost the tapes in a fire in 1999. We also had back-up slots with Faith No More, and Soundgarden at the Venue (now The Roxy). This show line-up didn&amp;#039;t happen, due to border problems with the American bands. This line-up of IRON GYPSY was sadly short lived because of a re-occurrence of the aforementioned.\n\nIRON GYPSY was still unsigned at this time, and with all the personnel changes, things were not that stable to attract the help needed. I did all the band&amp;#039;s business, booking, advertising, and writing of songs for the most part, and it was taking its toll on me, in a big way. In some ways, I felt that Jay&amp;#039;s dabblings were still with the band... ha ha ha, but I wasn&amp;#039;t laughing then.\n\nBy this time IRON GYPSY had 20 original songs plus, and I though to myself, ``They must be heard!``. So, back to the drawing board.\n\nAfter a few &amp;#039;fun bands&amp;#039; that I threw together, including a trash tribute band called Lois Lane with Kick from Vertical After on bass, and a New Yorker named Roy Lewis on drums, I decided that it was time to resurrect IRON GYPSY, but how...?\n\nThe only way I knew to let people know that I was serious about the songs in my head (mostly recorded with a drum machine and my tiny Teac 4 track, excluding the first EP at that time ), was to go back into the studio and just &amp;#039;Do it&amp;#039;.\n\nI was still in touch with Glenn Harder in Alberta, and asked him if he would be interested in coming out to do my next EP. My sister was kind enough to finance this one, while my brother financed the first one (and incidentally, made all his money back). Glenn agreed, but said he could not move to Vancouver to do the &amp;#039;live&amp;#039; thing. I settled for that because Glenn was a far superior musician, and I felt good about recording with him. But... the drum problem was still there to be dealt with...\n\nWhen I was checking out studios around town at the time, one of the engineers I met introduced me to a new drummer friend of his named Dave &amp;#039;Mofo&amp;#039; Miller. Dave and I got along just fine, but he was not ready for the studio, so I kept looking. I met two guys at a party some weeks later, who just arrived in town from my home town of Toronto. They were a Bass and Drummer team looking to get into something... Hmmmmm, a gift from Jay..? Anyway, the drummer was experienced, but the bass player was not, so I asked him for a favor. Ovidio (I am not sure how to spell his last name) agreed, and he Glenn and I recorded Take #2 in 1988. We had Jerry Doucett - &amp;#039;Mama Let Him Play&amp;#039; hanging around at those sessions, but he did not play on any of the tracks. Jerry offered me to sit in on his new recording, which was being done at the same studio, but I was too shy about the offer. Paul Dean of Loverboy was across the hall, working on his solo album too, at the time.\n\nDuring one of the &amp;#039;fun band&amp;#039; line-ups, I met a bass player named Ken Firomski whom I had been running into a lot lately, and asked him if he might be interested in helping me take it live. Ken agreed, but Ovidio had a change of heart because the music was too demanding and he could not do double bass drumming, nor wanted too. So, I got back in touch with Dave Miller, who was working the No #5 Orange strip club as the DJ, a popular place then where touring and local scene makers of the day frequented, and IRON GYPSY was born again.\n\nThis line-up of Dave, Ken and myself was the last one, but it played &amp;#039;live&amp;#039; the most. One gig we did at The 86 Street Music Hall (now The Rage) was metered at 130 decibels. Someone told me, it was like having a Jet airplane on the dance floor, in idle! So, we advertised ourselves as The Loudest Band in Canada at the time... ha ha ha. We went on to play all the local hot spots at the time, backing up such bands as D.O.A., Kick Axe, Omen, Cro Mags (a show that didn&amp;#039;t happen, due to border problems again), and another back to back at The Commodore Ballroom with The Pat Travers Band. We did a tour out to Calgary with a band called Madd Duck, whoÃƒ?s drummer Dale went on to form Unclesid.\n\nOur last local show was out in Surrey, backing-up Death Angel. Due to the inexperience of Dave and Ken as players of their respected instruments at that time, I booked us on a mini tour of the Gulf Islands, to tighten us up with some appropriate cover songs thrown into the show, and to explore &amp;#039;grooves&amp;#039;, but it was a disaster!\nSo, I folded IRON GYPSY, in a state of frustration... lack of label interest... lack of a following... and also the fact that CDs were just coming out and vinyl was considered passÃ…Â½, so the music wasn&amp;#039;t selling either. We did manage to sell all of the 250 cassette tapes, but to this day, I still have most of the last EP in storage - about 500. The year was 1989.\n\n\n\nDiscography\n\n\nIron Gypsy \tEP, 1984\t\nTake #2 \tEP, 1989\t\n\nIron Gypsy - Iron Gypsy\n\nEP, Red Hearings Records\nOctober 1984 \t\n[add review] \t\n1.\tHell and Back\t03:47\t[view lyrics]\n2.\tFor the Crown\t04:53\t[view lyrics]\n3.\tNeed Your Lovin&amp;#039;\t03:23\t[view lyrics]\n4.\tStreetwize\t05:29\t[view lyrics]\nTotal playing time\t20:00","torrent":{"xt":"urn:btih:e61bf9f9ae3366e2c4dc4f8706163ebf2e9c3e6d","amp;dn":"Iron+Gypsy+%28Can%29+-+Iron+Gypsy+1984+-++80s+Geophagus+series","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e61bf9f9ae3366e2c4dc4f8706163ebf2e9c3e6d","infoHashBuffer":{"type":"Buffer","data":[230,27,249,249,174,51,102,226,196,220,79,135,6,22,62,191,46,156,62,109]},"announce":[],"urlList":[]}}