{"title":"NBA_Live_08_READNFO_USA_XBOX360-USA","uid":4205443,"size":6660798460,"categoryP":"games","categoryS":"xbox360","magnet":"?xt=urn:btih:e6def090a313c433cb86d79de08afedcafdca8e4&amp;dn=NBA_Live_08_READNFO_USA_XBOX360-USA&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"zarape2","files":72,"time":1211771183,"description":"All-New Quickstrike BallhandlingÃƒÂ¢ Whether you\\&amp;#039;re pushing the ball upcourt or backing down a defender inside, quicker, more responsive ball-handling moves allow you to break down opponents and take complete control of your game with the right analog stick.\n# Own the PaintÃƒÂ¢ Put the ball in the hands of your big men and go head-to-head in the lane. With all-new moves and counters, including pump fakes, drop-steps, and spins, post play has never been better.\n# See Who\\&amp;#039;s Hot and Who\\&amp;#039;s NotÃƒÂ¢ Using actual NBA shot tracking data, know who to feed and who to defend based on a shooter\\&amp;#039;s Hot Spots, an all-new on-screen overlay showing you exactly where a player is most dangerous.\n# Dominate with Your Go-To MoveÃƒÂ¢ Every player has a go-to move that they consistently go to when the game is on the line. Now the signature go-to moves of the NBA\\&amp;#039;s best players have been realistically re-created to help you score when it counts. That patented step back jumper? A fadeaway with the big leg kick? If it\\&amp;#039;s in the game, it\\&amp;#039;s in the game.\n# A New Look and FeelÃƒÂ¢ 5-on-5 gameplay has never looked so good. Featuring enhanced player spacing and behavior logic in the half-court, upgraded passing and rebounding mechanics, and an all-new two player interaction engine.\n# All-New Shooting MechanicsÃƒÂ¢ From deep three-point shots well beyond the arc to 10-foot jumps shots in the paint, every shot attempt has been redesigned to provide more fluid, realistic results. Dunks and lay-ups are now assigned to the same button command making highlight reel plays even easier to perform.\n# The NBA Goes LiveÃƒÂ¢ Player faces, team uniforms, and authentic arenas jump to life behind the power of next-generation game graphics. Whether you\\&amp;#039;re working on your game in the revamped practice gym or playing in front of a packed house, feel what it\\&amp;#039;s like to be an NBA superstar.\n# Like Butter ÃƒÂ¢  Running at a smooth 60 frames per second, NBA LIVE 08 is as close as you can get to the court, without dropping dime for courtside seats.\n\nUSA ONLY!!","torrent":{"xt":"urn:btih:e6def090a313c433cb86d79de08afedcafdca8e4","amp;dn":"NBA_Live_08_READNFO_USA_XBOX360-USA","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e6def090a313c433cb86d79de08afedcafdca8e4","infoHashBuffer":{"type":"Buffer","data":[230,222,240,144,163,19,196,51,203,134,215,157,224,138,254,220,175,220,168,228]},"announce":[],"urlList":[]}}