{"title":"Lita Roza - Love Is The Answer  1956","uid":4187489,"size":74741249,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e7519ef4232751ce4b3fec7ac41742bf89885444&amp;dn=Lita+Roza+-+Love+Is+The+Answer++1956&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mingy2","files":14,"time":1210759569,"description":"Lita Roza - Love Is The Answer  1956\n\n\n\n\n\nLita Roza (born Lilian Patricia Lita Roza, March 14, 1926, Liverpool is a British singer. Her 1953 number one hit record &quot;(How Much Is) That Doggie in the Window?&quot; afforded Roza the privilege of being the first British female singer to top the UK Singles Chart, and the first Liverpudlian to do so.\n\n\n \n\n\n Biography\n\nShe was the eldest of seven children. and began work at an early age to support the family. She owed her sultry looks to her Spanish father, an amateur accordionist who also played piano in several Liverpool nightclubs.\n\nAt the age of twelve she saw an advertisement in the local newspapers for juvenile dancers and passed the audition. She took to the stage at that age in a pantomime and by the time she was fifteen was working with fellow Merseysider comedian, Ted Ray.\n\nBy sixteen (at the height of the Nazi Blitz-bombing raids on Liverpool) she answered another advert, when she managed to secure a job as a singer in the &quot;New Yorker&quot; - a Southport, Merseyside club. She got that job at Â£5 a week, then shortly afterwards signed up with the Harry Roy Orchestra in London. She moved on from this to work with other bands of the era including that of Edmundo Ros.\n\nBy the time she was eighteen war-ravaged London was still a dangerous place to work and she had decided to retire from show business - choosing marriage to an American and a life in Miami, Florida in exchange. London was full of American servicemen at the time, one of whom Roza married and off they went to safety in America.\n\nHowever, this did not last and shortly after World War II she returned to the UK In 1950 she became lead female singer with the Ted Heath Band, and by 1954 had achieved enough public acclaim to leave the band and pursue a solo recording career on her own.\n\nFor Roza, whose &quot;(How Much Is) That Doggie in the Window?&quot; was a cover version of Patti Page&amp;#039;s original, this was the peak of her career. Further covers of &quot;Hey There&quot; and &quot;Jimmy Unknown&quot; gave her small hits in the mid 1950s, but her career as Ted Heath&amp;#039;s vocalist was knocked hard by the onslaught of rock and roll a year or two later.[6] Her chart-topping single was produced by Dick Rowe. Roza disliked the song so much she never performed it live on stage.\n\nIn 1956 she married the trumpet player, Ronnie Harris.\n\nShe remained a top UK recording artist during the remainder of the 1950s, but her subsequent recordings never recaptured the magic she had shown while with Ted Heath.\n\nShe was consecutively voted the &amp;#039;Top British Female Singer&amp;#039; in the New Musical Express&amp;#039; poll winners charts from 1951 to 1955. Melody Maker readers also voted her their &amp;#039;Top Girl Singer&amp;#039; in the Dance Band section of their polls in 1951 and 1952.\n\nRoza made two appearances in the UK heats of the Eurovision Song Contest, in 1957 and 1959.\n\nOn 14 March 2001 the Liverpool Wall of Fame was inaugurated opposite the famous Cavern Club on Mathew Street, in Liverpool, with Roza presiding at the ceremony.\n\nAt 28 November 2002 in Liverpool, she gave her last public performance on Radio Merseyside. A 22 track The Best Of Lita Roza was released in 2007.\n\nBeginning when Roza took the number one spot in 1953 with &quot;(How Much Is) That Doggie in the Window?, Liverpool artists have had 57 number one records. The last number one was Atomic Kitten&amp;#039;s &quot;The Tide is High&quot; in 2002.\n\n\n01 - Bewitched\n02 - Fools Rush In\n03 - It Could Happen To You\n04 - I Surrender, Dear\n05 - I Had The Craziest Dream Last Night\n06 - They Say It&amp;#039;s Wonderful\n07 - Where Is Your Heart?\n08 - You&amp;#039;ve Changed\n09 - How Did He Look?\n10 - Hello, My Darling\n11 - A Woman&amp;#039;s Intuition\n12 - Can&amp;#039;t Get Out Of This Mood\n13 - Just One More Chance","torrent":{"xt":"urn:btih:e7519ef4232751ce4b3fec7ac41742bf89885444","amp;dn":"Lita+Roza+-+Love+Is+The+Answer++1956","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e7519ef4232751ce4b3fec7ac41742bf89885444","infoHashBuffer":{"type":"Buffer","data":[231,81,158,244,35,39,81,206,75,63,236,122,196,23,66,191,137,136,84,68]},"announce":[],"urlList":[]}}