{"title":"Poltergeist (WS-25th Anniversary Dual-MultiSubs) [RePoPo]","uid":4131422,"size":1473264203,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:e76c3c47940980445b8368ddea629425e3a9d2cc&amp;dn=Poltergeist+%28WS-25th+Anniversary+Dual-MultiSubs%29+%5BRePoPo%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"repopo","files":5,"time":1208049587,"description":"*******************************************************************************\n                        Poltergeist (Tobe Hooper, 1982)\n*******************************************************************************\n\n-------------------------------------------------------------------------------\n                              General Information\n-------------------------------------------------------------------------------\nType.................: Movie\nFile Validation......: SFV\nContainer file.......: Matroska\nVideo Format.........: H.263\nVideo Bitrate........: 1781\nAudio Format.........: AC3 384Kb/s (English 5.1), AC3 192Kb/s (Spanish 2.0)\nSubtitles enclosed...: English, Spanish\nSubpack Subtitles....: English, Croatian, Czech (Ceske), Dansk, Suomi, \n                       Deutsch, Greek, Norsk, Portugues, Spanish and Svenska.\nResolution...........: 688x288 (2.40:1)\nColor................: 24 bit\nFPS..................: 25.000\nSource...............: DVD 16x9\nDuration.............: 01:49:45\nOriginal Format......: PAL\nGenre................: Horror\nIMDb Rating..........: 7.4\nMovie Information....: http://www.imdb.com/title/tt0084516/\n\n-------------------------------------------------------------------------------\n                                  Ripping Notes\n-------------------------------------------------------------------------------\nENG: This is my personal rip of the spanish DVD.  It contains in the same \nMatroska file the original 5.1 english track, and a spanish-dub audio track,\nand two subtitles (spanish and english) selectable during playback.\n\nYou need H.263 and AC3 codecs to play this file.  I recommend using VLC Media\nPlayer, as it uses its own codecs.\n\nESP: Este es mi propio rip del DVD espaÂ¦ol.  Contiene en el mismo archivo \nMatroska la pista de audio original en ingles, el doblaje en espaÂ¦ol y\nsubtitulos en espaÂ¦ol e ingles, todos intercambiables durante la reproduccion.\n\nEs necesario tener instalados los codecs H.263 y AC3 para reproducirlo.\nRecomiendo usar el VLC Media Player, pues ya los trae incluidos.\n\n-------------------------------------------------------------------------------\n                                 Release Notes\n-------------------------------------------------------------------------------\n\nSynopsis\n\nA young family are visited by ghosts in their home. At first the ghosts appear \nfriendly, moving objects around the house to the amusement of everyone, then \nthey turn nasty and start to terrorise the family before they &quot;kidnap&quot; the \nyoungest daughter.  Written by Rob Hartill\n\nWhile living an an average family house in a pleasant neighborhood, the \nyoungest daughter of the Freeling family, Carol Anne (Heather O&amp;#039;Rourke), seems \nto be connecting with the supernatural through a dead channel on the televison.\nIt is not for long when the mysterious beings enter the house&amp;#039;s walls. At first\nseeming like harmless ghosts, they play tricks and amuse the family, but they \ntake a nasty turn- they horrify the family to death with angry trees and \nmurderous dolls, and finally abduct Carol Anne into her bedroom closet, which \nseems like the entrance to the other side. Written by Thomas O&amp;#039;Rourke.\n\n\nTrivia\n    *  The hands which pull the flesh off the investigator&amp;#039;s face in the \nbathroom mirror are Steven Spielberg&amp;#039;s.\n\n    * The weird way the family members descend the stairs at the beginning of \nthe film was created by having the actors walk backward up the stairs and \nplaying the film in reverse. The same effect was used later in the movie during \nthe scene showing video playback of the ghosts.\n\n    * The house that gets sucked into a black hole at the end was actually a \nmodel about four feet across. The model took several weeks to complete. The shot \nwas arranged with the camera placed directly above model, which was mounted over \nan industrial strength vacuum generator (the front door was facing directly up, \nstraight at the camera). The model also had about 100 wires attached to various \npoints of the structure. These wires went down through the back of the house, \nand down through the vacuum collection sack. The camera was turned on, and took \n15 seconds to wind up to the required 300 frames per second. The vacuum was \nturned on, the wires were yanked, and several SFX guys blasted the house with \npump-action shotguns. The entire scene was over in about two seconds, and they \nhad to wait until the film was developed before they knew if they would have to \ndo it again. Luckily, they got it right on the first take. The finished scene \nwas sent to Steven Spielberg, who was on location shooting E.T.: The \nExtra-Terrestrial (1982). He gave it to a projectionist, who assumed it was \ndailies from ET and was startled by the images. Spielberg had the remains of the \nmodel encased in perspex, and it is now sitting on his piano. The model itself \nwas worth well over $25,000.\n\n    * Steven Spielberg worked on this movie and E.T.: The Extra-Terrestrial \n(1982) literally back to back. Principal photography on Poltergeist ended in \nAugust of 1981, then Spielberg took a few weeks off and began work on E.T. \nSpielberg also supervised the visual effects for both films simultaneously \n(which were produced at Industrial Light &amp; Magic under the supervision of \nRichard Edlund and Dennis Muren). Once post production work on Poltergeist began \nin early 1982, Spielberg was in total control. He was responsible for the \nediting of the film (Spielberg&amp;#039;s usual editor Michael Khan edited this film \nwhile Carol Littleton edited E.T), the final sound mixes and loops, the \nsupervision of the visual effects, and the selection of Jerry Goldsmith as the \ncomposer of the score. Poltergeist and E.T opened to theaters nationwide only a \nweek between each other during the summer of 1982, Poltergeist on June 4th and \nE.T. one week later on June 11th.\n\n    * Steven Spielberg had a major hand in the production of this film at the \nsame time that he was directing E.T.: The Extra-Terrestrial (1982). He later \nsaid &quot;If E.T. was a whisper, Poltergeist was a scream&quot;.\n\n    * As an homage to his friend George Lucas, Spielberg populated the \nchildren&amp;#039;s bedroom with Star Wars toys. He did the same in E.T.: The \nExtra-Terrestrial (1982).\n\n    * To make the ghosts&amp;#039; movements seem more ethereal when they appeared \nwalking down the stairs on the monitor, the director had the actors walk very \nslowly backwards up the staircase, then reversed the film in the final cut.\n\n    * Mrs. Freeling&amp;#039;s line &quot;Mmmm... smell that mimosa.&quot; is taken directly from \nThe Uninvited (1944).\n\n    * Movie on the TV in an early bedroom scene is A Guy Named Joe (1943), a \nfilm about a pilot who returns to the world as a ghost. It was later remade by \nSteven Spielberg into Always (1989).\n\n    * The sign at the Holiday Inn reads, Welcome Dr. Fantasy and Friends. Dr. \nFantasy is a nickname for producer Frank Marshall.\n\n    * Heather O&amp;#039;Rourke, who played the little girl Carol-Anne, and Dominique \nDunne, who played the teenage daughter, are buried in the same cemetery: \nWestwood Memorial Park in Los Angeles. Dunne was strangled into brain-death by \nher boyfriend in 1982, the year of the film&amp;#039;s release. Six years later, O&amp;#039;Rourke \ndied of intestinal stenosis.\n\n    * The film was originally given a R rating, but the filmmakers protested \nsuccessfully and got a PG rating (the PG-13 rating did not exist at the time).\n\n    * During the scene where Robbie (Oliver Robins) is being strangled, the \nclown&amp;#039;s arms became extremely tight and Robbins started to choke. When he \nscreamed out, &quot;I can&amp;#039;t breathe!&quot; Steven Spielberg and Tobe Hooper thought that \nthe boy was ad-libbing and just instructed him to look at the camera. When \nSpielberg saw Robbins&amp;#039;s face turning purple, he ran over and removed the clown&amp;#039;s \narms from Robbins&amp;#039;s neck.\n\n    * The sound effect for the beast that attacks the house at the end of the \nmovie is the source for the current MGM lion roar.\n\n    * When writers Michael Grais and Mark Victor first met with Steven \nSpielberg, they were being hired to write the film that eventually became Always \n(1989). When Spielberg happened to mention he also had an idea for a ghost \nstory, Grais and Victor said they&amp;#039;d rather write the ghost story than Always and \nthat&amp;#039;s how they got this job.\n\n    * The skeletons that emerge from the swimming pool while Diane searches for \nhelp are actual skeletons. JoBeth Williams didn&amp;#039;t know this until after the \nscene was shot.\n\n    * The crawling steak was done by using a real steak which was laid over a \nslot cut between the tiles in the counter top. Two wires were fastened to the \nbottom of the steak and a special effects operator, hidden under the counter, \nsimply moved the wires to make the steak crawl like a caterpillar. A similar \noperation was done when Diane presents to Steven the chairs that move across the \nroom by themselves. A wire was fastened to one of the chair&amp;#039;s legs under the \nset. An operator first wobbled the chair with the wire, then dragged the chair \nacross to its destination.\n\n    * Shirley MacLaine was offered a starring role in the film, but backed out \nin order to make Terms of Endearment (1983).\n\n    * The shot of the chairs that position themselves in the amazing balancing \nact on the table was all done in one take. As the camera panned along with \nJoBeth Williams, who was getting some cleaning materials, several crew members \nquickly set an already organized pyramid of chairs on the table, then took the \nsingle chairs away before the camera scrolled back. See Goofs entry.\n\n    * JoBeth Williams was hesitant about shooting the swimming pool scene \nbecause of the large amount of electrical equipment positioned over and around \nthe pool. In order to comfort her, Steven Spielberg crawled in the pool with her \nto shoot the screen. Spielberg told her, &quot;Now if a light falls in, we will both \nfry.&quot; The strategy worked and Williams got in the pool.\n\n    * The Rams (then Los Angeles Rams) vs. Saints football game seen near the \nbeginning of the film, is taken from a Monday Night Football game in 1980.\n\n    * The scene in which Diane opens the bedroom door and is met with a fearsome \nscream was the first to be filmed.\n\n    * The scene in which Marty hallucinates in the bathroom was the last to be \nfilmed.\n\n    * Both of the terrors that plague Robbie came from Steven Spielberg&amp;#039;s own \nfears as a child, a fear of clowns and a tree outside his window.\n\n    * Steven Spielberg and Tobe Hooper wanted virtually unknown actors to play \nthe Freelings because they wanted to add a realism to the family that would \noff-balance the ghost story. They felt that if the audience watched well-known \nstars, then it would take away from the realistic feel of the characters.\n\n    * The swirling, flickering lights coming from the closet during the rescue \nscene were achieved using a very simple effect by having an aquarium full of \nwater in front of a spotlight. Then a fan blew on the surface of the water to \nmake it swirl.\n\n    * The house used to film this movie is located in Simi Valley, California \nwhere it still stands today. The family who owned it when this movie was filmed \nstill live there today.\n\n    * In addition to the two times that the Beast appeared in the movie (the \nface that appeared in the closet and the creature that guarded the kid&amp;#039;s door), \nthe script had it appearing during the scene where the family and investigators \nare looking at the tape of the manifestation. The giant ghost that they saw \nvisually slowly resolved itself into the image of a face of a cruel old man: the \nman we know in the later films as &amp;#039;Reverend Henry Kane.&amp;#039;\n\n    * A common translation of the German word &quot;Poltergeist&quot; is &quot;rumbling \nspirit&quot;.\n\n    * When Carol Anne&amp;#039;s mother tells her to stop watching the static because it \nwill hurt your eyes, she turns on a movie and it is Go for Broke! (1951).\n\n    * During all the horrors that proceeded while filming Poltergeist (1982), \nonly one scene really scared Heather O&amp;#039;Rourke: that in which she had to hold \nonto the headboard, while a wind machine blew toys into the closet behind her. \nShe fell apart; Steven Spielberg stopped everything, took her in his arms, and \nsaid that she would not have to do that scene again.\n\n    * The movie&amp;#039;s line &quot;They&amp;#039;re here!&quot; was voted as the #69 movie quote by the \nAmerican Film Institute (out of 100).\n\n    * Drew Barrymore was considered for the role of Carol Anne, but Steven \nSpielberg wanted someone more angelic. It was Barrymore&amp;#039;s audition for this \nrole, however, that landed her a part in E.T.: The Extra-Terrestrial (1982).\n\n    * In reality, Craig T. Nelson and JoBeth Williams are only 14 and 11 years \nolder than Dominique Dunne, who plays their teen-aged daughter.\n\n    * Stephen King was briefly approached to write the screenplay. It would have \nbeen the first written by King directly for the screen, but the parties could \nnot agree on the terms.\n\n\n\n-------------------------------------------------------------------------------\n                                 Personal Info\n-------------------------------------------------------------------------------\n\nMy releases so far... personal rips from original DVDs, looking for quality...\nThey&amp;#039;re uploaded in TPB, Mininova and TorrentBox, but feel free to share them\non edonkey networks on any way you want.  Spread the word.\n\n- Timerider: The Adventure of Lyle Swann (DVDRip Dual Spanish-English) (1,4Gb)\n  AVI/MP3, Dual English-Spanish, no subs\n\n- The Yakuza (Sidney Pollack, 1974) (DVDRip Dual Eng-Esp) (1,3Gb)\n  AVI/AC3, Dual English-Spanish, subpack including multiple subtitles\n\n- Dracula&amp;#039;s Daughter (Lambert Hillyer, 1936, DUal-Multisubs) (700Mb)\n  H264/AAC in Matroska container, Dual Eng-ESP, subs ENG-ESP-ITA-POR\n\n- Dracula (George Melford, 1931, Spanish Audio) (1,4Gb)\n  H264/AC3 in Matroska container, ESP audio, subs ENG-ESP-ITA-POR-CRO\n\n- Queen Christina (Rouben Mamoulian, 1933, Dual-Multisubs) (1,45Gb)\n  H.264/AC3/AAC in Matroska container, ENG-ESP Audio and subs,\n  also enclosed a subpack with subs in english, croatian, ceske, dansk, suomi,\n  Deutsch, greek, hebrew, magyar, polish, portugues, slovenian, spanish, \n  svenska and turkish.\n\n- Poltergeist (25th anniversary-WideScreen) (Tobe Hooper, 1982) (Dual Multisubs)\n  H.264/AC3/AAC in Matroska container, ENG-ESP Audio and subs,\n  also subpack with subs in english, croatian, czech (ceske), dansk, suomi, \n  deutsch, greek, norsk, portugues, spanish and svenska.\n\n\n-------------------------------------------------------------------------------\n-------------------------------------------------------------------------------\n","torrent":{"xt":"urn:btih:e76c3c47940980445b8368ddea629425e3a9d2cc","amp;dn":"Poltergeist+%28WS-25th+Anniversary+Dual-MultiSubs%29+%5BRePoPo%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e76c3c47940980445b8368ddea629425e3a9d2cc","infoHashBuffer":{"type":"Buffer","data":[231,108,60,71,148,9,128,68,91,131,104,221,234,98,148,37,227,169,210,204]},"announce":[],"urlList":[]}}