{"title":"AudialHub 1.0 with Serial","uid":4194358,"size":4198094,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:e854849b3f90b2dcba5c4aaafebc3e9eb37b44f9&amp;dn=AudialHub+1.0+with+Serial&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"tycoonalex","files":1,"time":1211137412,"description":"If music is the universal language, how come there are so many different music formats?\nAudialHub is designed to chop through the mighty jungle of sound formats, clearing a path for your music, podcasts, lectures, white noise, etc.\nEasy as 1-2-3, simple as Do-Re-Mi.\n\nAudialHub can convert audio files (and even the audio inside video files!) in as little as three steps:\n1: Drag your files into the window.\n2: Choose the format you want to convert to.\n3: Click start.\nYou can count &quot;listening to your stuff however you want&quot; as step 4, but that part&amp;#039;s fun.\n\nWant more control? No problem. You can have it both ways &amp;#039;round. AudialHub comes with an extensive set of Advanced controls to tweak the encoding process however you please. Don&amp;#039;t stop &amp;#039;til you get enough.\n\nAudialHub comes from the creators of iSquint and the Eddy-award-winning VisualHub with an all-new Leopard-inspired interface ? inviting to newbies, yet powerful enough for experts.\nEnough to prove it&amp;#039;s all for you.\nKey Features:\n\n    * Conversion from dozens of audio types to popular formats like AAC, MP3, WMA, AIFF, WAV, Apple Lossless, 3G (cell phones), Ogg Vorbis, FLAC, and even Audio and MP3 CDs!\n    * Audio tracks inside video files can also be converted!\n    * Common tags (Artist, Album, etc) are automatically passed when applicable.\n    * Up to 16 hours of audio can be converted to a single MP3 CD.\n    * Easy-to-use Trim capabilities to narrow down short segments of audio.\n    * Quick Preview capability to check out compression quality and Trim settings before a full conversion.\n    * Dynamic file queue, allowing mid-conversion changes or additions, Pause/Resume, and an &quot;always ready&quot; Assembly Line Mode!\n    * Run multiple simultaneous conversions in separate queues with separate settings.\n    * Growl notifications, Dock progress indicator, and AppleScripting automation support!\n    * Normalization, audio track selection, multiple decoder options, and direct access to add custom low-level command-line settings!\n    * Detailed Users Guide and Help Center.\n\n\n\n\n\n\nI will continue seeding.\n\nTakk...\nTycoonalex","torrent":{"xt":"urn:btih:e854849b3f90b2dcba5c4aaafebc3e9eb37b44f9","amp;dn":"AudialHub+1.0+with+Serial","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e854849b3f90b2dcba5c4aaafebc3e9eb37b44f9","infoHashBuffer":{"type":"Buffer","data":[232,84,132,155,63,144,178,220,186,92,74,170,254,188,62,158,179,123,68,249]},"announce":[],"urlList":[]}}