{"title":"Still game series 3.rar","uid":4064917,"size":1314044487,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e88f7629dcd6face44d6d6d712c4916986adc710&amp;dn=Still+game+series+3.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"o0oliambeeo0o","files":1,"time":1204756294,"description":"Series 3 (2004)\n\n\n\n\n\nHoaliday - Jack and Victor arrive in Canada to visit Fiona. Just like in Scotland, the two get up to more mischief than the usual pensioners. Meanwhile back home, Winston tries to avoid Isa\\&amp;#039;s gossip while still getting fed by her as he continues seeing her even though Harry has left.\n\nSwottin\\&amp;#039; - Jack and Victor are back home and on the hunt for more adventures; in this case, enrolling in a night class for first-aid. They intend to use this new knowledge to win the Clansman quiz.\n\nCairds - The pensioners of Craiglang attempt to win back a crippled man\\&amp;#039;s electric scooter from Tam. Meanwhile Winston wins time and time again at the bookies.\n\nBig Yin - Guest stars Clive Russell as Jack and Victor\\&amp;#039;s old friend, \\&quot;Big Innes\\&quot;. He hopes to rid the town of hooligans; that is, if he can stay away from Midori long enough. Winston also has troubles of his own when he joins the staff of \\&quot;Food-Fare\\&quot;.\n\nOot - A recluse (Sylvester McCoy) is tempted out of his home due to it being demolished. Scared by the inventions over the years, Jack and Victor try to encourage him into a new world. Meanwhile Winston plans to build a telly.\n\nAff - Isa is told by a psychic in the pub that she will be ran over by a silver car. Terrified at the notion, the episode follows her struggle with destiny. Winston also has his own problems with his sore leg caused by years of smoking, this encourages Jack to give up his pipe. Meanwhile Victor gets a surprise visit from his son John when he fakes illness.\n","torrent":{"xt":"urn:btih:e88f7629dcd6face44d6d6d712c4916986adc710","amp;dn":"Still+game+series+3.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e88f7629dcd6face44d6d6d712c4916986adc710","infoHashBuffer":{"type":"Buffer","data":[232,143,118,41,220,214,250,206,68,214,214,215,18,196,145,105,134,173,199,16]},"announce":[],"urlList":[]}}