{"title":"Farscape SE01E01 - Premiere.rar","uid":4129851,"size":563691812,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e8acc2bc7b0b7d69b8c2feb6702c45e1fff916d8&amp;dn=Farscape+SE01E01+-+Premiere.rar&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"ash_lands","files":1,"time":1207980842,"description":"Farscape\n\nSeason 1 Episode 1 - Premiere\n\nAstronaut John Crichton&amp;#039;s &quot;Farscape-1&quot; space module is swallowed by a wormhole and spat out on the other side of the universe into the middle of a space battle. Taken on board &quot;Moya&quot;, a huge bio-mechanoid living ship, desperately trying to escape Peacekeeper captivity. On board Moya is a group of alien fugitives trying to escape from the ruthless Peacekeepers, a local military regime. While managing to escape the immediate threat, John Crichton forms friendships with the prisoners and continues to look for a way home. But later a race of beings called, &quot;The Ancients&quot; implanted knowledge about the power of wormholes in his mind and this knowledge makes him a wanted man throught the Uncharted Territories. Now, John and his crewmates are on the run from ruthless alien races that want his knowledge so they can make wormhole weapons to take over the universe. Despite all that happens to him, despite his friendships and relationships with the crew, at the end of the day he wants to get home to Earth. This 2-hour TV pilot was later divided into episodes 1 and 3 of Farscape the series.\n\nDVD Rip, converted to Xvid using MKV, original AC3 2ch audio track, original resolution.\n\nSeeding them as I rip them, might be a while for the whole lot.","torrent":{"xt":"urn:btih:e8acc2bc7b0b7d69b8c2feb6702c45e1fff916d8","amp;dn":"Farscape+SE01E01+-+Premiere.rar","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8acc2bc7b0b7d69b8c2feb6702c45e1fff916d8","infoHashBuffer":{"type":"Buffer","data":[232,172,194,188,123,11,125,105,184,194,254,182,112,44,69,225,255,249,22,216]},"announce":[],"urlList":[]}}