{"title":"Oscar Romero, The Violence Love - mp3 - The Last Christian? Brea","uid":4237729,"size":103769780,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:e8e77e718ffcdf4bc150e7b5832180c9d5b0719f&amp;dn=Oscar+Romero%2C+The+Violence+Love+-+mp3+-+The+Last+Christian%3F+Brea&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"RevolutionaryNonviolence","files":11,"time":1213380433,"description":"Henri J. M. Nouwen, from the Forward\nRomero does not speak from a distance. He does not hide his fears, his brokenness, his hesitations. It is as if he puts his arm around my shoulder and slowly walks with me. He shares my struggles. There is a warmth in his words that opens my heart to listen. --This text refers to an out of print or unavailable edition of this title.\n\nRobert McAfee Brown, Professor Emeritus, Pacific School of Religion\nThese homilies reveal lines of poetic beauty describing a cruel and ugly world Here is indomitable courage and utter humility. Here is a message of hope. --This text refers to an out of print or unavailable edition of this title.\n\nSamuel Ruiz Garcia, Bishop of San Cristobal, Chiapas Mexico\nOscar Romero was converted by suffering: the suffering of a friend, of the people he served, and then finally his own suffering. There are many ways to be converted, but perhaps the best way is to live among the poor and to discover in them as Romero did, the presence of Christ. --This text refers to an out of print or unavailable edition of this title.\n\nBook Description\nThese selections from the sermons and writings of Archbishop Oscar Romero share the message of a great holy prophet of modern times. Three short years transformed Romero, archbishop of San Salvador, from a conservative defender of the status quo into one of the church?s most outspoken voices of the oppressed. Though silenced by an assassin?s bullet, his spirit?and the challenge of his life lives on.\n\nLanguage Notes\nText: English (translation)\nOriginal Language: Spanish --This text refers to an out of print or unavailable edition of this title.\n\nFrom the Inside Flap\nThree short years transformed Archbishop Oscar Romero from a conservative defender of the status quo into one of the church&amp;#039;s most outspoken voices on behalf of the oppressed. Though silenced by an assassin&amp;#039;s bullet, his spirit - and the vital challenge of his life - lives on. --This text refers to an out of print or unavailable edition of this title.\n\nExcerpted from The Violence of Love by Oscar A. Romero, James R. Brockman. Copyright Â© 1998. Reprinted by permission. All rights reserved\nThe violence we preach is not the violence of the sword the violence of hatred It is the violence of love, of brotherhood, the violence that wills to beat weapons into sickles for work.\n\nOscar Romero, Novenber 27, 1977 --This text refers to an out of print or unavailable edition of this title.","torrent":{"xt":"urn:btih:e8e77e718ffcdf4bc150e7b5832180c9d5b0719f","amp;dn":"Oscar+Romero%2C+The+Violence+Love+-+mp3+-+The+Last+Christian%3F+Brea","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e8e77e718ffcdf4bc150e7b5832180c9d5b0719f","infoHashBuffer":{"type":"Buffer","data":[232,231,126,113,143,252,223,75,193,80,231,181,131,33,128,201,213,176,113,159]},"announce":[],"urlList":[]}}