{"title":"Standup Comedy - Puke and Snot Collection","uid":4190717,"size":102891885,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e93ab6f70325a45be2d0c777dd6773a87f3240dd&amp;dn=Standup+Comedy+-+Puke+and+Snot+Collection&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"rambam1776","files":5,"time":1210898341,"description":"How exactly does one go about describing Puke &amp; Snot? Basically, you have a ribald version Abbot &amp; Costello who perform around Americas Renaissance Festivals, spitting chewed up carrots all over people. They are easily the most famous and most popular Ren Fest draw in America. I actually sorta know these guys, since I used to work the circuit as a minor peroformer. Back in the day, these were the guys to go drinking with. Little known trivia fact: Joe (Snot) is a former Navy Frogman whose Vietnam activities are still classified. Here is the spiel from their agents website below, and if you wanna purchase some of the funniest TeeShirts around, head to the official site, www.magaga.com \n\n\nPuke &amp; Snot is the disturbed brainchild of Minneapolis actor/comedians Mark Sieve and Joe Kudla. Developing quickly as a street act alongside such notable contemporaries as Avner the Eccentric, The Flying Karamazov Brothers, and Penn and Teller, Men in Tights moved out of the streets and into the alleys &quot;....where the audiences were already seated.&quot; Since then they have steadily attracted a national audience.\n\nThis duo anchors their show with a fearsome blend of mock-violence, iambic pentameter, uncooked vegetables, and the funniest vaudeville routines in show biz. At a combined weight of 370 pounds, they are arguably the heaviest comedy act out of Minneapolis since Louie Anderson.\n\nA club owner in Los Angeles once said of M in T: &quot;This act heralds the merging of the visual discipline of performance art with the verbal discipline of classical drama, resulting in nothing less than a new art form. Theyll never work here again.&quot; Nevertheless, they have appeared at comedy clubs from Minneapolis to Los Angeles, from Denver to Edmonton, including a highly successful two-week run of their bizarre vaudeville show, The Knights of Pythias Circle of Death Family Fun Show in Minneapolis.\n\nIf you have the opportunity to stroll into Adventureland in The Magic Kingdom at Orlandos Walt Disney World you can watch Men in Tights do their thing on the Plaza outside the Pirates of the Caribbean. Bring the kids, its a wild ride.\n\n\n\n&quot;...the most successful act on the circuit, the nonpareils [Men in Tights].&quot;\nCalvin Trillin, The New Yorker \n\n&quot;Someone has spliced together pieces of a Marx Brothers movie and an Errol Flynn swashbuckler. Very exhilarating and highly entertaining!&quot;\nJim Ahrens, Minneapolis/St. Paul Magazine\n\n&quot;...a decidedly daft duo currently tickling many a funnybone at Summerfest. With their less-than-fancy swordwork, rapier-like punning and broad physical humor, their comedy owes as much to Laurel and Hardy as it does to Avons Bard.&quot;\nJames Adams, The Edmonton Journal\n\n&quot;Intense wit, flashy swordfights, organic vegetables... leaves the audience breathless with laughter.&quot;\nUniversity of California\n\n&quot;The laughs come in waves, often with race-track speed ...they engage each other and their audience with one-liners, double entendres and countless sight gags, keeping lovers of vaudeville in literary stitches.&quot;\nMartin Keller, Twin Cities Reader\n\n&quot;A tremendously appealing act, a huge hit!&quot;\nJohn Habich, Minneapolis Star Tribune  \n\n\n","torrent":{"xt":"urn:btih:e93ab6f70325a45be2d0c777dd6773a87f3240dd","amp;dn":"Standup+Comedy+-+Puke+and+Snot+Collection","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e93ab6f70325a45be2d0c777dd6773a87f3240dd","infoHashBuffer":{"type":"Buffer","data":[233,58,182,247,3,37,164,91,226,208,199,119,221,103,115,168,127,50,64,221]},"announce":[],"urlList":[]}}