{"title":"Christy Moore ~ Ride On","uid":4068991,"size":103089161,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:e9b2ed4a1c42c6020cc9d7aa0946db84df726552&amp;dn=Christy+Moore+%7E+Ride+On&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"gazzjazz","files":13,"time":1204947404,"description":"Christy Moore is an Irish singing legend\nHere is what America&amp;#039;s All Music Guide say about Christy\nenjoy &amp; please seed as long as possible friends\n\nBiography\tby Craig Harris\n\nThe older brother of Irish folk-pop singer-songwriter Luka Bloom (Barry Moore), Christy Moore is one of contemporary Irish music&amp;#039;s best singer-songwriters. The former lead vocalist and chief songwriter of Planxty and Moving Hearts, Moore helped to bring the musical traditions of Ireland up to modern standards. As a solo singer-songwriter, Moore has continued to add elements of rock and popular music to his well-crafted, tradition-based tunes and has been a major inspiration to such modern Irish artists as U2, Sinead O&amp;#039;Connor and the Pogues.\n\nTraditional Irish music had little influence on Moore&amp;#039;s early music. Trained in old-time pop tunes and religious music, Moore was inspired as a teenager by the rock &amp; roll of American artists including Elvis Presley, Chuck Berry and Little Richard. It wasn&amp;#039;t until he had moved to London, where he heard Irish folk songs sung in Irish ghettos, that he became aware of the musical traditions of his homeland. Acquiring an acoustic guitar and Irish drum (bodhran), Moore began busking in the streets. Moore continued to attract attention with his original, folk-like songs after returning to Ireland in the late 1960s. Moore&amp;#039;s debut solo album, Paddy on the Road, was released in 1969.\n\nWhile recording his third album, Prosperous, in 1972, Moore assembled a band that evolved into Planxty. The group&amp;#039;s fusion of Celtic music and high-energy rock made Planxty one of Ireland&amp;#039;s most influential bands. With Moore singing lead in his heavily accented brogue and playing rhythm guitar and bodhran, Planxty brought together such top-ranked Irish musicians as Donal Lunny (guitar, bouzouki, bottleneck bouzouki), Liam O&amp;#039;Flynn (uilleann pipes, whistle) and Andy Irvine (mandolin, mouth organ). Although he left Planxty in 1974, Moore returned when the band&amp;#039;s original lineup reunited in 1979. He remained with Planxty until 1983, when it evolved into a new band, Moving Hearts. Moore served as frontman for Moving Hearts until leaving to resume his solo career in 1985.\n\nThe excitement of Moore&amp;#039;s concerts has been documented on two albums. Live In Dublin, released in 1978, featured accompaniment by Donal Lunny. Live at the Point, released in 1995, captures a solo performance at the Point Theater in Dublin in July 1994. Moore&amp;#039;s solo recordings between 1973 and 1978, were compiled on The Folk Collection, released in 1978. His solo recordings between 1981 and 1991 were anthologized on The Christy Moore Collection, released in 1991. Moore&amp;#039;s 1985 album Voyage featured backing vocals by Sinead O&amp;#039;Connor, Elvis Costello and Mary Black, plus accordion player Shamus Shannon. \n\n\nReview\tby Chip Renner\n\nA powerful CD featuring &quot;Ride On,&quot; &quot;City of Chicago, &quot; &quot;Lisdoonvarna, &quot; and &quot;Among the Wicklow Hills.&quot; This one is so good it can make his other good ones seem weak. ","torrent":{"xt":"urn:btih:e9b2ed4a1c42c6020cc9d7aa0946db84df726552","amp;dn":"Christy+Moore+%7E+Ride+On","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9b2ed4a1c42c6020cc9d7aa0946db84df726552","infoHashBuffer":{"type":"Buffer","data":[233,178,237,74,28,66,198,2,12,201,215,170,9,70,219,132,223,114,101,82]},"announce":[],"urlList":[]}}