{"title":"Supernatural Season 02 DVD-R 04 EN-US PT-BR Garrett_BR","uid":4082343,"size":4496809271,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:e9cdbfda3cccb76a717ef5406d4daa7b7a638a09&amp;dn=Supernatural+Season+02+DVD-R+04+EN-US+PT-BR+Garrett_BR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"garrett_br","files":44,"time":1205620480,"description":"Os irmaos Sam e Dean Winchester continuam na trilha do demonio que assassinou sua mae. No final da primeira temporada, Sam, Dean e o pai deles estavam aprisionados em uma armadilha de metal retorcido e vidro. Nesta temporada comeca exatamente apos o acidente de carro e com um sacrificio que cimenta definitivamente o laco que une os Winchester. Junte-se aos irmaos em suas aventuras para mais uma temporada arrepiante e repleta de suspense.\n\nIdioma do Audio: Ingles DTS Digital 5.1 Surround, Portugues BR Dolby Digital 2.0\n\nIdioma da Legenda: Ingles e Portugues\n\nAjude no Seed ou os outros DVDs nao sairao.\nAjude no Seed ou os outros DVDs nao sairao.\nAjude no Seed ou os outros DVDs nao sairao.\n\nHELP IN SEED !\nHELP IN SEED !\n\nSEED 3x\n\nProduct Description\nTwenty-two years ago, Sam (series star JARED PADALECKI) and Dean (series star JENSEN ACKLES) Winchester lost their mother to a mysterious and demonic supernatural force. As a result, their father, John (recurring guest star JEFFREY DEAN MORGAN - &quot;Grey&amp;#039;s Anatomy&quot;), raised the brothers to be soldiers. He taught them about the paranormal evil that lives in the dark corners and on the back roads of America...and he taught them how to kill it. Sam, however, wanted nothing to do with this violent and dangerous life, and he left it behind, until the day Dean appeared on his doorstep with troubling news. Their father had gone missing on a &quot;hunting trip.&quot; Sam and Dean have spent the last year cruising the highwaysof the United States in their 1967 Chevy Impala, searching for their lost father and encountering creatures that most people believe exist only in folklore, superstition and nightmares. Along the way, they have battled the various supernatural threats--and each other as well, for their sibling rivalries and conflicts were never far from the surface. Finally, they found their father, just as he was closing in on the Demon who claimed their mother.","torrent":{"xt":"urn:btih:e9cdbfda3cccb76a717ef5406d4daa7b7a638a09","amp;dn":"Supernatural+Season+02+DVD-R+04+EN-US+PT-BR+Garrett_BR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"e9cdbfda3cccb76a717ef5406d4daa7b7a638a09","infoHashBuffer":{"type":"Buffer","data":[233,205,191,218,60,204,183,106,113,126,245,64,109,77,170,123,122,99,138,9]},"announce":[],"urlList":[]}}