{"title":"Zeitgeist set","uid":4127341,"size":8318193161,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:eaf266c76d8e3dd318bfeff311d035ee2b110ff0&amp;dn=Zeitgeist+set&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Retrospect007","files":265,"time":1207855023,"description":"This torrent includes:\n\n--------------------------------------------------------------------------------\nZeitgeist the movie (remastered edition) DVD with the following subtitles: english, turkish, espagnol, nederlands, francais, polski, slovenian, croatian.\n--------------------------------------------------------------------------------\n\nZeitgeist the movie covers several important subjects about how our world is operating. \n\nPart 1: Shows how religious institutions around the world are used by the rich and powerful to control people.\n\nPart 2: the 9/11 tragedies were part of an elite conspiracy.\n\nPart 3: Ever since World War I, the ultra-rich have been secretly manufacturing wars and financial collapses to control the populace and to get richer and more powerful.\n\nAllthough this documentary film is highly suggestive in nature, the film is based on and is a compilation of various in depth researches concerning the subjects presented. It is my belief that this movie is perhaps the most important movie of this age. As it is easy to understand by the average individual and it gives the spark to most people to do their own research into the subjects. \n\nGoal of the movie: to inform the public of the danger that exists that the world is moving towards a totalitarian global state.\n\n---------------------------------------------------------------------------------\nInfo DVD (for use in laptop or desktop PC)\n---------------------------------------------------------------------------------\n\nEver since Zeitgeist the movie was released in july 2007, I have done my own extensive research into the subjects. To further support the claims made in Zeitgeist the movie I decided to compile my own research into this Info DVD.\n\nThe DVD holds many sources like weblinks, videos and literature. Also, it includes freeware software burning programs and manuals so that people can easily make copies of Zeitgeist (and the info DVD) for their friends, co-workers, loved ones and neighbourhood folks.\n\nGoal of the info DVD: to share research and to encourage distribution of Zeitgeist \\&quot;outside\\&quot; the realm of internet. Zeitgeist has a huge internet following but with this DVD I hope hard copies of the movie will spread to people who aren\\&amp;#039;t as active on the internet as us torrentfreaks :).\n\n\n----------------------------------------------------------------------------------\nSoftware\n----------------------------------------------------------------------------------\n\nIn this torrent you will find Iso-burner, which is a freeware ISO-burning program.\nAlso, you will find Magicdisc, which is a freeware virtual drive program to watch and run the included ISO files directly on your computer without first burning them.\n\n----------------------------------------------------------------------------------\n\nI will SEED this torrent as long as I can possibly afford. My upload isn\\&amp;#039;t that high (2 Mbit/s) so I hope you guys will SEED this as much as possible. \n\nI thank you very much,\n\nThe revolution is NOW!","torrent":{"xt":"urn:btih:eaf266c76d8e3dd318bfeff311d035ee2b110ff0","amp;dn":"Zeitgeist+set","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eaf266c76d8e3dd318bfeff311d035ee2b110ff0","infoHashBuffer":{"type":"Buffer","data":[234,242,102,199,109,142,61,211,24,191,239,243,17,208,53,238,43,17,15,240]},"announce":[],"urlList":[]}}