{"title":"AVG Anti-Spyware Free is a free anti-spyware protection tool dev","uid":4235672,"size":12479902,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:eb35ac08d2a28d18e7fb603537f2d4304f3c0b49&amp;dn=AVG+Anti-Spyware+Free+is+a+free+anti-spyware+protection+tool+dev&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Gayzr","files":1,"time":1213290820,"description":"Firewall, Antivirus, Antispam:\nESET Smart Security Has It All\nWith a personal firewall, antispam, antispyware, and the same antivirus protection delivered by ESET NOD32 Antivirus, ESET Smart Security is the most comprehensive defense against Internet threats.\n\nThese threats come in many forms. In fact, by the time you finish reading this sentence, approximately 70 new variants of malware?viruses, trojans, worms, rootkits, spyware, and more?will have been released.\n\nBut ESET Smart Security will keep you safe. And with the addition of personal firewall software, you can proactively filter content, ensuring customized protection.\n\nESET Smart Security is a tightly integrated solution designed to protect computers from a range of threats. Built on the award-winning ESET NOD32Â® Antivirus and its powerful ThreatSenseÂ® engine, ESET Smart Security provides antispyware, antispam and customized firewall features to protect you, your family and your business from Internet threats.\n\nESET Smart Security provides:\n? Proactive Protection: Utilizing ThreatSense?the industry&amp;#039;s most advanced heuristics technology, capable of proactively recognizing threats?the window of vulnerability between malware outbreak and signature update is reduced. The included antispam and firewall software provide you with a total security solution.\n? Precise Detection: ESET accurately identifies known and unknown threats. It consistently wins top awards from testing labs and is recognized for having zero false positives.1\n? Lightweight Design: Smart Security requires less memory and CPU power, allowing your computer to run fast, making more room for games, web browsing, and emailing.\n? Fast Scanning Speeds: ESET Smart Security is a highly efficient program ensuring fast file scanning and product updates, while running quietly in the background.\n\nIncluded Documentation\n? Product Quick-Start Guide (PDF for download; printed manual for boxed version)\n? Integrated online help (accessible via the F1 key)\nSystem Requirements\n? Processors supported: 32-bit (x86) and 64-bit (x64) IntelÂ®, AMDÂ® or 100% compatible\n? Operating Systems: Microsoft WindowsÂ® 2000, Microsoft Windows XP (32 and 64-bit editions), Microsoft Windows VistaÂ® (32 and 64-bit editions)\n? Memory: 35 - 40 MB, on average\n? Disk Space (download): 18 MB\n? Disk Space (installation): 80 MB ","torrent":{"xt":"urn:btih:eb35ac08d2a28d18e7fb603537f2d4304f3c0b49","amp;dn":"AVG+Anti-Spyware+Free+is+a+free+anti-spyware+protection+tool+dev","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb35ac08d2a28d18e7fb603537f2d4304f3c0b49","infoHashBuffer":{"type":"Buffer","data":[235,53,172,8,210,162,141,24,231,251,96,53,55,242,212,48,79,60,11,73]},"announce":[],"urlList":[]}}