{"title":"Svages - Israel part 2 - AIPAC, women and carnage.","uid":4241768,"size":1376479232,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:eb570aebc6231f6542c04bf090dbee0ccc965b1b&amp;dn=Svages+-+Israel+part+2+-+AIPAC%2C+women+and+carnage.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"raytras","files":1,"time":1213579015,"description":"Savages the quest for hegemony is three man amateur project in response to racism and especially the Dutch movie Fitna. Fed up with lies and bigotry we try to create a seven movie series to refresh our minds and to open eyes. \n\nThis one is about AIPAC, more about the treatment of women and children, Hebron and more.\n\n\nSavages the Quest for hegemony is a compilation of truth nothing more nothing  \n\nwhen finished we hope it will turn out to be one of the most complete compilations made about how we got into this mess. We started with the wars and we will end with the wars. \n\nIn between are 5 episodes i made to explain to myself how we got into the mess of episodes 1 and 7.\n\nThe first part was a YouTube and internet project called &quot;Their blood our oil&quot;.\nThe second part is a two part compilation about Israel.\nThe third part which i will upload right after this one is called &quot;Christian savages&quot;.\n\nCurrently we are working the last 4 parts corporations, psychology, media and war.\nThis is the second part of our compilation about Israel. \n\nPlease if you have the bandwidth help us spread these movies to other torrent trackers under different filenames just use savages in the title..\n","torrent":{"xt":"urn:btih:eb570aebc6231f6542c04bf090dbee0ccc965b1b","amp;dn":"Svages+-+Israel+part+2+-+AIPAC%2C+women+and+carnage.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eb570aebc6231f6542c04bf090dbee0ccc965b1b","infoHashBuffer":{"type":"Buffer","data":[235,87,10,235,198,35,31,101,66,192,75,240,144,219,238,12,204,150,91,27]},"announce":[],"urlList":[]}}