{"title":"The Bodyguard Original Soundtrack (1992) [EAC+FLAC][Michi80]","uid":4203800,"size":384408435,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ebe4802c34b0847d03753cc04817a63254fc6d60&amp;dn=The+Bodyguard+Original+Soundtrack+%281992%29+%5BEAC%2BFLAC%5D%5BMichi80%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"michi80","files":7,"time":1211660901,"description":"The Bodyguard Original Soundtrack (1992) [EAC+FLAC][Michi80]+ cover\n\nReleaser: Michi80\n\nExtractor: EAC 0.99 prebeta 3  \nRead Mode: Secure with NO C2, accurate stream, disable cache. \nCodec: Flac 1.2.1;  Level 8  \nSource: Original CD\nArtwork: Internet Covers.\n\nGeneral Info:\nIt &amp;#039;a Whitney Houston at what we find inside this CD, racchiudente the original music is from the famous love story with actors Kevin Costner and Houston. Although not a real artist&amp;#039;s albums color the six songs collected here are the best of an entire career: the subsequent work will not be able in fact to reconfirm the singer, nor in terms of quality, nor, especially, Plan voice, never more so highlighted. \nAs evidence of what would prove more than enough the only opening of the disc, entrusted to the famous &quot;I Will Always Love You&quot; (perhaps the best ballad ever strappalacrime exit from the States), if it were not for the following interpretations that follow, where Houston agile moves between soul songs ( &quot;Jesus Loves Me&quot;), dance ( &quot;I&amp;#039;m Every Woman&quot;) and even rock ( &quot;Queen Of The Night&quot;). \nConferme on the proper value of this collection also come from the songs of other artists involved, among them are distinguished, manco to say, the most famous, well represented by the voice of un&amp;#039;esplosiva Lisa Stansfield, who svetta grintosa between the bass and sax &quot;Someday (I&amp;#039;m Coming Back)&quot;, and with their stamp of Joe Cocker signing the splendid &quot;Trust In Me&quot; in pairs with Sass Jordan. \nBei moments are also offered by S.O.U.L. SYSTEM, which present the classic hit &quot;It&amp;#039;s Gonna Be A Lovely Day&quot; (better known by us in the version signed dall&amp;#039;eccentrico rap duo DJ Jazzy Jeff And The Fresh Prince), and Kenny G, with the instrumental &quot;Waiting For You &quot;signing the most romantic moment on the disc along with the already mentioned passage of the opening of Houston. \nThe closure is the theme of &quot;The Bodyguard&quot;, composed specially for the film chicca ideal of a soundtrack full of romance.\n","torrent":{"xt":"urn:btih:ebe4802c34b0847d03753cc04817a63254fc6d60","amp;dn":"The+Bodyguard+Original+Soundtrack+%281992%29+%5BEAC%2BFLAC%5D%5BMichi80%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ebe4802c34b0847d03753cc04817a63254fc6d60","infoHashBuffer":{"type":"Buffer","data":[235,228,128,44,52,176,132,125,3,117,60,192,72,23,166,50,84,252,109,96]},"announce":[],"urlList":[]}}