{"title":"Norton 360 Version 2","uid":4070639,"size":78048408,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ec8f5bdb8ce103a30779607890b218114759b8ca&amp;dn=Norton+360+Version+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"pucho69","files":1,"time":1205031604,"description":"Hello, fellow pirates, i would like to contribute this software even though that you can easily get it from Symantec. The point that i am trying to get across here is that if the most gifted programmer would crack this version of Norton 360, or at least recommend some new ideas or something.\n\nAny idea big or small would very much help in the situation in stopping Symantec or at least cripple it to the point that their software doesnt sell, beign one of the biggest viruses in earth.\n\nWell the steps i followed and the things i encountered, are that even if you disable the internet on your machine, it would not let you activate it trhough the phone (symantec got rid of the telephone activation) that is my thought until now!!\n\nAt the time of activation it keeps saying that in needs the internet to keep the registration stuff going\n\nWell is up to you (The world\\&amp;#039;s programmers) to make the difference in how we compute, and well hack and crack some software as you always do. \n\n\nCheers to all of you, and Hail to The Pirate Bay!!!","torrent":{"xt":"urn:btih:ec8f5bdb8ce103a30779607890b218114759b8ca","amp;dn":"Norton+360+Version+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ec8f5bdb8ce103a30779607890b218114759b8ca","infoHashBuffer":{"type":"Buffer","data":[236,143,91,219,140,225,3,163,7,121,96,120,144,178,24,17,71,89,184,202]},"announce":[],"urlList":[]}}