{"title":"Unsung Zeros - Discography","uid":4202804,"size":135095696,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed1aa0ab9e631f717923decf7c71261566fa3fdb&amp;dn=Unsung+Zeros+-+Discography&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"allisonpoole","files":35,"time":1211593729,"description":"Formed in 1998, Unsung Zeros had a small but loyal following thanks to extensive touring, even attracting many fans out of their home state. Their original lineup was Josh Bonner on vocals and bass, Jerry Phillips on guitar, Zach Gehring also on guitar (who currently plays with the band Mae), and Jason Burrows on drums.\n\nTheir first, self-titled demo was released seven months after the band formed. In 2000 they released their first album, People Mover, on Therapy Records. After months of touring the band signed with Eulogy Recordings where they released the Fading Out EP in 2002, and later their second album, also on Eulogy, titled Moments From Mourning, in 2002.\n\nMonths after their last release the band went through a new lineup change picking up Omar Surillo on guitar and keyboards and Nathan Chase on drums. The band released info on their web site regarding working on a new EP, but decided to record new tracks and release it as a full album. In 2004 the band announced it would be breaking up, never having released the EP or recorded any new tracks for it. The band played one final show in their hometown to a sold out crowd. The EP was supposed to be titled Life On Repeat, and contained five tracks that were only released to the public on their website before the band dissolved.\n\nThe band reunited on May 26, 2007, playing a show in Downtown Orlando.","torrent":{"xt":"urn:btih:ed1aa0ab9e631f717923decf7c71261566fa3fdb","amp;dn":"Unsung+Zeros+-+Discography","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed1aa0ab9e631f717923decf7c71261566fa3fdb","infoHashBuffer":{"type":"Buffer","data":[237,26,160,171,158,99,31,113,121,35,222,207,124,113,38,21,102,250,63,219]},"announce":[],"urlList":[]}}