{"title":"Zone Stad Seizoen 5en6 HDTV NL By Jeffrey","uid":12826066,"size":14556742574,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:ed41a842debac353d5ef9e6fd64bbf2047b7579b&amp;dn=Zone+Stad+Seizoen+5en6+HDTV+NL+By+Jeffrey&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gljeffrey45","files":26,"time":1448345562,"description":"ZoneStad Seizoen 5 HDTV NL Collected By Jeffrey\r\n\r\nZone Stad is uitgegroeid tot één van de meest dynamische politiereeksen van eigen bodem. Deze politiereeks vaart dan ook resoluut een eigen koers en serveert een spannende cocktail van actie en misdaad in Antwerpen, met boeiende plots die snel in mekaar vloeien en even dynamisch verfilmd worden. Deze aanpak resulteerde in een alsmaar groeiende trouwe aanhang in de Vlaamse huiskamer; bij de critici in een nominatie voor de Plateau Prijs en in Europa een nominatie voor een gouden nimf op het televisiefestival van Monte Carlo.\r\n\r\nIn dit seizoen wordt ook een nieuwe invalshoek uitgewerkt. Voor het eerst zien we een undercover agent in dienst van de Federale Politie aan het werk. Een keiharde kerel die over verschillende identiteiten beschikt, wat hem toelaat om in verschillende criminele milieus te infiltreren. De keerzijde is dat hij het zich niet kan veroorloven om zijn echte gevoelens te tonen. En het wordt helemaal moeilijk wanneer hij verliefd wordt.\r\n\r\nDe makers van 'Zone Stad' konden voor de realisatie van deze reeks opnieuw rekenen op de bereidwillige medewerking en logistieke ondersteuning van Stad Antwerpen en Politie Antwerpen.\r\n\r\nHet vijfde seizoen van Zone stad bevat 13 afleveringen.\r\n\r\n\r\nAfleveringen:\r\n\r\nDe gijzeling\r\nWelpen en wolven\r\nDe laatste ronde\r\nHet schilderij\r\nDe Zwarte Madonna\r\nKoud geserveerd\r\nOntsnapt\r\nIsoleercel\r\nKing of skate\r\nDe club\r\nDe stille doder\r\nVergeten\r\nVerloren zonen\r\n\r\nNL Gesproken\r\nAVI\r\n\r\n\r\nZoneStad Seizoen 6 HDTV NL Collected By Jeffrey\r\n\r\nZone Stad? is een van de weinige Vlaamse series die de vergelijking met de beste buitenlandse politieseries zonder blozen doorstaat. Actie, spanning en emotie lopen dan ook als een rode draad door de serie. De politierechercheurs van ?Zone Stad? pakken de misdaad aan van het centrum van Antwerpen tot aan de haven. Elke nieuwe zaak confronteert hen met een ander milieu en met andere drijfveren. Zo krijgen ze met het volledige gamma van de criminaliteit te maken zoals: familiedrama’s, drugssmokkel, gewelddadige afrekeningen, verkrachting, afpersing, moord en de georganiseerde misdaad.\r\n\r\nAlle verhalen die aan bod komen leunen dicht aan bij de werkelijkheid. Voor de makers is het een bewuste keuze geweest om fictie met feiten te vermengen. De inspecteurs van ?Zone Stad? zijn weliswaar slim, maar zijn toch mensen zoals u en ik: kwetsbaar, ambitieus zonder sterallures, moedig maar geen superhelden. Ook zij slagen er niet altijd in om hun privéproblemen tijdens de werkuren op het achterplan te houden. In seizoen 6 raakt het hoofdpersonage Fien Bosvoorde in de ban van iemand die onterecht beschuldigd wordt van seriemoord. Haar tegenspeler, Tom Segers, gaat op zoek naar wat er indertijd met zijn overleden vader is gebeurd en doet op het einde van het seizoen een ontdekking die zijn leven voorgoed zal veranderen.\r\n\r\n\r\nAfleveringen:\r\n\r\nAngel Tears\r\nDe aanslag\r\nLeft Side Army\r\nVuur/Water\r\nRube Goldberg\r\nKruisweg\r\nPrivé\r\nAfscheid\r\nRigor Mortis\r\nIn het duister\r\nFashion\r\nMoeders en hoeren\r\nVriend of vijand\r\n\r\nNL Gesproken\r\nAVI","torrent":{"xt":"urn:btih:ed41a842debac353d5ef9e6fd64bbf2047b7579b","amp;dn":"Zone+Stad+Seizoen+5en6+HDTV+NL+By+Jeffrey","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed41a842debac353d5ef9e6fd64bbf2047b7579b","infoHashBuffer":{"type":"Buffer","data":[237,65,168,66,222,186,195,83,213,239,158,111,214,75,191,32,71,183,87,155]},"announce":[],"urlList":[]}}