{"title":"The Real Jane Austen (BBC 2002)","uid":4128312,"size":520106186,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:ed9b85f3784b0af647b0a7547d52c97c65b9b9e4&amp;dn=The+Real+Jane+Austen+%28BBC+2002%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"noggin101","files":1,"time":1207910369,"description":"The Real Jane Austen \n\nDecember 30, 2002\nBBC 1\n\nDirected by Nicky Pattison\t \t\n \nActress Anna Chancellor (Four Weddings and a Funeral; Karaoke), who is Jane Austen&amp;#039;s great niece, narrates and appears as on-screen host of this dramatic documentary about the life of England&amp;#039;s ever-popular novelist. Here is the BBC Press Release:\n\nJane Austen remains one of the greatest writers of all time. Almost 200 years since her death, her novels such as Pride and Prejudice, Sense and Sensibility and Mansfield Park continue to entrance readers the world over, and be a source of inspiration for TV and film.\n\nCoinciding with the television premiere of Mansfield Park, The Real Jane Austen explores the woman behind these acclaimed works.\n\nPresented by Anna Chancellor, a great niece of Austen, with Gillian Kearney as Jane, Jack Davenport as Jane&amp;#039;s Brother, and also starring John Standing, Phyllis Logan, Beth Winslet and Wendy Craig, the programme shatters the myth that Jane lived the elegant Regency life of one of her heroines.\n\nThrough readings and dramatic reconstructions, The Real Jane Austen pieces together the reality of Austen&amp;#039;s existence - her modest upbringing in Hampshire as one of seven children of a clergyman; her disappointment in love; and the family&amp;#039;s poverty following the death of her father.\n\nThrough her writing Jane found financial independence without having to marry. Tragically only four years later in July 1817 whilst writing Persuasion Jane Austen died.\n\nFilmed in locations associated with Austen, including Jane&amp;#039;s birth place of Steventon and her later home in Chawton; and illustrated with extracts from film and television adaptations of Austen&amp;#039;s work, The Real Jane Austen paints a vivid portrait of one of the greatest talents in English literature.\n\n\n\nPlease note this caveat: Apologies for the quality of this file. This AVI file was produced from an original PAL off-air LP recording made by a friend. I believe the VCR that made the recording had seen better days, as the audio signal is faint and muddy, and the quality of the video suggests a machine with dirty heads. (If anyone believes they can clean the audio tracks and wants to take the time and effort, please feel free to do your magic.)\n\nPAL VHS &gt; PAL DVD-R&gt; DivX  496MB 58 Minutes\n","torrent":{"xt":"urn:btih:ed9b85f3784b0af647b0a7547d52c97c65b9b9e4","amp;dn":"The+Real+Jane+Austen+%28BBC+2002%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed9b85f3784b0af647b0a7547d52c97c65b9b9e4","infoHashBuffer":{"type":"Buffer","data":[237,155,133,243,120,75,10,246,71,176,167,84,125,82,201,124,101,185,185,228]},"announce":[],"urlList":[]}}