{"title":"Something Corporate - Leaving Through The Window","uid":4191667,"size":96931127,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ed9eea441475147297701771a59bc07f05fd2fc1&amp;dn=Something+Corporate+-+Leaving+Through+The+Window&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"billy_stretcher","files":20,"time":1210993449,"description":"Something Corporate\nLeaving Through The Window\nPop Punk/Alt.Rock\n2002\n192Kbps\n\n\n1.I Want To Save You\n2.Punk Rock Princess\n3.I Woke Up In A Car\n4.If You C Jordan\n5.Astronaut\n6.Hurricane\n7.Cavanaugh Park\n8.Fall\n9.Straw Dog\n10.Good News\n11.Drunk Girl\n12.Not What It Seems\n13.You&amp;#039;re Gone\n14.Walking By [UK bonus track]\n15.Little [UK bonus track] \n16.Globes And Maps\n\nFront, Back Inside And CD Covers Included.\n\n \nSomething Corporate includes: Andrew McMahon (vocals, piano, Hammond B-3 organ); Josh Partington, William Tell (guitar, background vocals); Clutch (bass, background vocals); Brian Ireland (drums, percussion, background vocals).\nAdditional personnel: Paul Buckmaster (arranger, conductor).\nEngineers include: Jim Wirt, Mike Fraser, Brian Reeves.\nRecorded at Cello, Hollywood, California; 4th Street, Santa Monica, California; South Beach, Miami, Florida; Jungle Room Studio, Glendale, California.\n\nAt heart, Something Corporate find themselves somewhere between the quirky, piano-driven sound of Ben Folds Five and the power pop angst of Marvelous 3 and Semisonic. The bittersweet mid-tempo &quot;Cavanaugh Park&quot; boasts lush, dramatic keyboards, setting a vibe that is almost at odds with the lyrics. &quot;Punk Rock Princess&quot; is as catchy as the song&amp;#039;s name would suggest, while the bratty, self-proclaimed anthem &quot;If You C Jordan&quot; sounds like a second cousin to much contemporaneous neo-pop-punk music. Staying corporate, &quot;Drunk Girl&quot; opens with Boston-influenced guitar harmonies that lead to the most endearing sentiment on LEAVING THROUGH THE WINDOW. The song finds a man in a dubious situation, but virtue keeps him from betraying his heart; not something corporate, but something refreshing.\n\nSomething Corporate are one of the most promising bands to come out of the MCA/Drive-Thru stall in years. Their sound is anchored by the fierce piano playing of 19 year old lead singer/songwriter Andrew McMahon. As he explains, &quot;I love the great &amp;#039;70s Elton John, where he was at the best part of his youth, writing angst-filled songs&quot;. The So-Cal quintet&amp;#039;s unique blend of piano-powered indie rock crosses the boundaries between the pop-punk that has seeded the airwaves over the years and the singer/songwriter genre that spans the last 30 years. \n\n&quot;Musically, my goal in life has always been to touch people the way that first Counting Crows record did to me. People tend to underestimate what kids will comprehend and what they&amp;#039;ll connect to. I think the more honest I am with myself, the more people get it. And regardless of whether or not people always get it, they&amp;#039;ll definitely get that we&amp;#039;re not just spitting out bullshit&quot; - Andrew McMahon\n\nRolling Stone (10/3/02, p.104) - 3 stars out of 5 - &quot;...They craft suburban ennui and high-school angst into slick, hummable punk...the secret weapon here is sharp songwriting and nice keyboards...Derivative, but not boring.&quot;\n\nEntertainment Weekly (5/31/02, p.108) - &quot;...Though these guys have the same catchy choruses and jump-up-and-down energy of modern-rock counterparts like Sum 41 and Blink-182, they&amp;#039;re not nearly as juvenile...&quot; - Rating: B \n\nEnjoy! :)","torrent":{"xt":"urn:btih:ed9eea441475147297701771a59bc07f05fd2fc1","amp;dn":"Something+Corporate+-+Leaving+Through+The+Window","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ed9eea441475147297701771a59bc07f05fd2fc1","infoHashBuffer":{"type":"Buffer","data":[237,158,234,68,20,117,20,114,151,112,23,113,165,155,192,127,5,253,47,193]},"announce":[],"urlList":[]}}