{"title":"Kaspersky Internet Security v.8.0.0.284 beta + key","uid":4078658,"size":47086481,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:edd1bb21bbc5af9085ccacbbece97ba740d6d7a3&amp;dn=Kaspersky+Internet+Security+v.8.0.0.284+beta+%2B+key&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"botpet","files":4,"time":1205448542,"description":"    1) System watch\n            System watcher (all-in-one system for registering events)\n            HIPS (host intrusion prevention system - proactive defense, which is based on limiting application actions on a system) \n            PDM (system of proactive defense, which is based on application behavior analysis for malicious/suspicious activities)\n            Firewall (personal protection screen)\n        2) Malware protection\n            Protection of files and memory (File-Antivirus)\n            Protection of email and IM (Mail-Antivirus)\n            Protection of WEB (Web-Antivirus)\n        3) Online Security\n            Protection from Phishing (Anti-Phishing)\n            Protection against network attacks (IDS)\n            Protection from auto-dialers (Anti-Dialer)\n        4) Content Filtering\n            Spam Filtering (Anti-Spam)\n            Banner Filtering (Anti-Banner)\n            Parental Control\n        5) On Demand Scanning (Scan tasks)\n        6) Updater\n            \n        Aggregated protection system status is displayed on a separate screen, from which modifications can be made to allow for ?Your computer is protected&quot;. \n        \n        Several parts of product functionality are implemented using special tasks, which are on separate tabs for following components:\n        1) Window displays an overall system status\n            Analyzer of current system protection (heuristically)\n            Master to create RescueCD\n            Master of configuration problems troubleshooting\n        2) System Watch\n            Monitor of connected networks (with support for Wi-Fi and IPv6)\n            Monitor of network activities of applications\n            Packet sniffer (analysis of network packets)\n        3) Online Security\n            Master of Internet browser setup (Browser tweaker)\n            Master of system cleanup (Privacy tweaker)\n            Virtual Keyboard, protected against screenshot captures\n        4) Content Filtering\n            Anti-Spam training wizard        \n\n    2. Graphical Interface\n        Product&amp;#039;s graphical interface was again written &quot;from scratch&quot;. With goals of code optimization and simplification, with dialogs some dialogs borrowed from 6.0/7.0. Main window changed considerably: to allow easier comprehension of longer lists the main window became resizable, to decrease the number of separate dialogs, which opened in separate windows before, the main structure became table like - in addition navigator in the left side is combined with upper tabs; by grouping several elements together main navigator is not tree like anymore.\n        All-in-one settings window of v7.0 is now a much simpler (Options) window, whereby only the main product settings remained, with some new additional options. All settings which are component specific are directly linked and changed through the main window. The support for more contextual menu system, which was previously available, makes it more scalable.\n        Alerts (dialogs for user actions) are changed to include more information and simplification for correct actions for non-savvy users.\n        To enhance readability and flexibility of controlling multiple lists a new control method was developed, which replaced all default windows listing controls. It allows to do sorting, grouping (by multiple fields) and data filtering. Scheme of control using external buttons in such controls is replaced with &quot;in-place&quot; editing possibility.\n    \n    3. Antivirus Protection\n        This build utilizes a new AV core engine, developed by Kaspersky Labs specialists. It allows to improve protection levels and speedup scanning through optimization of object handling and maximum utilization possibility of the hardware platform.\n        Technologies for object detection added with suspicious packers and multi-layered packing, which can be another characteristic for malware.\n        Possibility for granular threat type detection, including such category as &quot;mostly unwanted software applications&quot;.\n\n    4. Content Filtering\n        In Anti-Spam new technologies will be integrated, which are now in use in server products, and showed consistent efficiency (some of them will appear as early as KIS 7.0 MP1)\n\n    5. Scan Tasks\n        One of the tasks will be a vulnerability scanner of the user using an external updatable threat database.\n        Mechanism for earlier scan storage reports is changed to avoid problems, which were encountered with chkdsk utility.\n    \n    6. System Watch\n        Main protection component of a new product, based on combination of reactive and proactive technologies. Main task of this component is to control the rights of active system applications, behavioral analysis, and also logging critical events, occurring in the system - for later analysis, for example to handle occurred incidents \n        Control of application rights is based on a system of rules and application resources which are available on the system and execution environment. Resources can be of different types, including file system objects, system registry, hardware devices, rights (interception of keyboard entry etc.), access operations, which was previously controlled by &quot;Confidential Data&quot; \n        Firewall is now logically part of System Watch, since its rules are part of application rights, in which the resource is network interactions. By default the product will pass all year end 2007 leaktests.\n\n    7. Additional Technologies:\n        Technologies based on AVZ engine: detailed computer analysis with a possibility of scripted disinfection; troubleshooting masters, browser settings configuration and system cleanup.\n        System to report detected objects onto a centralized KL database. This database will allow for better protection for most apparent threats and to notify users faster about epidemics. This feature can be switched off, although confidential data is never sent anyways. \n        Base driver klif.sys on all supported OS is replaced with a new version, which is not vulnerable to current known exploits.","torrent":{"xt":"urn:btih:edd1bb21bbc5af9085ccacbbece97ba740d6d7a3","amp;dn":"Kaspersky+Internet+Security+v.8.0.0.284+beta+%2B+key","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"edd1bb21bbc5af9085ccacbbece97ba740d6d7a3","infoHashBuffer":{"type":"Buffer","data":[237,209,187,33,187,197,175,144,133,204,172,187,236,233,123,167,64,214,215,163]},"announce":[],"urlList":[]}}