{"title":"HTML5 Programmer's Reference - Jonathan Reid","uid":12762653,"size":6014758,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:ee2ea6b58a47b71ec34f9cb7ba20ad690e08949f&amp;dn=HTML5+Programmer%27s+Reference+-+Jonathan+Reid&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Mohammad_AT","files":3,"time":1447550693,"description":"The HTML5 Programmer’s Reference aims to provide everything a programmer needs for understanding and using the new HTML5 family of standards. Previous HTML standards were focused on defining tags for marking up documents. The HTML5 family of standards not only includes new semantic tags but also defines exciting new JavaScript APIs that can be used to build rich, interactive web applications for both mobile and desktop platforms.\r\n\r\nThe HTML5 Programmer’s Reference focuses on providing real-world non-trivial examples to demonstrate concepts. Chapters include both in-depth discussions and full references for all HTML5 features, as well as extras like how to find the standards, the history of their evolution, and other examples and helpful resources. With this book the reader will learn everything they need to know to build the next generation of web applications.\r\n\r\nWhat you’ll learn\r\n\r\n01. Improve the semantics of your documents using new structural tags: sections, groups, forms, etc.\r\n\r\n02. Learn the new web form features: autofocus, placeholders, field types, etc.\r\n\r\n03. Explore the new AUDIO and VIDEO tags, and learn how to embed those rich media types directly into your applications.\r\n\r\n04. Use the new HTML5 JavaScript APIs: canvas, messaging, drag and drop, workers and sockets, etc.\r\n\r\n05. Learn about related JavaScript APIs including touch events, device orientation, and WebGL.\r\n\r\nWho this book is for\r\n\r\nThe HTML5 Programmer’s Reference is for people who are working with modern web technologies who need to come up to speed fast and have answers handy for their common use cases. With HTML5 Programmer’s Reference at their elbows, programmers can quickly learn and master these new technologies, and maybe even surprise themselves with what they can do with them. The book dives directly into the new technologies without wasting time on formalities, so it is an ideal choice for developers who already have a basic understanding of web technologies and how to work with them","torrent":{"xt":"urn:btih:ee2ea6b58a47b71ec34f9cb7ba20ad690e08949f","amp;dn":"HTML5+Programmer%27s+Reference+-+Jonathan+Reid","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee2ea6b58a47b71ec34f9cb7ba20ad690e08949f","infoHashBuffer":{"type":"Buffer","data":[238,46,166,181,138,71,183,30,195,79,156,183,186,32,173,105,14,8,148,159]},"announce":[],"urlList":[]}}