{"title":"[PSX]-SLED STORM! PS1-XxGLITCHxX-ePSXe-100%-IMG.","uid":4122528,"size":433833631,"categoryP":"games","categoryS":"psx","magnet":"?xt=urn:btih:ee32e704a298d3b0973bf1f1827d11e3859c602a&amp;dn=%5BPSX%5D-SLED+STORM%21+PS1-XxGLITCHxX-ePSXe-100%25-IMG.&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"XxGLITCHxX","files":1,"time":1207624795,"description":"****ReUPLOADED*** had to reupload this, since i got faster connection. not alot of people seemed to of like to download this game?\n\nthis works 100% with ePSXe emulator (which i provide in my uploads) Very fun game! its about snowmobiling and doing sick stunts and tricks\n\nUpgrade your Sled and race, do tricks earn points. Unlock new characters,sleds,upgrades\n\nFun game, This is a game i would highly! recommend you using a joy-stick when using ePSXe the reason is for the stunts you have to hold and hit some buttons, alot harder on the keyboard!\n\n\nHere is some info about the game.... Great music too btw, to bad there is only like 11 songs. You do end up getting them stuck in your head. Some artist like ROB zombie :D\n\nINFO:\n\nPlatform: PlayStation\nRelease Date: August 10, 1999\nSimilar Games: Road Rash (Sega Genesis), Cool Boarders (PlayStation), Cool Boarders 2 (PlayStation), ESPN Extreme Games (PlayStation), Road Rash (PlayStation), ESPN Extreme Games (IBM PC Compatible), Road Rash (IBM PC Compatible), Road Rash (Sega Game Gear), Road Rash (Sega Saturn), Road Rash (Sega CD), Road Rash (3DO), Twisted Edge Extreme Snowboarding (Nintendo 64), Cool Boarders 3 (PlayStation), Rushdown (PlayStation), Road Rash (Game Boy), Road Rash (Sega Master System), Big Air (PlayStation), 1080Â° Snowboarding (Nintendo 64)\n\n\nGENERAL INFO:\n\nSled Storm is a racing game featuring snowmobiles (referred to as sleds), stunts and fourteen snow-covered courses consisting of slippery slopes, inclement weather and treacherous cliffs. Up to four players can also participate at once, making this title one of the few racing games on the PlayStation (as of 1999) to feature split-screen action with more than two players. Sled Storm also offers two forms of racing for both multi-player and solo competition: Championship and Quick Race.\n\nQuick Race allows you to jump right into the game on any of the available courses unlocked during the Championship Mode. Players can choose their alter ego from a pool of characters, each with his or her own sled rated in five areas: top speed, acceleration, handling, stability and tricks. Once a player has found the appropriate character, he or she can set the number of laps (from two to nine), time of the race (day or night) and even the weather conditions (clear, snow or rain). \n\nChampionship Mode involves competing in a series of races that can earn you money as well as open up additional tracks and hidden characters. Two types of championship racing are awaiting you: Open Mountain and the Super SnoCross. The Open Mountain Championship involves straightforward racing down alpine terrain as you try to finish first to receive a cash prize (which can then be used to purchase upgrades in such areas as treads, skis, brakes and spotlights). The Super SnoCross involves racing strictly for points as you string together tricks off the motocross-inspired courses. Earn enough points and you&amp;#039;ll be able to unlock additional characters to play as!\n\nSled Storm also features a Time Trials mode, which has you racing as fast as you can in order to earn a spot on the leader board. Once players have finished the Time Trials, there are a number of customizable features to help tailor the game to individual preferences. After completing a few circuits, you&amp;#039;ll be able to mix and match the unlocked courses to form your own custom championship. The AI can also be tweaked by toggling &quot;Catch Up Logic,&quot; meaning the CPU-controlled racers will move faster once you pass them. Finally, the multi-player perspective can be set to either a portrait or landscape view to offer more or less of the screen while racing. \n\nPlayers can also save unlocked characters, upgraded sleds and circuit progress using a memory card with one block free. The game includes support for the Dual Shock Analog Controller to offer both analog control as well as vibration feedback while racing. In addition, the included soundtrack features songs from the likes of Rob Zombie, Econoline Crush, Uberzone, E-Z Rollers and Dom &amp; Roland. Once players are through thrashin&amp;#039; the slopes, they can pop the disc into a standard CD player and listen to the music!","torrent":{"xt":"urn:btih:ee32e704a298d3b0973bf1f1827d11e3859c602a","amp;dn":"%5BPSX%5D-SLED+STORM%21+PS1-XxGLITCHxX-ePSXe-100%25-IMG.","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ee32e704a298d3b0973bf1f1827d11e3859c602a","infoHashBuffer":{"type":"Buffer","data":[238,50,231,4,162,152,211,176,151,59,241,241,130,125,17,227,133,156,96,42]},"announce":[],"urlList":[]}}