{"title":"A Message of Hope - the Presence of Maitreya (Benjamin Creme)","uid":4188037,"size":75503722,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:eea1cc3cb02cdc9e85239e618a83f3bea81dc885&amp;dn=A+Message+of+Hope+-+the+Presence+of+Maitreya+%28Benjamin+Creme%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"eveningstar","files":1,"time":1210786895,"description":"Information has for over 100 years been flowing in the world, about the existence \n\nof a group of enlightened, highly evolved men, men like us who have gone ahead of \n\nus in evolution and became perfect. They are said to be living in the remote \n\nmountain and desert areas of the world and were seen only by few people.\n\n\nThe first who spoke of Masters of Whisdom, as they are called, was a Russian Madam \n\nHelena Petrovna Blavatsky, founder of Theosophical Society. She claimed to have \n\nmet them while on travelling across India and Tibet.\n\n\nLater, from 1920 on, an English disciple Alice Ann Bailey published 19 esoteric \n\nbooks which she received telepathically from one of the masters named Djwhal Khul \n\nor simply The Tibetan.\n\n\nToday the news about them and is being presented to the world by English artist \n\nand esotericist Benjamin Creme. \n\n\nHis message is that despite of all the agonies the world today faces, a new torch \n\nof hope has been lit. The masters have decided to return openly in the world to \n\nhelp us in our crisis and to show us how deep our potential as humans goes - into \n\ninfinity. Infront of the group comes their leader Maitreya, the one who has been \n\nexpected for generations by all religions only that they call him by different \n\nnames. \n\n\nThey now come, at the dawn of the new age of Aquarius to help us realize and \n\nfulfil our destiny, a destiny of living gods.","torrent":{"xt":"urn:btih:eea1cc3cb02cdc9e85239e618a83f3bea81dc885","amp;dn":"A+Message+of+Hope+-+the+Presence+of+Maitreya+%28Benjamin+Creme%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eea1cc3cb02cdc9e85239e618a83f3bea81dc885","infoHashBuffer":{"type":"Buffer","data":[238,161,204,60,176,44,220,158,133,35,158,97,138,131,243,190,168,29,200,133]},"announce":[],"urlList":[]}}