{"title":"Music Alarm Clock v3.12","uid":4192017,"size":847968,"categoryP":"other","categoryS":"other","magnet":"?xt=urn:btih:eeb854833c0a066697ebd7e2a3fe74323f5cf6bf&amp;dn=Music+Alarm+Clock+v3.12&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"lnterrobias","files":2,"time":1211016919,"description":"Music Alarm Clock v3.12 \n\n\nNow with this PC program you can set your favorite MP3 or CD songs as the ring sound.\nIn attempt to make waking up for a work a more pleasant experience, this program also provides an option of waking to the CD, MP3, audio, video or the MPEG movies. Additional features include Gentle wake, Weekend Sleeper, Auto-Shutdown function, built-in play lists editor...\nMain Features:\n\nSupports a wide spectrum of file formats, include video and audios.\nsupports about all of media file types. This brand new version also plays CD tracks, WAV audios, AVI videos and MPEG movies.\n\nYou can set up set an infinite number of alarms.\nSupports fade In (Gentle Wake) and Fade Out function!\nThe gentle-wake feature will gradually increase the volume to ensure a gentle and certain awakening. Oppositely, the fade out function is good for a lullaby.\n\nSupport Weekend Sleeper feature\nThe Weekend Sleeper function will prohibit alarms from going off on weekends (or any other regular days you choose).\n\nSupports the play list!\nYou can use the built-in play list editor to edit your own play list. One of our users lived alone in Paris and she like to play some audio songs at first, when she is totally awaked, she will see her husband and two years old baby\\\\\\&amp;#039;s video on the screen (sometimes with her baby\\\\\\&amp;#039;s crying or laughing), then she will get up and have her breakfast with some other music.\n\nSleep and Slumber feature enabled now!\nWith the sleep/slumber feature, you can listen to music while falling asleep without the worry of having to turn off the power. It will be automatically shut off after the playback is end.\n\nOther Features:\nÃƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ \\\\\\&quot;Always on top\\\\\\&quot; feature\nÃƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ Separate displays for time, date and day of the week\nÃƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ Possibility to position the main screen anywhere on the screen\nÃƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ Detection of another running copy hiding in the system tray\nÃƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ Auto-save of settings\nÃƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ Full install/uninstall support\nÃƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ Pure Win32 API code\nÃƒ?Ã‚Â¢?Ãƒ?Ã‚Â¢ Set your video as screensaver\n\nOS: Windows 95/98/NT/2000/ME/XP\n","torrent":{"xt":"urn:btih:eeb854833c0a066697ebd7e2a3fe74323f5cf6bf","amp;dn":"Music+Alarm+Clock+v3.12","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"eeb854833c0a066697ebd7e2a3fe74323f5cf6bf","infoHashBuffer":{"type":"Buffer","data":[238,184,84,131,60,10,6,102,151,235,215,226,163,254,116,50,63,92,246,191]},"announce":[],"urlList":[]}}