{"title":"Memorialul Durerii + Cei Morti (Romanian)","uid":4186839,"size":2918875136,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:ef22819e6513b98c9a8ecdce32c80cebc7af4d15&amp;dn=Memorialul+Durerii+%2B+Cei+Morti+%28Romanian%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"cypher_foo","files":13,"time":1210719110,"description":"----------------ROMANIAN-------------------\n\nAcest DVD contine doua parti - Memorialul Durerii si Cei Morti.\n\nMemorialul Durerii - film de Lucia Hossu Longin. Selectie de 30 de minute din serialul cu acelasi titlu produs de catre Televiziunea Romana\n\nCei Morti - Un film despre noile sapaturi din &quot;Cimitirul saracilor&quot; de la Sighet, initiate de Institutul de Investigare a Crimelor Comunismului in Romania si Fundatia &quot;Academia Civica&quot;\n\n---------------ENGLISH---------------------\n\nThis is a two-part DVD - The Memorial Of Pain and The Dead Ones, no subtitles, audio in Romanian\n\nThe Memorial of Pain was a long-running television series that ran on the Romanian Television (the Romanian state channel) starting July 1991, barely 20 months after the overthrow of the communist dictatorship. 120 episodes were aired, detailing the stories of communist atrocities and human rights violations during almost half a century of communist rule of Romania (1945-1989), as well as the stories of dissidents and survivors.\nIn April 2008, 36 of these episodes were selected and launched as a DVD collection, accompanying the launch of the eponymous book. This 30-minute film by Lucia Hossu Longin (the Memorial&amp;#039;s creator) contains a selection of scenes from the series.\n\nThe Dead Ones - A film about the new digs at the &quot;Pauper&amp;#039;s Cemetery&quot; in Sighetu Marmatiei, a town in the northern Romania which houses one of the most infamous communist prisons, now a memorial for the victims of the regime. The digs were carried out by The Institute for Investigation of Communist Crimes in Romania and the &quot;Academia Civica&quot; Foundation.","torrent":{"xt":"urn:btih:ef22819e6513b98c9a8ecdce32c80cebc7af4d15","amp;dn":"Memorialul+Durerii+%2B+Cei+Morti+%28Romanian%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ef22819e6513b98c9a8ecdce32c80cebc7af4d15","infoHashBuffer":{"type":"Buffer","data":[239,34,129,158,101,19,185,140,154,142,205,206,50,200,12,235,199,175,77,21]},"announce":[],"urlList":[]}}