{"title":"Dreamcast - Blue Stinger AIO","uid":4085642,"size":430009722,"categoryP":"games","categoryS":"other","magnet":"?xt=urn:btih:f0bbe9e5d7cede350e0a7b2a6287673d6ca13670&amp;dn=Dreamcast+-+Blue+Stinger+AIO&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Wolfsstund","files":1,"time":1205789311,"description":"Dreamcast - Blue Stinger / All in One Archive\n\nI made some AIO for Blue Stinger, it contains the iSO of course, a burning tutorial, the coverart and codes / tricks as well as VMU saves for it. just read the info and or the how 2 burn tutorial and get that thing working.\n\nhere is some short review:\n\n&quot;The story takes place on Dinosaur Island, where a high-tech, high-security bio-research community has been built. Eliot Ballade, a vacationing member of the island&amp;#039;s Emergency staff is caught in a mysterious explosion. Upon returning to the island he finds that the population is wiped out, with more mutated people and animals than survivors. The only clue in this mystery is Nephilim, a glowing blue fairy that triggers dream-like visions in those around her.\n\nWhile the story is confusing and not entirely original, Blue Stinger is graphically impressive in both its enormity and detail. The island community is complex and full of bizarre creatures (although there are curiously few dinosaurs) and buildings ranging from commercial stores to science labs and power plants. The puzzles and boss creatures are very challenging and the strong visuals make this game worth experiencing.&quot;","torrent":{"xt":"urn:btih:f0bbe9e5d7cede350e0a7b2a6287673d6ca13670","amp;dn":"Dreamcast+-+Blue+Stinger+AIO","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f0bbe9e5d7cede350e0a7b2a6287673d6ca13670","infoHashBuffer":{"type":"Buffer","data":[240,187,233,229,215,206,222,53,14,10,123,42,98,135,103,61,108,161,54,112]},"announce":[],"urlList":[]}}