{"title":"DrÃƒÂ¡cula (Dracula) 1931 DVDRip Dual Audio By Bozano","uid":4074174,"size":731423626,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f1b73239c3b43b0a319fb6cb3b012a0ff017f363&amp;dn=Dr%C3%83%C2%A1cula+%28Dracula%29+1931+DVDRip+Dual+Audio+By+Bozano&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"bozano","files":3,"time":1205208482,"description":"Dracula (Bela Lugosi) e um conde vindo dos Carpatos que aterroriza Londres por carregar uma maldicao que o obriga a beber sangue humano para sobreviver. Apos transformar uma jovem em vampira ele concentra suas atencoes em uma amiga dela, mas o pai da proxima vÃƒÂ­tima se chama Van Helsing (Edward Van Sloan), um cientista holandes especialista em vampiros que pode acabar com seu reinado de terror.\n\nAfter a harrowing ride through the Carpathian mountains in eastern Europe, Renfield enters castle Dracula to finalize the transferral of Carfax Abbey in London to Count Dracula, who is in actuality a vampire. Renfield is drugged by the eerily hypnotic count, and turned into one of his thralls, protecting him during his sea voyage to London. After sucking the blood and turning the young Lucy Weston into a vampire, Dracula turns his attention to her friend Mina Seward, daughter of Dr. Seward who then calls in a specialist, Dr. Van Helsing, to diagnose the sudden deterioration of Mina&amp;#039;s health. Van Helsing, realizing that Dracula is indeed a vampire, tries to prepare Mina&amp;#039;s fiance, John Harker, and Dr. Seward for what is to come and the measures that will have to be taken to prevent Mina from becoming one of the undead.","torrent":{"xt":"urn:btih:f1b73239c3b43b0a319fb6cb3b012a0ff017f363","amp;dn":"Dr%C3%83%C2%A1cula+%28Dracula%29+1931+DVDRip+Dual+Audio+By+Bozano","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1b73239c3b43b0a319fb6cb3b012a0ff017f363","infoHashBuffer":{"type":"Buffer","data":[241,183,50,57,195,180,59,10,49,159,182,203,59,1,42,15,240,23,243,99]},"announce":[],"urlList":[]}}