{"title":"Angels Thaddeus Music by Sanaya Roman","uid":4195115,"size":185608733,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f1f19ff98269a5c72b92c82298626fd6c3f360b9&amp;dn=Angels+Thaddeus+Music+by+Sanaya+Roman&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"iloveabrahamhicks","files":4,"time":1211170093,"description":"Angels\nThe music in this album is a gift to you from the angels.  In each musical journey, a group of angelic beings work with Thaddeus to bring you music that heals, lifts, and takes you into their realms of light and joy. Angels play through creating music, and in this play bring to you their sounds of transformation, light, and love. \n\nThis is one of Thaddeus&amp;#039; most popular albums for healing. As you listen, ask for any assistance you need. This music is filled with angelic choirs, harp, piano, and strings.\n\nThe music is happy, relaxing, soothing, and melodic. It will expand your consciousness and relax your body as you listen. Album has approximately 2 hours of music and is ideal for meditation, healing, relaxation, and for pure listening enjoyment.\n\nSide 1 Angels of Love\nThese are the gentlest of angels.  Their song is sent to awaken your heart and to help you receive your higher good. They can assist you in forgiving yourself and others, in releasing the past, and in increasing your feelings of self-love and self-worth.  Work with them to experience unconditional love for yourself and others.\n\nSide 2 Angels of Healing\nThaddeus calls the angels of healing to heal and lift pain, suffering, or illness you may have.  They will join their energy with yours to assist you in healing anything in your life.  Nothing is too big or too small for them to help you with.  As you listen, sense their presence and ask for whatever assistance you need.\n\nSide 3 Guardian Angels\nThese angels protect and watch over you, your home, and loved ones. They are always ready to shield and protect those who call upon them.  As you listen, call upon your guardian angel.  Feel the comforting, soothing lullaby of reassurance these guardian angels sing as they weave a light of protection around you.\n\nSide 4 Angels of Beauty\nBring beauty and harmony into your home and life as you surround yourself with the angels of beauty. Beauty brings divine essence into anything you see and create.  Call upon the angels of beauty to join with you as you birth your art, music, or other creative work.   Create a life that is more beautiful than anything you have imagined.  \n &lt;a href=&quot;\nhttp://www.orindaben.com/products/ms204d.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.orindaben.com/products/ms204d.php&lt;/a&gt;","torrent":{"xt":"urn:btih:f1f19ff98269a5c72b92c82298626fd6c3f360b9","amp;dn":"Angels+Thaddeus+Music+by+Sanaya+Roman","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f1f19ff98269a5c72b92c82298626fd6c3f360b9","infoHashBuffer":{"type":"Buffer","data":[241,241,159,249,130,105,165,199,43,146,200,34,152,98,111,214,195,243,96,185]},"announce":[],"urlList":[]}}