{"title":"Monkey Business Series 7 Disc 2","uid":4126688,"size":1389144296,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f2223e05b669a3785da87735859d26aa6052533e&amp;dn=Monkey+Business+Series+7+Disc+2&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"jaywick","files":1,"time":1207832694,"description":"From The Monkey World Website\n\nSet amongst the woodland of Dorset lays 65 acres of sanctuary for over 150 primates. \nMonkey World was set up in 1987 by Jim and Alison Cronin to provide abused Spanish beach chimps with a permanent, stable home. \nToday Monkey World works in conjunction with foreign governments from all over \nthe world to stop the illegalsmuggling of apes out of Africa and Asia. \nAt the park visitors can see more than 150 primates of 15 different species.\n\nThere are currently 56 chimpanzees at Monkey World, which makes it the largest group \noutside Africa. \nMonkey World has rescued chimps from Spain, Greece, France, England,Austria, \nThe Netherlands, Israel, Cyprus, Dubai and Taiwan where they were being used \nand/or abused in laboratories, as exotic pets, as photographer?s props, or as circus \nanimals. \nTheir exact histories vary, but the majority of them share part of the same story. \nBorn in Africa chimps are taken from their family groups as youngsters. \nPoaching expeditions for bush meat and the capture of young animals results in the \nslaughter of adults as they try and defend their babies and extended family. \nIt is estimated that the removal of one infant will result in the death of up to \nten other chimpanzees. \nThe young animals are smuggled out of Africa and then sold illegally abroad.\n\nIn the case of Spanish beach chimps, they are dressed up in human clothes and worked \nin tourist resorts, often for 16 hours per day as a photographer?s prop. When the \nchimpanzees reach 4 or 5 years of age they become uncontrollable and are usually \nkilled in order to be replaced with a new baby chimp. Some photographers will try \nand control their chimps by beating them and pulling their teeth out and/or putting \nthem on drugs. Monkey World in co-operation with Spanish authorities confiscates all \nknown beach chimpanzees. New arrivals are given a full medical check and such \nexaminations often reveal serious injuries such as machete wounds and broken bones. \nMany of the chimps come to us addicted to drugs. Recovery and rehabilitation is a \nlengthy process with many of the animals suffering from malnutrition and anaemia.\n\nAt Monkey World we rehabilitate the chimps into large social groups but we keep the \nfemales on birth control. There are still many chimps that need rescuing and for this \nreason we do not allow our animals to breed in order that we have the space and \nfunding to rescue others. At present there are 4 groups of chimps at the park, \nthe largest numbering 22. Each group is given at least 1 hectare of land. \nMonkey World is also working in Asia with the Pingtung Rescue Centre for Endangered \nWild Animals to try to stop the smuggling of gibbons and orangutans from the wild. \nWe are also conducting undercover surveys of the illegal pet trade in South East Asia.\n\nOn site there is a hospital and operating theatre where most of the medical examination \nand operations on the chimps and monkeys happen. While we have a local vet and a \nspecialist primate vet, the staff at Monkey World are recognised as experts in primate \nrehabilitation and health. We also bring in specialists as needed such as paediatricians, \ndentists, ear, nose and throat surgeons, ophthalmic specialists, and gynaecologists. \n\nOur costs of providing quality and continuing care are high. We operate an adoption \nscheme to assist in our fund raising, which includes free admission to the park for \none year. Our work can only continue with the assistance of our supporters and visitors. \n\n\t &lt;a href=&quot;\thttp://www.monkeyworld.co.uk/main.php&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\thttp://www.monkeyworld.co.uk/main.php&lt;/a&gt;\n-------------------------------------------------------------------------------------------\n\nJim Cronin passed away on March 17, 2007 at Cabrini Medical Center in Manhattan. \nBorn and raised in Yonkers, NY, he has been a resident of Great Britain for more \nthan two decades where he and his wife Alison have operated the internationally \nrenowned ape rescue centre, Monkey World, which works with governments around the \nworld to halt the illegal smuggling of apes out of Africa and Asia. Jim was educated \nat St. Denis School and Lincoln High School in Yonkers.\n\nDuring the past 20 years, Jim established himself as an international expert in the \nrescue and rehabilitation of abused primates, and the enforcement of international \ntreaties aimed at protecting primates from illegal trade and experimentation. \nJim founded Monkey World which he and Alison built from a small refuge to a 65 acre \nwildlife park that is home to more than 160 rescued primates of 16 different species \nand is rated as one of the most popular family destinations in England. Last year Jim \nwas awarded the honour of Member of the British Empire (MBE) by Queen Elizabeth II for \nServices to Animal Welfare. The well-loved series, Monkey Business, has documented \ntheir frequent rescue missions and undercover investigations throughout Europe and \nAsia for the past 10 years, and a new series is in production.\n\nJim had a passion for life and the conservation of wildlife that was an inspiration \nto all who knew him. His enthusiasm was infectious and he will be missed by all whose \nlives he touched. Jim?s legacy will continue under the guidance of his devoted wife, \nDr Alison Cronin. Monkey World and the numerous projects Jim and Alison set up globally, \nwill continue as a fitting memorial to a man whose life touched so many around the world.\n\nMonkey World have set up a fund in memory of Jim to continue his legacy.","torrent":{"xt":"urn:btih:f2223e05b669a3785da87735859d26aa6052533e","amp;dn":"Monkey+Business+Series+7+Disc+2","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2223e05b669a3785da87735859d26aa6052533e","infoHashBuffer":{"type":"Buffer","data":[242,34,62,5,182,105,163,120,93,168,119,53,133,157,38,170,96,82,83,62]},"announce":[],"urlList":[]}}