{"title":"Webroot Window Washer 6.5.5.155 - Uploaded for PACMAN.PT.VU","uid":4198726,"size":3785964,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f233f116b4ed5ace55fc1d4ae8257826f5d45e19&amp;dn=Webroot+Window+Washer+6.5.5.155+-+Uploaded+for+PACMAN.PT.VU&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"real-pacman","files":1,"time":1211383606,"description":"Uploaded for:\n\nWWW.PACMAN.PT.VU / WWW.PACSTEAM.PT.VU\n*************************************\n\nThe newest version of Windows Washer. Fully cracked just install.  I use this on a daily basis.  Washes away ANY tracks of computer use, interent, photo, files, last accesses of files...Custom scanner detects other programs that could store possible incrimidating evidence against you and allows you to adjust what to do with them.  \n\nAlso, its pretty handy right before you you defrag.  Windows defrag likes to defrag a bunch of shit it doesn&amp;#039;t even need to worry about.  Like defragging the recycling bin or the temp internet files.  This causes the defrag to take...for...ever...Just run a wash quick and then defrag.  Seems to go hand in hand with each other.  Matter of fact, fuck Windows defualt defrag.  Download O&amp;O or Diskeeper defraggers.  They are the bomb for defragging!  I sound like a fricking infomercial...\n\nWebroot Window Washer 6.5.5.155\n\n\nWindow Washer is the definitive choice to safely and completely increase system performance and completely wash away your on and off line activities. It&amp;#039;s an Internet washer, system cleaner, registry cleaner and privacy protector all in one! \n\nThis utility automatically cleans your cache, cookies, history and recent documents list to protect your privacy and improve system performance. Completely overwrite files with random characters making them unrecoverable by undelete or un-erase utilities. Built-in safety features prevent you from accidentally removing important files. You can save valuable cookies to maintain your preferred Internet settings and logins. You can automatically discover and install free plug-ins for your favorite programs such as Real Player or Adobe Acrobat. This utility automatically cleans your cache, cookies, history and recent documents list to protect your privacy and improve system performance. Completely overwrite files with random characters making them unrecoverable by undelete or un-erase utilities. Built-in safety features prevent you from accidentally removing important files. You can save valuable cookies to maintain your preferred Internet settings and logins. You can automatically discover and install free plug-ins for your favorite programs such as Real Player or Adobe Acrobat. \n\nWebroot Window Washer protects your privacy and improves PC performance:\n- Simply, safely and easily wipe clean your online and offline tracks for complete privacy \n- Wash away excess useless files that clog your PC&amp;#039;s hard drive \n- Shred function includes bleach to completely wipe out data \n- Free plug-ins instantly detect and clean up more than 60 popular programs \n- Custom wash cycles put you in control \n- Automatic cleaning saves you time \n\nFeatures:\n? Windows Vista? Compatible. Webroot Window Washer now supports Microsoft&amp;#039;s Windows Vista Operating System. \n? Extensive Wash Areas. Window Washer scrubs hundreds of areas on your PC to remove unnecessary files to ensure your privacy and free up valuable disk space.\n? Browser Activity Eraser. Window Washer cleans all aspects of your browser activity, including Internet history, address bar, cache, cookies, and more. Firefox users now enjoy the same online privacy protection that users of Internet Explorer, AOL and Netscape already enjoy.\n? Permanent Bleaching. Bleach, an encryption feature, completely overwrites files with random characters to make them unrecoverable. This feature is so powerful it exceeds the tough standards of the Department of Defense and the National Security Agency.\n? Free Space Cleaner. Free space on your computer contains portions of old and previously deleted files and documents. Window Washer now cleans this area making the files you deleted earlier permanently unrecoverable.\n? One-click Shredder. Window Washer lets you simply and conveniently shred a folder and all of its contents, or just a single file, in one step. Just a simple right-click will permanently overwrites these files, making them unrecoverable.\n? Critical File Protection. Window Washer includes built-in safety features to help prevent you from accidentally removing important files. Alerts prompt you to confirm your request to delete special folders, like system folders, My Documents, My Photos, and others, so they remain safe from unintentional deletions.\n? Smart Cookie Saver. Window Washer deletes the cookies you don&amp;#039;t want and lets you keep and save those you do. That way you maintain your preferred Internet settings and log-ins for all your favorite sites.\n? Flexible Washes. During a wash, Window Washer automatically cleans the latest versions of your favorite programs such as Microsoft Office, Google Search Toolbar, iTunes, Adobe Flash Player, Adobe Acrobat and hundreds more, to keep these programs running smoothly.\n? Automatic Wash Cycles. You can set Window Washer to automatically clean your system at specified intervals, like at shut down or start up. For added security, we recommend setting Window Washer to wash when you close your Internet browser.\n? Total System Erase. Window Washer can be set to fully erase your hard drive, files, programs and operating system for easy re-formatting. Consider using this feature if you&amp;#039;re donating or selling your PC and you don&amp;#039;t want your files to be seen by strangers.\n\nWhat&amp;#039;s New in Version 6.5:\n* Windows Vista Compatible\n* Expanded application cleaning for over 180 3rd party programs\n* Updated interface makes it faster and easier to keep your privacy\n* Erases tracks of sites you&amp;#039;ve visited\n* Removes thousands of unnecessary files\n* Increases computer performance\n* Securely removes files using government standards\n* Highly rated by independent reviews\n* Can be set to clean your computer on a regular schedule\n\nHomepage - http://www.webroot.com/products/windowwasher/\n\n----------\n\n\nGIVE UP YOUR FREEDOM FOR SECURITY --- \n\nAND YOU CAN BE SURE TO LOSE BOTH \n\n\n\nThe terrorists are NOT who you think they are: \nSecret Service create the terror, to bring in the new world order \n- NO TO GLOBAL DICTATORSHIP !!!! \n\n","torrent":{"xt":"urn:btih:f233f116b4ed5ace55fc1d4ae8257826f5d45e19","amp;dn":"Webroot+Window+Washer+6.5.5.155+-+Uploaded+for+PACMAN.PT.VU","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f233f116b4ed5ace55fc1d4ae8257826f5d45e19","infoHashBuffer":{"type":"Buffer","data":[242,51,241,22,180,237,90,206,85,252,29,74,232,37,120,38,245,212,94,25]},"announce":[],"urlList":[]}}