{"title":"RamboIV","uid":4179947,"size":289971836,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f258ccb08bb4241e6685da12ea479ac46a49598e&amp;dn=RamboIV&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"nick_man1000","files":1,"time":1210349734,"description":"Vietnam veteran John Rambo has survived many harrowing ordeals in his lifetime \n   and has since withdrawn into a simple and secluded existence in Bangkok, where\n   he spends his time salvaging old PT boats and tanks for scrap metal. Even though \n   he is looking to avoid trouble, trouble has a way of finding him. A group of\n   Christian human rights missionaries, led by Michael Burnett and Sarah Miller,\n   approach Rambo with the desire to rent his boat to travel up the river to Burma.\n   For over fifty years, Burma has been like a war zone. The Karen people of \n   the region, who consist of peasants and farmers, have endured brutally \n   oppressive rule from the murderous Burmese military and have been struggling\n   for survival every single day. This is the time when medical assistance and\n   general support from the Christian missionaries is needed most. After some \n   consideration, and due to insistence from his mentor, former military man Ed \n   Baumgartner, Rambo accepts the offer and takes Michael, Sarah, and the rest of \n   the missionaries up the river. When the missionaries finally arrive at the Karen\n   village, they are ambushed by the sadistic Major Pa Tee Tint and a slew of \n   Burmese army men. A portion of the villagers and missionaries are tortured and\n   viciously murdered, while Tint and his men hold the remainder captive. News soon\n   reaches the minister in charge of the mission and with the help of Ed Baumgartner he\n   employs Rambo to lead a rescue effort. With five young and highly diverse\n   mercenaries at his disposal, Rambo has to travel back up the river and liberate\n   the survivors from the clutches of Major Tint in what may be one of his \n   deadliest missions ever\n   \n   \n   \n                    &lt;a href=&quot; http://www.imdb.com/title/tt0462499/&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt; http://www.imdb.com/title/tt0462499/&lt;/a&gt;\n\nIf you like my compressed videos then please seed them.","torrent":{"xt":"urn:btih:f258ccb08bb4241e6685da12ea479ac46a49598e","amp;dn":"RamboIV","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f258ccb08bb4241e6685da12ea479ac46a49598e","infoHashBuffer":{"type":"Buffer","data":[242,88,204,176,139,180,36,30,102,133,218,18,234,71,154,196,106,73,89,142]},"announce":[],"urlList":[]}}