{"title":"CashTrack (formally iFinance)","uid":4084493,"size":1010391,"categoryP":"applications","categoryS":"mac","magnet":"?xt=urn:btih:f2864cc45e24b17f2199e9bbf4694e5acd90f36a&amp;dn=CashTrack+%28formally+iFinance%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"DJMac317","files":1,"time":1205728457,"description":"- Ability to transfer between accounts to move money easily and make payments\n- Add transactions quickly and easily.\n- Deletion of transactions is not supported since Banks don\\&amp;#039;t delete transactions.\n- Loan calculator\n- Debt to income ratio calculator\n- Bill Reminder\n\nCashTrack is the easy way to keep track of your finances with out all the confusion and clutter of big bloated programs.  \n\nIn my experience working for a bank, almost 75% of people with just a regular checking or savings account don&amp;#039;t write down their transactions in a check ledger or keep track of them in any way.  The most common reasons are it&amp;#039;s too inconvenient or all the finance software is too complicated.  This is where CashTrack comes in.  \n\nAdding transactions is as easy as typing in the type of transaction, and the amount.  \n\nOther bank software allows you to manipulate your money to the point where you don&amp;#039;t know what happened when.  Banks will never delete a transaction from a ledger, all adjustments are made using the &quot;Add Transaction&quot; tool and then you&amp;#039;ll know when adjustments have been made.   \n\nTransfering funds between accounts couldn&amp;#039;t be simpler.  Instead of manually putting in the values for payments, the Transfer function will move the money in your ledger between accounts or to your loan, credit card, or mortgage payments.\n\nNow there is no excuse for not keeping track of your finances.  CashTrack can handle Checking and savings accounts, consumer loans, credit cards and mortgages and equity loans all using the same interface, with an emphasis on simplicity and ease.\n\nOne of the most useful features of CashTrack is the ability to remind you of bills that need to be paid.  Bills such as credit cards, gas, cable, electric, phone and so on.  Simply input the name of the bill, the account number of the bill, which account it will come out and the day of the month it is due.  The next time you launch CashTrack, it will remind you of bill due 5 days in advance.","torrent":{"xt":"urn:btih:f2864cc45e24b17f2199e9bbf4694e5acd90f36a","amp;dn":"CashTrack+%28formally+iFinance%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f2864cc45e24b17f2199e9bbf4694e5acd90f36a","infoHashBuffer":{"type":"Buffer","data":[242,134,76,196,94,36,177,127,33,153,233,187,244,105,78,90,205,144,243,106]},"announce":[],"urlList":[]}}