{"title":"Digital Signage","uid":4236475,"size":986,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f32f33a27bbb4fa00dfea853dd3f44d484a79fae&amp;dn=Digital+Signage&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"steyn69","files":1,"time":1213323365,"description":"Flash Adverts Agent is a Multimedia Digital Signage software system which can operate multiple units, post media content to screens and manage your Network from your desktop.\n\nFlash Adverts Agent is a Multimedia Digital Signage software system which can operate multiple display units (LED/LCD displays, VGA projectors and video walls) remotely across a LAN, WAN or internet. It can control multiple display units located in parts of the building or across the city from your desktop PC. With Flash Adverts Agent, VCR, VCD players and CD-ROM are no longer required to connect to each display unit to broadcast advertising contents.\n\n\nThere are two main components that allow a digital signage network to operate without any down time, namely: deployment tool and a tool to display the adverts. The two tools are: Flash Adverts Agent and FTP Player and will be described in detail here.\n\nThe software also supports Shared and Private Digital Signage Networks.\nOnce you have downloaded Flash Adverts Agent, please contact us and we will send you a license key. ","torrent":{"xt":"urn:btih:f32f33a27bbb4fa00dfea853dd3f44d484a79fae","amp;dn":"Digital+Signage","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f32f33a27bbb4fa00dfea853dd3f44d484a79fae","infoHashBuffer":{"type":"Buffer","data":[243,47,51,162,123,187,79,160,13,254,168,83,221,63,68,212,132,167,159,174]},"announce":[],"urlList":[]}}