{"title":"Advanced Uninstaller PRO v9.1 Portable","uid":4226247,"size":23702876,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:f3ad736804bff432b5c4e85b4125d92a608ab65c&amp;dn=Advanced+Uninstaller+PRO+v9.1+Portable&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"NoExcuses","files":1,"time":1212843726,"description":"Advanced Uninstaller PRO v9.1 made Portable\n\nNo need to install it.\n\n\nAdvanced Uninstaller PRO is the ultimate uninstaller for Windows. You can uninstall programs quickly and completely using its simple and intuitive interface.\n\nThe Installation Monitor included in the program can watch all the actions that a program performs on your computer while it installs. Advanced Uninstaller PRO remembers these changes so later you can completely uninstall that program, making sure nothing is left behind. This tool can remove any program without a trace.\n\nAdvanced Uninstaller PRO can also remove a lot of items that other uninstallers can&amp;#039;t even touch. It can repair broken registry entries, clean non-functional Start Menu shortcuts, uninstall annoying browser toolbars, plugins and hijackers, remove fonts and get rid of startup programs that run in your system tray and slow down your computer.\n\nThe program is especially designed to be very clear, fast, pleasant and intuitive. Easy to read information and help is readily available throughout the program, guiding you every step of the way.\n\nAdvanced Uninstaller PRO helps your PC run at its full speed by taking good care of the Windows registry and services. It also helps you free disk space by detecting and removing duplicate files and helping you turn on the Windows file compression if needed.\n\nThe program can delete the web browsing and document opening history in many applications, so you can surf the Internet and open images, videos and any other file without worry. It can also defend your right to privacy by shredding the files and folders you choose in such a way that they won?t ever be recovered.\n\nWith Advanced Uninstaller PRO, you have all the tools you need to uninstall programs, speed up and fix your PC, protect your privacy, remove lots of annoying plugins, toolbars and browser hijackers that other cleaning tools don&amp;#039;t detect and remove.\n\nAdvanced Uninstaller PRO runs on Windows Vista and Windows XP and has been reviewed and recommended by prestigious computer magazines and testing labs all over the world.\n\n\n\nMore infos about it to:\n &lt;a href=&quot;\nhttp://www.innovative-sol.com/uninstaller/new.htm&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.innovative-sol.com/uninstaller/new.htm&lt;/a&gt;\n\nEnjoy and remember to seed... :o)\n\n","torrent":{"xt":"urn:btih:f3ad736804bff432b5c4e85b4125d92a608ab65c","amp;dn":"Advanced+Uninstaller+PRO+v9.1+Portable","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3ad736804bff432b5c4e85b4125d92a608ab65c","infoHashBuffer":{"type":"Buffer","data":[243,173,115,104,4,191,244,50,181,196,232,91,65,37,217,42,96,138,182,92]},"announce":[],"urlList":[]}}