{"title":"Donald Byrd ~ A New Perspective","uid":4070706,"size":98888220,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f3fdb52949feb70a26b8ed5cfffbb3029cc546ff&amp;dn=Donald+Byrd+%7E+A+New+Perspective&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"gazzjazz","files":8,"time":1205034732,"description":"One of the great albums from the legendary Donald Byrd\nthis album is up here already but no longer seeded\nI&amp;#039;ve included scanned cover art &amp; the disc plus the All Music Guide bio &amp; a killer of a review\nif you have never been into choirs this might change you perspective, plus this is so much like Gershwin&amp;#039;s &quot;Porgy &amp; Bess&quot;.\n\nwhat follows is AMG&amp;#039;s perspective...now that&amp;#039;s new!\n\nBiography\tby Steve Huey\n\nDonald Byrd was considered one of the finest hard bop trumpeters of the post-Clifford Brown era. He recorded prolifically as both a leader and sideman from the mid-&amp;#039;50s into the mid-&amp;#039;60s, most often for Blue Note, where he established a reputation as a solid stylist with a clean tone, clear articulation, and a knack for melodicism. Toward the end of the &amp;#039;60s, Byrd became fascinated with Miles Davis&amp;#039; move into fusion, and started recording his own forays into the field. In the early &amp;#039;70s, with the help of brothers Larry and Fonce Mizell, Byrd perfected a bright, breezy, commercially potent take on fusion that was distinct from Davis, incorporating tighter arrangements and more of a smooth soul influence. Opinions on this phase of Byrd&amp;#039;s career diverge wildly -- jazz purists utterly despised it, branding Byrd a sellout and the records a betrayal of talent, but enraptured jazz-funk fans regard it as some of the most innovative, enduring work of its kind. In fact, proportionately speaking, Byrd is held in even higher esteem by that audience than by straight-ahead jazz fans who enjoy his hard bop output.Donaldson Toussaint L&amp;#039;Ouverture Byrd II was born in Detroit, MI, on December 9, 1932. His father, a Methodist minister, was an amateur musician, and Byrd was already an accomplished trumpeter by the time he finished high school, having performed with Lionel Hampton. Byrd served a stint in the Air Force, during which time he played in a military band, and subsequently completed his bachelor&amp;#039;s degree in music at Wayne State University in 1954. He moved to New York in 1955 to get his master&amp;#039;s at the Manhattan School of Music, and soon began performing with pianist George Wallington&amp;#039;s group. In December of that year, he was invited to join Art Blakey&amp;#039;s Jazz Messengers, filling a chair once held by his idol, Clifford Brown, and Kenny Dorham. Byrd also began his recording career during this period, leading several sessions (mostly for Savoy) and working often as a sideman, particularly at the Prestige label. He left the Jazz Messengers in 1956 and joined up with Max Roach; he went on to play with the likes of John Coltrane, Sonny Rollins, and Red Garland, and also co-founded the Jazz Lab Quintet with altoist Gigi Gryce in 1957.In 1958, Byrd signed an exclusive recording contract with Blue Note, and also formed a band with baritonist Pepper Adams, who would remain Byrd&amp;#039;s regular partner until 1961. Byrd&amp;#039;s Blue Note debut was 1958&amp;#039;s Off to the Races, and he and Adams collaborated on a series of excellent hard bop dates over the next three years, including Byrd in Hand (1959), At the Half Note Cafe, Vols. 1-2 (1960), The Cat Walk (1961), and Royal Flush (also 1961), among others. Another 1961 recording, Free Form, found Byrd giving a young Herbie Hancock some of his earliest exposure. Following this burst of activity, Byrd took a sabbatical to continue his studies in Europe, where he spent some time under the tutelage of the legendary French music educator Nadia Boulanger. He returned to the U.S. in 1963 and recorded A New Perspective, a now-classic set that broke new ground by incorporating gospel choirs into its arrangements; its signature piece, &quot;Cristo Redentor,&quot; became quite popular.In the mid-&amp;#039;60s, Byrd focused more of his energies on teaching, and worked diligently to make jazz and its history a legitimate part of the college curriculum. He taught at Rutgers, Hampton, New York University, and Howard in the late &amp;#039;60s, and the last one remained a steady association for much of the &amp;#039;70s. In the meantime, Byrd continued to record occasionally, cutting a final spate of hard bop albums over 1966-1967 that included Mustang! and Blackjack. Byrd also began to study African music, inspired partly by the emerging black-consciousness movement, and became interested in Miles Davis&amp;#039; efforts to woo a younger audience (including Byrd&amp;#039;s own students) by experimenting with electronics and funk rhythms. 1969&amp;#039;s Fancy Free found Byrd using electric piano for the first time, with a spacy sound that recalled Davis&amp;#039; In a Silent Way. 1970&amp;#039;s Electric Byrd had more of a Bitches Brew flavor, and the jams on 1971&amp;#039;s Ethiopian Knights were longer, funkier, and more aggressive. Byrd truly came into his own as a fusion artist when he hooked up with brothers Larry and Fonce Mizell, who began to handle production, writing, and some musical support duties. Their first collaboration was 1972&amp;#039;s Black Byrd, an upbeat, funky blend of jazz and R&amp;B. Jazz critics detested the album and called Byrd all sorts of names, but the record was a smash hit; it became the biggest seller in Blue Note history, and just missed hitting number one on the R&amp;B albums chart. In the wake of its success, Byrd formed a supporting group, the Blackbyrds, who were culled from the cream of his music students at Howard University and recorded through the rest of the &amp;#039;70s. Byrd went on to release a string of successful LPs in partnership with the Mizell Brothers, including the imaginary blaxploitation soundtrack Street Lady (1974), Stepping into Tomorrow (1975), the much-lauded Places and Spaces (1976), and Caricatures (1977). All made the Top Ten on the R&amp;B album charts, and the Places and Spaces single &quot;Change (Makes You Wanna Hustle)&quot; even got substantial play in discotheques. Jazz-funk fans revere this period in general, but usually reserve their highest praise for Street Lady and, especially, Places and Spaces. As a side note to his musical career, Byrd finished law school in 1976, and went on to teach at North Carolina Central University.Following Caricatures, Byrd parted ways with Blue Note and the Mizell Brothers and moved to Elektra. He recorded several albums over 1978-1983, but even the most commercially successful, 1978&amp;#039;s Thank You...for F.U.M.L. (Funking up My Life), didn&amp;#039;t match the infectiousness of his Blue Note jazz-funk outings. In 1982, Byrd received his Ph.D. from Columbia Teachers College. He spent a few years in the mid-&amp;#039;80s away from recording, due in part to ill health, but continued to teach, moving on to North Texas State and Delaware State. In the late &amp;#039;80s and early &amp;#039;90s, Byrd returned to the hard bop of his early days on several sessions for the Landmark label. He participated in rapper Guru&amp;#039;s Jazzmatazz project in 1993, and with the advent of the jazz-rap movement and England&amp;#039;s acid jazz revival, his &amp;#039;70s albums became hugely popular sources for samples. In the meantime, Byrd continued his activities as a jazz educator. \n\n\n\nReview\tby Scott Yanow\n\nThis unusual set (reissued on CD by Blue Note) was one of the most successful uses of a gospel choir in a jazz context. Trumpeter Donald Byrd and a septet that also includes tenor saxophonist Hank Mobley, guitarist Kenny Burrell, and pianist Herbie Hancock are joined by an eight-voice choir directed by Coleridge Perkinson. The arrangements by Duke Pearson are masterful and one song, &quot;Cristo Redentor,&quot; became a bit of a hit. This is a memorable effort that is innovative in its own way, a milestone in Donald Byrd&amp;#039;s career. ","torrent":{"xt":"urn:btih:f3fdb52949feb70a26b8ed5cfffbb3029cc546ff","amp;dn":"Donald+Byrd+%7E+A+New+Perspective","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f3fdb52949feb70a26b8ed5cfffbb3029cc546ff","infoHashBuffer":{"type":"Buffer","data":[243,253,181,41,73,254,183,10,38,184,237,92,255,251,179,2,156,197,70,255]},"announce":[],"urlList":[]}}