{"title":"The Chimes - The Chimes  - (1990)[EAC-MP3@320KBPS]","uid":4214440,"size":135125258,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f43ac9a628e4eb73082099b6cb1dc57dde9dc305&amp;dn=The+Chimes+-+The+Chimes++-+%281990%29%5BEAC-MP3%40320KBPS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"seanprince","files":22,"time":1212256451,"description":"The Chimes - The Chimes  - (1990)[EAC-MP3@320KBPS]\n\nTrack list.\n\nThe Chimes - The Chimes\n\n01.\tLove so tender\t\t\t\t\t\t03:01\n02.\tHeaven\t\t\t\t\t\t\t03:52\n03.\tTrue love\t\t\t\t\t\t03:49\n04.\t1-2-3\t\t\t\t\t\t\t03:24\n05.\tUnderestimate\t\t\t\t\t\t04:12\n06.\tLove comes to mind\t\t\t\t\t04:52\n07.\tDon&amp;#039;t make me wait\t\t\t\t\t04:02\n08.\tStronger together\t\t\t\t\t03:53\n09.\tI still haven&amp;#039;t found what i&amp;#039;m looking for\t\t05:33\n10.\tStay\t\t\t\t\t\t\t04:40\n11.\tI still haven&amp;#039;t found what i&amp;#039;m looking for (street mix)\t06:19\n12.\tHeaven (physical mix)\t\t\t\t\t08:27\n\nBiography\t\n\nScottish R&amp;B trio the Chimes formed in 1988 when multi-instrumentalists and producers Mike Peden and James Locke (formerly of the synth-poppers Fiction Factory) drafted singer Pauline Henry to sing on some dance-pop demos they had recorded. The resulting tracks got the trio signed to CBS Records, who released their first single, &quot;Love So Tender,&quot; in 1989. Though the single was a critical hit, thanks largely to Henry&amp;#039;s expressive but controlled voice, it was not a particularly strong-seller. The trio hooked up with Soul II Soul&amp;#039;s Jazzie B and Nellee Hooper, the club producers of the moment, to record the follow-up, &quot;1-2-3,&quot; which was a bigger hit, though a less-interesting song. Third time was the charm, however, as the trio&amp;#039;s next single, a canny acid house reworking of U2&amp;#039;s &quot;I Still Haven&amp;#039;t Found What I&amp;#039;m Looking For,&quot; reached the U.K. Top Ten.\nTheir debut album, 1990&amp;#039;s The Chimes, was a minor hit in the U.K. and a critical and college radio favorite in the U.S., but Henry left Locke and Peden later that year for a solo career. Her first solo album, 1994&amp;#039;s Pauline, scored a minor hit with another unexpected remake, a trip-hop version of Bad Company&amp;#039;s &quot;Feel Like Makin&amp;#039; Love.&quot; Locke became an indie producer, helming albums for acts like the Glasgow dream pop quartet the Bathers. Peden became a noted producer and remixer on the British underground dance scene of the &amp;#039;90s, with credits on a huge number of singles and albums.\nIn 2001, a collection of single sides, remixes, and album tracks, I Still Haven&amp;#039;t Found What I&amp;#039;m Looking For, was released.\n\nReview\t\n\nThe Chimes&amp;#039; sole album is proof that commercial dance pop can have artistic viability as well as chart potential. A mixture of hip influences (Soul II Soul&amp;#039;s Jazzie B and Nellee Hooper produced two tracks, including the meaty acid house single &quot;1-2-3&quot;) and the polish of soul and pop veterans (Pete Wingfield plays piano on most of the album, and other guests range from the Hooters&amp;#039; Eric Bazilian to &amp;#039;70s studio pro Ralph Schuckett), The Chimes is a completely solid and credible album with thankfully little of the overdone slickness and shrieking pseudo-soul of pretenders like Mariah Carey or Whitney Houston. (In fact, it&amp;#039;s possible that the low-key dignity of this album is why it wasn&amp;#039;t a bigger chart hit, though it received rave reviews both in the US and the trio&amp;#039;s native Great Britain.) Pauline Henry&amp;#039;s expressive but controlled voice is powerful without resorting to the tiresome trills and oversinging of so many of her R&amp;B contemporaries, and multi-instrumentalist producers James Locke and Michael Peden combine pop, dance and soul influences into a seamless, sleekly danceable blend. The album&amp;#039;s biggest hit, a gospel-tinged remake of U2&amp;#039;s &quot;I Still Haven&amp;#039;t Found What I&amp;#039;m Looking For,&quot; finds new levels of power in that over-played song, and its inclusion make perfect thematic and musical sense instead of being the desperate plea for chart attention it might have been in less capable hands.\n\nEnjoy.  ","torrent":{"xt":"urn:btih:f43ac9a628e4eb73082099b6cb1dc57dde9dc305","amp;dn":"The+Chimes+-+The+Chimes++-+%281990%29%5BEAC-MP3%40320KBPS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f43ac9a628e4eb73082099b6cb1dc57dde9dc305","infoHashBuffer":{"type":"Buffer","data":[244,58,201,166,40,228,235,115,8,32,153,182,203,29,197,125,222,157,195,5]},"announce":[],"urlList":[]}}