{"title":"Power Rangers Operation Overdrive - All (RESEED) TVCap Xvid avi","uid":4225137,"size":8047347180,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:f492878f10b18d968bed9873abb8109f4ba19170&amp;dn=Power+Rangers+Operation+Overdrive+-+All+%28RESEED%29+TVCap+Xvid+avi&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"WaveThemes","files":31,"time":1212784407,"description":"This is just a package of episodes already released as seperate torrents. The original release was in error by refering to the 2-parter &quot;Once a Ranger&quot; as only Episode 20. Because of this all episode numbers from that point on are wrong. The numbers have been corrected in this release. There has been NO audio/video changes at all.\n\n &lt;a href=&quot;\nhttp://www.operationoverdrive.net&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.operationoverdrive.net&lt;/a&gt;\n\n--------------------------------------------------------------------------------\n\nPower Rangers Operation Overdrive Behind the Scenes (we list as episode 00)\n\nUnrelated to Episode 15, this is truly a &quot;Behind the scenes&quot; look at how the show came together and how some of the props and special effects work.\n\n--------------------------------------------------------------------------------\n\nEpisode 01 &amp; 02 - Kick into Overdrive (Parts 1 and 2)(Airdate: 2/26/2007)\n\nPart 1:\nMack dreams of becoming an adventurer like his father, Andrew Hartford. During one of his adventures, Andrew finds the Corona Aurora and awakens two villains (Flurious and Moltor). A golden image appears before him and delivers a message to protect the crown.\n\nSix months later, Andrew recruits four teenagers with extraordinary talents. He informs them about the Corona Aurora and their mission to protect the Crown against Flurious and Moltor. Andrew chooses to be the Red Ranger, the leader of the Overdrive Rangers. During their first mission, Mack takes the morpher and joins the new rangers.\n\nPart 2:\nAndrew is captured and the rangers work together to save him. Will finds Andrew&amp;#039;s Overdrive Tracker in the safe and gives it to Mack. The five rangers save Andrew and use the DriveMax Megazord for the first time. Andrew decides that Mack is the right person as the Red Ranger. With the Crown in evil hands, the rangers&amp;#039; new mission is to find and protect the five stones.\n\n--------------------------------------------------------------------------------\n\nEpisode 03 - The Underwater World (Airdate: 3/5/2007)\n\nAndrew discovers the underwater world of Atlantis, a resting place of one of the jewels. Will&amp;#039;s solo career comes to a halt when he discovers the true meaning of being part of a team.\n\nIn Atlantis, the rangers uncover a cocoon. As they are about to head out, Flurious arrives to stop the rangers. When he fails, Flurious awakens the Ruins Monster to face the rangers. With the power of teamwork, the rangers stop the monster. Back at the base, Rose reveals the contents of the cocoon: An Ancient Scroll.\n\n--------------------------------------------------------------------------------\n\nEpisode 04 - Heart of Blue (Airdate: 3/12/2007)\n\n\nThe rangers discover the Atlantis Scroll is connected to the Sword of Neptune. Rose mentions that the Sword of Neptune is actually part of three scrolls. During his daily job hunting, Dax saves a suspicious beautiful girl named Mira. Two years ago, Lady Penelope, a famous thief, has stolen the other two scrolls. As the rangers head for the scrolls, Mira calls Dax to keep him away from the rangers. Will retrieves the scrolls from Penelope&amp;#039;s place. As the rangers are about to leave, the monster returns to face the rangers. Mira spoils the plan when she is captured by the monster. Dax brings Mira to the Hartford Mansion to talk to her.\n\nMira sees Dax place the scroll in Andrew&amp;#039;s office. As he is called to duty, she reaches for the scroll. Dax arrives to stop her and sees her true self: Miratrix. With the scroll, she hopes to give the monster ultimate power. She discovers that her scroll is fake. Spencer arrives with the real scroll to help the rangers defeat the monster. The rangers combine the scrolls for the Neptune Sword, which is missing the jewel. The sword points to the rangers next destination: St. Lucia in the Caribbeans.\n\n--------------------------------------------------------------------------------\n\nEpisode 05 - Weather Or Not (Airdate: 3/19/2007)\n\nAs the rangers prepare to head for their next mission, Moltor prepares a weather machine to do his bidding. Mack feels that he&amp;#039;s not Red Ranger material when he fails to protect a civilian driver.\n\nMack learns to be a true leader when his friends are trapped in the avalanche. Having full faith in Mack, the remaining rangers remain calm. Red Ranger arrives to the scene with the new Drill Driver.\n\nThe rangers use the Drill Driver to form a new Megazord.\n\n--------------------------------------------------------------------------------\n\nEpisode 06 - Pirate in Pink (Airdate: 3/26/2007)\n\nThe Rangers arrive on St. Lucia to seek the first jewel. Will finds a cannon labeled &quot;The Black Scabbard&quot;. Mack informs the Rangers that the cannon belonged to a jolly pirate, who spent his life searching for the Eye of the Sea. Miratrix is also on the island.\n\nAfter surviving a collapsing bridge, the Rangers run into Brownbeard&amp;#039;s spirit, who convinces the Rangers to work together with him to find the jewel. Rose decides to go on her own. Brownbeard follows her and decides to possess her body with his spirit.\n\nMiratrix arrives to steal the map from the Rangers, but her attempts are halted when Rosie the Bold makes her appearance. Rosie faces Miratrix and the monster to retrieve the map. With the map, Rosie and the Rangers find the Treasure Chest with the jewel. Brownbeard&amp;#039;s spirit leaves Rose&amp;#039;s body and makes an attempt to leave with the jewel. Miratrix returns to steal the jewel.\n\nPink Ranger uses her new Shovel Driver to form the new DriveMax combination.\n\nThe Rangers discover the Eye of the Sea is not the real Corona Aurora jewel. Rose gives the Eye back to Brownbeard, who in return gives the Rangers his lucky pearl. The Lucky Pearl has a Precious Level 100 and reveals to be the first jewel of the Corona Aurora.\n\n--------------------------------------------------------------------------------\n\nEpisode 07 - At All Cost (Airdate: 4/2/2007)\n\nWhile taking a break from the Jewel Quests, the Rangers continue their training with a nice jog. Ronny&amp;#039;s competitive spirit shines as she races against Mack. When the Rangers finally catch up with Ronny, she&amp;#039;s enjoying another race (in a video game). The Rangers start to feel discouraged when they learn that all Ronny cares about is winning. During their board game, Ronny wins and breaks Dax&amp;#039;s heart by taking his vehicle.\n\nAndrew presents the Rangers&amp;#039; newest arsenal: Drill Blaster. Mack and Ronny try to harness its powers, but fail. Andrew reveals that they need a more powerful energy source. Meanwhile, Moltor tests his Lava Lizards against each other. He rewards his Champion Lava Lizard with more power and armor. The Rangers fail to stop Moltor and Volcan.\n\nAndrew finds the required power source from Briarwood. The source is a Dragon Scale from the Fire Heart (Power Rangers Mystic Force). Moltor intercepts the shipping and uses the scale to his advantage. The Rangers morph into action and call their new vehicle: Cement. With the new vehicle, they form the DriveMax Megazord: Mixer Formation, which was what they needed to cool down the heat. The rangers defeat Volcon with the new Defender Vest and Drill Blaster.\n\nBack at home, Mack and Ronny enjoy a competitve game, in which neither has ever lost. The fellow Rangers arrive to watch as Mack wins. Ronny enjoys her first loss. Down in the base, Andrew discovers their next mission: The Legendary Hou-ou Bird.\n\n--------------------------------------------------------------------------------\n\nEpisode 08 - Both Sides Now (Airdate: 4/9/2007)\n\nThe Rangers arrive to Turkey to find the statue, only to find an empty safe. When they arrive at the Base, Will is sent to Andrew&amp;#039;s office. The Rangers ponder about the meeting. Andrew informs the Rangers that he fired Will because of his unstable behavior. He includes the best part: Will left with his Overdrive Tracker. Will finds Miratrix and recruits her. After a quick battle, she gives to use his ability to recover a Thermal device. After getting the well-protected device, Will hands it to Miratrix. The Rangers arrive and learn that Will has joined with Miratrix. As Will fights the Rangers, Miratrix uses the device to release Kamdor from the Crystal. Kamdor defeats the Rangers in their first encounter. The Rangers watch as Black Ranger walks away with Kamdor and Miratrix.\n\nWill continues to flirt and gain Miratrix&amp;#039;s trust, but Kamdor feels uneasy about Will&amp;#039;s loyalty. He tells Will to prove himself by destroying the Rangers. The Rangers pick up Will&amp;#039;s signal and enter his trap. Miratrix and Kamdor watch as the Black Ranger uses his Overdrive Tracker to destroy the Rangers. The confused Rangers arrive at the base. Andrew tells the Rangers that he had configured Will&amp;#039;s tracker to teleport the Rangers to the base and that Will is pretending to work with Miratrix.\n\nMiratrix releases the Hou-oh Bird at the appropriate location to transform the statue its true form. As Miratrix is about the follow the bird, the Rangers arrive to stop them. Will joins the side of his friends. The Rangers chase Miratrix while Will morphs into action to fight Kamdor. Miratrix summons a monster to distract the Rangers as she continues to follow the bird. Red Ranger uses the Defender Vest and Drill Blaster to finish off the monster. Kamdor makes the monster grow. Black Ranger calls his new Crane Driver and combines with the DriveMax to form the new DriveMax Megazord Drill and Crane Formation. The new combination destroys the monster.\n\nBack on the ground level, Miratrix tries to read the parchment that she got from the Hou-oh Bird. The parchment is written in an unknown language.\n\n--------------------------------------------------------------------------------\n\nEpisode 09 - Follow the Ranger (Airdate: 4/30/2007)\n\nMack overhears the conversation between Spencer and Andrew. His father still worries about Mack. Mack feels hurt that he still has proven himself. With the release of Kamdor, Flurious feels that Moltor should join him. Moltor doesn&amp;#039;t trust Flurious due to their past experiences with his red sled. The two villians join forces and draw the Rangers out.\n\nThe Rangers use their weapons and the Defender Vest against Moltor and Flurious. The villians unleash the dragon in its large form. The Rangers face the new dragon, but its too powerful. Even with the Drill and Cement Formation, the Dragon appears to be a powerful enemy. The DriveMax Megazord falls and the Rangers eject. Mack remains injured inside the Megazord cockpit.\n\nMoltor and Flurious bring Mack to an unknown island. Andrew is worried about Mack and wants to find him. The Rangers return back to the base. They assure Andrew that they will find Mack. Ronny leads the Rangers in the repair of the Vehicles. Back on the island, Mack learns Moltor and Flurious from Norg. Using the new information, he turns the villians against each other.\n\nMack returns to the Megazord. The Rangers arrive in the Auxilary Zords. The nine vehicles combine into the Super DriveMax Megazord. The new Megazord combination powers up and destroys the monster.\n\nFlurious and Moltor break their alliance and are enemies once again. Andrew tells he will always worry about Mack. Mack takes the opportunity to bash his father.\n\n--------------------------------------------------------------------------------\n\nEpisode 10 - Lights, Camera, DAX (Airdate: 5/7/2007)\n\nAndrew presents the latest weaponry to the Rangers. It is called the Transtek Armor, a weapon that all of the Rangers will get a chance to use. Dax reads about an upcoming audition that he&amp;#039;d be perfect for. Ronny and Andrew decline his request because they are on duty. Moltor summons the monster of the day to find Kamdor and Miratrix. Kamdor and Miratrix follow the parchment&amp;#039;s path until they are halted by the monster and the Lava Lizards.\n\nRose sees a glimpse of Dax&amp;#039;s acting and gives him advice. She convinces him to audition for the part. At the audition, Dax is immediately dismissed because he doesn&amp;#039;t look like a hero. Dax saves the director from an unsuspecting accident. The director gives Dax the part. \n\nThe Rangers are called to stop the battle between the monster and Kamdor. Rose covers for Dax by saying he is out for a walk. As his first scene is about the start, Dax is called into battle. The Rangers work together to slow down the attempts of the ongoing battle. The Rangers return to base as Dax returns to the Set. Andrew tells the Rangers that he owns the set that Dax auditioned for. Dax performs his scene perfectly until he remembers that he is a Ranger, not an actor. He leaves the set as Kamdor creates his monsters and foot soliders.\n\nDax returns to base and rejoins the Rangers. Back in the city, Moltor&amp;#039;s forces face against Kamdor and his new foot soliders. The Rangers enter the Battle Royale. Moltor and Kamdor send their foot soliders against the Rangers. Andrew sends the Transtek Armor. Blue Ranger is the first to test the new vehicle and the new Transtek Armor Formation. He uses the new Formation to save the Day. The Rangers now have possession of the Parchment. When the Rangers arrive back home, Dax and Rose have to clean all 27 bathrooms.\n\n--------------------------------------------------------------------------------\n\nEpisode 11 - Face to Face (Part 1) (Airdate: 5/14/2007)\n\nAndrew works hard on the new zord. Mack and Spencer tell Andrew to take a break, but Andrew feels the new vehicle will be a great asset. Andrew shows the new Sonic Streaker to Mack. Mack shows off the new Vehicle to the Rangers. Rose discovers the next clue from the Parchment. Mack and Dax join Rose in further research.\n\nIn London, the three Rangers are attacked by Moltor&amp;#039;s monster, who steals the Parchment. The Rangers morph into Action to fight both of Moltor&amp;#039;s monsters. During the battle against Red Ranger, the monster drops crystals on the ground. Red Ranger tries to regain the parchment, but the parchment is torn in half. Tyzonn and the Monster retreat. Blue Ranger finds a small Crystal. The Rangers return to the Base and learn more about the parchment. Andrew believes it could lead to the 2nd stone of the Corona Aurora.\n\nThe monster and Tyzonn call the Rangers into Battle. Yellow Ranger arrives in the Transtek Armor. Mack feels that there is something good about Tyzonn. He tries to stop Tyzonn from running away. He follows Tyzonn through the forest and to a pond. Mack watches as Tyzonn screams at his reflection in the water. Mack confronts him and overhears that Tyzonn must regain the parchment. The Rangers fight the Monster and Lava Lizards. Blue Ranger equips the Defender Vest and assists the Rangers.\n\nMack and Tyzonn continue to talk about the Corona Aurora. Tyzonn arrives back to face the monster. Moltor arrives to face the new traitor. Tyzonn stands upto Moltor to protect the Corona. Mack arrives to protect Tyzonn. Mack morphs into action by sliding the tracker on Moltor&amp;#039;s staff. The monster sends another blast to Tyzonn. Red Ranger dives to take the hit.\n\nMack and Tyzonn retreat and join forces. They combine the parchment back into its whole entity. The Rangers look for Mack and Tyzonn, who are ambushed by Lava Lizards.\n\n--------------------------------------------------------------------------------\n\nEpisode 12 - Face to Face (Part 2) (Airdate: 5/21/2007)\n\nMack and Tyzonn work together to face the Lava Lizards. Tyzonn has the ability to transform into a liquid mercury form. After the battle, Tyzonn tells the story about his past to Mack. Tyzonn was once a Mercurian warrior. Moltor had recruited Tyzonn to do his bidding, but Tyzonn declined. Moltor smashes Tyzonn&amp;#039;s crystals into pieces and transforms Tyzonn into a reptile-alien form. Mack offers to help Tyzonn.\n\nMack and Tyzonn return to the base. Mack tells the others that Tyzonn is a friend. They gave Andrew the Parchment. With the help of Spencer&amp;#039;s lemonade, Tyzonn uses the citrus acid to decipher the Parchment to reveal coordinates. The rangers and Tyzonn follow the coordinates to find the location of the Touru Diamond. Moltor and his monster stop the Rangers from advancing. The Rangers and Tyzonn fight together. Red Ranger and Tyzonn board the new Sonic Streaker to give chase towards the Diamond. Black Ranger equips the Defender Vest and destroys the monster. The four Rangers now face the grown monster in the Super DriveMax Megazord while Red Ranger and Tyzonn arrive inside the volcano. Tyzonn&amp;#039;s scaly body allows him to decend the volcano and grab the diamond.\n\nRed Ranger joins his friends and combines the Sonic Streaker with the DriveMax to form a new combination: DriveMax Ultrazord. The new combination takes flight and destroys the monster.\n\nThe Rangers return to base with the second jewel of the Corona Aurora. Sentinel Knight makes an appearance to congratulate the Rangers on their achievement. Rose discovers that they can use the jewels to break Tyzonn&amp;#039;s spell. Tyzonn returns to his normal human self. Andrew recruits Tyzonn to join the team, but Tyzonn has his own mission to complete. Mack returns Tyzonn&amp;#039;s crystal.\n\n--------------------------------------------------------------------------------\n\nEpisode 13 - Man of Mercury (Part 1) (Airdate: 6/4/2007)\n\nIn Brazil, an archeologist finds a rare statue. The Rangers arrive to Portugal to follow a lead on a jewel, but they are too late. The archeologist returns to camp to show off his new discovery. Two new villians, the Fearcats, arrive in search of a jewel. Before leaving the camp, the Fearcats cause serious damage to the camp. The Fearcats need the jewel to release their army from the mirror. Miratrix, with her new hairstyle, arrives with Kamdor to greet the Fearcats. After a brief battle, Kamdor and Miratrix retreat.\n\nThe Rangers arrive to the Camp to see the damage caused by the Fearcats. Ronny stays behind to help the archeologists as the other four Rangers fight the Fearcats. Using only their abilities, the four Rangers find the Fearcats to be formidable opponents. Tyzonn arrives in the nick of time to assist the Rangers. The Rangers morph into action and work together with Tyzonn to fight the Fearcats, who retreat after one of their attacks is reflected by Tyzonn.\n\nFlurious monitors the battle between the Fearcats and Team Kamdor. He prepares two gyros for the upcoming battle. Tyzonn and the Rangers return to Camp. Tyzonn has a brief flashback and begins to leave camp. Ronny tells Tyzonn and they should work together. He tells that he must work alone against the Fearcats while they look for the jewel. The Rangers separate and search for the missing jewel. The Fearcats find and capture Ronny. They use her Tracker to open the portal within the mirror. Tyzonn and the four Rangers arrive to save Ronny. The mirror releases the third Fearcat. Tyzonn throws Ronny&amp;#039;s Tracker to her. She morphs and helps Tyzonn to destroy the Mirror. The Rangers use the DriveMax Ultrazord to defeat one of the Fearcats. The remaning Fearcats defeat Tyzonn into a puddle of mercury.\n\n--------------------------------------------------------------------------------\n\nEpisode 14 - Man of Mercury (Part 2) (Airdate: 6/4/2007)\n\nThe Rangers regroup and head back to Base to find a cure for Tyzonn. Flurious uses his two Gyros on the Chillers, but they are overwhelmed by the power. He sends Norg to find two warriors that can withstand the power of the gyros. Back at the Base, Andrew and Ronny work on stabilizing Tyzonn&amp;#039;s form. He is brought back to his human form. As the Rangers face the Fearcats, Andrew makes an another attempt to recruit Tyzonn. This time, he presents his Morpher. Tyzonn declines the Morpher and heads to the Battle. He helps the Rangers defeat the Fearcats, who grow into their large form. The DriveMax Ultrazord&amp;#039;s finishing attack destroys the Fearcats.\n\nNorg brings the bodies of the Fearcats to Flurious. With the Gyros, Flurious revives the Fearcats and orders them to destroy the Power Rangers. The Rangers celebrate their victory as Tyzonn prepares to leave. He feels that his mission is complete. Tyzonn wants to join the team, but he can&amp;#039;t. Many years ago, he was part of an intergalactic emergency rescue team. During a mission, he sent his team inside the cave to rescue more civilians. Thinking that the Fearcats were trapped inside, Tyzonn blames himself for sending the team to their deaths. Ronny tries to convince Tyzonn to stay.\n\nThe Fearcats return to face the Rangers. With the new Gyros, the Fearcats are now equiped with new black armors and more power. Tyzonn shows up in his new Operation Overdrive uniform. He morphs into the Mercury Ranger using the morphing call &quot;Overdrive Accelerate&quot;. Mercury Ranger fights the Fearcats in the first of many battles. He uses his weapon, the Drive Detector, to defeat them. \n\n--------------------------------------------------------------------------------\n\nEpisode 15 - Behind the Scenes (Airdate: 6/11/2007)\n\nFlurious discovers the location of the Cannon of Ki Amuk. Kamdor offers an alliance with Flurious by helping him to defeat the Mercury Ranger. Flurious considers the alliance, but ponders why Kamdor&amp;#039;s true intentions.\n\nAndrew prepares Tyzonn&amp;#039;s zord for the upcoming battle. Curious Tyzonn wants to know what his zords are, but Andrew maintains the secret. Spencer accidently mentions that he will be piloting multiple zords. The meeting is interrupted when Andrew&amp;#039;s old college friend, Jessica Jeffries, arrives for a visit. Jessica works as a reporter at &amp;#039;Good Morning San Angeles&amp;#039;. She invites the Rangers to do an interview for the show.\n\nThe Rangers are excited to do the interview, especially Dax. Jessica introduces the team: Mack, Rose, Will, and Ronny. She asks Dax to introduce himself, but he is too nervous to respond. Tyzonn introduces Dax and himself. During a commercial break, the Mayor&amp;#039;s assistant arrives to deliver medals for the Rangers. Jessica accepts and hands them to the Rangers. The Mayor&amp;#039;s Assistant is really Miratrix in disguise. After the show ends, Jessica thanks the Rangers for being on the show. As they head out, Tyzonn begins to feel weak and dizzy. Kamdor made the medals to react with the Mercury Ranger&amp;#039;s physiology.\n\nFlurious has prepared his robot with the coordinates of the Cannon. The Fearcats hijack the robot and use it to steal the Cannon for themselves. Andrew discovers that the Yanomami Statue matches the same jewel signature to a signal emitting from Indonesia. All of the Rangers except Tyzonn morph. The medal on his uniform is taking a strong effect. The Rangers head to the mountainside of Indonesia and join the battle for the Cannon. Using Flurious&amp;#039; Robot, the Fearcats gain control of the Cannon and cause damage to the DriveMax Megazord.\n\nJessica arrives to the city and reports the attack. She leaves the scene to investigate more about the situation. At the Hartford Mansion, Jessive arrives and pulls the pin off Tyzonn. She mentioned that the mayor didn&amp;#039;t send anyone to hand those medals. Tyzonn returns to his normal form. The Rangers make another attempt to face the monster. They use the Auxilary Zords, but are rapidly defeated. Mercury Ranger arrives in his three new zords: Fire Rescue and Rescue Runners 1 and 2. The three zords combine into the FlashPoint Megazord. The new Megazord defeats the Robot. Mercury Ranger returns the Cannon to the Rangers.\n\nThe Mayor personally awards the Medals to the Rangers, who celebrate with their latest victory of obtaining the Cannon. They watch Jessica&amp;#039;s announcement of being a field reporter.\n\n--------------------------------------------------------------------------------\n\nEpisode 16 - Just Like Me (Airdate: 6/18/2007)\n\nFlurious insults Norg (as always) and Norg decides to leave. Will shows his smooth style to Tyzonn. Tyzonn tries to copy, but doesn&amp;#039;t work out. Tyzonn doesn&amp;#039;t want to be himself, he would rather be like Will. The Rangers arrive to the Rainforest to fight Moltor and the Lava Lizards. Moltor powers up and defeats the Rangers. He leaves them and heads back home, where he runs into Norg. Norg awards Moltor with Chiller Stones, which allows him to summon his own army of Chillers.\n\nRose discovers that Moltor is looking for Thor&amp;#039;s Hammer. Will is annoyed by Tyzonn being his copycat. Tyzonn arrives to the Base with his new hairstyle. The Rangers follow a signal to find Moltor. The Rangers morph into action to face Moltor&amp;#039;s new Chillers. Mercury Ranger struts his new fighting style against the Chillers. Black Ranger tells Mercury Ranger to stop copying him. Red Ranger orders that Black and Mercury Rangers work together to find Moltor. Norg daydreams that Flurious misses him.\n\nWill and Tyzonn find Moltor and the Chillers. Black Ranger wants to call his friends, but Tyzonn rushes into battle. They are overwhelmed by the Chillers as Moltor leaves the scene. Mercury Ranger abandons Black Ranger to follow Moltor. Black Ranger continues to struggle against the Chillers. Mercury Ranger finds the Hammer. Moltor takes the Hammer and attacks Mercury Ranger. Black Ranger fires a flare gun to inform his friends of his location. He uses the Hovertek Cycles to save Mercury Ranger, but is badly injured following the attack. Tyzonn uses his Mercurian powers to help Will.\n\nThe six Rangers arrive to the Scene and use their weapons to defeat the Chillers and Lizards. Moltor uses the Hammer to power up his Lizards. The Rangers form the DriveMax Ultrazord. Mercury Ranger steals the Hammer and joins his friends in the FlashPoint Megazord. Tyzonn gives the Hammer to Will and they work things out.\n\nTyzonn struts his new style and manages to get a phone number from a cute girl. Moltor returns to his home and kicks Norg out. He returns back to Flurious&amp;#039;s place.\n\n--------------------------------------------------------------------------------\n\nEpisode 17 - It&amp;#039;s Hammer Time (Airdate: 7/2/2007)\n\nRose finds the location of the next jewel: Mexico. As the Rangers head towards the next location, they are attacked by Kamdor and Miratrix and their Magician Monster. The Rangers call the DriveMax and FlashPoint Megazords. Ronny and Dax place the two relics in their vehicles. Mercury Ranger forms the FlashPoint Megazord: Drill and Shovel Mode to defeat the monster. As the Rangers continue their mission, they are attacked by Chillers. The five Rangers fight the Chillers as Ronny protects the two relics. She is visited by a visitor, who compliments the Hammer. The warrior is Thor and he is interested in the hammer and then in Ronny. He calls Ronny by the name of Freya. Ronny gives the Hammer to Thor, who uses it to defeat the villians.\n\nThe Fearcats prepare their secret weapon. Thor doesn&amp;#039;t want to give up the Hammer. Thor proposes to Ronny with a huge diamond. The Rangers find the mark and use the Cannon on it. The cannon fails. Andrew convinces Thor to use the Hammer on the mark to find the jewels of the Corona Aurora. Thor makes several attempts to break down the mark, but fails. The Rangers wonder why the great god of Thor is acting strangely. Moltor and the Lava Lizards arrive to stop the Rangers. The six Rangers morph into Action and use their weapons to fight Moltor and the Lizards. The real Thor arrives. The Rangers demorph and meet the two Thors. The fake Thor is Loki, the God of Mischief. Loki escapes with the Hammer.\n\nRonny goes in disguise to trick Loki, who tells her that she must stick to her word. Ronny gets the Hammer and removed her mask...it&amp;#039;s Spencer! Flurious arrives and the Rangers once again morph into Action. Thor and Mercury Ranger face the Chillers as the other Rangers call the zords to face the Fearcats. Mercury Ranger and Thor defeat Flurious. Mercury Ranger joins the Rangers against the Fearcats. Thor monitors the fight from a distance. He uses his Hammer to weaken the monster as the Rangers call forth the DriveMax Ultrazord. The combination defeats the monster.\n\nThe Rangers use both the Hammer and Cannon to destroy the mark. They find another relic with a rating of 88. Thor says his goodbyes. Moltor arrives and steals the Relic.\n\n--------------------------------------------------------------------------------\n\nEpisode 18 - Out of Luck (Airdate: 7/9/2007)\n\nAndrew mentions that the compass has great power and is unstable. Moltor presents the new relic to his monster. The Rangers follow the signal to find the monster with the compass. They morph into action and fight the monster. The monster activates the power of the compass to control chi energy. He then uses the compass to cast a bad luck spell on the Red Ranger. Mack starts experiencing a series of bad luck. Dax shows Ronny his lucky t-shirt that he plans to give to Mack. Ronny shows her Dax her lucky socks.\n\nMack continues to have bad luck. The monster opens the compass and opens a hole in the ground. Will presents his lucky scarf. Rose shows her dad&amp;#039;s lucky sombrero. Tyzonn has a potted plant. The rangers give Mack all of their good luck charms, giving him a brand new luck. Red Ranger faces the monster with his new lucky uniform. The bad luck spell is too strong for his good luck charms. The other Rangers fight off the group of Lava Lizards. Red Ranger uses the remaining charms to fight the monster. He kicks the compass away from the monster and destroys the monster.\n\nPink Ranger activates the compass and restores the good luck in Mack. Moltor sends a group of Lava Lizards against the Rangers. Mercury Ranger equips the Transtek Armor to fend off the Lizards. Moltor makes the monster grow. The Rangers call the DriveMax and FlashPoint Megazords. The Auxillary Zords surround the monster as the DriveMax Megazord uses the compass to destroy the monster. Andrew tries to learn how Mack could be affected by luck. The rangers celebrate in the rec room as Mack believes his bad luck is over...or is it?\n\n--------------------------------------------------------------------------------\n\nEpisode 19 - One Gets Away (Airdate: 7/16/2007)\n\nThe Rangers follow Rose as she uses the Aztec Stone. The stone continues to lead them deeper into the ocean until they can&amp;#039;t walk anymore. Moltor decides to team up with the Fearcats by giving them an invincible armor. He hands a map to them that identifies the location of the armor. Three of the Rangers dive underwater to find the Sapphire, the third jewel of the Corona Aurora. Miratrix sees the discovery. Meanwhile, the Fearcats prepare for latest robot. Andrew calls the Rangers to abort the mission to face the Fearcats. Mack reports that they found the jewel.\n\nThe Rangers head to battle as Will prepares to take the jewel back to the Base. He is stopped by Kamdor and Miratrix. Will morphs and calls the Hovertek Cycle to take on Team Kamdor. He ejects from the cycle and fights Team Kamdor on foot. Miratrix fires a powerful blast. Black Ranger equips the Defender Vest for additional protection. Kamdor steals the jewel from Black Ranger.\n\nDriveMax Ultrazord fights the Fearcats&amp;#039; Robot. Will reports back to Andrew and hands in his resignation due to his failure. Andrew is disappointed and Spencer tries to convince Will to take back the Tracker. Mercury Ranger arrives to help the Rangers in battle. Will morphs and follows the Fearcats as they retreat. Will overfears them talking about a super armor. He steals the map from them and escapes.\n\nSpencer reminds Andrew that everyone makes mistakes, especially since Andrew lost the Crown. Black Ranger follows the map towards the armor. He is followed and defeated by a Fearcat. His friends arrive in the nick of time to protect the armor. The Fearcats regroup and equip the armor onto the robot. The Rangers form the Super DriveMax Megazord and FlashPoint Megazord to take on the powered up Robot. The Armor gives the Robot a powerful attack that greatly damages the Megazords. Black Ranger tells the Rangers that he lost the jewel. The Rangers attack the Robot with the Auxilary Zords. Using a variety of attacks and formations, the Rangers give the Robot a fierce battle. The Megazords strip the Super Armor from the Robot. The DriveMax and FlashPoint Megazord exchange zords to form two new combinations. The new combinations defeat the Robot.\n\nMiratrix and Kamdor enjoy their jewel. Flurious is angry because he is nothing, while the Rangers and the other villians have the Crown and the three jewels. Andrew apologizes to Will and Spencer. As the Rangers head out, Spencer thanks Andrew for sharing his biggest secret with him.\n\n--------------------------------------------------------------------------------\n\nEpisode 20 &amp; 21 - Once a Ranger (Parts 1 and 2) (Airdate: 7/23/2007)\n\nPart 1:\nA monster gives the most priceless ruby from the museum to Kamdor and Miratrix. Kamdor believes the ruby isn&amp;#039;t one of the Corona Aurora jewels. Miratrix takes the ruby for her own collection. The Rangers arrive to stop Team Kamdor. Using teamwork and Mercury Ranger&amp;#039;s Drive Detector, the Rangers defeat the monster and recover the ruby. Kamdor and Miratrix reteat.\n\nNorg delivers a message box from an unknown villian that offers an alliance. The Rangers return the ruby back to the museum. Team Kamdor gets a similar message from the unknown villian. They arrive to the villian&amp;#039;s lair and run into the fellow villians (Flurious, Moltor, and the Fearcats). The new villian is Thrax, a villian that was imprisoned by the Sentinel Knight. As the Sentinel Knight grew weaker, Thrax grew stronger. He offers to help the other villians to defeat the Power Rangers.\n\nThe Rangers celebrate their victory at home. Thrax, the son of Lord Zedd and Rita Repulsa, sends a message to the Rangers. The Rangers morph into Action and meet Thrax face to face. The Battle between the Rangers and the Villians begin. The Rangers use their weapons, the Transtek Armor, and the Hovertek Cycle, but all attempts fail with the overwhelmed forces of the Lava Lizards, Chillers, and the powerful villians. The Rangers combine their evil energies to send a mighty blow that damages the universal Morphing Grid, causing the Rangers lose their powers.\n\nThe Sentinel Knight arrives and escapes with the Rangers. The Knight teleports the Rangers to a safe area and tells them that he must do something. The Rangers return to the Base to learn that they are no longer Power Rangers. Andrew tells the Rangers that they still have their skills to fight. The Rangers arrive in the vehicles to face the Fearcat and Kamdor. The Rangers struggle against the two villians, but are unable to stop them. As the villians are about to defeat the Rangers, they are attacked by plants. The first Retro Ranger, Green Mystic Force Ranger, makes his appearance. He is joined by Red S.P.D. Ranger, Yellow Dino Ranger, Blue Wind Ranger, and of course...the original Mighty Morphin Black Ranger.\n\nThe two villians retreat as the Retro Rangers power down to show their real forms. The Rangers return to the Operation Overdrive Rangers to regroup. Bridge explains that he is the only that currently isn&amp;#039;t a Ranger. He&amp;#039;s the Red Ranger but in the future, he&amp;#039;ll be the Green and then the Blue Rangers. Bridge tries to explain his color of Red due to the promotion of Doggie Cruger (&quot;who&amp;#039;s a dog&quot;). Only Dax understands the story. Sentinel Knight tells how he is channeled some of his powers to revive some of the Rangers&amp;#039; powers. They all chant &quot;Once a Ranger, Always a Ranger&quot;. he is chosen the Retro Rangers to replace the Operation Overdrive team. The Operation Overdrive team relax at home as the Retro Rangers enjoy the lives of being Rangers. The Retro Rangers try to cheer up the Operation Overdrive team, but no luck.\n\nThe (Retro) Power Rangers are called into action to fight Flurious and the Chillers. The Rangers easily defeat them. They return back to the Base. Adam tells Andrew that he&amp;#039;s happy to help. Andrew mentions that he doesn&amp;#039;t have the technology to restore the Morphing Grid. Adam tells Andrew that he knows someone that can help. The villians regroup with their complaints about the Retro Rangers. Thrax sends his new monster to defeat the Rangers as he prepares to take on the Sentinel Knight. The Overdrive team retire their roles from Operation Overdrive. They would like to return back to their normal lives.\n\nPart 2:\nThe Villians begin to lose confidence in Thrax. Flurious&amp;#039;s troops are keeping on eye on the new Rangers, but they feel they should be keeping an eye on Thrax. Adam leads the Retro Teens to a warehouse in Angel Grove. Bridge uses his powers to discover the Chillers ambush. Xander tries to use Plan Xander to reason with the Chillers, but as always the plan fails. The teens work together to fight the Chillers. Kira uses her Ptera Scream, Xander uses his Magical Powers, Tori uses her Water Ninja Powers, and Adam uses some old school fighting skill. Adam finds the crate with a lightning symbol and mentions that it has never let him down before.\n\nBack at the Base, Sentinel Knight appears before Mack, who is sweeping the floor. The Knight cheers up Mack by reminding him that &quot;Once a Ranger, Always a Ranger&quot;. Mack asks about the weapon that Thrax mentioned. Sentinel Knight tells Mack about the Sword of Excelsior. Mack wants to help get the sword, but Sentinel Knight stops him. His friends continue their normal lives. Ronny wins another race in Monaco and hopes to see the message box in her trophy, but no luck. Dax heads to Auckland, New Zealand where he persues an acting career in front of a green screen. As always, he still doesn&amp;#039;t have respect from others. Will returns to his job of recovering priceless artifacts, but is still unhappy. Tyzonn travels the Earth since he has nothing to go back to. Rose becomes a professor. Mack visits Rose and asks about the Sword of Excelsior. He leaves in a hurry, leaving Rose with great curiousity.\n\nMack follows the book deep into a forest where he finds the Excelsior. Thrax appears and thanks Mack for leading him to the weapon. Dax and the remaining Overdrive Team arrive to stand by Mack. Back at the Base, Andrew and Adam reactivate Alpha and debrief him in the Morphing Grid mission. Thrax makes an attempt to grab the Sword, but the Warrior Goddess protects it. Alpha enters the Morphing Grid and the Retro Rangers are called into action. Adam pilots the FlashPoint and the remaining Rangers pilot the DriveMax Ultrazord. The Overdrive Team try to get the Sword, but give up. Mack remembers the words of the Sentinel Knight. They make one final attempt together. The Warrior Goddess awakens and gives the Excelsior to Mack. Alpha begins to make the repairs to the Morphing Grid. The FlashPoint and DriveMax Ultrazord struggle against the monster. Mack saves the Day by using the Sword of Excelsior on the monster.\n\nMack gives the Sword of Excelsior to the Sentinel Knight. The sword restores the Knight to his true form. The Overdrive Team tell Andrew that they want to return. Alpha and the Retro Rangers arrive to the Base. Alpha has repaired the Morphing Grid and restored the Rangers&amp;#039; connection to the Morphing Grid. Flurious uses a Gyro on Thrax&amp;#039;s monster to revive him. The 11 Rangers enter the battle field and morph into action. Adam begins the Morph with the classic &quot;It&amp;#039;s Morphing Time&quot;. He is followed by the remaining Retro Rangers and concluded with the Overdrive morphs. Mighty Morphin Black Ranger takes on Thrax with the Defender Vest and the Power Axe. Red Rangers use their weapons on Flurious. Green Mystic Ranger uses his Mystic Fighter to fight alongside with Black and Blue Rangers against the Fearcats. The Yellow Rangers face Team Kamdor with their weapons and great agility. Blue Wind Ranger and Pink Ranger work together against Moltor. Mercury Ranger fights solo against the monster. Sentinel Knight transforms from sword to warrior mode to protect Black Ranger from Thrax. Using the power of Excelsior, he defeats Thrax. The Villians and Rangers regroup to their sides to prepare for the final move. The Retro and Overdrive Rangers work together to defeat the Villians, who return to their normal lives of seeking the remaining jewels.\n\nThe Rangers head back to the Hartford Mansion. Bridge enjoys the Buttery Toasts from Spencer. Tori gives her number from Custom Surfboards. Xander invites his new friends to check out the Rockporium for a 10% discount. Kira promises to bring her music CD next time. Adam recruits Alpha to help him at his dojo in Angel Grove. The episode ends with the classic &quot;Go Go Power Rangers!&quot;\n\n--------------------------------------------------------------------------------\n\nEpisode 22 - One Fine Day (Airdate: 8/6/2007)\n\nTyzonn has nothing better to do so he spends time with Rose. Tyzonn wants to know more about Rose. He asks her a series of interesting questions. Rose wishes she went to the picnic with the others. The other Rangers enjoy their day off. Mack mentions about his old camping trips with Andrew. Rose catches up with her friends. She wanted to get some space away from Tyzonn, but he ends up following them.\n\nThe Fearcats begin their next plan. Andrew prepares to call the Rangers, but Spencer tells them that it is their day off. Andrew mentions that it was 2 years ago when Mack arrived. The Rangers follow the strange footsteps. They run into an invisible forcefield. Only Tyzonn can enter the forcefield with his Mercurian powers. He tells the other Rangers to hold each others&amp;#039; hands to enter the forcefield. Only Rose and Tyzonn are able to enter the forcefield.\n\nThe Fearcats feel the presence of the intruders. Tyzonn mentions that the forcefield is used by the Fearcats. The other Rangers ponder how to enter the forcefield. Mack tries to use the Sentinel Sword on the forcefield. The sword transforms into the Sentinel Knight. The Knight tries to break the field, but all attempts fail. Tyzonn and Rose help Norg by removing a large object from his foot. The Fearcats arrive to the scene. Tyzonn and Rose morph into action and fight the Fearcats.\n\nTyzonn begins to grow weaker. Rose asks Tyzonn why he is asking a lot of questions. Tyzonn tells her that he just wants to get to know her more. Rose doesn&amp;#039;t like to talk about herself. No one in her past ever told Rose that she is special. Tyzonn and Rose find the Seal. Mig arrives to stop them. Rose tries to stop the Rose, but she is blasted hard. She destroys the Seal with the Double-O Zip Shooter. Tyzonn is injured badly.\n\nRose is angry and morphs into action. She fights Mig with all of her strength. Pink Ranger defeats Mig. Benglo finds the torch and joins the fight in robot. The Rangers arrive to save her. Sentinel Knight is summoned to watch over Tyzonn as the Rangers call their zords. DriveMax Ultrazord faces the Fearcats&amp;#039; Robot and the Torch. The Rangers defeat the Fearcats and gain the Torch. Norg chants a dance to help Tyzonn. Norg remembers that Mack is a Power Ranger. He runs for his life. Rose tells Tyzonn about her breakfast since college. Norg tells Tyzonn that he ran into the Power Rangers. The Rangers return home with a new gift for Andrew.\n\n--------------------------------------------------------------------------------\n\nEpisode 23 - Ronny on Empty (Part 1) (Airdate: 8/20/2007)\n\nDax and Will enjoy a nice game of billiards. During their game, a monster appears before them. The monster is really Ronny in disguise. She wishes her friends a Happy Halloween. Andrew calls the Rangers to the Base. He discovers the next clue inside the torch: a golden scabbard beetle. Andrew mentions that he is currently working on a new fleet of zords to help them in their future missions.\n\nMoltor uses the Gyro Generator to power up his robot. The Generator is a gift from the Fearcats and originally from Flurious. After the Generator fails, the Fearcats mention there may be another way to power up the robot. Norg gets ready for the Trick or Treaters, who are usually dressed like penguins. Flurious discovers that someone is using his generator. The Fearcats attack the city to draw out the Rangers.\n\nSpencer and the Rangers prepare for the Halloween for Party. Will is the only Ranger that is not interested in Halloween. Ronny tries to bring the kid out of Will. Andrew calls the Rangers for action. Mercury and the fellow Rangers face the Fearcats. Sentinel Knight and Moltor join the fight. The Fearcats capture Yellow Ranger while Moltor keeps the rest of the Rangers busy. Black Ranger tries to use the Sentinel Sword, but he is also captured by Moltor.\n\nWill and Ronny are tied to a tree. Moltor places a container spell around the Sentinel Sword. The Fearcats ask why the Black Ranger is captured. Will overhears that Moltor will destroy Will on his own. Andrew sends the Rangers to Egypt to recover the jewel. The Rangers are concerned about their captured friends. Will and Ronny get free and run for their lives. Ronny asks what they wanted. Will replies that they wanted Ronny and wanted to destroy Will. The Fearcats recapture Ronny. Will reports back to Andrew and tells him that he will rescue her.\n\nMoltor and the Fearcats prepare to use the Sentinel Sword for the energy drain. Will is ambushed by Flurious and the Chillers. Will morphs into action and uses the Hovertek Cycle to fight the Chillers. Flurious tells Norg to track down the Fearcats hideout. Flurious retreats. Moltor begins the energy drain as Ronny is forced to touch the device. Will continues to look for Ronny and runs into Norg. Will captures Norg and tries to get information from him, but founds out that he is useless.\n\nThe remaining Rangers find their way in Egypt to a marketplace. The appraiser admires the beetle. Moltor completes the energy draining and powers up the robot. The Sentinel Sword breaks free and transforms into Sentinel Knight. He struggles against the Fearcats but is turned to evil. Moltor awakens his robot and begins the attack. The Egyptian Appraisal give the Rangers more information about the beetle. Miratrix overhears the conversation. The Rangers morph into Action and call the zords to take on Moltor&amp;#039;s Robot. The robot fires out a huge fleet of LavaDactyls. Sentinel Knight joins the fight to fight off the FlashPoint Megazord. The DriveMax Ultrazord fires its final attack, but it is deflected back. The robot destroys the DriveMax Ultrazord.\n\nAndrew sends the Battlefleet. The Rangers enter the floating fortress and use its artillery to take on the Dactyls. Moltor retreats after his robot needs to recharge. Andrew orders the Rangers to return back to the Base. The Battlefleet isn&amp;#039;t fully operational. Ronny continues to hold on for her life.\n\n--------------------------------------------------------------------------------\n\nEpisode 24 - Ronny on Empty (Part 2) (Airdate: 8/27/2007)\n\nThe Rangers search the plains of Egypt for the jewel signature. Will continues to search for Ronny. Norg follows Will and tells him that he was ordered to find the Norg&amp;#039;s Secret Hideout. Norg happens to be a clever tracker and assists Will in heading towards the right direction. Ronny&amp;#039;s energy is almost fully drained. Moltor sends the Lizards to slow down Will. The remaining Rangers struggle in the desert as the jewel signature grows stronger. Dax sees a mirage and performs a cannonball into it. The Rangers follow him into an underground location. Norg and Will arrive at the end of the tracks, where the Lava Lizards greet them. Will morphs into action as Norg retreats. Black Ranger defeats the Lava Lizards and enters the secret hideout.\n\nThe rangers follow Dax in the underground hallway. Rose accidently trips a trap, which releases a swarm towards them. The Rangers escape into a large room, where they run into Miratrix and Kamdor. The villians retreat with an artifact in their hands. Will makes his way through the secret hideout. The Rangers follow Team Kamdor back into the desert. They morph into Action and battle for the tablet. Mercury Ranger grabs the tablet and the Rangers fight to protect it from Team Kamdor. After the brief battle, Team Kamdor retreats. Will tries to call for backup, but Moltor stops him.\n\nBack at the base, Andrew and Spencer retrieve the Tablet and Will&amp;#039;s coordinates. Will morphs again and takes on Moltor. Black Ranger and Moltor engage in a sword battle. The Fearcats spot the remaining rangers. Ronny&amp;#039;s grows weaker as the Evil Sentinel Knight stares at her. Moltor powers up his Drive Slammer and defeats Moltor. Black Ranger enters the final room where he runs towards Ronny and tries to pull her free. Will pulls apart the control panel and disables the machine by cutting the black wire. Will and Ronny escape the hideout.\n\nThe remaining Rangers morph into Action to take on the Fearcats. Andrew contacts the Rangers and tells them that the Battlefleet Zords are operational. The Rangers call the new zords. The battle between the Rangers and the Fearcats continue. Moltor powers up his Robot and returns back into battle. Will and Ronny join the fight. They morph into action and stand by their friends. Sentinel Knight returns to the side of good and helps Mercury Ranger fight the Fearcats.\n\nThe Rangers combine the Battlefleet Zords into the Battlefleet Megazord. The Megazord takes on Moltor&amp;#039;s Robot. BattleFleet Megazord powers up its final attack and defeats Moltor&amp;#039;s Robot. Norg reports back to Flurious and reports his progress. Flurious is unhappy as always. The Rangers enjoy their Halloween Party. Even Will enjoys the party in his skeleton costume.\n\n--------------------------------------------------------------------------------\n\nEpisode 25 - Things Not Said (Airdate: 9/10/2007)\n\nMack shows the photos from Mack&amp;#039;s old camping trip. Dax discovers that Mack doesn&amp;#039;t have a shadow in the picture. Spencer walks in and overhears the discussion. As Andrew researches the tablet, Rose works on creating a new weapon that utilizes the Sentinel Zord. The weapon is designed for enhancing zord capabilities.\n\nThe Rangers are called into action. Kamdor and Miratrix prepare a trap for the Rangers. Kamdor summons a monster to attack the Rangers. Tyzonn and the four Rangers morph and taken on the monster. Red Ranger takes on Kamdor and Miratrix. The Rangers use their weapons to slow down the monster. Miratrix fights Red Ranger as Kamdor powers up the monster to its full size. Red Ranger retreats to help the Rangers. The monster wraps its wires around the Battlefleet. The zords break free and combine into the Battlefleet Megazord. The Megazord defeats the monster and Kamdor leaves with success. The Rangers return to the Base, where they experience a temporary virus. Mack is greatly affected by the virus, causing him to repeat &quot;Good Thing&quot;. He awakens to see Andrew and Mack. His head is separated from his body, revealing the robotic parts below.\n\nAndrew and Spencer reassemble Mack and reveal the truth to him. Mack is a 2 year old android. Andrew informs Mack that he was programmed with childhood memories. Mack is the son that he always wanted. Mack leaves the scene in great frustration. Kamdor reveals his plot to Miratrix with the location of the next jewel. As Mack is about to tell the truth to his friends, the alarm signals the Rangers. Mack decides not to join the Rangers. The Rangers caught up with Team Kamdor in Florida. Kamdor summons five monsters to slow down the Rangers. Black Ranger calls the Hovertek Cycle and takes on Kamdor. The monsters are too strong for the Rangers. Yellow Ranger tries to call the zords, but they fail to respond.\n\nAt the mansion, Spencer comforts Mack, who feels sorry for himself. Despite being an android, Mack is being loved by Andrew, Spencer, and his friends. Andrew calls Mack into action. Mack compromises to join the fight with the new robotic armor. Team Kamdor defeats the Rangers. Red Ranger arrives just in time. Kamdor finds the jewel, the Star of Isus. Red Ranger brings the Sentinel Sword and transforms into the Red Sentinel Ranger. With the new power, Red Sentinel Ranger easily defeats the first two monsters. He uses his sword mode to defeat the remaining three monsters. Miratrix is surrounded by the Rangers. Kamdor arrives in time to help Miratrix. Ronny uses her super speed to steal the jewel before they leave. Rose questions Mack on how he survived the technology.\n\nMack tells the truth to his friends, who accept him for who he is. The Rangers deliver the jewel to the base. Andrew wants to talk to Mack, but Mack isn&amp;#039;t the mood to talk to him.\n\n--------------------------------------------------------------------------------\n\nEpisode 26 - Red Ranger Unplugged (Airdate: 10/1/2007)\n\nDax brings a book for Mack, who is ponders about his own identity. Dax suggests that Mack does some soul searching. The Fearcats prepare for the next search. They enlist the help of a new Fearcat. Flurious feels the energy of the new Fearcat. Norg is sick, but Flurious doesn&amp;#039;t care. Back at the mansion, Mack has a rock concert, which is interrupted by Spencer. The Rangers morph into action and face Crazar. Crazar summons the Evil Rangers. As Mercury Ranger fights Crazar, the Rangers face their evil clones. After a brief battle, Crazar retreats.\n\nNorg and the Chillers catch up with the Fearcats. Mig and Benglo defeat the Fearcats. Back at the base, Tyzonn reveals the past to his friends. Crazar was there during the day Tyzonn&amp;#039;s friends and his girlfriend were trapped in a cave. The Rangers head for battle. Andrew talks to Mack, who wants to have his own life. Mack leaves to help his friends. The Rangers search for the Fearcats, but end up being captured by them. Tyzonn finds Crazar and they fight for a moment. Mack joins the battle.\n\nWith Will&amp;#039;s laser, Dax helps the Rangers. Mack and Tyzonn morph into action and use their weapons against Crazar. Red Ranger powers up to his Sentinel form. The two Rangers defeat Crazar, who grows to her big form. Sentinel Knight grows and fights Crazar. Tyzonn begins the Mercurian Battle Spell. DriveMax Ultrazord joins the fight. The Rangers form the Dual Drive Megazord. The new Megazord and Tyzonn&amp;#039;s Battle Spell defeats Crazar.\n\nFlurious prepares to get rid of Norg, but Norg reveals the Fearcats&amp;#039; next plan. Flurious decides that Norg may be useful after all. The Rangers celebrate their victory back at the Base. Andrew prepares for the next mission: search for the chalice.\n\n--------------------------------------------------------------------------------\n\nEpisode 27 - Home and Away (Part 1) (Airdate: 10/8/2007)\n\nRose finds the information on the Octavian Chalice, which can synthesize the energies from three ancient relics. When the three relics are placed in the Chalic, it can release a power that can destroy worlds. Rose begins the scan for the other three relics. Tyzonn is frustrated because they destroyed the most important person in his life. Rose finds the location of the first relic: The Staff. Andrew orders Rose to take the Rangers with her to find the relic. Tyzonn wants to go, but Andrew tells him to stay and calm down. The Fearcats finalize their machine for the next mission. With the Octavian Chalice in their possession, they seek the powers of the three relics. Flurious and Norg travel in the forest to find and find the Minerva&amp;#039;s Staff. The Rangers arrive to the scene and blast the Staff away from Flurious. As Black Ranger is about to get the Staff, a Chiller grabs it and returns it to Flurious. The Rangers fight the Chillers for the Staff. Dax finds the remaining relics, the Root of Heisker and the Sands of Sila. Andrew orders the Rangers to split up, but Tyzonn offers to find the Sands of Sila. The Rangers continue to fight the Chillers. Kamdor and Miratrix find the Sands of Sila in a chest located inside a vast desert. Mercury Ranger arrives to stop them. After a brief battle, Team Kamdor defeats Mercury Ranger and celebrate their victory. The Fearcats steal the Sands and defeats Team Kamdor.\n\nTyzonn awakens to see his girlfriend, Vella. Tyzonn is confused about his current state and worried about the Rangers. Vella tells Tyzonn that he never left Mercuria. Moltor finds the last relic, the Root of Heisker. Red and Yellow Rangers arrive to stop him. Red Ranger powers up to his Red Sentinel Ranger form. Sentinel Ranger defeats the large group of Lava Lizards. Flurious and Norg retreat with the Staff. Tyzonn continues to talk to Vella, who tells her that she escaped the cave-in. Red and Yellow Rangers continue to fight Moltor and the Lizards. Blue Ranger arrives to help them. He informs them about the current status of the relics. Flurious arrives to the scene and shows off his Staff. The Fearcats steal both of the relics from Moltor and Flurious. With the confidence from the relics, the Fearcats enjoy their victory by insulting everyone, one by one. The Fearcats place the relics in the Chalice. The liquid from the chalice transform into a large monster, Agreos.\n\nThe Fearcats connect their machine as the armor for Agreos. Rangers call their zords and form the Ultrazord. Agreos is too powerful for the Ultrazord. The Rangers call the Battlefleet. Sentinel Knight briefly joins the fight, but a powerful blast from Agreos defeats the Knight back into his sword mode. Agreos turns his attention back to the Battlefleet Megazord and defeats the mighty Megazord. The Fearcats command Agreos to attack the other villians and knock them to their feet.\n\nThe Rangers mourn at the remains of the Battlefleet Megazord. Tyzonn believes Vella and enjoys his life with her again.\n\n--------------------------------------------------------------------------------\n\nEpisode 28 - Home and Away (Part 2) (Airdate: 10/15/2007)\n\nAndrew begins the repairs on the zords as Rose begins repairing the Sentinel Sword. Mack worries about Tyzonn because his signal has disappeared. Back on Mercurian, Tyzonn still has doubts about his true form. He still believes that he is a Power Ranger. Vella tries to comfort him by mentioning that he&amp;#039;s been through a tramatic experience. Vella is excited about continuing their lives and being engaged to Tyzonn. The Fearcats begin their attack on the city. Mack and Rose hear the alarm, but Rose mentions that they have no zords to fight with. Mack offers to pilot Tyzonn&amp;#039;s FlashPoint Megazord. Andrew mentions that Mack doesn&amp;#039;t have the proper training to pilot the zord, but Mack orders Mr. Hartford to perform the programming. Red Ranger enters the battle with the FlashPoint Megazord. The Rangers monitor the fight from the Base. Back on Mercuria, Tyzonn wants to get married but he feels that he needs to return to Earth and learn the truth. Vella convinces Tyzonn to stay and gives him a hug. Her eyes emit an evil mercurian glow.\n\nThe FlashPoint Megazord begins to overload. Andrew orders Mack to return, but Red Ranger declines and continues to fight. Team Kamdor monitors the fight and feel they have underestimated the Fearcats. Flurious and Moltor join Team Kamdor. Red Ranger prepares the ultimate sacrifice by overpowering his Megazord to destroy Agrious and the FlashPoint Megazord. The other Rangers return to the Battle. The zords work together to fight Agrios. Spencer repairs the Sentinel Sword and performs a global search for Tyzonn. Tyzonn hopes to get his old job back, but Vella disapproves. Tyzonn&amp;#039;s morpher emits a noise and drops from Vella&amp;#039;s gown. Tyzonn lifts the morpher and questions Vella. Tyzonn remembers his past and learns that Vella is really Crazar.\n\nCrazar tells Tyzonn that she replicated her and has her in good hands. The DualDrive, FlashPoint, and DriveMax Megazords fight Agrios. Tyzonn fights Crazar and returns to the desert in his Ranger uniform. Tyzonn had never left the Earth...it was all an illusion created by Crazar. Tyzonn morphs into Action and the battle between Mercury Ranger and Crazar begins. Mercury Ranger defeats Crazar and returns to the fight with the Battlefleet. DriveMax Megazord rides the Battlefleet Megazord and prepares for their ultimate attack. Using the Sentinel Sword, the DriveMax Megazord sends a powerful attack towards Agrios. The Fearcats plan to use the Octavian Chalice to defeat the Rangers. The battle for the Chalice begins. Blue Ranger equips the Defender Vest and the Rangers struggle in his fierce battle against their two foes. Mercury Ranger defeats one of the Fearcats. Red Ranger powers up to Red Sentinel Ranger, who defeats the final Fearcat.\n\nFlurious enjoys the victory over the Fearcats. Moltor calls Flurious and tells Flurious that he will find all the jewels. Flurious offers to recruit Moltor, but is declined. Team Kamdor prepare for the final move against Moltor, Flurious, and the Power Rangers. The Rangers bring the Octavian Chalice back to the Mansion and enjoy their sweet victory. They begin researching the Chalice to see what clues it possesses for their mission. Andrew calls Mack for a meeting. Mack tells Andrew that he is not angry because that is a feeling that androids don&amp;#039;t possess. He leaves the room and calls Andrew by Mr. Hartford.\n\n--------------------------------------------------------------------------------\n\nEpisode 29 - Way Back When (Airdate: 10/22/2007)\n\nAs Dax and Ronny discuss which came first: chicken or the egg, Rose finds five signals in the Octavian signals. Mack offers his robotic self to assist in reviewing the history of Operation Overdrive.\n\nThe Rangers watch the events beginning from their first time at the Mansion. Andrew recruits the Rangers in his search for the Corona Aurora Jewels. They travel to the Atlantis, where they find a cocoon that revealed the first Ancient Scroll. With the three scrolls, the Rangers used the Sword of Neptune to make way to St. Lucia. With the help of Brownbeard, they found the first jewel of the Corona Aurora. The show ends as Rose places the first marker on St. Lucia. Rose feels the locations of the jewels are important.\n\nThe Rangers continue to watch the events that lead to the discovery of the second jewel of the Corona Aurora and the entrance of Mercury Ranger, followed by the events of the third jewel. Rose and Will place the respected markers on the locations, yet are unable to see a pattern. Mack suggests watching the final jewel search. The Rangers watch the events starting from the Centurian Torch to the entrance of the 4th jewel. Tyzonn places the 4th marker and the Rangers watch the final scenes, including the end of the Fearcats. Spencer brings the brain food to help the Rangers.\n\nRose deciphers that the solution is at the beginnings of each adventure. The search reveals to be Greece.\n\n--------------------------------------------------------------------------------\n\nEpisode 30 - Two Fallen Foes (Airdate: 10/29/2007)\n\nRose explains the legend of the Octavian Chalice, which is known to have magical powers during a solar eclipse. The Ancient Greeks used it to ask for things like rain. Rose discovers the ancient writings of the Octavian Chalice and its connection to the solar eclipse. The Rangers hope to ask the Chalice for the location of the final jewel. Dax is curious on asking where he found his keys. Luckily for the Rangers, the next solar eclipse takes place later in the afternoon. Norg cleans Flurious&amp;#039;s base. Flurious is frustrated because he only wants the jewels, not a clean base.\n\nThe Rangers arrive in Greece, where they run into Team Kamdor. Kamdor insults Will for his loss of the Blue Sapphire. The Rangers morph into Action and take on Team Kamdor. Matrix gets the chalice from Yellow Ranger. Red Sentinel Ranger attacks Miratrix and knocks the Chalice out of her hands. Kamdor tells Miratrix that she has failed him for the last time and they retreat. The Rangers demorph and prepare for the eclipse. Kamdor insults Miratrix and feels that he must work alone. Miratrix challenges Kamdor and runs away. The Rangers place the Chalice on the pedestal and begin the ceremony. The Solar Eclipse begins and the Octavian Chalice emits a golden glow. The Rangers ask for the location of the 5th jewel. Miratrix arrives and interrupts the ceremony. She holds onto the Chalice and asks for the power.\n\nThe chalice grants Miratrix her absolute power and transforms her into a new, stronger form. As Ronny and Tyzonn try to break the connection with the Chalice, the Rangers morph into Action to take on Miratrix. The Battlefleet Megazord fights the powered up Miratrix. The Battlefleet struggles against Miratrix as she continues to get stronger. Tyzonn uses his Mercurian form to disrupt the energy field. Ronny grabs the chalice and returns Miratrix begins to lose her powers. Battlefleet Megazord uses its final attack to defeat Miratrix. The solar eclipse ends and reveals the next clue to the 5th jewel. Kamdor blasts Tyzonn a","torrent":{"xt":"urn:btih:f492878f10b18d968bed9873abb8109f4ba19170","amp;dn":"Power+Rangers+Operation+Overdrive+-+All+%28RESEED%29+TVCap+Xvid+avi","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f492878f10b18d968bed9873abb8109f4ba19170","infoHashBuffer":{"type":"Buffer","data":[244,146,135,143,16,177,141,150,139,237,152,115,171,184,16,159,75,161,145,112]},"announce":[],"urlList":[]}}