{"title":"Dr Stanley Montieth - 2008 05 08-09 - William Grigg - MP3","uid":4181747,"size":41795560,"categoryP":"audio","categoryS":"other","magnet":"?xt=urn:btih:f5e13d221df216777dc77ba979b723dc376320ec&amp;dn=Dr+Stanley+Montieth+-+2008+05+08-09+-+William+Grigg+-+MP3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Anotha_modemho","files":2,"time":1210441840,"description":"Dr Stanley Montieth and William N. Grigg\n\nFor over a decade, prior to his retirement, Dr. Monteith led a delegation of physicians from Santa Cruz County to the House of Delegates of the California Medical Association. For 10 years he led the battle \nwithin organized medicine in California to address the AIDS epidemic as a medical issue rather than a civil rights issue. As a result of his experiences trying to implement an effective medical approach to the HIV epidemic, he wrote the book, &quot;AIDS:The Unnecessary Epidemic&quot;, the widely circulated pamphlet, &quot;To Deceive a Nation&quot;, and more recently, &quot;A Nation Deceived and Betrayed.&quot; Supported by physicians across our nation, his public health approach to the HIV epidemic was eventually accepted by the \nCalifornia Medical Association. Unfortunately, powerful forces continue to oppose the dictates of doctors. Dr Monteith currently spends five hours daily on talk radio, writes extensively, and lectures on \ngeopolitics. He has spent 30 years researching the causes for America&amp;#039;s spiritual and moral decline.\n\nDr Stans guest is William N. Grigg\nAge: 45 \nGender: Male \nAstrological Sign: Aquarius \nZodiac Year: Rabbit \nOccupation: Writer, editor, dogmatist \nLocation: Payette : Idaho : United States \nAbout Me\nGrateful follower of my Lord Jesus, equally grateful husband to my wonderful wife Korrin, inadequate father to five delightful children\n\nOscillate my metallic sonatas with your plan for the Panama canal:\nI&amp;#039;m sorry -- you must re-state your gibberish in the form of a QUESTION, cretin.\n\nInterests\nMy lovely wife and wonderful family politics music literature science fiction martial arts/physical culture \ncooking but NOT astrology.\n\nFavorite Movies\nMy oldest son&amp;#039;s name is William Wallace Grigg. Duh.\n\nFavorite Music\nBach Latino ballads fusion 1970s rock particularly Thin Lizzy and Rush.\nFavorite Books\nThe Bible, The Federalist (and Anti-Federalist)Papers, Reflections on the Revolution in France, The Law \n(Bastiat), Our Enemy the State (Nock), The Road to Serfdom (Hayek), The Complete Works of Shakespeare, Robert Parker&amp;#039;s &quot;Spenser&quot; series, anything by Louis L&amp;#039;Amour... this list will have to be a work in progress.\n\nDr Stanley Montieth - 2008 05 08-09 - William Grigg - MP3 ","torrent":{"xt":"urn:btih:f5e13d221df216777dc77ba979b723dc376320ec","amp;dn":"Dr+Stanley+Montieth+-+2008+05+08-09+-+William+Grigg+-+MP3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5e13d221df216777dc77ba979b723dc376320ec","infoHashBuffer":{"type":"Buffer","data":[245,225,61,34,29,242,22,119,125,199,123,169,121,183,35,220,55,99,32,236]},"announce":[],"urlList":[]}}