{"title":"Red Hot Chili Peppers - Live At Slance Castle","uid":4118995,"size":7895326720,"categoryP":"video","categoryS":"movies_dvdr","magnet":"?xt=urn:btih:f5fc1a99797f93995d4f6454d0ff91af5aed0b2b&amp;dn=Red+Hot+Chili+Peppers+-+Live+At+Slance+Castle&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"jotun_82","files":1,"time":1207447019,"description":"Red Hot Chili Peppers - Live At Slance Castle\nFormat: DVD9\n\nActors: Red Hot Chili Peppers\nFormat: Color, DVD-Video, Live, PAL (16:9) &amp; (4:3)\nLanguage: English\nRegion: 2/3/4/5/6\nAspect Ratio: 1.33:1\nNumber of discs: 1\nRating: 10/10\nStudio: Warner Bros / Wea\nDVD Release Date: November 18, 2003\nRun Time: 102 minutes\n\n\n\nI had the pleasure of going to see the Chili Peppers during this tour with great seats - I was dead center in the pit. There couldn&amp;#039;t have been more than twenty feet seperating me from the band. Being only a casual RHCP fan, I was blown away by the awesome power of their live performance. That remains the best concert I&amp;#039;ve ever been too. And this DVD is a perfect way to revisit that experience again and again.\n\nIf you were also went to see them during that tour, this DVD is essential. They were smart in that they played almost the same setlist and wore the same clothes even (most remarkably Flea&amp;#039;s Skeleton costume - reminiscent of John Entwistle) so that for all intents and purposes no matter where you saw them this concert is almost exactly like the one you saw.\n\nThe Chili Peppers were full of great surprises here. First of all, John Frusciante has new solo&amp;#039;s for every song and he&amp;#039;s in prime guitar god form. His improvisations are brilliant, including the intro to &quot;By the Way&quot; which opened the concert and especially the extended solo after &quot;Throw Away Your Television&quot; will blow your mind. I still recall my jaw dropping when watching him perform this live. Also it&amp;#039;s good to see they included his solo performance of &quot;Maybe&quot;, a 60&amp;#039;s pop love song, which comes right after &quot;Scar Tissue&quot; although it&amp;#039;s not listed. That was an odd and memorable part of the show I saw.\n\nThe filmmakers were smart to film the concert from start to finish. No breaks to hear short interviews from the band. No &amp;#039;Song Remains the Same&amp;#039; style movie clips. Just pure unadulturated Chili Peppers goodness. There are also some cool effects such as the still-motion, 180 degree, Matrix-style camera trick used to capture and accentuate Anthony Kiedis&amp;#039;s crazy jumping around. I also liked how they focused on the right people at the right time, so that interested guitarists such as myself could see the fretboard during many of Frusciante&amp;#039;s solos.\n\nOverall there&amp;#039;s nothing to complain about with this DVD. It&amp;#039;s the best live document of the Chili Peppers that you could hope for. The only thing I would have liked (if only as a lark) is as an extra feature some footage of opening band French Toast, who came on before Queens of the Stone Age. My friends and I had many laughs at their expense, especially when we realized the lyrics to one of their songs chorus&amp;#039;s was &quot;This is what I had for breakfast!&quot; Anyone who came early and saw them","torrent":{"xt":"urn:btih:f5fc1a99797f93995d4f6454d0ff91af5aed0b2b","amp;dn":"Red+Hot+Chili+Peppers+-+Live+At+Slance+Castle","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f5fc1a99797f93995d4f6454d0ff91af5aed0b2b","infoHashBuffer":{"type":"Buffer","data":[245,252,26,153,121,127,147,153,93,79,100,84,208,255,145,175,90,237,11,43]},"announce":[],"urlList":[]}}