{"title":"Milestones by Syed Qutb","uid":4236142,"size":707781,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:f6111d7ca4f4b9bb72f14ffff777de2d6279dd27&amp;dn=Milestones+by+Syed+Qutb&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"ThreeAces","files":1,"time":1213308451,"description":"Sayyid Qutb is easily one of the major architects and \\&quot;strategists\\&quot; of contemporary \n Islamic revival. Along with Maulana Maududi, the founder of Jamaat-e-Islami, the \n revivalist movement in South Asia, and Imam Khomeini, the leader of Iran\\&amp;#039;s Islamic \n revolution, he gave shape to the ideas and the worldview that has mobilized and \n motivated millions of Muslims from Malaysia to Michigan to strive to reintroduce \n Islamic practices in their lives and alter social and political institutions so that they \n reflect Islamic principles. Milestones was written to educate and motivate the potential \n vanguard of the re-Islamization movement. \n\n Qutb, like most contemporary mujaddids, Islamic revivalists, was distressed with the \n growing distance between Islamic values, institutions and practices and the emerging \n postcolonial Muslim societies, specially in his native Egypt. In Milestones, he sought \n to answer some of the fundamental questions such as why Islam needs to be revived? \n why no other way of life is adequate? What is the true essence of an Islamic identity \n and an Islamic existence (he uses the term \\&quot;concept\\&quot; to signify these two elements)? \n How was Islam established by the Prophet Muhammad (pbuh) and his companions? \n Can the same method, which was undoubtedly divine in its conception be replicated \n again? Qutb is particularly concerned with this issue of \\&quot;Islamic methodology\\&quot;. He \n believes that Islamic values and the manner in which they are to be realized (read as \n were realized by Prophet Muhammad (pbuh) and his glorious companions) both \n together constitute the faith of Islam. \n\n Relying entirely on the Quran, Qutb uses the concepts of jahiliyya, Islamic concept, \n Islamic methodology, jihad and Allah\\&amp;#039;s sovereignty, to dilineate the strategy by which \n Muslims would: \n\n 1. realize the true significance and implications of La-ilaha-illallah, having faith in the \n exclusive unity of Allah (tawhid). \n\n 2. understand the imperfections, injustices and moral poverty of jahiliyya. \n\n 3. empower themselves by realising the meaning of \n ashhadu-anna-muhammadur-rasoolullah (bearing witness that Muhammad is Allah\\&amp;#039;s \n messenger) -- internalizing his method of dawah and submitting to the will and laws of \n Allah. \n\n 4. through this Islamic methodology, as articulated in the Quran and manifested in the \n practices of Prophet Muhammad, which does not separate theory from practice, and \n discourse from action, establish an Islamic order. The Islamic order, which is Allah\\&amp;#039;s \n most significant gift to the entire humanity. \n\n 5. The most remarkable aspect of Qutb\\&amp;#039;s book is his insistance on an approach in \n \\&quot;stages\\&quot; and the repeated assertion that the need for implementing Islamic law would \n not arise until every member of the community had completely submitted to the \n sovereignty of Allah and by that agreed to live under Allah\\&amp;#039;s laws. Laws would then be \n framed merely to serve the needs of this \\&quot;living community of Islam\\&quot;. A far cry from the \n perception that a handful of Islamists are out to impose an essentialized shariah on all \n Muslims and non-Muslims living in Muslim lands. \n\n Jahiliyya, as used in the traditional Islamic sense suggests ignorence in the ways of \n God. However, Qutb gives an interesting twist to the idea of jahiliyya. Jahiliyya for Qutb \n is the sovereignty of man over man. Socio-political orders where men have power over \n other men, to institute legislation and determine principles of right and wrong conduct. \n The Quran is explicit in postulating Islam as the antithesis of jahiliyya. Qutb, by \n redefining jahiliyya to encompass modern secular systems of political organization, is \n basically decreeing that all existing systems are unacceptable and even antithetical to \n the spirit of Islam. Thus the dichotomy, Islam and jahiliyya includes both the Islamic \n and the anthropocentric way of doing things, and Islamic regimes and the existing \n unIslamic regimes in Muslim lands. A clever ploy that uses Islamic reasoning to \n indirectly condemn contemporary political organizations as antithetical to Islam. \n\n His notion of the sovereignty of Allah as opposed to the sovereignty of man is basically \n a restating of the meaning of Islamic faith -- submission to the will of God. It clearly \n suggests, that any principle of organization that is not premised on God\\&amp;#039;s supreme and \n sole prerogative as a legislative source, is shirk. Shirk, in Islam is the only unforgivable \n sin. It means to associate other Gods with Allah thereby denying the fundamental \n article of faith, lailaha illalah, there is no deity but Allah. He also uses it to declare the \n \\&quot;universal declaration of the freedom of man on earth from a every authority except \n Allah\\&quot; (p. 48). I have already discussed his idea of the Islamic concept which basically \n emphasizes the inseparability of knowledge and practice. It is an important insight \n which means that one cannot really understand Islam fully unless one is also \n practicing it. Islamic methodology is his interpretation of how Prophet Muhammad \n realized the Islamic ideal. He believes that any other way of approaching Islamization \n is destined to fail. \n\n His understanding of the obligation of jihad -- struggle in the path of Allah -- is also a \n significant departure from traditional understanding. He understands jihad as taking \n many different forms depending upon the stage of development of the Muslim \n community. Thus at the earliest stage it implies struggling to assert the principle of \n tawhid against all odds. Further along the journey of Islamization it means defending \n the communities right to \\&quot;freely practice Islamic beliefs\\&quot; even if it entails the use of \n arms. He challenges the \\&quot;defensive\\&quot; constitution of the duty of jihad and argues that \n jihad is a mandatory proactive activity that seeks to establish Allah\\&amp;#039;s sovereignty on \n earth. He is however careful to emphasize that it does not necessarily mean the use of \n violence, it includes preaching use of service and wealth in the way of Allah. He is also \n careful to remind his readers that there is no compulsion in Islam. But if someone has \n chosen to live by it then no one has the right to prevent him from doing so. Jihad, for \n Qutb is both, the defense of the right to believe and live by Islam and also the struggle \n to establish Allah\\&amp;#039;s sovereignty. Qutb, true to his preachings died for the values he \n espoused. He was sentenced to death and hanged by a military court established by \n Nasser. I think, and Qutb would agree, writing Milestones was his jihad against the \n jahiliyya that he saw all around him. \n\n (This review is based on the ATP edition, Indianapolis, 1990.) \n\n","torrent":{"xt":"urn:btih:f6111d7ca4f4b9bb72f14ffff777de2d6279dd27","amp;dn":"Milestones+by+Syed+Qutb","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6111d7ca4f4b9bb72f14ffff777de2d6279dd27","infoHashBuffer":{"type":"Buffer","data":[246,17,29,124,164,244,185,187,114,241,79,255,247,119,222,45,98,121,221,39]},"announce":[],"urlList":[]}}