{"title":"Don Imus - God's Other Son (abridged audiobook - 1994)","uid":4189289,"size":158725095,"categoryP":"audio","categoryS":"audio_books","magnet":"?xt=urn:btih:f6ba1808b31fd5edfcad040111ea7ecc5f575eb2&amp;dn=Don+Imus+-+God%5C%27s+Other+Son+%28abridged+audiobook+-+1994%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":2,"uploader":"rambam1776","files":3,"time":1210862620,"description":"Gods Other Son ABRIDGED AUDIOBOOK 1994\n\n\nThis book is just bloody weird. Im not recommending, promoting, or knocking it, just putting it out there since nobody else has. Transcribed from Audio tape, 192 kbps. The following reviews are from Amazon.\n\nEditorial Reviews\n\nBook Description\nImus is back, by popular demand, with the Second Greatest Story Ever Told, the hilarious novel about the most outrageous TV evangelist of them all, Billy Sol Hargus. \n&quot;God had two sons. Jesus was His first, and I, Billy Sol Hargus, am His second.&quot; Thus begins Don Imus riotously funny story about the life and times of the lecherous, corrupt, hustling, huckstering television evangelist who claims to have a 2,000 year old brother named Jesus. From his backwoods Texas country, preacher roots, Billy Sol rose to dazzle the nation as a Superstar Minister, preaching at soldout stadiums and traveling across the country. \n\nReverend Billy raked in the dough, the fame, and the women. And then it happened, just like Amelia Earhart and Jimmy Hoffa, Billy Sol vanished one day into legend, disappearing from the face of the earth. But unlike anyone else in the Family, Billy kept a diary, and now his tapes, believed lost, can finally be heard. Praise the Lord!\n\nPRO REVIEW, I grew up in the part of the world where this book is set, and Mr. Imus nailed it. People who compare it to &quot;Elmer Gantry&quot; need to quit showing off their Liberal Arts degrees and bring me another beer chop, chop if they want a full 15% gratuity. \n\nIts best parts happen inside Billy Sols head as he steers his life based on the twisted morality he learned out in a part of the world where people believe in God because the land is too godforsaken to have happened by chance. He got the voice and the tone down really well. And any straight man who doesnt wish for his own Step Edna has no soul. \n\nCON REVIEW, Ive actually watched the Imus show at various times for the same reason I can get hypnotized by TV preachers, theyre so unbelievably bad that I cant believe anyone buys it. I have never heard Imus say anything that was remotely witty, insightful or urbane. I may have missed it amidst the mumbles and gum snapping but I doubt it. So I certainly picked up this book with some prejudice, wondering if I might find myself surprised by a talent on the page not in evidence in his other venues. Nope. Clumsy phrasing, telegraphed gags and heavy handed critiques. As another reviewer remarked this aint Elmer Gantry. But then Elmer Gantry was written by a writer. \n &lt;a href=&quot;\nhttp://www.amazon.com/Gods,Other,Son,Don,Imus/dp/0684801663/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1210844508&amp;sr=8,1&quot; rel=&quot;nofollow&quot; target=&quot;_NEW&quot;&gt;\nhttp://www.amazon.com/Gods,Other,Son,Don,Imus/dp/0684801663/ref=pd_bbs_sr_1?ie=UTF8&amp;s=books&amp;qid=1210844508&amp;sr=8,1&lt;/a&gt;\n\nProduct Details\n\nHardcover: 320 pages \nPublisher: Simon &amp; Schuster (November 23, 1994) \nLanguage: English \nISBN,10: 0684801663 \nISBN,13: 978,0684801667\n","torrent":{"xt":"urn:btih:f6ba1808b31fd5edfcad040111ea7ecc5f575eb2","amp;dn":"Don+Imus+-+God%5C%27s+Other+Son+%28abridged+audiobook+-+1994%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6ba1808b31fd5edfcad040111ea7ecc5f575eb2","infoHashBuffer":{"type":"Buffer","data":[246,186,24,8,179,31,213,237,252,173,4,1,17,234,126,204,95,87,94,178]},"announce":[],"urlList":[]}}