{"title":"White Williams - Smoke (320kbps)","uid":4074361,"size":96015356,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:f6e90f6391aabb73e29eae899251b258df56429c&amp;dn=White+Williams+-+Smoke+%28320kbps%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"dankencity","files":11,"time":1205222251,"description":"Audio CD (November 6, 2007)\nOriginal Release Date: November 6, 2007\nNumber of Discs: 1\nLabel: Tigerbeat6\nASIN: B000WM71XK\n\n1. Headlines\t\n2. In the Club\t\n3. New Violence\t\n4. Going Down\t\n5. Smoke\n6. The Shadow\n7. Danger\n8. I Want Candy\n9. Fleetwood Crack\n10. Route To Palm\n11. Lice In the Rainbow\t\n\n\nJoe Williams, the rowdy 23-year old behind White Williams, got his start playing piano at a young age, getting scolded by his mean German piano teacher for screwing around with the pedals making his own sounds without ever practicing. At 15 he moved onto his first project drumming for a noisy screaming band whose first show was opening for Black Dice and the Rapture in 1999. Playing in DIY venues exposed Joe Williams to a wild party lifestyle of fires, noise bands, art and performance. He had a growing interest in electronic music and wanted to take the noisy, screaming band in another direction, incorporating more electronics, sampling, triggered drums and machines. With no knowledge of studio recording or the basics of sound synthesis, he used the computer to recreate and evolve the sounds the band had been creating.\n\nIn 2001 he became close with Gregg Gillis, who had just started the Girl Talk project. Williams first electronic music project was called So Red, a part of a tiny scene of Gregg Gillis, Andrew Strasser (creator of WW\\&amp;#039;s album art), Frank Musarra (Hearts of Darknesses/TreyTold Em), and Luca Venezia (Drop the Lime). Together they played and booked shows and parties featuring a variety of electronic music artists. After two tours with Girl Talk, Williams\\&amp;#039; project started incorporating vocals and he became less interested in the complexities of electronic sounds. He started gravitating toward pop music and became more interested in physical instruments.\n\nWilliams became enamored with learning about the studio situations of his favorite albums of the 70\\&amp;#039;s and 80\\&amp;#039;s, and was fascinated by the idea of recontextualizing how music could be made with the tools given. This shows up in Williams\\&amp;#039; album, Smoke, as many of the sounds are algorithmically generated. Guitars and vocals are repitched, copied and pasted, and heavily edited at times, or not edited at all when they should be, while Williams focuses on producing more of a live recorded sound that still uses modern techniques.\n\nAs a part of his graphic design education in Cincinnati, Williams moved from city to city for work. As a result, Smoke was recorded in Cleveland, Cincinnati, New York, and San Francisco over the last two years, using a laptop and small selection of studio equipment. He found himself subletting rooms, living with random people, waiting for everyone to leave so he could record, and losing things from moving so often.\n\nSmoke, White Williams first album, is nostalgic colorful art pop, often loose, imperfect, and ambiguous. The album title describes the lyrics, which fade in and out of logic the same way that smoke diffuses into the air.","torrent":{"xt":"urn:btih:f6e90f6391aabb73e29eae899251b258df56429c","amp;dn":"White+Williams+-+Smoke+%28320kbps%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f6e90f6391aabb73e29eae899251b258df56429c","infoHashBuffer":{"type":"Buffer","data":[246,233,15,99,145,170,187,115,226,158,174,137,146,81,178,88,223,86,66,156]},"announce":[],"urlList":[]}}