{"title":"Alyson_Schafers_Parenting_Bootcamp_2007","uid":4121899,"size":4641685504,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f8e56c9ce723ba8e43beb38817181d9f2390d3b8&amp;dn=Alyson_Schafers_Parenting_Bootcamp_2007&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"mschilling","files":1,"time":1207598535,"description":"Alyson Schafer\\&amp;#039;s Parenting Bootcamp. DVD Video Nov. 07 Toronto. Burn with Toast on mac to single layer DVD.\n\nThis is an amateur video of psycho therapist and parenting guru, Alyson Schafer\\&amp;#039;s two-day parenting boot camp. I used my Canon still camera on the lowest quality video setting with just over 10 hours of video (thanks to Toast on the mac). It is in DVD Video format so you can select scenes which are clips at max one hour each. Get out of the trenches and get some tips from the pro!          \n\n\nMy wife and I watched the video through to the end, and I jotted down some brief notes on each scene. With the menu scene selection on this DVD, you can then zone in on the relevant sections for a brush up. If you see any needed changes in the notes, leave a comment and I can update it. Also it gives you an idea of the breadth of the topics. Highly recommended to watch it from start to finish to get the relevant background info.\n\nDay 1\n1. Intro\n2. Cooperative vs. Obedient\n3. Parenting Styles Auto vs. Democratic, Cooperation vs competition, praise vs. encouragement (stickies skit acted out)\n4. Four crucial beliefs\n5. Siblings differences, birth order, mistaken approaches, four categories of misbehavior, attention/connection\n6. Phone training\n7. Power, competent and capable, coat, needs of the situations\n8. Revenge\n\nDay 2\n9. \\&quot;Do nothing\\&quot; social laws, logical consequences, eating and table manners\n10. Table and boundaries, rules that work for everybody\n11. Logical consequences, family meetings, rule making participation: connect, capable, count, courage, being heard, democratic, power, arrangements and agreements, safe, supported and heard, actors, 3 kids, celebrate the family, privacy, contributions: what did we do well as a family this week?, what are we enjoying about the family?, acknowledgements, how did it go?, talking stick (all family meeting related)\n12. age difference in kids\n13. Sibling rivalries, the two-arm technique, who owns the problem?, getting out of the house, alarm clocks\n14. teeth brushing, stimulating intrinsic needs, situational powerbase, not personal powerbase, the choices you\\&amp;#039;re making are not working for you, how can we do morning time better?, what should happen if we\\&amp;#039;re late?, what more things to do?, empowered book - by age can they..., \\&quot;clean up now\\&quot; sounds like a command, not a request\n15. Discipline, tag team vs personal, who starts the discussion, finishes it, allowance, responsibility, two dollar allowance and the vending machine routine, money and saving, tantrums\n16. Can you calm yourself? or do I have to move somewhere else? or do you need to go somewhere else?, bedtime training, freedoms/rights and responsibilities cannot be separated\n\nEnjoy!","torrent":{"xt":"urn:btih:f8e56c9ce723ba8e43beb38817181d9f2390d3b8","amp;dn":"Alyson_Schafers_Parenting_Bootcamp_2007","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f8e56c9ce723ba8e43beb38817181d9f2390d3b8","infoHashBuffer":{"type":"Buffer","data":[248,229,108,156,231,35,186,142,67,190,179,136,23,24,29,159,35,144,211,184]},"announce":[],"urlList":[]}}