{"title":"John E. Mack, M.D. - Transcending the Dualistic Mind","uid":4071074,"size":734679575,"categoryP":"video","categoryS":"other","magnet":"?xt=urn:btih:f988d279a6a11c67e699a4639dba86d10a59652f&amp;dn=John+E.+Mack%2C+M.D.+-+Transcending+the+Dualistic+Mind&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"geogaddi00","files":16,"time":1205058277,"description":"John E. Mack, M.D. - Transcending the Dualistic Mind.avi\n\nDuration: 2:02:54 \nBit rate: 96kbps .mp3 \nDimensions: 512 x 384 DivX\nSize: 650mb\n\n(this video is from the International UFO Congress, 2002. http://www.ufocongressstore.com )\n\nThe Current Crisis: Transcending the Dualistic Mind. The events of September 11th reflect a growing planetary crisis that is deeper than the attack itself or its social, political and economic causes: We in the West are trapped in a dualistic worldview that reduces reality to simple divisions of good and evil. In his talk, Dr. Mack will discuss explorations of the Center for Psychology and Social Change (now the John E. Mack Institute), especially the study of the UFO encounter phenomenon and other anomalous experiences, that are revealing the possibility of a unifying cosmology that transcends this dualism.\n\n\n** NOTE: You can also stream this presentation on Google Video: http://video.google.ca/videoplay?docid=685085385914178771\n\n--------------------------------------------------------------------------------\n\n\n(This torrent also includes several mp3 files featuring Dr. John Mack- including: Abduction, Alienation and Reason, BBC Radio 4, broadcast June 8, 2005.mp3; Dr. John Mack at Prophets Conference, 2001.mp3; Whitley Strieber interviews John Mack - November 14, 1999.mp3; Coast to Coast - 04 18 2001 -John Mack - Alien Abduction Phenomenon.mp3; &amp; Coast to Coast - Sep 28 2004 - Budd Hopkins' Tribute to John Mack.mp3 &lt;many thanks to Dr. Hex and Andrew from alt.binaries.sounds.radio.coasttocoast.am for supplying the C2C mp3 files&gt;)\n\n\nTorrent compiled and uploaded by geogaddi00 ( &lt;a class=&quot;__cf_email__&quot; href=&quot;/cdn-cgi/l/email-protection&quot; data-cfemail=&quot;30535f4243515942000070584543585d51595c1e535f5d&quot;&gt;[email&amp;#160;protected]&lt;/a&gt;&lt;script data-cfhash='f9e31' type=&quot;text/javascript&quot;&gt;\n/* &lt;![CDATA[ */!function(){try{var t=&quot;currentScript&quot;in document?document.currentScript:function(){for(var t=document.getElementsByTagName(&quot;script&quot;),e=t.length;e--;)if(t[e].getAttribute(&quot;data-cfhash&quot;))return t[e]}();if(t&amp;&amp;t.previousSibling){var e,r,n,i,c=t.previousSibling,a=c.getAttribute(&quot;data-cfemail&quot;);if(a){for(e=&quot;&quot;,r=parseInt(a.substr(0,2),16),n=2;a.length-n;n+=2)i=parseInt(a.substr(n,2),16)^r,e+=String.fromCharCode(i);e=document.createTextNode(e),c.parentNode.replaceChild(e,c)}t.parentNode.removeChild(t);}}catch(u){}}()/* ]]&gt; */&lt;/script&gt; ) to:\n\nUtopiated - http://utopiated.net/ (part of Exopolitics UK: http://exopolitics.org.uk/ )\nConspiracy Central - http://conspiracycentral.net:6969/\nThe Pirate Bay - http://thepiratebay.se/\nalt.binaries.ufo.files\n\n\n--------------------------------------------------------------------------------\n\nBiographical Information\nJohn E. Mack, M.D.\n(From Wikipedia, the free encyclopedia)\n\nJohn Edward Mack, M.D. (October 4, 1929 ÃƒÂ¢?? September 27, 2004) was an American Psychiatrist and Professor at Harvard Medical School.\n\nHe was Pulitzer Prize-winning biographer, considered to be a leading authority on the spiritual or transformational effects of alleged alien encounter experiences, sometimes called the Abduction Phenomenon.\n\nBorn in New York City, Mack received his medical degree from the Harvard Medical School (Cum Laude, 1955) after undergraduate study at Oberlin (Phi Beta Kappa, 1951). He was a graduate of the Boston Psychoanalytic Society and Institute and was Board certified in child and adult psychoanalysis.\n\nThe dominant theme of his life's work has been the exploration of how one's perceptions of the world affect one's relationships. He addressed this issue of &quot;worldview&quot; on the individual level in his early clinical explorations of dreams, nightmares and teen suicide, and in his biographical study of the life of British officer T. E. Lawrence (Lawrence of Arabia), for which he received the Pulitzer Prize in biography in 1977. \n\nMack advocated that Western culture required a shift away from a purely materialist worldview (which he felt was responsible for the Cold War, the global ecological crisis, ethnonationalism and regional conflict) towards a transpersonal worldview which embraced certain elements of Eastern spiritual and philosophical traditions.\n\nMack's interest in the spiritual aspect of human experience has been compared by the New York Times to that of a previous Harvard professor, William James. Like James, Mack became controversial for his efforts to bridge spirituality and psychiatry.\n\nThis theme was taken to a controversial extreme in the early 1990s when Mack commenced his decade-plus study of 200 men and women who reported recurrent alien encounter experiences.\n\nSuch encounters had been reported since at least the 1950's (the account of Antonio Villas Boas), and had seen some limited attention from academic figures (Dr. R. Leo Sprinkle perhaps being the earliest, in the 1960s). Mack, however, remains probably the most esteemed academic to have studied the subject.\n\nMack initially suspected that such persons were suffering from mental illness, but when no obvious pathologies were present in the persons he interviewed, Mack's interest was piqued.\n\nFollowing encouragement from longtime friend Thomas Kuhn (who predicted that the subject might be controversial, but urged Mack to simply collect data and temporarily ignore prevailing materialist, dualist and &quot;either/or&quot; analysis), Mack began concerted study and interviews.\n\nMany of those Mack interviewed reported that their encounters had affected the way they regarded the world, including producing a heightened sense of spirituality and environmental concern.\n\nMack was somewhat more guarded in his investigations and interpretations of the abduction phenomenon than were the earlier researchers. Literature professor Terry Matheson writes that &quot;On balance, Mack does present as fair-minded an account as has been encountered to date, at least as these abduction narratives go.&quot; (Matheson, 251) In an undated interview, Dr. Jeffrey Mishlove stated that Mack seemed &quot;inclined to take these [abduction] reports at face value&quot;. Mack replied by saying &quot;Face value I wouldn't say. I take them seriously. I don't have a way to account for them.&quot;Similarly, the BBC quoted Mack as saying, &quot;I would never say, yes, there are aliens taking people. [But] I would say there is a compelling powerful phenomenon here that I can't account for in any other way, that's mysterious. Yet I can't know what it is but it seems to me that it invites a deeper, further inquiry.&quot;\n\nMack noted that there was a worldwide history of visionary experiences -- especially in pre-industrial societies. One example is the vision quest common to some Native American cultures. Only fairly recently in Western culture, notes Mack, have such visionary events been interpreted as aberrations or as mental illness. Mack suggested that abduction accounts might best be considered as part of this larger tradition of visionary encounters.\n\nMack's interest in the spiritual or transformational aspects of people's alien encounters, and his suggestion that the experience of alien contact itself may be more spiritual than physical in nature -- yet nonetheless real -- set him apart from many of his contemporaries such as Budd Hopkins, who advocated the physical reality of aliens.\n\nIn 1994 the Dean of Harvard Medical School appointed a committee of peers to review Mack's clinical care and clinical investigation of the people who had shared their alien encounters with him (some of their cases were written of in Mack's 1994 book Abduction). In the same BBC article cited above, Angela Hind wrote, &quot;It was the first time in Harvard's history that a tenured professor was subjected to such an investigation.&quot;\n\nMack described this investigation as &quot;Kafkaesque:&quot; He never quite knew the status of the ongoing investigation, and the nature of his critics' complaints shifted frequently, as most of their accusations against him proved baseless when closely scrutinized.\n\nAfter fourteen months of inquiry, there were growing questions from the academic community (including Harvard Professor of Law Alan Dershowitz) regarding the validity of Harvard's investigation of a tenured professor who was not suspected of ethics violations or professional misconduct. Harvard then issued a statement stating that the Dean had &quot;reaffirmed Dr. Mack's academic freedom to study what he wishes and to state his opinions without impediment,&quot; concluding &quot;Dr. Mack remains a member in good standing of the Harvard Faculty of Medicine.&quot; (Mack was censured for some methodological errors.) He had received legal help from Roderick MacLeish and Daniel Sheehan, and the support of Laurance Rockefeller, who also funded Mack's Center for four consecutive years at $250,000 per year.\n\nMack's explorations later broadened into the general consideration of the merits of an expanded notion of reality, one which allows for experiences that may not fit the Western materialist paradigm, yet deeply affect people's lives. His second (and final) book on the alien encounter experience, Passport to the Cosmos: Human Transformation and Alien Encounters (1999), was as much a philosophical treatise connecting the themes of spirituality and modern worldviews as it was the culmination of his work with the &quot;experiencers&quot; of alien encounters (to whom the book is dedicated).\n\nAn archive of his writings is available at www.passporttothecosmos.com\n\n\n--------------------------------------------------------------------------------\n\n\n** NOTE: John Mack was tragically killed after being struck by a drunk motorcyclist in London, England on September 27th, 2004.  He had attended the T. E. Lawrence Society Symposium 2004 at St. John's College, Oxford where he lectured and had a wide-ranging discussion with Malcolm Brown and Jeremy Wilson, two other acclaimed biographers of T.E. Lawrence.  Back in America, John had been deeply concerned about the direction of the government and had voluntarily gone to Maine (which according to his best friend, Budd Hopkins, had been his last activity in the United States) to register poor and underprivileged citizens to vote and make a positive difference in the 2004 presidential election.  John had been going door to door working with people.  Budd Hopkins also revealed on Coast to Coast AM with George Noory, on the day after John Mack's tragic death, that John had also been working on another book.  This book had to do with evidence suggesting the survival of consciousness after death...     \n\n\n--------------------------------------------------------------------------------\n\n\n(the following text is from an interview with John Mack posted in its entirety here: http://users.lycaeum.org/~maverick/mack.htm )  \n\n&quot;Interviewer: How were you first introduced to the abduction phenomena?\n\nJohn Mack: It began with UFO's. I never had had a very great interest in UFO's actually. I thought there were too many people seeing ordinary objects along the roadside and in the sky. I basically believed that there was nothing to the reports, and it wasn't a consuming interest of mine. \n\nI remember a conversation on the topic that I had with Carl Sagan and Lester Grinspoon, an old classmate and friend of mine from medical school. The three of us were sitting around talking sometime in the late sixties, and Lester asked Carl about UFO's, because that was Carl's territory in those days. And Carl said, oh, we've really looked into that and studied it, and there's nothing to it. I think that he was referring to the Condan report, which I later learned didn't come to that conclusion at all. It just said there's a certain percentage of cases that they can't explain, and dismissed it. But in those days Carl seemed to be the authority on matters of extraterrestrial life, so I had just accepted his response. \n\nYou can imagine that I was somewhat surprised when some fifteen years or so later, it turned out that Carl was mistaken, and there was something to this. In fact, there was a lot to it. But I didn't get back involved again until around 1989, when I was given a paper by Keith Thompson (who I later got to know quite well) on the UFO phenomenon. The paper was from a book edited by Stan Grof on spiritual emergencies, of which UFO encounters were considered to be one type. At the time I was learning the Grof Holotropic Breathwork method, and for some reason Stan thought I would find this chapter interesting. I did. I read it with great interest, and repeatedly asked myself, yeah, but is it real? \n\nStill, I didn't really pick up on this much until January of 1990, when I met Budd Hopkins. I was brought to see him by a psychologist colleague and friend, and was struck by what he had to tell me. It just didn't add up. I couldn't come up with any kind of explanation. As you probably know, psychiatrists are very good at finding psychological, psycho-social, or psycho-dynamic explanations for most human phenomena. But this just didn't make any sense. \n\nPeople from all over the United States (and now from all over the world) have reported with great concern for themselves, and with much self-questioning, the same basic story of being visited and taken by aliens. And many of the details are very similar, and they had not been in the media at this time. People didn't know each other, and they were shocked when they would hear that someone else had had the same kind of experience. I met some of these people very soon after that, and they seemed very sound of mind, very genuine and sincere to me.&quot;\n\n\n&quot;Interviewer: What do you personally believe is really going on?\n\nJohn: That they are being abducted, in a sense. Abduction is a bad word. Something very powerful is happening to them. Sometimes they experience that their physical bodies appear to be taken. There are witnesses who report that people are missing. The abductees will report as altogether real that they have been floated through walls, taken up into a spacecraft, subjected to all of these physical, ecological and spiritually-related experiences. \n\nIt's totally real. At the same time, I'm not sure how it's real-- in other words, in what dimension it's occurring. And again, what's happened to me is this has required that I, in a certain sense, suspend my literal notions of reality, because reality in this sense is not limited to the physical world. People may, in fact, be taken physically, but it's going to be very hard to prove. I don't think it should be looked upon so literally. I think that there are some kinds of energies, entities, and daimonic agents that our culture is unaware of. \n\nIf you were in an African society you'd have a whole different perspective on this. I've worked with African medicine men who have a whole classification of beings that their people encounter. And the beings are completely real in their experience, but they wouldn't be real to our culture, because we don't have the senses anymore to know them. As the Poet Rilke said, by daily parrying we have cut off our connection. The senses by which we can know the spirit world have atrophied.\n\nI wasn't prepared for this when I first got started. When people say that I've been converted to something, they don't know that I'm the last person in a certain way that would be converted. I was raised in a very secular, rational, empirical, materialist-- whatever you want to call it-- view, and the only thing that led me to take this seriously is I just couldn't place it clinically. It just didn't fall into anything. It acted like it was real, but if this was real, then-- good heavens-- what's going on?&quot;\n\n\n&quot;Interviewer: Do you think that there is any relationship between the abduction phenomenon and the extraterrestrial contact that some people-- like Terence McKenna and John Lilly-- have written about in regard to their experience with psychedelic drugs or shamanic plants?\n\nJohn: I find that interesting. It's very mysterious. I've seen this too, and it does seem that when some people take psychedelics they may open themselves up to something that seems similar. Terence McKenna talks about taking DMT and then suddenly finding all kinds of alien beings around him. What does this mean? Obviously it didn't cause something to materialize physically, so it suggests that, in a certain sense, the person has become pro-active in discovering another realm. \n\nThose cases may be experienced quite similarly to the cases where there's actual physical evidence that some material UFO has actually appeared in somebody's backyard, but that doesn't help me with the situation I face. I have cases where a neighbor or the media report a UFO close to somebody's home, or where they were driving their car, and independently the person will tell me about a UFO abduction experience. They don't know that the media has tracked the UFO. So there is a physical dimension to this. And it's that aspect of it that has created so much distress in the Western culture, because we felt we were safely cornered off in our material sanctity.\n\nThe idea that some kind of entities, beings, or energies from some other dimension can cross over and find us here, in a way that no missile-defense is going to help, is-- I guess-- scary to most people. It doesn't scare me particularly. But I guess that's scary if you've been raised with the notion that we're the pre-eminent bosses of the cosmos, and nobody can get us, and all we have to do is create better technologically-controlled atmospheres, astro-domes, and that kind of thing, and no one will ever reach us. I mean, think about what the military's Star Wars project is. The Strategic Defense Initiative is part of that kind of effort that is based upon the belief that somehow technology can make us secure and inviolate from ourselves and the powers and energies of the cosmos.\n\nI've read most of Terence Mckenna's books, and I find they're very compatible with what I'm about. But I don't think he quite realizes how robust the abduction phenomenon itself is because his access to it has been so much through psychedelics. I don't think he realizes how powerful these cross-over experiences are in a material sense.&quot;\n\n\n--------------------------------------------------------------------------------\n\n** COMING IN AUTUMN 2008 ---&gt; Passport to the Cosmos (Commemorative Edition): Human Transformation and Alien Encounters **\n\n\nÃƒÂ¢??The alien encounter experience seems almost like an outreach program from the cosmos to the consciously impaired.ÃƒÂ¢?? \n\n\n     What if the alien encounter phenomenon were subtle in the sense that it may manifest in the physical world but derives from a source which by its very nature could not provide the kind of hard evidence that would satisfy skeptics for whom reality is limited to the material? What if we were to acknowledge that the phenomenon is beyond our present framework of knowledge? \n\n     Might not such an attitude of humility become, paradoxically, a way to enlarge upon what could then be learned? Is it possible that adopting an open attitude toward the testimony of witnesses could enable us to learn of unseen realities now obscured by our too limited epistemology, allowing us to rediscover the sacred and the divinity in nature and in ourselves?\n\n     I think of these experiences as a crossing over between the material world and what in Eastern philosophy is called the subtle realm. Like a reified ÃƒÂ¢??mystic's journey,ÃƒÂ¢?? experiencers describe being brought into another dimension of reality from which a new perspective on life on Earth is possible. Sensitivity to our dysfunctional ecological and social conditions emerges as many come to feel that every living system is connected to what many call ÃƒÂ¢??Source,ÃƒÂ¢?? or ÃƒÂ¢??Home.ÃƒÂ¢?? An awareness of this relationship must be regained, they say, if we are to create a sustainable, peaceful world.\n\n     Having listened to the similar testimony of more than 200 experiencers from the West and from indigenous cultures, I have come to feel that the phenomenon is of great importance to our evolution, regardless of its ontological status.  \n\nJohn E. Mack, M.D.\n\n-------------------------------------------\n\nÃƒÂ¢??Here is a fascinating foray into an exotic world. ...As a serious investigation into a mystifying experience, Mack's account poses questions begging for answers.ÃƒÂ¢??\n     ÃƒÂ¢?? Publishers Weekly\n \nÃƒÂ¢??ÃƒÂ¢?Ã‚Â¦because of its conspicuous attempts to be even handed and the introduction of cross-cultural material, Passport to the Cosmos breaks new ground. ...A credible work on an incredible topic and worth reading.ÃƒÂ¢??\n     ÃƒÂ¢?? Albert A. Harrison, Ph.D.,\n     Professor of Psychology, UC Davis, \n     National Institute for Discovery Science\n \nÃƒÂ¢??Dr. Mack is one of the more credible writers and researchers in the UFO scene and a man who has earned the right to be accorded some consideration.ÃƒÂ¢??\n     ÃƒÂ¢?? Tom Elliott, \n     Mensa Bulletin: The Magazine of American Mensa\n \nÃƒÂ¢??In my opinion, Passport to the Cosmos is a monumental ÃƒÂ¢?? I almost want to say, definitive ÃƒÂ¢?? contribution to our understanding of the meaning of extraordinary experiences. It is also a very brave book, passionately written and deeply engaging. And more than that ÃƒÂ¢?? its provocative thesis strikes me as being absolutely on target.ÃƒÂ¢??\n     ÃƒÂ¢?? Kenneth Ring, Ph.D., \n     author of The Omega Project, Lessons from the Light\n \nÃƒÂ¢??Passport to the Cosmos provides the most sophisticated and insightful analysis to date about alien abduction phenomenon. [Mack deserves] thanks for holding his ground in the face of critics.ÃƒÂ¢??\n     ÃƒÂ¢?? Michael Zimmerman, Ph.D.,\n     Chair of the Dept. of Philosophy, Tulane University\n \nÃƒÂ¢??Dr. Mack is, in my opinion, now the world's leading authority on alien abductions. Do not assume that [Passport to the Cosmos] is a sequel to Abduction. It is far beyond that. The close encounter experience as it really is. Dr. Mack is probably as close to the truth about this as anyone ever has been.ÃƒÂ¢??\n     ÃƒÂ¢?? Whitley Strieber, author of Communion\n \nÃƒÂ¢??...a stunning breakthrough in our understanding of ourselves and our place in the larger cosmos. With a rare combination of empiricism, reason, and empathy, he skillfully guides us to reconsider our attachment to the bankrupt materialist worldview and open our minds to the possibilities of a universe of awesome diversity.ÃƒÂ¢??\n     ÃƒÂ¢?? Ralph Metzner, Ph.D., psychologist and author\n \nÃƒÂ¢??What do people really want when they think about UFOs? According to John Mack's newest book Passport to the Cosmos, the first thing they want is for their experiences to stop. Only after they realize they have no power to stop the experience do they begin to to accept a process that is informative and transformative ÃƒÂ¢?? a process that propels them out of their narcissistic concerns and towards active involvement with environmental values, the survival of humanity and an exploration of spiritually-based consciousness. ...Perhaps Wilber, the philosopher, might discover he has more in common with Mack than he realizes.ÃƒÂ¢?? \n     ÃƒÂ¢?? The Vancouver Sun\n\n--------------------------------------------------------------------------------\n\n","torrent":{"xt":"urn:btih:f988d279a6a11c67e699a4639dba86d10a59652f","amp;dn":"John+E.+Mack%2C+M.D.+-+Transcending+the+Dualistic+Mind","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f988d279a6a11c67e699a4639dba86d10a59652f","infoHashBuffer":{"type":"Buffer","data":[249,136,210,121,166,161,28,103,230,153,164,99,157,186,134,209,10,89,101,47]},"announce":[],"urlList":[]}}