{"title":"Sundown: The Vampire In Retreat Fanedit (Welcome to Purgatory Ed","uid":4098601,"size":1314386321,"categoryP":"video","categoryS":"movies","magnet":"?xt=urn:btih:f9b40512e677f751abbf3c0903d23727983ed16b&amp;dn=Sundown%3A+The+Vampire+In+Retreat+Fanedit+%28Welcome+to+Purgatory+Ed&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Akitsu","files":4,"time":1206461304,"description":"\nOriginal film name: Sundown: The Vampire In Retreat\nNew film name: Sundown: Welcome to Purgatory Edition\nFilm studio name: Vestron Pictures\nOriginal running time: 1h44m\nNew running time: 1h28\nResolution: 640x480\nYour intention for this fanedit:  Removal of several subplots that simply did not fit the movie.  \nHardware and software information (what did you use to create your fanedit): Womble, Photoshop, Vegas, Total Video Converter\nAdditional Comment: This film could have easily been a cult classic, but alas, the narrative is stretched in too many directions to be effective.  By removing the soap operaish family subplots, the movie focuses more on the town itself and it\\&amp;#039;s odd inhabitants.  \nTime needed for the edition: Over a month off and on.  \nEditor: Akitsu\nIMDB: http://www.imdb.com/title/tt0098412/\n\nPlease keep in mind that this film is unavailable on LD, VCD, or DVD... the only source used on this was my own VHS rip.  As such, the quality isn\\&amp;#039;t up to those standards.  Still, this version was made using the best materials available at the time of the edit.  Some scenes are dark... others crystal clear.  This is unfortunately unavoidable... please do not let it detract from your enjoyment of this, a lost B-movie classic.\n\nFeaturing Bruce Campbell (Evil Dead 2) as Robert Van Helsing, David Carradine (Kill Bill) as Jozek Mardulak, and Jim Metzler (Circuitry Man) as David Harrison.  \n\nThis movie started it\\&amp;#039;s life as a mix of family drama and horror comedy... needless to say this edit removes 88.5% of the family drama aspect, leaving us with a horror comedy.  Your welcome.\n\nBest viewed late night with a big bowl of popcorn and a love of bad movies.\n\n\nCuts removed/added/extended :\n\nInserted scene with Bruce Campbell\\&amp;#039;s car breaking down to the opening.  It gets him into the picture earlier, and makes his character a bit more tenacious in the long run.  Ironicly this fits in with existing footage and dialogue to make it appear he has been walking several days to find the town, and not just overnight.\n\nRemoved original opening titles and music, replaced with the new theme and the more interesting logo from the end credits.\n\nRemoved opening family scene.  Elements of it are cannabalized for later scenes.\n\nRemoved \\&quot;gaaaaarlic\\&quot; take 1, left in the better take.  Why both were used is a mystery.  \n\nRemoved \\&quot;tucking in the kids\\&quot; scene, as it detracted from the flow of the movie and conflicted with a later insertion.\n\nRemoved \\&quot;family fight\\&quot;, spliced in the \\&quot;creepy bedroom\\&quot; scene from the beginning.  \n\nCut down the secret passage scene to a tolerable level.  \n\nRemoved Shane and David\\&amp;#039;s \\&quot;confrontation\\&quot; at the blood plant.\n\nRemoved family argument number two... damn do these people fight.  \n\nRemoved David\\&amp;#039;s \\&quot;I\\&amp;#039;m a giant pussy\\&quot; speech.\n\nRemoved pointless \\&quot;gone with the wind\\&quot; reconciliation scene.\n\nRemoved David\\&amp;#039;s addendum to the vampire army speech... it felt tacked on in the first place.\n\nCut down the gas station attack.  Seems like the characters are rather unresponsive in the original cut.  Now it appears that the attack comes out of nowhere, and is much more effective.\n\nCut down car crash scene, as it really didn\\&amp;#039;t need 45 seconds of the kids looking bored before the actual crash.\n\nRemoved Shane\\&amp;#039;s seduction scene.\n\nRemoved \\&quot;Daddy\\&quot; scene, had to replace it with a scene of the impending sunrise to maintain pacing.\n\nUpdates on this fanedit can be seen on Fanedit.org \\&amp;#039;s forum page.  Comments, suggestions and criticisms are welcome.\n\nI apologize for the large file size, there will be a PSP release uploading soon for those who don\\&amp;#039;t want to download such a large file.\n\n\n\n\n","torrent":{"xt":"urn:btih:f9b40512e677f751abbf3c0903d23727983ed16b","amp;dn":"Sundown%3A+The+Vampire+In+Retreat+Fanedit+%28Welcome+to+Purgatory+Ed","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"f9b40512e677f751abbf3c0903d23727983ed16b","infoHashBuffer":{"type":"Buffer","data":[249,180,5,18,230,119,247,81,171,191,60,9,3,210,55,39,152,62,209,107]},"announce":[],"urlList":[]}}