{"title":"Kevin Spencer Season 7","uid":4130042,"size":1549882572,"categoryP":"video","categoryS":"tv_shows","magnet":"?xt=urn:btih:fa0b8caed30b415cc04fef379d12ecda945cb15c&amp;dn=Kevin+Spencer+Season+7&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"Magical.Unicorn.Mayonaise","files":7,"time":1207992759,"description":"Kevin Spencer is a cartoon television series developed by Greg Lawrence, aired in Canada on The Comedy Network and aimed at adult audiences. It takes its name from the main character.\n\nThe half-hour show takes place in Ottawa, Ontario, and revolves around the everyday happenings of the Spencer family, more frequently Kevin himself. His parents are Anatasia and Percy Spencer. Anatasia (voiced by Thomasin Langlands) is a fat, drunken, and promiscuous woman, a curious cross, it would seem, between a hoser (a stereotypical Canadian) and a hick. Curiously, she often ends up having sex, despite being immensely unattractive in just about all senses of the word. Often she receives sex because of people wishing to get back at her husband, Percy. Percy (voiced by Lawrence) is also a fat, drunken, loud, boorish and illiterate oaf, so stupid it is questionable whether he can write his own name. With parents like these, it is not the least bit surprising that Kevin is a \\\\\\\\\\\\\\&quot;chain-smoking, alcoholic, sociopathic\\\\\\\\\\\\\\&quot; juvenile delinquent at the age of 14.\n\nMost of the adventures on the show revolve along illegal schemes committed by any or all three of the characters. Most of the time their motive is nothing more than the ability to acquire more money than their welfare cheques give them. Kevin occasionally goes to school, encountering other stereotypes and people who are almost as stupid as his parents.\n\nKevin\\\\\\\\\\\\\\&amp;#039;s character is slightly more interesting in the fact that he is obviously in possession of some degree of intellect. The show never uses his voice (until recently), but suggests that he tells people rather detailed and articulate things or asks intelligent, legitimate questions when faced with an argument. Instead, the show\\\\\\\\\\\\\\&amp;#039;s narrator (voiced by Lawrence) speaks for him. More often than not these arguments are dismissed by the person that hears them, and this usually causes Kevin to respond to what his environment led him to be the answer: violence.\n\nAnother frequent character in the show is Allen the Magic Goose, an anthropomorphic chain-smoking goose that is the other inspiration behind many of Kevin\\\\\\\\\\\\\\&amp;#039;s misadventures, but is just a figment of his imagination. The bird is what contributes the most to Kevin\\\\\\\\\\\\\\&amp;#039;s sociopathic nature, usually asking him to do illegal, indecent, and dangerous things simply for the sake of the thrill or for vengeance.\t","torrent":{"xt":"urn:btih:fa0b8caed30b415cc04fef379d12ecda945cb15c","amp;dn":"Kevin+Spencer+Season+7","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa0b8caed30b415cc04fef379d12ecda945cb15c","infoHashBuffer":{"type":"Buffer","data":[250,11,140,174,211,11,65,92,192,79,239,55,157,18,236,218,148,92,177,92]},"announce":[],"urlList":[]}}