{"title":"ULTIMATE NRG 3","uid":4082632,"size":60438,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:fa3185883f89cd972ae99f33ff45ad7881525680&amp;dn=ULTIMATE+NRG+3&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"g-8433778","files":1,"time":1205632253,"description":"CD1\n\n\nVarious Artists Megamix T2 feat. Jodie Aysha Heartbroken (Alex K Mix) Breeze v Lost Witness Rise Again Cascada What Do You Want From Me? (Alex K Mix) Girls Aloud Call The Shots (Alex K Mix) Manian feat. Aila Turn the Tide Klubbed DJs v Kuta Production Let There Be Passion Cahill &amp; Nikki Belle Trippin&amp;#039; On You Alex K Piece of Heaven Rozalla Everybody&amp;#039;s Free (Klubbed Mix) Underdog Project Summer Jam (Nrgize Mix) Alex K Long Way From Home (Club Enforcer Mix) Shakedown At Night N Force &amp; Darren Styles Right By Your Side (KB Project Mix) Hypasonic &amp; Jorg Schmidt Doesn&amp;#039;t Matter (Hypasonic Mix) Delinquent &amp; Kcat My Destiny (Alex K Mix) Superstar DJs Meet Her At The Love Parade Ibiza united &amp; KK Project DJ Cut Nysee &amp; Hinton Silver Water \n\nCD 2\n\n\nBassfreakz Now You&amp;#039;re Gone Ultrabeat I Wanna Touch You (Frisco Mix) Corona Rhythm of the Night Manian feat. Aila Heaven (Alex K Mix) DJ Lapell Drinking Chardonnay (Alex K Mix) Kinderwater Forever Beatplayers &amp; Lara McAllen Piece of Heaven (Alex K Mix) JK &amp; Sky Flyers Beat It Butler &amp; Hayes Don&amp;#039;t You Wanna Be Mine Dance Assassins Why D &amp; G Because Of You (Bad Behaviour Mix) Manina &amp; Aila (Alex K Mix) Hold Me Tonight Blackout Crew Bbbbounce (Alex K Mix) Deja Vu Face Up Ass Down (Plus8 Mix) Porn Kings &amp; Flip &amp; Fill Music Is Pumping (Alex K Mix) Club Enforcer Get Up Everybody KB Project Shake It Club Enforcer Royal Flush (Alex K Mix) The Scooters Question What Is The Question Beat Trippa Insomnia \n\nCD 3\n\n\nDinky Allstars Faith Marianne Girls Like Me (Alex K Mix) Slinkee Minx Summer Rain (Alex K Mix) KCB &amp; Victor Lopez Be With You Funky Choad &amp; Nick Skitz Ultimate (Skitz Mix) Nicolette Harden Up Alex K I&amp;#039;ll Be There (Alex K Mix) Nick Skitz All You Deejays Carlotts Chadwick Be There (Alex K Mix) Amen &amp; Alex K I Can&amp;#039;t Wait (Alex K Mix) Nick Skitz Headcheck Project Bass You And Me (Club Mix) Alex K Beat Pounds Captain Kirk Battle (Club Mix) London Fiesta Can You Feel It Mango Maniax Hit The Floor Alex K You Got It London Fiesta La La Konovox Blitz (DJ Schwede Mix) Alex K &amp; Dee One Summer (UK Club Mix) ","torrent":{"xt":"urn:btih:fa3185883f89cd972ae99f33ff45ad7881525680","amp;dn":"ULTIMATE+NRG+3","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fa3185883f89cd972ae99f33ff45ad7881525680","infoHashBuffer":{"type":"Buffer","data":[250,49,133,136,63,137,205,151,42,233,159,51,255,69,173,120,129,82,86,128]},"announce":[],"urlList":[]}}