{"title":"BangBus - Kelly Greene (An appetite for the dick!) NEW 25 Novemb","uid":12836217,"size":431326797,"categoryP":"porn","categoryS":"movie_clips","magnet":"?xt=urn:btih:fb0604446451205e22bfbb6856031612be611767&amp;dn=BangBus+-+Kelly+Greene+%28An+appetite+for+the+dick%21%29+NEW+25+Novemb&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":3,"uploader":"xxxlavalxxx","files":2,"time":1448457993,"description":"Greeting from Miami! We're back with another ride on the Bang Bus! This week we picked up Kelly Greene. See, my egg plant shaped driver was hungry and had to stop for food. While we waited for his huge order, I spotted a cute white girl across the parking lot. She was friendly/naive enough to come and talk to us. Turns out she's eighteen, in need of money, and gullible enough to to believe we were doing a rolling survey. Once Hungry bear got back with half the menu, it only took a couple miles worth of questions to get this sexy little doll to open up about how slutty she really is. It's weird, the more innocent a girl looks, the more she wants to shock you with tales of not being innocent. She seemed to have something to prove, so all I had to do was add money to the mix, and next thing you know she was in her bra and panties sucking cock, also known as, the point of no return. My boy Pauly fucked the shit out of that shaved tight teen pussy. Too bad all good things must cum to an end. This tale did end with swallowing, but also with an abrupt end to Kelly's ride. If you like seeing pretty 18 year old white girls getting stuffed, you better check out this video. Even Kelly was surprised at the mess she made sucking dick. You'll see what I mean...\r\nTags:18+ Teens, Amateur, Blonde, Blowjob, Cumshot, Facial, Handjob, Hardcore, White Girl\r\n \nhttp://imgdone.com/viewer.php?file=25195248913851770036.jpg\r\n    \t \nhttp://imgdone.com/viewer.php?file=40540364425828225446.jpg\r\n    \t \nhttp://imgdone.com/viewer.php?file=03643074045042258124.jpg\r\n    \t \nhttp://imgdone.com/viewer.php?file=95995468776598943329.jpg","torrent":{"xt":"urn:btih:fb0604446451205e22bfbb6856031612be611767","amp;dn":"BangBus+-+Kelly+Greene+%28An+appetite+for+the+dick%21%29+NEW+25+Novemb","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fb0604446451205e22bfbb6856031612be611767","infoHashBuffer":{"type":"Buffer","data":[251,6,4,68,100,81,32,94,34,191,187,104,86,3,22,18,190,97,23,103]},"announce":[],"urlList":[]}}