{"title":"Discovery HD - Equador - 02de06 - Poder do Oceano - PT-BR","uid":4095070,"size":933485024,"categoryP":"video","categoryS":"hd___tv_shows","magnet":"?xt=urn:btih:fbbd16376625e51d97dfaa79d37c05c49f454bbe&amp;dn=Discovery+HD+-+Equador+-+02de06+-+Poder+do+Oceano+-+PT-BR&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"xara_maior","files":1,"time":1206232610,"description":"Audio: Ingles\nLegendas/subtitles: Portugues (hardsubed)\nResolucao: 1280 x 720 (16:9)\nBitrate: 2250 kbps\nDuracao: 50 min cada\nCodecs: DivX/mp3\nHRHDTV\n\n+++++++++++++++++++++++++++++++++++++++++\n\nA Linha do Equador nao eh apenas uma linha que divide a Terra. Eh tambem uma usina climatica e evolucionaria. Ali o ritmo da evolucao acelera, onde o Sol brilha com mais intensidade. A linha do equador cobre apenas 5% da superficie da Terra mas eh o lar para 50% de todas as especies de animais e plantas. Esta serie, capturada em alta definicao, viaja pelos locais mais extremos e variados do planeta. Examina a vida dos animais e plantas em 6 zonas equatoriais do planeta: o Vale Rift na Africa, a bacia Amazonica, os picos dos Andes, o sudeste Asiatico, o oceano Pacifico e as Ilhas Galapagos.\n\n1. Recifes Preciosos\nO arquipelago da Indonesia no Oceano Pacifico compreende milhares de ilhas, atois e a maior concentracao de recifes de coral do mundo. Esse ambiente rico e variado eh o produto de circunstancias naturais.\nO Sol equatorial impulsiona correntes oceanicas por entre pequenas ilhas. Na conjuncao do arquipelago com a extremidade da Nova Guineh, uma interseccao de correntes oceanicas criou talvez os recifes mais preciosos do mundo, na regiao das Ilhas Raja Ampar.\n\n2. Poder do Oceano\nAs Ilhas Galapagos sao ilhas desertas cercadas por ferteis oceanos. Palmira eh um oasis no meio de um oceano deserto. Estao separadas por todo um oceano mas foram moldadas pelo poder equatorial. Grandes correntes oceanicas, postas em movimento pelo Sol equatorial, afetam o destino dos animais vivendo nos dois lugares.\n","torrent":{"xt":"urn:btih:fbbd16376625e51d97dfaa79d37c05c49f454bbe","amp;dn":"Discovery+HD+-+Equador+-+02de06+-+Poder+do+Oceano+-+PT-BR","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbbd16376625e51d97dfaa79d37c05c49f454bbe","infoHashBuffer":{"type":"Buffer","data":[251,189,22,55,102,37,229,29,151,223,170,121,211,124,5,196,159,69,75,190]},"announce":[],"urlList":[]}}