{"title":"Anders Jallai - I rikets tjänst (Svensk Retail EPUB)","uid":12757795,"size":5233013,"categoryP":"other","categoryS":"e_books","magnet":"?xt=urn:btih:fbd010848b2104ef0a71c2a206e8fb3dfce41502&amp;dn=Anders+Jallai+-+I+rikets+tj%26auml%3Bnst+%28Svensk+Retail+EPUB%29&amp;tr=udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969&amp;tr=udp%3A%2F%2Fzer0day.ch%3A1337&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":null,"files":1,"time":1447473218,"description":"Författare: Anders Jallai\r\n       Titel: I rikets tjänst (Anton Modin #5)\r\nUtgivningsår: 2013\r\n       Språk: Svenska\r\n        ISBN: 9789198131550\r\n\r\nÅret är 1984. Vad hände före Estonia - före ubåtskränkningarna - innan Palmemordet? Följ med till sommaren 1984, året då det kalla kriget i världen når bristningsgränsen. Palme är tillbaka som statsminister. På andra sidan Atlanten har Ronald Reagan vunnit presidentvalet. Stora satsningar görs på underrättelsetjänsterna på båda sidor järnridån. Anton Modin är 18 år. Han gör militärtjänst som attackdykare på Kustjägarskolan. Livet leker. Han är stark, svårigheter inspirerar honom och ingen utmaning känns för stor. Då börjar saker hända. Hans stora önskan att bli något, någon av betydelse, för en plötslig vändning i juni 1984 när han oväntat får sparken. Hans värld rasar samman och hans möjligheter att visa att han duger försvinner. Då dyker Chris Loklinth, en man i 35-årsåldern, upp i kulisserna. Han är chef på SSI:s inrikesavdelning, Byrån kallad, som skyddar Sveriges inre säkerhet - en hemlig militär enhet med långt större befogenheter än Säpo. Loklinth vill värva Anton Modin till sin avdelning för våta uppdrag - Black Ops. Anton Modin - i rikets tjänst är den femte boken i serien med nyckelromaner om det kalla kriget, skrivna av experten på området, Anders Jallai. Boken är en fristående fortsättning och en lämplig introduktion till underrättelseoperatören Anton Modins liv och äventyr. Ett livsöde som ska komma att förändra den svenska samtidshistorien i grunden","torrent":{"xt":"urn:btih:fbd010848b2104ef0a71c2a206e8fb3dfce41502","amp;dn":"Anders+Jallai+-+I+rikets+tj%26auml%3Bnst+%28Svensk+Retail+EPUB%29","amp;tr":["udp%3A%2F%2Ftracker.leechers-paradise.org%3A6969","udp%3A%2F%2Fzer0day.ch%3A1337","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fbd010848b2104ef0a71c2a206e8fb3dfce41502","infoHashBuffer":{"type":"Buffer","data":[251,208,16,132,139,33,4,239,10,113,194,162,6,232,251,61,252,228,21,2]},"announce":[],"urlList":[]}}