{"title":"AruaROSE","uid":4121874,"size":780577271,"categoryP":"games","categoryS":"pc","magnet":"?xt=urn:btih:fd56068a55bff099f2226d45567a9d7a9510e94b&amp;dn=AruaROSE&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"AruaROSE","files":1,"time":1207597245,"description":"The goal of ROSE Online is to gain a sense of your purpose as a Visitor to this universe and take an active part in the ever-evolving storyline. Depending on your adventures and actions, you may take part in the central story or go off on your adventures.\n\nThere are various tales, fantasies, and legends around the seven planets and many of them contain some grain of truth.\n\nOur universe, or as it was called in the old tales, the Sea of Souls, was a vast ocean of darkness until the goddess Arua created the seven planets. Each one of them was special and unique. However, all seven planets were created with Arua&amp;#039;s love and they shined with the brilliance of seven stars, filling the vast ocean of darkness with wondrous light and life.\n\nHowever, Hebarn, god of malice, grew envious of Arua for her creative power. He forcefully took the seventh planet and pompously named it after himself. Hebarn had become a constant threat to the peace of the seven planets as well as to the goddess Arua.\n\nTo protect the planets from Hebarn&amp;#039;s looming menace, Arua created the Visitors, living beings to protect and inhabit the planets. They were scattered among the seven planets to bring peace and justice to the different worlds.\n\nThere are a total of 3 forms of transportation available in ROSE Online. Castle Gear which was developed to cause great damage to enemies in battles, the Cart which was developed to efficiently traverse the land, and the Flying Vessel which was developed to realize the dream of exploring outer space. It is possible to customize Carts and Castle Gears by changing parts and upgrading abilities.\n\nJoin AruaROSE today to experience ROSE Online to the full. AruaGuard, the unique AruaROSE anti-hacking software, ensures that our server stays a fun and fair environment to all our players. We pride ourselves in creating unique, regular, and exciting updates and patches to introduce new content into AruaROSE to create a diverse environment. AruaROSE offers constant Developer and GameMaster attention, proven by our popularity and fan-base. Join in the fun today: register a free account, download the client, and start playing!","torrent":{"xt":"urn:btih:fd56068a55bff099f2226d45567a9d7a9510e94b","amp;dn":"AruaROSE","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fd56068a55bff099f2226d45567a9d7a9510e94b","infoHashBuffer":{"type":"Buffer","data":[253,86,6,138,85,191,240,153,242,34,109,69,86,122,157,122,149,16,233,75]},"announce":[],"urlList":[]}}