{"title":"Duran Duran - Pop Trash (2000) (FLAC-EAC-CUE)","uid":4190925,"size":565906654,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:fe354b524fca18a065bacb28fe2ae3df66e6ab56&amp;dn=Duran+Duran+-+Pop+Trash+%282000%29+%28FLAC-EAC-CUE%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"bigsimon","files":26,"time":1210951789,"description":"Music : Pop : Lossless\n\n\n\n\n\n\n\n\nDuran Duran - Pop Trash (2000) (FLAC-EAC-CUE)\n\n\n\n\n\n\n\n\n\nDuran Duran Biography From allmusic.com\n\n\n\nBiography by Stephen Thomas Erlewin\n\n\nDuran Duran personified new wave for much of the mainstream audience. And for good reason, too. Duran Duran&amp;#039;s reputation was built through music videos, which accentuated their fashion model looks and glamorous sense of style. Without music videos, it&amp;#039;s likely that the band&amp;#039;s pop-funk -- described by the group as the Sex Pistols meets Chic -- would never have made them international pop stars. While Duran Duran did have sharper pop sensibilities than their new romantic contemporaries like Spandau Ballet and Ultravox, none of their peers exploited MTV and music video like the Birmingham-based quintet. Each video the group made was distinctive, incorporating a number of cinematic styles to showcase the band as either part of the jet-setting elite (&quot;Rio&quot;) or as worldly adventurers (&quot;Hungry Like the Wolf&quot;). While early videos like &quot;Girls on Film&quot; and &quot;The Chauffeur&quot; sparked controversy in England over their sexual content, their best-known clips were often based on hit contemporary movies. &quot;Hungry Like the Wolf&quot; uncannily recalled Raiders of the Lost Ark, while &quot;Union of the Snake&quot; and &quot;The Wild Boys&quot; brought to mind The Road Warrior. The clever videos helped make Duran Duran&amp;#039;s rise to popularity remarkably swift. Between 1982 and 1984, they rocketed from underground British post-punk sensations to teen idols. But their fall from grace was equally fast. By the late &amp;#039;80s, the group&amp;#039;s lineup had fragmented, and the remaining members had trouble landing hit singles. Nevertheless, the group pulled off a surprising, if short-lived, comeback in the early &amp;#039;90s as a sophisticated soft rock trio.\n\nInspired by David Bowie and Roxy Music, as well as post-punk and disco, schoolmates Nick Rhodes (keyboards) and John Taylor (guitar) formed Duran Duran in 1978 with their friends Simon Colley (bass, clarinet) and Stephen Duffy (vocals). Taking their name from a character in Roger Vadim&amp;#039;s psychedelic sci-fi film Barbarella, the group began playing gigs in the Birmingham club Barbarella, supported by a drum machine. Within a year, Duffy and Colley both left the group -- Duffy would later form the Lilac Time -- and were replaced by former TV Eye vocalist Andy Wickett and drummer Roger Taylor. After recording a demo, John Taylor switched to bass and guitarist John Curtis joined the band, only to leave within a matter of months. The group placed an ad in Melody Maker, which drew the attention of Andy Taylor, who became their guitarist. However, Duran Duran were still having trouble finding a vocalist. Following Wickett&amp;#039;s departure in 1979, a pair of singers passed through the group before Simon LeBon, a former member of the punk band Dog Days and a drama student at Birmingham University, joined in early 1980.\n\nBy the end of 1980, Duran Duran had become popular within the burgeoning new romantic circuit in England and had secured a record contract with EMI. &quot;Planet Earth,&quot; the band&amp;#039;s first single, quickly rose to number 12 upon its spring 1981 release. Immediately, Duran Duran became the leaders of the new romantic movement, becoming media sensations in the British music and mainstream press. The group&amp;#039;s popularity increased through their cutting-edge music videos, especially the bizarre, racy clip for &quot;Girls on Film.&quot; Although the BBC banned the Godley &amp; Creme-directed video, the single became the group&amp;#039;s first Top Ten hit, setting the stage for the fall release of their eponymous debut album. Duran Duran reached number three upon its release and stayed in the charts for 118 weeks. The band quickly followed the album with Rio in the spring of 1982. Rio entered the charts at number two, and its singles -- &quot;Hungry Like the Wolf&quot; and &quot;Save a Prayer&quot; -- became Top Ten hits. By the November release of the U.S.-only remix EP Carnival, the band were superstars in Europe, but only just beginning to make headway in America. Their exposure in the U.S. was helped greatly by the emergence of MTV, which put the group&amp;#039;s stylish videos into heavy rotation. MTV&amp;#039;s constant playing of the videos paid off, and &quot;Hungry Like the Wolf&quot; became a Top Ten hit early in 1983. Rio followed that single into the Top Ten, eventually selling over two million copies.\n\nDuran Duran mania was in full swing across America, with &quot;Is There Something I Should Know&quot; reaching the Top Ten -- it became the group&amp;#039;s first English number one that summer -- and the group&amp;#039;s first album climbing its way to number ten. Duran Duran capitalized on their popularity by releasing Seven and the Ragged Tiger in time for 1983&amp;#039;s holiday season. The record hit number one in the U.K. and number eight in the U.S., spawning the hit singles &quot;Union of the Snake&quot; and &quot;The Reflex,&quot; their first number one U.S. hit and their second British chart-topper. The band took an extended break after completing their year-and-a-half-long international tour in the spring of 1984. In November, they released the non-LP single &quot;Wild Boys,&quot; which reached number two in the U.K. and the U.S., where it was added to the live album Arena.\n\nBy 1985, Duran Duran fever was beginning to cool off, and after the band completed the title track for the James Bond film A View to a Kill, the group went on hiatus. Andy and John Taylor formed the supergroup the Power Station with vocalist Robert Palmer and former Chic drummer Tony Thompson in January, releasing their eponymous debut album in the spring; it spawned the Top Ten singles &quot;Some Like It Hot&quot; and &quot;Get It On (Bang a Gong).&quot; The remaining members of Duran Duran -- Nick Rhodes, Simon LeBon, and Roger Taylor -- responded with their own side project, Arcadia, which released an album called So Red the Rose in the fall of 1985; the album launched the Top Ten hit &quot;Election Day.&quot; Early in 1986, Roger Taylor announced he was taking a year-long sabbatical from the group; he never returned. Several months later, Andy Taylor also left, reducing Duran Duran to a trio. Late in 1986, the band released Notorious, their first album in nearly three years. While it was relatively successful, going platinum in the U.S. and generating a Top Ten hit with the title track, it was noticeably less popular than their earlier records. For the remainder of the decade, Duran Duran&amp;#039;s popularity continually declined, with 1988&amp;#039;s Big Thing producing &quot;I Don&amp;#039;t Want Your Love,&quot; their last Top Ten single for five years.\n\nThe greatest-hits album Decade was released late in 1989, followed several months later by Liberty, the first Duran Duran album to fail to go gold. By that point, former Missing Persons guitarist Warren Cuccurullo had become a permanent member of the group. In 1993, the band returned from a prolonged hiatus with Duran Duran [The Wedding Album], a mature, layered record of lite funk and soulful adult contemporary pop that became a surprise hit. &quot;Ordinary World&quot; and &quot;Come Undone&quot; became Top Ten hits in America, with the former reaching the Top Ten in the U.K. as well; the album itself climbed into the Top Ten on both continents and went platinum in America. Not only did the record restore their commercial status, but it earned them some of their best reviews of their career. The group followed the album with one of their poorest-received efforts, 1995&amp;#039;s all-covers Thank You, which managed to go gold in America despite its negative reviews. While Duran Duran was recording the follow-up to Thank You in 1996, John Taylor left the band to pursue a solo career, leaving the group a trio of LeBon, Rhodes, and Cuccurullo. That follow-up, Medazzaland, was released in 1997 but failed to produce any major hits. 2000&amp;#039;s Pop Trash suffered a similar fate.\n\nIn March 2001, the three Taylors -- Andy, John, and Roger -- met up in Wales and worked with each other for three weeks. Around this time, rumors of a five-member reunion began to circulate. Two months after Rhodes and LeBon denied the rumors, the reunion was confirmed. Duran Duran recorded on and off for a new album over the next three years and also toured sporadically. After signing with Epic, they released Astronaut in October 2004. Red Carpet Massacre followed in 2007.\n\n\n\n\n\nCD Pressing Information\n\n\n\nLabel: Hollywood Records\nCatalog#: HR-62266-2\nFormat: CD, Album\nCountry: US\nReleased: 2000\nGenre: Electronic, Pop\nStyle: Synth-pop\n\n\n\n\n\n\nPop Trash Album review from allmusic.com\n\n\n\nReview by Stacia Proefrock\n\n\nThis album showcases a Duran Duran that is but a hollow shell of the band that enjoyed pop successes in the early &amp;#039;80s. Only Simon LeBon and Nick Rhodes remain from the original lineup -- Warren Cuccurullo, who has been featured on several recent Duran Duran albums, joins them to make a trio. Some of the smooth, spacy ballads that were characteristic of their 1993 self-titled release show up here, but more often than not LeBon is lost in a swamp of overproduction. Completely absent from this music was the aggressiveness and sexuality that made early Duran Duran great -- kinder, gentler records could probably be expected from the band as they age, but this album feels careless and flabby instead of introspective. Notable exceptions include the ascorbic &quot;Mars Meets Venus,&quot; which skewers the American self-help movement over Bowie-influenced dance-pop beats, and the delicate if slightly sappy &quot;Lady Xanax.&quot;\n\n\n\n\n\nTrack List\n\n\n\n\nDuran Duran - Pop Trash (2000)\n\n\n1. Someone Else Not Me\n2. Lava Lamp\n3. Playing With Uranium\n4. Hallucinating Elvis\n5. Starting To Remember\n6. Pop Trash Movie\n7. Fragment\n8. Mars Meets Venus\n9. Lady Xanax\n10. The Sun Doesn&amp;#039;t Shine Forever\n11. Kiss Goodbye\n12. Last Day On Earth\n13. Someone Else Not Me (En Espanol) ","torrent":{"xt":"urn:btih:fe354b524fca18a065bacb28fe2ae3df66e6ab56","amp;dn":"Duran+Duran+-+Pop+Trash+%282000%29+%28FLAC-EAC-CUE%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"fe354b524fca18a065bacb28fe2ae3df66e6ab56","infoHashBuffer":{"type":"Buffer","data":[254,53,75,82,79,202,24,160,101,186,203,40,254,42,227,223,102,230,171,86]},"announce":[],"urlList":[]}}