{"title":"Mindless Self Indulgence - Never Wanted to Dance (Spider's","uid":4117255,"size":12065646,"categoryP":"audio","categoryS":"music","magnet":"?xt=urn:btih:ff8807087363a8f869c6b8e66b6d636a1d6feda1&amp;dn=Mindless+Self+Indulgence+-+Never+Wanted+to+Dance+%28Spider%5C%27s+&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":0,"uploader":"Chouonsoku","files":1,"time":1207370451,"description":"From Mindless Self Indulgence&amp;#039;s blog on MySpace:\n\n&quot;Thanks to you (that is if &quot;you&quot; bought the new Mindless remix CD), MSI?s &quot;Never Wanted To Dance&quot; is the Number One CD Single on the Billboard Top Singles Chart. We can?t thank you enough for your devotion and support, and seeing that MSI fans are hardcore and give a shit about supporting the band makes everyone that much more excited for the release in April...\nUnfortunately, there?s some bad news. Really bad news.\nOur good friend Spider did a remix which can be found on the NWTD single. Even though it?s quickly become a fan favorite, we?ve just been made aware that there was an error in mastering the first run of these singles -- basically, one computer wasn?t talking to another computer correctly and the pitch in Spider?s remix got FUCKED. In short, it runs slower and in a lower pitch than intended. Because we value your purchases and Spider?s hard work, we?re offering a free remix of the track HERE-- in addition, when we repress the single, it will have the corrected version of the remix with a sticker indicating that it contains the corrected master of Spider?s track. Artwork and tracklisting will remain otherwise unaltered, but Spider?s track will be heard as it was originally intended in future pressings.\n\nIn the meantime, you can order the we?re-fucking-assholes-and-hope-Spider-knows-we-still-love-him version of the remix CD HERE (http://www.theomegaorder.com/msi) (on the cheap). Listen to it while you check out the new interview with Jimmy in the May issue of Revolver (number 68 w/ Serj Tankian, Dave Grohl of the Foo Fighters, and a buncha other dudes on the cover).\n\nAgain, THANK YOU!&quot;\n\nI am not affiliated in any way with Mindless Self Indulgence. The story is that I sent them a message on MySpace about whether or not they&amp;#039;d offer the fixed version of the song in FLAC rather than in the MP3 format allowed on MySpace. I didn&amp;#039;t really expect to get a reply back, but I did, and they basically left it up to me to get this spread around. So, that&amp;#039;s what I&amp;#039;m doing. :)\n\nIn case you didn&amp;#039;t figure it out, this is the fixed version of the track from the Never Wanted to Dance remix single, Spider&amp;#039;s &quot;Dub&quot; Mix. This is not a transcode, or anything done by me. This is an official, studio remaster of the track in the form Spider meant for it to be heard. It is being offered by MSI and Spider free-of-charge. All i did was add the tags. :)\n\nListen, enjoy, tell your friends and share it all around.","torrent":{"xt":"urn:btih:ff8807087363a8f869c6b8e66b6d636a1d6feda1","amp;dn":"Mindless+Self+Indulgence+-+Never+Wanted+to+Dance+%28Spider%5C%27s+","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ff8807087363a8f869c6b8e66b6d636a1d6feda1","infoHashBuffer":{"type":"Buffer","data":[255,136,7,8,115,99,168,248,105,198,184,230,107,109,99,106,29,111,237,161]},"announce":[],"urlList":[]}}