{"title":"In Strict Confidence - Holy[FLAC - LOSSLESS]","uid":4202702,"size":589187968,"categoryP":"audio","categoryS":"flac","magnet":"?xt=urn:btih:ffafa607dd5fe6cc6b298f1aff898c1808fa0627&amp;dn=In+Strict+Confidence+-+Holy%5BFLAC+-+LOSSLESS%5D&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"99AM","files":21,"time":1211587749,"description":"FLAC files + CUE sheet + Covers\nRelease date: February 3, 2004\n\n\nTrack Listing:\n\nCD1\n1. Eye of Heaven\n2. Seven Lives\n3. Babylon\n4. Closing Eyes\n5. Heal Me\n6. Emergency\n7. Another Night\n8. No Love Will Heal\n9. The Darkest Corridor\n10. Sleepless\n11. Alpha Centauri\n\nCD2\n1. Alpha Omega\n\n\n\nCertainly one of the more prolific artists in the electronic genre, In Strict Confidence distinguish themselves due to the fact that each of their albums feature a band who are giving their all. The advancement in sound and concept on &quot;Holy&quot; is nothing short of a revelation. In this ever-contracting world of MP3-based &quot;projects&quot; it?s inspiring to see a band so professional and relevant. Dennis Ostermann along with his fellow members Jorg Schelte and Steve Vesper (aka Dragon) really has gone beyond the call of duty with this one.\n&quot;Eye of Heaven&quot; opens the gates with thunderous aplomb. It is a mid-tempo track which perfectly shows the progress which ISC has made since their previous album &quot;Mistrust the Angels&quot;. Following this is the godlike track &quot;Seven Lives&quot; and goddamnit is it good. Layer upon layer of perfectly chosen sounds coupled to vocals that are partially processed and partially just downright vehement. I love this song for the subtly which it employs; the chorus is bloody infectious. Antje Shultz (ex-Chandeen) appears on two tracks, one of which &quot;Emergency&quot; jumps right out of the speakers and into the very depths of my mind. Two weeks have passed since I got this album and this track still will not leave my head. I have been smitten with Antje?s voice since first hearing it with Chandeen in 1993. I still am. By god the choice to use her as a vocalist was a very saavy move indeed. Hopefully, there will be a single for this one.\nThe tempo of this record is generally in the mid to high range but there are some astoundingly powerful slower works on &quot;Holy&quot;. Quite engaging is the track &quot;Alpha-Centauri&quot; which closes everything out and whose second half &quot;Alpha-Omega&quot; is included in the limited edition version of &quot;Holy&quot; on a stand-alone bonus disc. These two pieces are ambient film-score work at its finest. ISC has many sides, all of which are done expertly and inventively.\nWith this new effort we find ISC utterly on point and remorselessly slaying the competition. Upon finishing your perusal of this review, I&amp;#039;d suggest purchasing this album immediately it is that good. Go. Now.\n\n(Review from Release Magazine by PETER MARKS)\n\n\nEnjoy! ","torrent":{"xt":"urn:btih:ffafa607dd5fe6cc6b298f1aff898c1808fa0627","amp;dn":"In+Strict+Confidence+-+Holy%5BFLAC+-+LOSSLESS%5D","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffafa607dd5fe6cc6b298f1aff898c1808fa0627","infoHashBuffer":{"type":"Buffer","data":[255,175,166,7,221,95,230,204,107,41,143,26,255,137,140,24,8,250,6,39]},"announce":[],"urlList":[]}}