{"title":"Folder Guard Professional Edition v7.92.567(with keygen)","uid":4218343,"size":2477884,"categoryP":"applications","categoryS":"windows","magnet":"?xt=urn:btih:ffda29661bdde2ef52bfaaed051a04661a4b4e3f&amp;dn=Folder+Guard+Professional+Edition+v7.92.567%28with+keygen%29&amp;tr=udp%3A%2F%2Ftracker.openbittorrent.com%3A80&amp;tr=udp%3A%2F%2Fopen.demonii.com%3A1337&amp;tr=udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969&amp;tr=udp%3A%2F%2Fexodus.desync.com%3A6969","seeders":0,"leechers":1,"uploader":"aoloffline","files":1,"time":1212460515,"description":"Folder GuardÂ® is a powerful computer security software that you can use to control access to files, folders, and other Windows resources, such as Control Panel, Start Menu, and so on. You can use Folder Guard to lock your personal files and folders with passwords, to stop other users from peeking into your records. You can even completely hide your private folders from virtually all applications, and such folders would remain invisible until you enter a valid password. You can also protect sensitive system files from modification or destruction, disable access to the removable drives, restrict access to Control Panel, and more.\nFolder Guard Professional\n(see a full-size screenshot in a separate window)\n\nBrowse the User&amp;#039;s Guide for Folder Guard Download Folder Guard Buy Folder Guard Now!\n\nThere are several editions of Folder Guard available, for a variety of Windows versions Compare editions... (Also available: Folder Guard Classic Edition for Windows 98, ME)\nWhy should you choose Folder Guard:\n\nFolder Guard lets you password protect your files and folders.\n\n    You can protect with password virtually any folder or file, allowing only the authorized users to open the protected files or folders. You can protect an unlimited number of files and folders, each with its own password, or you can use the Master Password of Folder Guard to unprotect them all at once.\n\nFolder Guard can hide your personal folders from other users.\n\n    You can set up Folder Guard to hide your private folders (or make them appear empty). The folder would be hidden from virtually any program, including Windows Explorer, Office, MS-DOS programs, etc.\n\nFolder Guard can restrict access to Control Panel, Start Menu, Desktop, etc.\n\n    You can set up Folder Guard to allow only certain users to change the computer settings with Control Panel, while denying that to other users. You can control access to various settings of Start Menu, Desktop, Taskbar, and other Windows resources. You can remove the Run and Search commands on the Start menu, hide specific drives, lock the Internet settings, and more.\n\nFolder Guard can protect access to the floppy, CD-ROM and other removable drives\n\n    You can configure Folder Guard to allow or deny access to the removable drives, restricting the user&amp;#039;s ability to run or install unauthorized programs on your computer.\n\nFolder Guard is suitable for a wide range of the computer security tasks.\n\n    You can stop other users of your computer from peeking into your personal files. You can protect the system files and folders from destruction by cyber-vandals. You can allow specific users to run a program while deny it to others. You can allow users to use the removable drives to store their documents while prevent them from running unauthorized programs from the removable disks. The possibilities are endless:\n\n    How to:\n\n        * Hide folders from prying eyes\n        * Hide files without encrypting them\n        * Lock files and folders with passwords\n        * Use Quick Start Wizard of Folder Guard\n        * Restrict access to Control Panel and other resources\n        * Set up user-specific restrictions\n        * Prevent users from installing unauthorized programs\n        * Prevent users from running programs from the removable disks\n        * Prevent users from reformatting local drives\n        * Disable the CANCEL button on the Windows Me/9x login window\n        * Restrict downloading programs from the Internet with Internet Explorer\n        * Restrict downloading programs from the Internet with Opera browser\n        * and more:\n        *\n\nFolder Guard protects your files without encrypting them.\n\n    There is no risk of losing your documents if you lose your encryption key: with Folder Guard all your files remain intact, without modification of any kind.\n\nFolder Guard lets you quickly enable or disable the protection via a &quot;hot key&quot;.\n\n    You can choose a specific keyboard combination as the hot key of Folder Guard, to be able to quickly enable or disable the protection of your computer. Of course, the &quot;hot key&quot; is protected with your password, too, only you can use it!\n\nFolder Guard can operate in the &quot;stealth mode&quot;.\n\n    You can set up Folder Guard to operate in the stealth mode, to hide its own files and shortcuts from being seen by other users. You would still be able to control Folder Guard via the &quot;hot key&quot;.\n\nFolder Guard supports easy recovery in case of emergency.\n\n    If you forget your password, or experience other problems, simply use the Emergency Recovery Utility (free download) to quickly restore access to your protected folder.\n\nFolder Guard works with drives of any format.\n\n    If your computer can handle it, Folder Guard can protect it. You don&amp;#039;t have to format your hard drive with the NTFS file system: Folder Guard can protect files and folders on both NTFS and FAT/FAT32 disks.\n\nFolder Guard runs on a wide range of Windows platforms.\n\n    From Windows 2000 to Windows XP to Windows Vista and later, with all service packs and hotfixes, all are supported by at least one of the available editions of Folder Guard.\n\nFolder Guard is easy to use.\n\n    Folder Guard sports one of the most intuitive user interfaces, that makes it easy to use for both novice users and computer professionals.\n\nFolder Guard &quot;speaks&quot; plain English.\n\n    You don&amp;#039;t have to be a computer professional to understand how to use Folder Guard. The Quick Start Wizard can guide you through the steps necessary to set up the password protection of your personal folders. Folder Guard Advisor warns you about situations that may require your attention and offers possible workarounds. Folder Guard User&amp;#039;s Guide describes its commands and operation in plain English, without &quot;pseudo-techno&quot; or &quot;geeky&quot; talk. (And it does not baby-sit you either).\n\nFolder Guard is not a toy.\n\n    Folder Guard is used by large corporations and small businesses, schools and police departments, universities and correctional facilities, libraries and hospitals (to name a few).\n\nFolder Guard is widely used.\n\n    Hundreds of thousands of copies of Folder Guard have been downloaded by computer users from virtually all countries of the world.\n\nFolder Guard offers the best value for the money.\n\n    None of our competitors offers a product that would come close to Folder Guard.\n\nFolder Guard is flexible.\n\n    Although Windows lets you restrict access to folders located on a NTFS drives, it cannot hide them. With Folder Guard, you can not only restrict access to, but also hide folders, or make them look empty. Unlike Windows, Folder Guard lets you protect only some files within a folder, and keep the rest of the files visible and accessible, if you wish. Or, you can protect files and folders each with its own individual password, and then unlock them separately from each other (Windows cannot do that).\n\nFolder Guard can be used with other disk tools.\n\n    You can designate your anti-virus and other disk maintenance tools to be the &quot;trusted&quot; programs, to make them able to work with your protected disks without restrictions.\n\nFolder Guard is extensible.\n\n    You can fine-tune the access rules to the files and folders of your computer by creating appropriate filters.\n\nFolder Guard will save you hours of learning time.\n\n    You don&amp;#039;t have to learn how to use the Group Policies, user groups, Access Control Lists, privileges, and other built-in security features of Windows, because Folder Guard does the hard work for you: its visual and intuitive user interface lets you manage the restrictions with ease.\n\nFolder Guard is actively maintained.\n\n    Since its first release back in 1997, we&amp;#039;ve been continuously extending, enhancing, and improving Folder Guard. Now in version 7.92, Folder Guard gives you more power than ever. \n\nIf you have not done so yet, feel free to download a free no-strings-attached-no-obligation evaluation version of Folder Guard and see for yourself how Folder Guard can be of use to you: ","torrent":{"xt":"urn:btih:ffda29661bdde2ef52bfaaed051a04661a4b4e3f","amp;dn":"Folder+Guard+Professional+Edition+v7.92.567%28with+keygen%29","amp;tr":["udp%3A%2F%2Ftracker.openbittorrent.com%3A80","udp%3A%2F%2Fopen.demonii.com%3A1337","udp%3A%2F%2Ftracker.coppersurfer.tk%3A6969","udp%3A%2F%2Fexodus.desync.com%3A6969"],"infoHash":"ffda29661bdde2ef52bfaaed051a04661a4b4e3f","infoHashBuffer":{"type":"Buffer","data":[255,218,41,102,27,221,226,239,82,191,170,237,5,26,4,102,26,75,78,63]},"announce":[],"urlList":[]}}